#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_InventoryCharacter

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABP_InventoryCharacter.ABP_InventoryCharacter_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_InventoryCharacter_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_InventoryCharacter_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_InventoryCharacter_C_AnimGraph");
static_assert(sizeof(ABP_InventoryCharacter_C_AnimGraph) == 0x000010, "Wrong size on ABP_InventoryCharacter_C_AnimGraph");
static_assert(offsetof(ABP_InventoryCharacter_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_InventoryCharacter_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_InventoryCharacter.ABP_InventoryCharacter_C.ExecuteUbergraph_ABP_InventoryCharacter
// 0x0010 (0x0010 - 0x0000)
struct ABP_InventoryCharacter_C_ExecuteUbergraph_ABP_InventoryCharacter final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_2;          // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_3;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_4;          // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_InventoryCharacter_C_ExecuteUbergraph_ABP_InventoryCharacter) == 0x000004, "Wrong alignment on ABP_InventoryCharacter_C_ExecuteUbergraph_ABP_InventoryCharacter");
static_assert(sizeof(ABP_InventoryCharacter_C_ExecuteUbergraph_ABP_InventoryCharacter) == 0x000010, "Wrong size on ABP_InventoryCharacter_C_ExecuteUbergraph_ABP_InventoryCharacter");
static_assert(offsetof(ABP_InventoryCharacter_C_ExecuteUbergraph_ABP_InventoryCharacter, EntryPoint) == 0x000000, "Member 'ABP_InventoryCharacter_C_ExecuteUbergraph_ABP_InventoryCharacter::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_InventoryCharacter_C_ExecuteUbergraph_ABP_InventoryCharacter, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000004, "Member 'ABP_InventoryCharacter_C_ExecuteUbergraph_ABP_InventoryCharacter::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_InventoryCharacter_C_ExecuteUbergraph_ABP_InventoryCharacter, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000005, "Member 'ABP_InventoryCharacter_C_ExecuteUbergraph_ABP_InventoryCharacter::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_InventoryCharacter_C_ExecuteUbergraph_ABP_InventoryCharacter, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000006, "Member 'ABP_InventoryCharacter_C_ExecuteUbergraph_ABP_InventoryCharacter::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_InventoryCharacter_C_ExecuteUbergraph_ABP_InventoryCharacter, CallFunc_NotEqual_ByteByte_ReturnValue_1) == 0x000007, "Member 'ABP_InventoryCharacter_C_ExecuteUbergraph_ABP_InventoryCharacter::CallFunc_NotEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_InventoryCharacter_C_ExecuteUbergraph_ABP_InventoryCharacter, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000008, "Member 'ABP_InventoryCharacter_C_ExecuteUbergraph_ABP_InventoryCharacter::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_InventoryCharacter_C_ExecuteUbergraph_ABP_InventoryCharacter, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x000009, "Member 'ABP_InventoryCharacter_C_ExecuteUbergraph_ABP_InventoryCharacter::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_InventoryCharacter_C_ExecuteUbergraph_ABP_InventoryCharacter, CallFunc_EqualEqual_ByteByte_ReturnValue_4) == 0x00000A, "Member 'ABP_InventoryCharacter_C_ExecuteUbergraph_ABP_InventoryCharacter::CallFunc_EqualEqual_ByteByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ABP_InventoryCharacter_C_ExecuteUbergraph_ABP_InventoryCharacter, CallFunc_NotEqual_ByteByte_ReturnValue_2) == 0x00000B, "Member 'ABP_InventoryCharacter_C_ExecuteUbergraph_ABP_InventoryCharacter::CallFunc_NotEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_InventoryCharacter_C_ExecuteUbergraph_ABP_InventoryCharacter, CallFunc_NotEqual_ByteByte_ReturnValue_3) == 0x00000C, "Member 'ABP_InventoryCharacter_C_ExecuteUbergraph_ABP_InventoryCharacter::CallFunc_NotEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_InventoryCharacter_C_ExecuteUbergraph_ABP_InventoryCharacter, CallFunc_NotEqual_ByteByte_ReturnValue_4) == 0x00000D, "Member 'ABP_InventoryCharacter_C_ExecuteUbergraph_ABP_InventoryCharacter::CallFunc_NotEqual_ByteByte_ReturnValue_4' has a wrong offset!");

}

