#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_HeadPostProcess

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABP_HeadPostProcess.ABP_HeadPostProcess_C.AnimGraph
// 0x0020 (0x0020 - 0x0000)
struct ABP_HeadPostProcess_C_AnimGraph final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              AnimGraph_0;                                       // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_HeadPostProcess_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_HeadPostProcess_C_AnimGraph");
static_assert(sizeof(ABP_HeadPostProcess_C_AnimGraph) == 0x000020, "Wrong size on ABP_HeadPostProcess_C_AnimGraph");
static_assert(offsetof(ABP_HeadPostProcess_C_AnimGraph, InPose) == 0x000000, "Member 'ABP_HeadPostProcess_C_AnimGraph::InPose' has a wrong offset!");
static_assert(offsetof(ABP_HeadPostProcess_C_AnimGraph, AnimGraph_0) == 0x000010, "Member 'ABP_HeadPostProcess_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_HeadPostProcess.ABP_HeadPostProcess_C.BlinkingLayer
// 0x0020 (0x0020 - 0x0000)
struct ABP_HeadPostProcess_C_BlinkingLayer final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              BlinkingLayer_0;                                   // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_HeadPostProcess_C_BlinkingLayer) == 0x000008, "Wrong alignment on ABP_HeadPostProcess_C_BlinkingLayer");
static_assert(sizeof(ABP_HeadPostProcess_C_BlinkingLayer) == 0x000020, "Wrong size on ABP_HeadPostProcess_C_BlinkingLayer");
static_assert(offsetof(ABP_HeadPostProcess_C_BlinkingLayer, InPose) == 0x000000, "Member 'ABP_HeadPostProcess_C_BlinkingLayer::InPose' has a wrong offset!");
static_assert(offsetof(ABP_HeadPostProcess_C_BlinkingLayer, BlinkingLayer_0) == 0x000010, "Member 'ABP_HeadPostProcess_C_BlinkingLayer::BlinkingLayer_0' has a wrong offset!");

// Function ABP_HeadPostProcess.ABP_HeadPostProcess_C.ExecuteUbergraph_ABP_HeadPostProcess
// 0x0018 (0x0018 - 0x0000)
struct ABP_HeadPostProcess_C_ExecuteUbergraph_ABP_HeadPostProcess final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ObjectIsA_ReturnValue;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_HeadPostProcess_C_ExecuteUbergraph_ABP_HeadPostProcess) == 0x000008, "Wrong alignment on ABP_HeadPostProcess_C_ExecuteUbergraph_ABP_HeadPostProcess");
static_assert(sizeof(ABP_HeadPostProcess_C_ExecuteUbergraph_ABP_HeadPostProcess) == 0x000018, "Wrong size on ABP_HeadPostProcess_C_ExecuteUbergraph_ABP_HeadPostProcess");
static_assert(offsetof(ABP_HeadPostProcess_C_ExecuteUbergraph_ABP_HeadPostProcess, EntryPoint) == 0x000000, "Member 'ABP_HeadPostProcess_C_ExecuteUbergraph_ABP_HeadPostProcess::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_HeadPostProcess_C_ExecuteUbergraph_ABP_HeadPostProcess, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000008, "Member 'ABP_HeadPostProcess_C_ExecuteUbergraph_ABP_HeadPostProcess::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_HeadPostProcess_C_ExecuteUbergraph_ABP_HeadPostProcess, CallFunc_ObjectIsA_ReturnValue) == 0x000010, "Member 'ABP_HeadPostProcess_C_ExecuteUbergraph_ABP_HeadPostProcess::CallFunc_ObjectIsA_ReturnValue' has a wrong offset!");

}

