#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Altar

#include "Basic.hpp"

#include "CommonInput_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Altar_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "EnhancedInput_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "InputCore_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Slate_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function Altar.VLayerCharacterAnimInstance.GetMainAnimInstance
// 0x0008 (0x0008 - 0x0000)
struct VLayerCharacterAnimInstance_GetMainAnimInstance final
{
public:
	class UVMainCharacterAnimInstance*            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VLayerCharacterAnimInstance_GetMainAnimInstance) == 0x000008, "Wrong alignment on VLayerCharacterAnimInstance_GetMainAnimInstance");
static_assert(sizeof(VLayerCharacterAnimInstance_GetMainAnimInstance) == 0x000008, "Wrong size on VLayerCharacterAnimInstance_GetMainAnimInstance");
static_assert(offsetof(VLayerCharacterAnimInstance_GetMainAnimInstance, ReturnValue) == 0x000000, "Member 'VLayerCharacterAnimInstance_GetMainAnimInstance::ReturnValue' has a wrong offset!");

// Function Altar.VLayerCharacterAnimInstance.GetMontageFromArrayWithGivenIndexIfValid
// 0x0020 (0x0020 - 0x0000)
struct VLayerCharacterAnimInstance_GetMontageFromArrayWithGivenIndexIfValid final
{
public:
	int32                                         GameplayArrayIndex;                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAnimMontage*>                   MontageArray;                                      // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class UAnimMontage*                           ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VLayerCharacterAnimInstance_GetMontageFromArrayWithGivenIndexIfValid) == 0x000008, "Wrong alignment on VLayerCharacterAnimInstance_GetMontageFromArrayWithGivenIndexIfValid");
static_assert(sizeof(VLayerCharacterAnimInstance_GetMontageFromArrayWithGivenIndexIfValid) == 0x000020, "Wrong size on VLayerCharacterAnimInstance_GetMontageFromArrayWithGivenIndexIfValid");
static_assert(offsetof(VLayerCharacterAnimInstance_GetMontageFromArrayWithGivenIndexIfValid, GameplayArrayIndex) == 0x000000, "Member 'VLayerCharacterAnimInstance_GetMontageFromArrayWithGivenIndexIfValid::GameplayArrayIndex' has a wrong offset!");
static_assert(offsetof(VLayerCharacterAnimInstance_GetMontageFromArrayWithGivenIndexIfValid, MontageArray) == 0x000008, "Member 'VLayerCharacterAnimInstance_GetMontageFromArrayWithGivenIndexIfValid::MontageArray' has a wrong offset!");
static_assert(offsetof(VLayerCharacterAnimInstance_GetMontageFromArrayWithGivenIndexIfValid, ReturnValue) == 0x000018, "Member 'VLayerCharacterAnimInstance_GetMontageFromArrayWithGivenIndexIfValid::ReturnValue' has a wrong offset!");

// Function Altar.VLayerCharacterAnimInstance.GetSequenceFromArrayWithGivenIndexIfValid
// 0x0020 (0x0020 - 0x0000)
struct VLayerCharacterAnimInstance_GetSequenceFromArrayWithGivenIndexIfValid final
{
public:
	int32                                         GameplayArrayIndex;                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAnimSequenceBase*>              ActionAnim;                                        // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class UAnimSequenceBase*                      ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VLayerCharacterAnimInstance_GetSequenceFromArrayWithGivenIndexIfValid) == 0x000008, "Wrong alignment on VLayerCharacterAnimInstance_GetSequenceFromArrayWithGivenIndexIfValid");
static_assert(sizeof(VLayerCharacterAnimInstance_GetSequenceFromArrayWithGivenIndexIfValid) == 0x000020, "Wrong size on VLayerCharacterAnimInstance_GetSequenceFromArrayWithGivenIndexIfValid");
static_assert(offsetof(VLayerCharacterAnimInstance_GetSequenceFromArrayWithGivenIndexIfValid, GameplayArrayIndex) == 0x000000, "Member 'VLayerCharacterAnimInstance_GetSequenceFromArrayWithGivenIndexIfValid::GameplayArrayIndex' has a wrong offset!");
static_assert(offsetof(VLayerCharacterAnimInstance_GetSequenceFromArrayWithGivenIndexIfValid, ActionAnim) == 0x000008, "Member 'VLayerCharacterAnimInstance_GetSequenceFromArrayWithGivenIndexIfValid::ActionAnim' has a wrong offset!");
static_assert(offsetof(VLayerCharacterAnimInstance_GetSequenceFromArrayWithGivenIndexIfValid, ReturnValue) == 0x000018, "Member 'VLayerCharacterAnimInstance_GetSequenceFromArrayWithGivenIndexIfValid::ReturnValue' has a wrong offset!");

// Function Altar.VLayerCharacterAnimInstance.ScheduledPlayMontage
// 0x0028 (0x0028 - 0x0000)
struct VLayerCharacterAnimInstance_ScheduledPlayMontage final
{
public:
	class UAnimMontage*                           MontageToPlay;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InPlayRate;                                        // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          AnimInstance;                                      // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMontagePlayReturnType                        ReturnValueType;                                   // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InTimeToStartMontageAt;                            // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStopAllMontages;                                  // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(VLayerCharacterAnimInstance_ScheduledPlayMontage) == 0x000008, "Wrong alignment on VLayerCharacterAnimInstance_ScheduledPlayMontage");
static_assert(sizeof(VLayerCharacterAnimInstance_ScheduledPlayMontage) == 0x000028, "Wrong size on VLayerCharacterAnimInstance_ScheduledPlayMontage");
static_assert(offsetof(VLayerCharacterAnimInstance_ScheduledPlayMontage, MontageToPlay) == 0x000000, "Member 'VLayerCharacterAnimInstance_ScheduledPlayMontage::MontageToPlay' has a wrong offset!");
static_assert(offsetof(VLayerCharacterAnimInstance_ScheduledPlayMontage, InPlayRate) == 0x000008, "Member 'VLayerCharacterAnimInstance_ScheduledPlayMontage::InPlayRate' has a wrong offset!");
static_assert(offsetof(VLayerCharacterAnimInstance_ScheduledPlayMontage, AnimInstance) == 0x000010, "Member 'VLayerCharacterAnimInstance_ScheduledPlayMontage::AnimInstance' has a wrong offset!");
static_assert(offsetof(VLayerCharacterAnimInstance_ScheduledPlayMontage, ReturnValueType) == 0x000018, "Member 'VLayerCharacterAnimInstance_ScheduledPlayMontage::ReturnValueType' has a wrong offset!");
static_assert(offsetof(VLayerCharacterAnimInstance_ScheduledPlayMontage, InTimeToStartMontageAt) == 0x00001C, "Member 'VLayerCharacterAnimInstance_ScheduledPlayMontage::InTimeToStartMontageAt' has a wrong offset!");
static_assert(offsetof(VLayerCharacterAnimInstance_ScheduledPlayMontage, bStopAllMontages) == 0x000020, "Member 'VLayerCharacterAnimInstance_ScheduledPlayMontage::bStopAllMontages' has a wrong offset!");

// Function Altar.VLayerCharacterAnimInstance.UpdateActionData
// 0x0010 (0x0010 - 0x0000)
struct VLayerCharacterAnimInstance_UpdateActionData final
{
public:
	struct FGameplayTag                           ActionTag;                                         // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UAnimSequenceBase*                ActionAnim;                                        // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VLayerCharacterAnimInstance_UpdateActionData) == 0x000008, "Wrong alignment on VLayerCharacterAnimInstance_UpdateActionData");
static_assert(sizeof(VLayerCharacterAnimInstance_UpdateActionData) == 0x000010, "Wrong size on VLayerCharacterAnimInstance_UpdateActionData");
static_assert(offsetof(VLayerCharacterAnimInstance_UpdateActionData, ActionTag) == 0x000000, "Member 'VLayerCharacterAnimInstance_UpdateActionData::ActionTag' has a wrong offset!");
static_assert(offsetof(VLayerCharacterAnimInstance_UpdateActionData, ActionAnim) == 0x000008, "Member 'VLayerCharacterAnimInstance_UpdateActionData::ActionAnim' has a wrong offset!");

// Function Altar.VLayerCharacterAnimInstance.UpdateActionDataFromArray
// 0x0018 (0x0018 - 0x0000)
struct VLayerCharacterAnimInstance_UpdateActionDataFromArray final
{
public:
	struct FGameplayTag                           ActionTag;                                         // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UAnimSequenceBase*>              ActionAnims;                                       // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(VLayerCharacterAnimInstance_UpdateActionDataFromArray) == 0x000008, "Wrong alignment on VLayerCharacterAnimInstance_UpdateActionDataFromArray");
static_assert(sizeof(VLayerCharacterAnimInstance_UpdateActionDataFromArray) == 0x000018, "Wrong size on VLayerCharacterAnimInstance_UpdateActionDataFromArray");
static_assert(offsetof(VLayerCharacterAnimInstance_UpdateActionDataFromArray, ActionTag) == 0x000000, "Member 'VLayerCharacterAnimInstance_UpdateActionDataFromArray::ActionTag' has a wrong offset!");
static_assert(offsetof(VLayerCharacterAnimInstance_UpdateActionDataFromArray, ActionAnims) == 0x000008, "Member 'VLayerCharacterAnimInstance_UpdateActionDataFromArray::ActionAnims' has a wrong offset!");

// Function Altar.VLayerCharacterAnimInstance.IsInCombat
// 0x0001 (0x0001 - 0x0000)
struct VLayerCharacterAnimInstance_IsInCombat final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VLayerCharacterAnimInstance_IsInCombat) == 0x000001, "Wrong alignment on VLayerCharacterAnimInstance_IsInCombat");
static_assert(sizeof(VLayerCharacterAnimInstance_IsInCombat) == 0x000001, "Wrong size on VLayerCharacterAnimInstance_IsInCombat");
static_assert(offsetof(VLayerCharacterAnimInstance_IsInCombat, ReturnValue) == 0x000000, "Member 'VLayerCharacterAnimInstance_IsInCombat::ReturnValue' has a wrong offset!");

// Function Altar.VHumanoidLowerAndUpperCharacterAnimInstance.IsSneaking
// 0x0001 (0x0001 - 0x0000)
struct VHumanoidLowerAndUpperCharacterAnimInstance_IsSneaking final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VHumanoidLowerAndUpperCharacterAnimInstance_IsSneaking) == 0x000001, "Wrong alignment on VHumanoidLowerAndUpperCharacterAnimInstance_IsSneaking");
static_assert(sizeof(VHumanoidLowerAndUpperCharacterAnimInstance_IsSneaking) == 0x000001, "Wrong size on VHumanoidLowerAndUpperCharacterAnimInstance_IsSneaking");
static_assert(offsetof(VHumanoidLowerAndUpperCharacterAnimInstance_IsSneaking, ReturnValue) == 0x000000, "Member 'VHumanoidLowerAndUpperCharacterAnimInstance_IsSneaking::ReturnValue' has a wrong offset!");

// Function Altar.VHumanoidLowerAndUpperCharacterAnimInstance.IsSwimming
// 0x0001 (0x0001 - 0x0000)
struct VHumanoidLowerAndUpperCharacterAnimInstance_IsSwimming final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VHumanoidLowerAndUpperCharacterAnimInstance_IsSwimming) == 0x000001, "Wrong alignment on VHumanoidLowerAndUpperCharacterAnimInstance_IsSwimming");
static_assert(sizeof(VHumanoidLowerAndUpperCharacterAnimInstance_IsSwimming) == 0x000001, "Wrong size on VHumanoidLowerAndUpperCharacterAnimInstance_IsSwimming");
static_assert(offsetof(VHumanoidLowerAndUpperCharacterAnimInstance_IsSwimming, ReturnValue) == 0x000000, "Member 'VHumanoidLowerAndUpperCharacterAnimInstance_IsSwimming::ReturnValue' has a wrong offset!");

// Function Altar.VHumanoidLowerAndUpperCharacterAnimInstance.IsUsingBow
// 0x0001 (0x0001 - 0x0000)
struct VHumanoidLowerAndUpperCharacterAnimInstance_IsUsingBow final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VHumanoidLowerAndUpperCharacterAnimInstance_IsUsingBow) == 0x000001, "Wrong alignment on VHumanoidLowerAndUpperCharacterAnimInstance_IsUsingBow");
static_assert(sizeof(VHumanoidLowerAndUpperCharacterAnimInstance_IsUsingBow) == 0x000001, "Wrong size on VHumanoidLowerAndUpperCharacterAnimInstance_IsUsingBow");
static_assert(offsetof(VHumanoidLowerAndUpperCharacterAnimInstance_IsUsingBow, ReturnValue) == 0x000000, "Member 'VHumanoidLowerAndUpperCharacterAnimInstance_IsUsingBow::ReturnValue' has a wrong offset!");

// Function Altar.VActor.OnActivateAnimation
// 0x0010 (0x0010 - 0x0000)
struct VActor_OnActivateAnimation final
{
public:
	class FString                                 AnimationName;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VActor_OnActivateAnimation) == 0x000008, "Wrong alignment on VActor_OnActivateAnimation");
static_assert(sizeof(VActor_OnActivateAnimation) == 0x000010, "Wrong size on VActor_OnActivateAnimation");
static_assert(offsetof(VActor_OnActivateAnimation, AnimationName) == 0x000000, "Member 'VActor_OnActivateAnimation::AnimationName' has a wrong offset!");

// Function Altar.VActor.OnResetAnimation
// 0x0018 (0x0018 - 0x0000)
struct VActor_OnResetAnimation final
{
public:
	class FString                                 AnimationName;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FramePosRatio;                                     // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          _bIsDestroyed;                                     // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(VActor_OnResetAnimation) == 0x000008, "Wrong alignment on VActor_OnResetAnimation");
static_assert(sizeof(VActor_OnResetAnimation) == 0x000018, "Wrong size on VActor_OnResetAnimation");
static_assert(offsetof(VActor_OnResetAnimation, AnimationName) == 0x000000, "Member 'VActor_OnResetAnimation::AnimationName' has a wrong offset!");
static_assert(offsetof(VActor_OnResetAnimation, FramePosRatio) == 0x000010, "Member 'VActor_OnResetAnimation::FramePosRatio' has a wrong offset!");
static_assert(offsetof(VActor_OnResetAnimation, _bIsDestroyed) == 0x000014, "Member 'VActor_OnResetAnimation::_bIsDestroyed' has a wrong offset!");

// Function Altar.VActor.GetDroppedItemSexVariant
// 0x0001 (0x0001 - 0x0000)
struct VActor_GetDroppedItemSexVariant final
{
public:
	ECharacterSex                                 ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VActor_GetDroppedItemSexVariant) == 0x000001, "Wrong alignment on VActor_GetDroppedItemSexVariant");
static_assert(sizeof(VActor_GetDroppedItemSexVariant) == 0x000001, "Wrong size on VActor_GetDroppedItemSexVariant");
static_assert(offsetof(VActor_GetDroppedItemSexVariant, ReturnValue) == 0x000000, "Member 'VActor_GetDroppedItemSexVariant::ReturnValue' has a wrong offset!");

// Function Altar.VActor.GetItemStackCount
// 0x0004 (0x0004 - 0x0000)
struct VActor_GetItemStackCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VActor_GetItemStackCount) == 0x000004, "Wrong alignment on VActor_GetItemStackCount");
static_assert(sizeof(VActor_GetItemStackCount) == 0x000004, "Wrong size on VActor_GetItemStackCount");
static_assert(offsetof(VActor_GetItemStackCount, ReturnValue) == 0x000000, "Member 'VActor_GetItemStackCount::ReturnValue' has a wrong offset!");

// Function Altar.VActor.GetVariantReferenceCharacter
// 0x0008 (0x0008 - 0x0000)
struct VActor_GetVariantReferenceCharacter final
{
public:
	class AVPairedCharacter*                      ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VActor_GetVariantReferenceCharacter) == 0x000008, "Wrong alignment on VActor_GetVariantReferenceCharacter");
static_assert(sizeof(VActor_GetVariantReferenceCharacter) == 0x000008, "Wrong size on VActor_GetVariantReferenceCharacter");
static_assert(offsetof(VActor_GetVariantReferenceCharacter, ReturnValue) == 0x000000, "Member 'VActor_GetVariantReferenceCharacter::ReturnValue' has a wrong offset!");

// Function Altar.TESForm.GetFormTypeFromFormString
// 0x0010 (0x0010 - 0x0000)
struct TESForm_GetFormTypeFromFormString final
{
public:
	int64                                         formString;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFormID                                       ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TESForm_GetFormTypeFromFormString) == 0x000008, "Wrong alignment on TESForm_GetFormTypeFromFormString");
static_assert(sizeof(TESForm_GetFormTypeFromFormString) == 0x000010, "Wrong size on TESForm_GetFormTypeFromFormString");
static_assert(offsetof(TESForm_GetFormTypeFromFormString, formString) == 0x000000, "Member 'TESForm_GetFormTypeFromFormString::formString' has a wrong offset!");
static_assert(offsetof(TESForm_GetFormTypeFromFormString, ReturnValue) == 0x000008, "Member 'TESForm_GetFormTypeFromFormString::ReturnValue' has a wrong offset!");

// Function Altar.TESForm.GetComponent
// 0x0008 (0x0008 - 0x0000)
struct TESForm_GetComponent final
{
public:
	class UClass*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TESForm_GetComponent) == 0x000008, "Wrong alignment on TESForm_GetComponent");
static_assert(sizeof(TESForm_GetComponent) == 0x000008, "Wrong size on TESForm_GetComponent");
static_assert(offsetof(TESForm_GetComponent, ReturnValue) == 0x000000, "Member 'TESForm_GetComponent::ReturnValue' has a wrong offset!");

// Function Altar.TESForm.GetDelete
// 0x0001 (0x0001 - 0x0000)
struct TESForm_GetDelete final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TESForm_GetDelete) == 0x000001, "Wrong alignment on TESForm_GetDelete");
static_assert(sizeof(TESForm_GetDelete) == 0x000001, "Wrong size on TESForm_GetDelete");
static_assert(offsetof(TESForm_GetDelete, ReturnValue) == 0x000000, "Member 'TESForm_GetDelete::ReturnValue' has a wrong offset!");

// Function Altar.TESForm.GetEquipableBlueprintClass
// 0x0028 (0x0028 - 0x0000)
struct TESForm_GetEquipableBlueprintClass final
{
public:
	TSoftClassPtr<class UClass>                   ReturnValue;                                       // 0x0000(0x0028)(Parm, OutParm, ReturnParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TESForm_GetEquipableBlueprintClass) == 0x000008, "Wrong alignment on TESForm_GetEquipableBlueprintClass");
static_assert(sizeof(TESForm_GetEquipableBlueprintClass) == 0x000028, "Wrong size on TESForm_GetEquipableBlueprintClass");
static_assert(offsetof(TESForm_GetEquipableBlueprintClass, ReturnValue) == 0x000000, "Member 'TESForm_GetEquipableBlueprintClass::ReturnValue' has a wrong offset!");

// Function Altar.TESForm.GetFormDetailedString
// 0x0010 (0x0010 - 0x0000)
struct TESForm_GetFormDetailedString final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TESForm_GetFormDetailedString) == 0x000008, "Wrong alignment on TESForm_GetFormDetailedString");
static_assert(sizeof(TESForm_GetFormDetailedString) == 0x000010, "Wrong size on TESForm_GetFormDetailedString");
static_assert(offsetof(TESForm_GetFormDetailedString, ReturnValue) == 0x000000, "Member 'TESForm_GetFormDetailedString::ReturnValue' has a wrong offset!");

// Function Altar.TESForm.CanFormBeUsedAsPropItem
// 0x0001 (0x0001 - 0x0000)
struct TESForm_CanFormBeUsedAsPropItem final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TESForm_CanFormBeUsedAsPropItem) == 0x000001, "Wrong alignment on TESForm_CanFormBeUsedAsPropItem");
static_assert(sizeof(TESForm_CanFormBeUsedAsPropItem) == 0x000001, "Wrong size on TESForm_CanFormBeUsedAsPropItem");
static_assert(offsetof(TESForm_CanFormBeUsedAsPropItem, ReturnValue) == 0x000000, "Member 'TESForm_CanFormBeUsedAsPropItem::ReturnValue' has a wrong offset!");

// Function Altar.TESForm.GetBPFormID
// 0x0008 (0x0008 - 0x0000)
struct TESForm_GetBPFormID final
{
public:
	int64                                         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TESForm_GetBPFormID) == 0x000008, "Wrong alignment on TESForm_GetBPFormID");
static_assert(sizeof(TESForm_GetBPFormID) == 0x000008, "Wrong size on TESForm_GetBPFormID");
static_assert(offsetof(TESForm_GetBPFormID, ReturnValue) == 0x000000, "Member 'TESForm_GetBPFormID::ReturnValue' has a wrong offset!");

// Function Altar.TESForm.GetFormEditorID
// 0x0010 (0x0010 - 0x0000)
struct TESForm_GetFormEditorID final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TESForm_GetFormEditorID) == 0x000008, "Wrong alignment on TESForm_GetFormEditorID");
static_assert(sizeof(TESForm_GetFormEditorID) == 0x000010, "Wrong size on TESForm_GetFormEditorID");
static_assert(offsetof(TESForm_GetFormEditorID, ReturnValue) == 0x000000, "Member 'TESForm_GetFormEditorID::ReturnValue' has a wrong offset!");

// Function Altar.TESForm.GetFormFlags
// 0x0008 (0x0008 - 0x0000)
struct TESForm_GetFormFlags final
{
public:
	int64                                         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TESForm_GetFormFlags) == 0x000008, "Wrong alignment on TESForm_GetFormFlags");
static_assert(sizeof(TESForm_GetFormFlags) == 0x000008, "Wrong size on TESForm_GetFormFlags");
static_assert(offsetof(TESForm_GetFormFlags, ReturnValue) == 0x000000, "Member 'TESForm_GetFormFlags::ReturnValue' has a wrong offset!");

// Function Altar.TESForm.GetFormType
// 0x0001 (0x0001 - 0x0000)
struct TESForm_GetFormType final
{
public:
	EFormID                                       ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TESForm_GetFormType) == 0x000001, "Wrong alignment on TESForm_GetFormType");
static_assert(sizeof(TESForm_GetFormType) == 0x000001, "Wrong size on TESForm_GetFormType");
static_assert(offsetof(TESForm_GetFormType, ReturnValue) == 0x000000, "Member 'TESForm_GetFormType::ReturnValue' has a wrong offset!");

// Function Altar.TESForm.GetFormTypeString
// 0x0010 (0x0010 - 0x0000)
struct TESForm_GetFormTypeString final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TESForm_GetFormTypeString) == 0x000008, "Wrong alignment on TESForm_GetFormTypeString");
static_assert(sizeof(TESForm_GetFormTypeString) == 0x000010, "Wrong size on TESForm_GetFormTypeString");
static_assert(offsetof(TESForm_GetFormTypeString, ReturnValue) == 0x000000, "Member 'TESForm_GetFormTypeString::ReturnValue' has a wrong offset!");

// Function Altar.TESForm.GetFormTypeStringFromFlags
// 0x0010 (0x0010 - 0x0000)
struct TESForm_GetFormTypeStringFromFlags final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TESForm_GetFormTypeStringFromFlags) == 0x000008, "Wrong alignment on TESForm_GetFormTypeStringFromFlags");
static_assert(sizeof(TESForm_GetFormTypeStringFromFlags) == 0x000010, "Wrong size on TESForm_GetFormTypeStringFromFlags");
static_assert(offsetof(TESForm_GetFormTypeStringFromFlags, ReturnValue) == 0x000000, "Member 'TESForm_GetFormTypeStringFromFlags::ReturnValue' has a wrong offset!");

// Function Altar.TESForm.GetHexFormID
// 0x0010 (0x0010 - 0x0000)
struct TESForm_GetHexFormID final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TESForm_GetHexFormID) == 0x000008, "Wrong alignment on TESForm_GetHexFormID");
static_assert(sizeof(TESForm_GetHexFormID) == 0x000010, "Wrong size on TESForm_GetHexFormID");
static_assert(offsetof(TESForm_GetHexFormID, ReturnValue) == 0x000000, "Member 'TESForm_GetHexFormID::ReturnValue' has a wrong offset!");

// Function Altar.TESForm.GetMaster
// 0x0001 (0x0001 - 0x0000)
struct TESForm_GetMaster final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TESForm_GetMaster) == 0x000001, "Wrong alignment on TESForm_GetMaster");
static_assert(sizeof(TESForm_GetMaster) == 0x000001, "Wrong size on TESForm_GetMaster");
static_assert(offsetof(TESForm_GetMaster, ReturnValue) == 0x000000, "Member 'TESForm_GetMaster::ReturnValue' has a wrong offset!");

// Function Altar.TESForm.GetTemporary
// 0x0001 (0x0001 - 0x0000)
struct TESForm_GetTemporary final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TESForm_GetTemporary) == 0x000001, "Wrong alignment on TESForm_GetTemporary");
static_assert(sizeof(TESForm_GetTemporary) == 0x000001, "Wrong size on TESForm_GetTemporary");
static_assert(offsetof(TESForm_GetTemporary, ReturnValue) == 0x000000, "Member 'TESForm_GetTemporary::ReturnValue' has a wrong offset!");

// Function Altar.VModularBodyPartBase.GetModularBodyPartClassFromSlot
// 0x0010 (0x0010 - 0x0000)
struct VModularBodyPartBase_GetModularBodyPartClassFromSlot final
{
public:
	EBipedModularBodySlot                         Slot;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class AVModularBodyPartBase>      ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VModularBodyPartBase_GetModularBodyPartClassFromSlot) == 0x000008, "Wrong alignment on VModularBodyPartBase_GetModularBodyPartClassFromSlot");
static_assert(sizeof(VModularBodyPartBase_GetModularBodyPartClassFromSlot) == 0x000010, "Wrong size on VModularBodyPartBase_GetModularBodyPartClassFromSlot");
static_assert(offsetof(VModularBodyPartBase_GetModularBodyPartClassFromSlot, Slot) == 0x000000, "Member 'VModularBodyPartBase_GetModularBodyPartClassFromSlot::Slot' has a wrong offset!");
static_assert(offsetof(VModularBodyPartBase_GetModularBodyPartClassFromSlot, ReturnValue) == 0x000008, "Member 'VModularBodyPartBase_GetModularBodyPartClassFromSlot::ReturnValue' has a wrong offset!");

// Function Altar.VModularBodyPartBase.OnAttachedToPhenotype
// 0x0018 (0x0018 - 0x0000)
struct VModularBodyPartBase_OnAttachedToPhenotype final
{
public:
	class UVCharacterPhenotypeData*               PhenotypeData;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTESRace*                               CharacterRace;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECharacterSex                                 CharacterSex;                                      // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(VModularBodyPartBase_OnAttachedToPhenotype) == 0x000008, "Wrong alignment on VModularBodyPartBase_OnAttachedToPhenotype");
static_assert(sizeof(VModularBodyPartBase_OnAttachedToPhenotype) == 0x000018, "Wrong size on VModularBodyPartBase_OnAttachedToPhenotype");
static_assert(offsetof(VModularBodyPartBase_OnAttachedToPhenotype, PhenotypeData) == 0x000000, "Member 'VModularBodyPartBase_OnAttachedToPhenotype::PhenotypeData' has a wrong offset!");
static_assert(offsetof(VModularBodyPartBase_OnAttachedToPhenotype, CharacterRace) == 0x000008, "Member 'VModularBodyPartBase_OnAttachedToPhenotype::CharacterRace' has a wrong offset!");
static_assert(offsetof(VModularBodyPartBase_OnAttachedToPhenotype, CharacterSex) == 0x000010, "Member 'VModularBodyPartBase_OnAttachedToPhenotype::CharacterSex' has a wrong offset!");

// Function Altar.VModularBodyPartBase.OnAttachToLeaderComponent
// 0x0008 (0x0008 - 0x0000)
struct VModularBodyPartBase_OnAttachToLeaderComponent final
{
public:
	class USkeletalMeshComponent*                 MasterComponent;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VModularBodyPartBase_OnAttachToLeaderComponent) == 0x000008, "Wrong alignment on VModularBodyPartBase_OnAttachToLeaderComponent");
static_assert(sizeof(VModularBodyPartBase_OnAttachToLeaderComponent) == 0x000008, "Wrong size on VModularBodyPartBase_OnAttachToLeaderComponent");
static_assert(offsetof(VModularBodyPartBase_OnAttachToLeaderComponent, MasterComponent) == 0x000000, "Member 'VModularBodyPartBase_OnAttachToLeaderComponent::MasterComponent' has a wrong offset!");

// Function Altar.VAIProcedureExecution_FOLLOW.GetFollowDistance
// 0x0004 (0x0004 - 0x0000)
struct VAIProcedureExecution_FOLLOW_GetFollowDistance final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VAIProcedureExecution_FOLLOW_GetFollowDistance) == 0x000004, "Wrong alignment on VAIProcedureExecution_FOLLOW_GetFollowDistance");
static_assert(sizeof(VAIProcedureExecution_FOLLOW_GetFollowDistance) == 0x000004, "Wrong size on VAIProcedureExecution_FOLLOW_GetFollowDistance");
static_assert(offsetof(VAIProcedureExecution_FOLLOW_GetFollowDistance, ReturnValue) == 0x000000, "Member 'VAIProcedureExecution_FOLLOW_GetFollowDistance::ReturnValue' has a wrong offset!");

// Function Altar.VAIProcedureExecution_FOLLOW.GetTargetActor
// 0x0008 (0x0008 - 0x0000)
struct VAIProcedureExecution_FOLLOW_GetTargetActor final
{
public:
	class AActor*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VAIProcedureExecution_FOLLOW_GetTargetActor) == 0x000008, "Wrong alignment on VAIProcedureExecution_FOLLOW_GetTargetActor");
static_assert(sizeof(VAIProcedureExecution_FOLLOW_GetTargetActor) == 0x000008, "Wrong size on VAIProcedureExecution_FOLLOW_GetTargetActor");
static_assert(offsetof(VAIProcedureExecution_FOLLOW_GetTargetActor, ReturnValue) == 0x000000, "Member 'VAIProcedureExecution_FOLLOW_GetTargetActor::ReturnValue' has a wrong offset!");

// Function Altar.TESBoundObject.GetPropBlueprintClass
// 0x0008 (0x0008 - 0x0000)
struct TESBoundObject_GetPropBlueprintClass final
{
public:
	class UClass*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TESBoundObject_GetPropBlueprintClass) == 0x000008, "Wrong alignment on TESBoundObject_GetPropBlueprintClass");
static_assert(sizeof(TESBoundObject_GetPropBlueprintClass) == 0x000008, "Wrong size on TESBoundObject_GetPropBlueprintClass");
static_assert(offsetof(TESBoundObject_GetPropBlueprintClass, ReturnValue) == 0x000000, "Member 'TESBoundObject_GetPropBlueprintClass::ReturnValue' has a wrong offset!");

// Function Altar.VEquippable.IsEquipped
// 0x0001 (0x0001 - 0x0000)
struct VEquippable_IsEquipped final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VEquippable_IsEquipped) == 0x000001, "Wrong alignment on VEquippable_IsEquipped");
static_assert(sizeof(VEquippable_IsEquipped) == 0x000001, "Wrong size on VEquippable_IsEquipped");
static_assert(offsetof(VEquippable_IsEquipped, ReturnValue) == 0x000000, "Member 'VEquippable_IsEquipped::ReturnValue' has a wrong offset!");

// Function Altar.VAmmunition.Collide
// 0x0120 (0x0120 - 0x0000)
struct VAmmunition_Collide final
{
public:
	struct FHitResult                             HitResult;                                         // 0x0000(0x00E8)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FVProjectilePenetrationSettings        PenetrationSettings;                               // 0x00E8(0x0014)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class AActor*                           TargetActor;                                       // 0x0100(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ImpactVelocity;                                    // 0x0108(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VAmmunition_Collide) == 0x000008, "Wrong alignment on VAmmunition_Collide");
static_assert(sizeof(VAmmunition_Collide) == 0x000120, "Wrong size on VAmmunition_Collide");
static_assert(offsetof(VAmmunition_Collide, HitResult) == 0x000000, "Member 'VAmmunition_Collide::HitResult' has a wrong offset!");
static_assert(offsetof(VAmmunition_Collide, PenetrationSettings) == 0x0000E8, "Member 'VAmmunition_Collide::PenetrationSettings' has a wrong offset!");
static_assert(offsetof(VAmmunition_Collide, TargetActor) == 0x000100, "Member 'VAmmunition_Collide::TargetActor' has a wrong offset!");
static_assert(offsetof(VAmmunition_Collide, ImpactVelocity) == 0x000108, "Member 'VAmmunition_Collide::ImpactVelocity' has a wrong offset!");

// Function Altar.VAmmunition.OnBounce
// 0x0100 (0x0100 - 0x0000)
struct VAmmunition_OnBounce final
{
public:
	struct FHitResult                             ImpactResult;                                      // 0x0000(0x00E8)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FVector                                ImpactVelocity;                                    // 0x00E8(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VAmmunition_OnBounce) == 0x000008, "Wrong alignment on VAmmunition_OnBounce");
static_assert(sizeof(VAmmunition_OnBounce) == 0x000100, "Wrong size on VAmmunition_OnBounce");
static_assert(offsetof(VAmmunition_OnBounce, ImpactResult) == 0x000000, "Member 'VAmmunition_OnBounce::ImpactResult' has a wrong offset!");
static_assert(offsetof(VAmmunition_OnBounce, ImpactVelocity) == 0x0000E8, "Member 'VAmmunition_OnBounce::ImpactVelocity' has a wrong offset!");

// Function Altar.VAmmunition.OnStaticMeshBeginOverlap
// 0x0108 (0x0108 - 0x0000)
struct VAmmunition_OnStaticMeshBeginOverlap final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(VAmmunition_OnStaticMeshBeginOverlap) == 0x000008, "Wrong alignment on VAmmunition_OnStaticMeshBeginOverlap");
static_assert(sizeof(VAmmunition_OnStaticMeshBeginOverlap) == 0x000108, "Wrong size on VAmmunition_OnStaticMeshBeginOverlap");
static_assert(offsetof(VAmmunition_OnStaticMeshBeginOverlap, OverlappedComponent) == 0x000000, "Member 'VAmmunition_OnStaticMeshBeginOverlap::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(VAmmunition_OnStaticMeshBeginOverlap, OtherActor) == 0x000008, "Member 'VAmmunition_OnStaticMeshBeginOverlap::OtherActor' has a wrong offset!");
static_assert(offsetof(VAmmunition_OnStaticMeshBeginOverlap, OtherComp) == 0x000010, "Member 'VAmmunition_OnStaticMeshBeginOverlap::OtherComp' has a wrong offset!");
static_assert(offsetof(VAmmunition_OnStaticMeshBeginOverlap, OtherBodyIndex) == 0x000018, "Member 'VAmmunition_OnStaticMeshBeginOverlap::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(VAmmunition_OnStaticMeshBeginOverlap, bFromSweep) == 0x00001C, "Member 'VAmmunition_OnStaticMeshBeginOverlap::bFromSweep' has a wrong offset!");
static_assert(offsetof(VAmmunition_OnStaticMeshBeginOverlap, SweepResult) == 0x000020, "Member 'VAmmunition_OnStaticMeshBeginOverlap::SweepResult' has a wrong offset!");

// Function Altar.VAmmunition.OnStaticMeshEndOverlap
// 0x0020 (0x0020 - 0x0000)
struct VAmmunition_OnStaticMeshEndOverlap final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(VAmmunition_OnStaticMeshEndOverlap) == 0x000008, "Wrong alignment on VAmmunition_OnStaticMeshEndOverlap");
static_assert(sizeof(VAmmunition_OnStaticMeshEndOverlap) == 0x000020, "Wrong size on VAmmunition_OnStaticMeshEndOverlap");
static_assert(offsetof(VAmmunition_OnStaticMeshEndOverlap, OverlappedComponent) == 0x000000, "Member 'VAmmunition_OnStaticMeshEndOverlap::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(VAmmunition_OnStaticMeshEndOverlap, OtherActor) == 0x000008, "Member 'VAmmunition_OnStaticMeshEndOverlap::OtherActor' has a wrong offset!");
static_assert(offsetof(VAmmunition_OnStaticMeshEndOverlap, OtherComp) == 0x000010, "Member 'VAmmunition_OnStaticMeshEndOverlap::OtherComp' has a wrong offset!");
static_assert(offsetof(VAmmunition_OnStaticMeshEndOverlap, OtherBodyIndex) == 0x000018, "Member 'VAmmunition_OnStaticMeshEndOverlap::OtherBodyIndex' has a wrong offset!");

// Function Altar.VAmmunition.SendCollide
// 0x0010 (0x0010 - 0x0000)
struct VAmmunition_SendCollide final
{
public:
	float                                         ArrowAgeMaxOnceCollided;                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CollidedActor;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VAmmunition_SendCollide) == 0x000008, "Wrong alignment on VAmmunition_SendCollide");
static_assert(sizeof(VAmmunition_SendCollide) == 0x000010, "Wrong size on VAmmunition_SendCollide");
static_assert(offsetof(VAmmunition_SendCollide, ArrowAgeMaxOnceCollided) == 0x000000, "Member 'VAmmunition_SendCollide::ArrowAgeMaxOnceCollided' has a wrong offset!");
static_assert(offsetof(VAmmunition_SendCollide, CollidedActor) == 0x000008, "Member 'VAmmunition_SendCollide::CollidedActor' has a wrong offset!");

// Function Altar.VAmmunition.ShootAmunition
// 0x0028 (0x0028 - 0x0000)
struct VAmmunition_ShootAmunition final
{
public:
	class AVPairedPawn*                           Shooter;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Direction;                                         // 0x0008(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Speed;                                             // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(VAmmunition_ShootAmunition) == 0x000008, "Wrong alignment on VAmmunition_ShootAmunition");
static_assert(sizeof(VAmmunition_ShootAmunition) == 0x000028, "Wrong size on VAmmunition_ShootAmunition");
static_assert(offsetof(VAmmunition_ShootAmunition, Shooter) == 0x000000, "Member 'VAmmunition_ShootAmunition::Shooter' has a wrong offset!");
static_assert(offsetof(VAmmunition_ShootAmunition, Direction) == 0x000008, "Member 'VAmmunition_ShootAmunition::Direction' has a wrong offset!");
static_assert(offsetof(VAmmunition_ShootAmunition, Speed) == 0x000020, "Member 'VAmmunition_ShootAmunition::Speed' has a wrong offset!");

// Function Altar.VDockingPairingComponent.GetSitSleepState
// 0x0001 (0x0001 - 0x0000)
struct VDockingPairingComponent_GetSitSleepState final
{
public:
	ESitSleepState                                ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VDockingPairingComponent_GetSitSleepState) == 0x000001, "Wrong alignment on VDockingPairingComponent_GetSitSleepState");
static_assert(sizeof(VDockingPairingComponent_GetSitSleepState) == 0x000001, "Wrong size on VDockingPairingComponent_GetSitSleepState");
static_assert(offsetof(VDockingPairingComponent_GetSitSleepState, ReturnValue) == 0x000000, "Member 'VDockingPairingComponent_GetSitSleepState::ReturnValue' has a wrong offset!");

// Function Altar.VDockingPairingComponent.GetUsedDockActor
// 0x0008 (0x0008 - 0x0000)
struct VDockingPairingComponent_GetUsedDockActor final
{
public:
	class AActor*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VDockingPairingComponent_GetUsedDockActor) == 0x000008, "Wrong alignment on VDockingPairingComponent_GetUsedDockActor");
static_assert(sizeof(VDockingPairingComponent_GetUsedDockActor) == 0x000008, "Wrong size on VDockingPairingComponent_GetUsedDockActor");
static_assert(offsetof(VDockingPairingComponent_GetUsedDockActor, ReturnValue) == 0x000000, "Member 'VDockingPairingComponent_GetUsedDockActor::ReturnValue' has a wrong offset!");

// Function Altar.VDockingPairingComponent.HasPendingDockingTransition
// 0x0001 (0x0001 - 0x0000)
struct VDockingPairingComponent_HasPendingDockingTransition final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VDockingPairingComponent_HasPendingDockingTransition) == 0x000001, "Wrong alignment on VDockingPairingComponent_HasPendingDockingTransition");
static_assert(sizeof(VDockingPairingComponent_HasPendingDockingTransition) == 0x000001, "Wrong size on VDockingPairingComponent_HasPendingDockingTransition");
static_assert(offsetof(VDockingPairingComponent_HasPendingDockingTransition, ReturnValue) == 0x000000, "Member 'VDockingPairingComponent_HasPendingDockingTransition::ReturnValue' has a wrong offset!");

// Function Altar.VDockingPairingComponent.IsDocked
// 0x0001 (0x0001 - 0x0000)
struct VDockingPairingComponent_IsDocked final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VDockingPairingComponent_IsDocked) == 0x000001, "Wrong alignment on VDockingPairingComponent_IsDocked");
static_assert(sizeof(VDockingPairingComponent_IsDocked) == 0x000001, "Wrong size on VDockingPairingComponent_IsDocked");
static_assert(offsetof(VDockingPairingComponent_IsDocked, ReturnValue) == 0x000000, "Member 'VDockingPairingComponent_IsDocked::ReturnValue' has a wrong offset!");

// Function Altar.VContainer.IsContainerOpen
// 0x0001 (0x0001 - 0x0000)
struct VContainer_IsContainerOpen final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VContainer_IsContainerOpen) == 0x000001, "Wrong alignment on VContainer_IsContainerOpen");
static_assert(sizeof(VContainer_IsContainerOpen) == 0x000001, "Wrong size on VContainer_IsContainerOpen");
static_assert(offsetof(VContainer_IsContainerOpen, ReturnValue) == 0x000000, "Member 'VContainer_IsContainerOpen::ReturnValue' has a wrong offset!");

// Function Altar.VContainer.IsContainerUnlocked
// 0x0001 (0x0001 - 0x0000)
struct VContainer_IsContainerUnlocked final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VContainer_IsContainerUnlocked) == 0x000001, "Wrong alignment on VContainer_IsContainerUnlocked");
static_assert(sizeof(VContainer_IsContainerUnlocked) == 0x000001, "Wrong size on VContainer_IsContainerUnlocked");
static_assert(offsetof(VContainer_IsContainerUnlocked, ReturnValue) == 0x000000, "Member 'VContainer_IsContainerUnlocked::ReturnValue' has a wrong offset!");

// Function Altar.VLevelChangeData.GetLevelChangeData
// 0x0010 (0x0010 - 0x0000)
struct VLevelChangeData_GetLevelChangeData final
{
public:
	const class UWorld*                           InWorld;                                           // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UVLevelChangeData*                      ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VLevelChangeData_GetLevelChangeData) == 0x000008, "Wrong alignment on VLevelChangeData_GetLevelChangeData");
static_assert(sizeof(VLevelChangeData_GetLevelChangeData) == 0x000010, "Wrong size on VLevelChangeData_GetLevelChangeData");
static_assert(offsetof(VLevelChangeData_GetLevelChangeData, InWorld) == 0x000000, "Member 'VLevelChangeData_GetLevelChangeData::InWorld' has a wrong offset!");
static_assert(offsetof(VLevelChangeData_GetLevelChangeData, ReturnValue) == 0x000008, "Member 'VLevelChangeData_GetLevelChangeData::ReturnValue' has a wrong offset!");

// Function Altar.VLevelChangeData.OnFadeToBlackEndEventReceived
// 0x0004 (0x0004 - 0x0000)
struct VLevelChangeData_OnFadeToBlackEndEventReceived final
{
public:
	EVFadeTransitionType                          InType;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VLevelChangeData_OnFadeToBlackEndEventReceived) == 0x000004, "Wrong alignment on VLevelChangeData_OnFadeToBlackEndEventReceived");
static_assert(sizeof(VLevelChangeData_OnFadeToBlackEndEventReceived) == 0x000004, "Wrong size on VLevelChangeData_OnFadeToBlackEndEventReceived");
static_assert(offsetof(VLevelChangeData_OnFadeToBlackEndEventReceived, InType) == 0x000000, "Member 'VLevelChangeData_OnFadeToBlackEndEventReceived::InType' has a wrong offset!");

// Function Altar.VDoor.OnBeginOverlapPreLoadBox
// 0x0108 (0x0108 - 0x0000)
struct VDoor_OnBeginOverlapPreLoadBox final
{
public:
	class UPrimitiveComponent*                    SourceComp;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 TargetActor;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    TargetComp;                                        // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         UnusedOtherBox;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UnusedSweep;                                       // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             EmptyHitResult;                                    // 0x0020(0x00E8)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(VDoor_OnBeginOverlapPreLoadBox) == 0x000008, "Wrong alignment on VDoor_OnBeginOverlapPreLoadBox");
static_assert(sizeof(VDoor_OnBeginOverlapPreLoadBox) == 0x000108, "Wrong size on VDoor_OnBeginOverlapPreLoadBox");
static_assert(offsetof(VDoor_OnBeginOverlapPreLoadBox, SourceComp) == 0x000000, "Member 'VDoor_OnBeginOverlapPreLoadBox::SourceComp' has a wrong offset!");
static_assert(offsetof(VDoor_OnBeginOverlapPreLoadBox, TargetActor) == 0x000008, "Member 'VDoor_OnBeginOverlapPreLoadBox::TargetActor' has a wrong offset!");
static_assert(offsetof(VDoor_OnBeginOverlapPreLoadBox, TargetComp) == 0x000010, "Member 'VDoor_OnBeginOverlapPreLoadBox::TargetComp' has a wrong offset!");
static_assert(offsetof(VDoor_OnBeginOverlapPreLoadBox, UnusedOtherBox) == 0x000018, "Member 'VDoor_OnBeginOverlapPreLoadBox::UnusedOtherBox' has a wrong offset!");
static_assert(offsetof(VDoor_OnBeginOverlapPreLoadBox, UnusedSweep) == 0x00001C, "Member 'VDoor_OnBeginOverlapPreLoadBox::UnusedSweep' has a wrong offset!");
static_assert(offsetof(VDoor_OnBeginOverlapPreLoadBox, EmptyHitResult) == 0x000020, "Member 'VDoor_OnBeginOverlapPreLoadBox::EmptyHitResult' has a wrong offset!");

// Function Altar.VDoor.OnEndOverlapPreLoadBox
// 0x0020 (0x0020 - 0x0000)
struct VDoor_OnEndOverlapPreLoadBox final
{
public:
	class UPrimitiveComponent*                    OverlappedComp;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
