#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Altar

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "EnhancedInput_structs.hpp"
#include "EnhancedInput_classes.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "Water_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "VActorStateMachine_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "Altar_structs.hpp"
#include "CommonUI_classes.hpp"
#include "InputCore_structs.hpp"
#include "SlateCore_structs.hpp"
#include "DeveloperSettings_classes.hpp"
#include "CommonInput_structs.hpp"
#include "ModelViewViewModel_classes.hpp"
#include "AkAudio_structs.hpp"
#include "AkAudio_classes.hpp"
#include "VCommonUIEnhancedInputNavigation_classes.hpp"
#include "LevelSequence_classes.hpp"
#include "NavigationSystem_classes.hpp"
#include "MotionWarping_classes.hpp"
#include "SteeringBehaviors_classes.hpp"
#include "AtmosphericToolRuntime_classes.hpp"
#include "AIModule_classes.hpp"
#include "AnimationBudgetAllocator_classes.hpp"
#include "Slate_structs.hpp"


namespace SDK
{

// Class Altar.NifType
// 0x0008 (0x0030 - 0x0028)
class UNifType : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NifType">();
	}
	static class UNifType* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNifType>();
	}
};
static_assert(alignof(UNifType) == 0x000008, "Wrong alignment on UNifType");
static_assert(sizeof(UNifType) == 0x000030, "Wrong size on UNifType");

// Class Altar.NiObject
// 0x0008 (0x0038 - 0x0030)
class UNiObject : public UNifType
{
public:
	int64                                         GroupID;                                           // 0x0030(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiObject">();
	}
	static class UNiObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiObject>();
	}
};
static_assert(alignof(UNiObject) == 0x000008, "Wrong alignment on UNiObject");
static_assert(sizeof(UNiObject) == 0x000038, "Wrong size on UNiObject");
static_assert(offsetof(UNiObject, GroupID) == 0x000030, "Member 'UNiObject::GroupID' has a wrong offset!");

// Class Altar.NiPixelFormat
// 0x0070 (0x00A8 - 0x0038)
class UNiPixelFormat final : public UNiObject
{
public:
	Altar::EPixelFormat                           PixelFormatFlags;                                  // 0x0038(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         RedMask;                                           // 0x0040(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         GreenMask;                                         // 0x0048(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         BlueMask;                                          // 0x0050(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         AlphaMask;                                         // 0x0058(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         BitsPerPixeluint;                                  // 0x0060(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<uint8>                                 OldFastCompare;                                    // 0x0068(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	EPixelTiling                                  Tiling;                                            // 0x0078(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         BitsPerPixelbyte;                                  // 0x007C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         RendererHint;                                      // 0x0080(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         ExtraData;                                         // 0x0088(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Flags_0;                                           // 0x0090(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          sRGBSpace;                                         // 0x0091(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPixelFormatComponent*>          Channels;                                          // 0x0098(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiPixelFormat">();
	}
	static class UNiPixelFormat* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiPixelFormat>();
	}
};
static_assert(alignof(UNiPixelFormat) == 0x000008, "Wrong alignment on UNiPixelFormat");
static_assert(sizeof(UNiPixelFormat) == 0x0000A8, "Wrong size on UNiPixelFormat");
static_assert(offsetof(UNiPixelFormat, PixelFormatFlags) == 0x000038, "Member 'UNiPixelFormat::PixelFormatFlags' has a wrong offset!");
static_assert(offsetof(UNiPixelFormat, RedMask) == 0x000040, "Member 'UNiPixelFormat::RedMask' has a wrong offset!");
static_assert(offsetof(UNiPixelFormat, GreenMask) == 0x000048, "Member 'UNiPixelFormat::GreenMask' has a wrong offset!");
static_assert(offsetof(UNiPixelFormat, BlueMask) == 0x000050, "Member 'UNiPixelFormat::BlueMask' has a wrong offset!");
static_assert(offsetof(UNiPixelFormat, AlphaMask) == 0x000058, "Member 'UNiPixelFormat::AlphaMask' has a wrong offset!");
static_assert(offsetof(UNiPixelFormat, BitsPerPixeluint) == 0x000060, "Member 'UNiPixelFormat::BitsPerPixeluint' has a wrong offset!");
static_assert(offsetof(UNiPixelFormat, OldFastCompare) == 0x000068, "Member 'UNiPixelFormat::OldFastCompare' has a wrong offset!");
static_assert(offsetof(UNiPixelFormat, Tiling) == 0x000078, "Member 'UNiPixelFormat::Tiling' has a wrong offset!");
static_assert(offsetof(UNiPixelFormat, BitsPerPixelbyte) == 0x00007C, "Member 'UNiPixelFormat::BitsPerPixelbyte' has a wrong offset!");
static_assert(offsetof(UNiPixelFormat, RendererHint) == 0x000080, "Member 'UNiPixelFormat::RendererHint' has a wrong offset!");
static_assert(offsetof(UNiPixelFormat, ExtraData) == 0x000088, "Member 'UNiPixelFormat::ExtraData' has a wrong offset!");
static_assert(offsetof(UNiPixelFormat, Flags_0) == 0x000090, "Member 'UNiPixelFormat::Flags_0' has a wrong offset!");
static_assert(offsetof(UNiPixelFormat, sRGBSpace) == 0x000091, "Member 'UNiPixelFormat::sRGBSpace' has a wrong offset!");
static_assert(offsetof(UNiPixelFormat, Channels) == 0x000098, "Member 'UNiPixelFormat::Channels' has a wrong offset!");

// Class Altar.bhkRefObject
// 0x0000 (0x0038 - 0x0038)
class UbhkRefObject : public UNiObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"bhkRefObject">();
	}
	static class UbhkRefObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UbhkRefObject>();
	}
};
static_assert(alignof(UbhkRefObject) == 0x000008, "Wrong alignment on UbhkRefObject");
static_assert(sizeof(UbhkRefObject) == 0x000038, "Wrong size on UbhkRefObject");

// Class Altar.bhkSerializable
// 0x0000 (0x0038 - 0x0038)
class UbhkSerializable : public UbhkRefObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"bhkSerializable">();
	}
	static class UbhkSerializable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UbhkSerializable>();
	}
};
static_assert(alignof(UbhkSerializable) == 0x000008, "Wrong alignment on UbhkSerializable");
static_assert(sizeof(UbhkSerializable) == 0x000038, "Wrong size on UbhkSerializable");

// Class Altar.bhkShape
// 0x0000 (0x0038 - 0x0038)
class UbhkShape : public UbhkSerializable
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"bhkShape">();
	}
	static class UbhkShape* GetDefaultObj()
	{
		return GetDefaultObjImpl<UbhkShape>();
	}
};
static_assert(alignof(UbhkShape) == 0x000008, "Wrong alignment on UbhkShape");
static_assert(sizeof(UbhkShape) == 0x000038, "Wrong size on UbhkShape");

// Class Altar.VBaseCharacterAnimInstance
// 0x0010 (0x0360 - 0x0350)
#pragma pack(push, 0x1)
class alignas(0x10) UVBaseCharacterAnimInstance : public UAnimInstance
{
public:
	class AVPairedPawn*                           PairedPawn;                                        // 0x0348(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_350[0x8];                                      // 0x0350(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VBaseCharacterAnimInstance">();
	}
	static class UVBaseCharacterAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVBaseCharacterAnimInstance>();
	}
};
#pragma pack(pop)
static_assert(alignof(UVBaseCharacterAnimInstance) == 0x000010, "Wrong alignment on UVBaseCharacterAnimInstance");
static_assert(sizeof(UVBaseCharacterAnimInstance) == 0x000360, "Wrong size on UVBaseCharacterAnimInstance");
static_assert(offsetof(UVBaseCharacterAnimInstance, PairedPawn) == 0x000348, "Member 'UVBaseCharacterAnimInstance::PairedPawn' has a wrong offset!");

// Class Altar.VLayerCharacterAnimInstance
// 0x0040 (0x03A0 - 0x0360)
class UVLayerCharacterAnimInstance : public UVBaseCharacterAnimInstance
{
public:
	class UVMainCharacterAnimInstance*            MainAnimInstance;                                  // 0x0358(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         AnimLayerIndex;                                    // 0x0360(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         AnimLayerPlayRate;                                 // 0x0364(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FPoseSnapshot                          SavedPoseSnapshot;                                 // 0x0368(0x0038)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, Protected, NativeAccessSpecifierProtected)

public:
	class UVMainCharacterAnimInstance* GetMainAnimInstance();
	class UAnimMontage* GetMontageFromArrayWithGivenIndexIfValid(int32 GameplayArrayIndex, const TArray<class UAnimMontage*>& MontageArray);
	class UAnimSequenceBase* GetSequenceFromArrayWithGivenIndexIfValid(int32 GameplayArrayIndex, const TArray<class UAnimSequenceBase*>& ActionAnim);
	void ScheduledPlayMontage(class UAnimMontage* MontageToPlay, float InPlayRate, class UAnimInstance* AnimInstance, EMontagePlayReturnType ReturnValueType, float InTimeToStartMontageAt, bool bStopAllMontages);
	void UpdateActionData(const struct FGameplayTag& ActionTag, const class UAnimSequenceBase* ActionAnim);
	void UpdateActionDataFromArray(const struct FGameplayTag& ActionTag, const TArray<class UAnimSequenceBase*>& ActionAnims);

	bool IsInCombat() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VLayerCharacterAnimInstance">();
	}
	static class UVLayerCharacterAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVLayerCharacterAnimInstance>();
	}
};
static_assert(alignof(UVLayerCharacterAnimInstance) == 0x000010, "Wrong alignment on UVLayerCharacterAnimInstance");
static_assert(sizeof(UVLayerCharacterAnimInstance) == 0x0003A0, "Wrong size on UVLayerCharacterAnimInstance");
static_assert(offsetof(UVLayerCharacterAnimInstance, MainAnimInstance) == 0x000358, "Member 'UVLayerCharacterAnimInstance::MainAnimInstance' has a wrong offset!");
static_assert(offsetof(UVLayerCharacterAnimInstance, AnimLayerIndex) == 0x000360, "Member 'UVLayerCharacterAnimInstance::AnimLayerIndex' has a wrong offset!");
static_assert(offsetof(UVLayerCharacterAnimInstance, AnimLayerPlayRate) == 0x000364, "Member 'UVLayerCharacterAnimInstance::AnimLayerPlayRate' has a wrong offset!");
static_assert(offsetof(UVLayerCharacterAnimInstance, SavedPoseSnapshot) == 0x000368, "Member 'UVLayerCharacterAnimInstance::SavedPoseSnapshot' has a wrong offset!");

// Class Altar.VHumanoidLowerAndUpperCharacterAnimInstance
// 0x00E0 (0x0480 - 0x03A0)
class UVHumanoidLowerAndUpperCharacterAnimInstance : public UVLayerCharacterAnimInstance
{
public:
	struct FVHumanoidLowerAndUpperBodySetup       TurnInPlaceBlendSettings;                          // 0x03A0(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  MovingTags;                                        // 0x03D8(0x0020)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTag                           RecoilTag;                                         // 0x03F8(0x0008)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  DedicatedSneakActionTags;                          // 0x0400(0x0020)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  LeftArmCastingTags;                                // 0x0420(0x0020)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	class FName                                   LandCurveName;                                     // 0x0440(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   LeftCastAnchorName;                                // 0x0448(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   RightCastAnchorName;                               // 0x0450(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsMovingOrRecoiling;                              // 0x0458(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bHasDedicatedSneakAnim;                            // 0x0459(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bStaffAttacking;                                   // 0x045A(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_45B[0x5];                                      // 0x045B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                MagicNodePosition;                                 // 0x0460(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_478[0x8];                                      // 0x0478(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool IsSneaking() const;
	bool IsSwimming() const;
	bool IsUsingBow() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VHumanoidLowerAndUpperCharacterAnimInstance">();
	}
	static class UVHumanoidLowerAndUpperCharacterAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVHumanoidLowerAndUpperCharacterAnimInstance>();
	}
};
static_assert(alignof(UVHumanoidLowerAndUpperCharacterAnimInstance) == 0x000010, "Wrong alignment on UVHumanoidLowerAndUpperCharacterAnimInstance");
static_assert(sizeof(UVHumanoidLowerAndUpperCharacterAnimInstance) == 0x000480, "Wrong size on UVHumanoidLowerAndUpperCharacterAnimInstance");
static_assert(offsetof(UVHumanoidLowerAndUpperCharacterAnimInstance, TurnInPlaceBlendSettings) == 0x0003A0, "Member 'UVHumanoidLowerAndUpperCharacterAnimInstance::TurnInPlaceBlendSettings' has a wrong offset!");
static_assert(offsetof(UVHumanoidLowerAndUpperCharacterAnimInstance, MovingTags) == 0x0003D8, "Member 'UVHumanoidLowerAndUpperCharacterAnimInstance::MovingTags' has a wrong offset!");
static_assert(offsetof(UVHumanoidLowerAndUpperCharacterAnimInstance, RecoilTag) == 0x0003F8, "Member 'UVHumanoidLowerAndUpperCharacterAnimInstance::RecoilTag' has a wrong offset!");
static_assert(offsetof(UVHumanoidLowerAndUpperCharacterAnimInstance, DedicatedSneakActionTags) == 0x000400, "Member 'UVHumanoidLowerAndUpperCharacterAnimInstance::DedicatedSneakActionTags' has a wrong offset!");
static_assert(offsetof(UVHumanoidLowerAndUpperCharacterAnimInstance, LeftArmCastingTags) == 0x000420, "Member 'UVHumanoidLowerAndUpperCharacterAnimInstance::LeftArmCastingTags' has a wrong offset!");
static_assert(offsetof(UVHumanoidLowerAndUpperCharacterAnimInstance, LandCurveName) == 0x000440, "Member 'UVHumanoidLowerAndUpperCharacterAnimInstance::LandCurveName' has a wrong offset!");
static_assert(offsetof(UVHumanoidLowerAndUpperCharacterAnimInstance, LeftCastAnchorName) == 0x000448, "Member 'UVHumanoidLowerAndUpperCharacterAnimInstance::LeftCastAnchorName' has a wrong offset!");
static_assert(offsetof(UVHumanoidLowerAndUpperCharacterAnimInstance, RightCastAnchorName) == 0x000450, "Member 'UVHumanoidLowerAndUpperCharacterAnimInstance::RightCastAnchorName' has a wrong offset!");
static_assert(offsetof(UVHumanoidLowerAndUpperCharacterAnimInstance, bIsMovingOrRecoiling) == 0x000458, "Member 'UVHumanoidLowerAndUpperCharacterAnimInstance::bIsMovingOrRecoiling' has a wrong offset!");
static_assert(offsetof(UVHumanoidLowerAndUpperCharacterAnimInstance, bHasDedicatedSneakAnim) == 0x000459, "Member 'UVHumanoidLowerAndUpperCharacterAnimInstance::bHasDedicatedSneakAnim' has a wrong offset!");
static_assert(offsetof(UVHumanoidLowerAndUpperCharacterAnimInstance, bStaffAttacking) == 0x00045A, "Member 'UVHumanoidLowerAndUpperCharacterAnimInstance::bStaffAttacking' has a wrong offset!");
static_assert(offsetof(UVHumanoidLowerAndUpperCharacterAnimInstance, MagicNodePosition) == 0x000460, "Member 'UVHumanoidLowerAndUpperCharacterAnimInstance::MagicNodePosition' has a wrong offset!");

// Class Altar.VStatusEffectTarget
// 0x0048 (0x02E0 - 0x0298)
class AVStatusEffectTarget : public AActor
{
public:
	bool                                          bIsVFXLocatedOnSkeletalMesh;                       // 0x0298(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   VFXLocationStaticMesh;                             // 0x02A0(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                 VFXLocationSkeletalMesh;                           // 0x02A8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UTESEffectShader* form, const TArray<struct FLinearColor>& VFXColors, const TArray<class UStaticMeshComponent*>& MeshIgnoreList, float StatusEffectValue)> OnTextureEffectStart; // 0x02B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnTextureEffectStop;                               // 0x02C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnTextureEffectReset;                              // 0x02D0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VStatusEffectTarget">();
	}
	static class AVStatusEffectTarget* GetDefaultObj()
	{
		return GetDefaultObjImpl<AVStatusEffectTarget>();
	}
};
static_assert(alignof(AVStatusEffectTarget) == 0x000008, "Wrong alignment on AVStatusEffectTarget");
static_assert(sizeof(AVStatusEffectTarget) == 0x0002E0, "Wrong size on AVStatusEffectTarget");
static_assert(offsetof(AVStatusEffectTarget, bIsVFXLocatedOnSkeletalMesh) == 0x000298, "Member 'AVStatusEffectTarget::bIsVFXLocatedOnSkeletalMesh' has a wrong offset!");
static_assert(offsetof(AVStatusEffectTarget, VFXLocationStaticMesh) == 0x0002A0, "Member 'AVStatusEffectTarget::VFXLocationStaticMesh' has a wrong offset!");
static_assert(offsetof(AVStatusEffectTarget, VFXLocationSkeletalMesh) == 0x0002A8, "Member 'AVStatusEffectTarget::VFXLocationSkeletalMesh' has a wrong offset!");
static_assert(offsetof(AVStatusEffectTarget, OnTextureEffectStart) == 0x0002B0, "Member 'AVStatusEffectTarget::OnTextureEffectStart' has a wrong offset!");
static_assert(offsetof(AVStatusEffectTarget, OnTextureEffectStop) == 0x0002C0, "Member 'AVStatusEffectTarget::OnTextureEffectStop' has a wrong offset!");
static_assert(offsetof(AVStatusEffectTarget, OnTextureEffectReset) == 0x0002D0, "Member 'AVStatusEffectTarget::OnTextureEffectReset' has a wrong offset!");

// Class Altar.VAltarStateConditionBase
// 0x0008 (0x0038 - 0x0030)
class UVAltarStateConditionBase : public UVStateCondition
{
public:
	class AVPairedPawn*                           PairedPawn;                                        // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VAltarStateConditionBase">();
	}
	static class UVAltarStateConditionBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVAltarStateConditionBase>();
	}
};
static_assert(alignof(UVAltarStateConditionBase) == 0x000008, "Wrong alignment on UVAltarStateConditionBase");
static_assert(sizeof(UVAltarStateConditionBase) == 0x000038, "Wrong size on UVAltarStateConditionBase");
static_assert(offsetof(UVAltarStateConditionBase, PairedPawn) == 0x000030, "Member 'UVAltarStateConditionBase::PairedPawn' has a wrong offset!");

// Class Altar.VAltarStateConditionCheckActionTags
// 0x0020 (0x0058 - 0x0038)
class UVAltarStateConditionCheckActionTags : public UVAltarStateConditionBase
{
public:
	struct FGameplayTagContainer                  ActionTags;                                        // 0x0038(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VAltarStateConditionCheckActionTags">();
	}
	static class UVAltarStateConditionCheckActionTags* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVAltarStateConditionCheckActionTags>();
	}
};
static_assert(alignof(UVAltarStateConditionCheckActionTags) == 0x000008, "Wrong alignment on UVAltarStateConditionCheckActionTags");
static_assert(sizeof(UVAltarStateConditionCheckActionTags) == 0x000058, "Wrong size on UVAltarStateConditionCheckActionTags");
static_assert(offsetof(UVAltarStateConditionCheckActionTags, ActionTags) == 0x000038, "Member 'UVAltarStateConditionCheckActionTags::ActionTags' has a wrong offset!");

// Class Altar.VActor
// 0x0010 (0x02F0 - 0x02E0)
class AVActor : public AVStatusEffectTarget
{
public:
	uint8                                         Pad_2E0[0x8];                                      // 0x02E0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ItemStackCount;                                    // 0x02E8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	FMulticastSparseDelegateProperty_             OnHiddenInGameChanged;                             // 0x02EC(0x0001)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_2ED[0x3];                                      // 0x02ED(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BindVariantUpdates();
	void OnActivateAnimation(const class FString& AnimationName);
	void OnResetAnimation(const class FString& AnimationName, float FramePosRatio, bool _bIsDestroyed);

	ECharacterSex GetDroppedItemSexVariant() const;
	int32 GetItemStackCount() const;
	class AVPairedCharacter* GetVariantReferenceCharacter() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VActor">();
	}
	static class AVActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AVActor>();
	}
};
static_assert(alignof(AVActor) == 0x000008, "Wrong alignment on AVActor");
static_assert(sizeof(AVActor) == 0x0002F0, "Wrong size on AVActor");
static_assert(offsetof(AVActor, ItemStackCount) == 0x0002E8, "Member 'AVActor::ItemStackCount' has a wrong offset!");
static_assert(offsetof(AVActor, OnHiddenInGameChanged) == 0x0002EC, "Member 'AVActor::OnHiddenInGameChanged' has a wrong offset!");

// Class Altar.TESBaseFormComponent
// 0x0000 (0x0028 - 0x0028)
class UTESBaseFormComponent : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TESBaseFormComponent">();
	}
	static class UTESBaseFormComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTESBaseFormComponent>();
	}
};
static_assert(alignof(UTESBaseFormComponent) == 0x000008, "Wrong alignment on UTESBaseFormComponent");
static_assert(sizeof(UTESBaseFormComponent) == 0x000028, "Wrong size on UTESBaseFormComponent");

// Class Altar.TESForm
// 0x00B0 (0x00D8 - 0x0028)
class UTESForm : public UTESBaseFormComponent
{
public:
	int64                                         m_formID;                                          // 0x0028(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 m_formEditorID;                                    // 0x0030(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EFormID                                       m_formType;                                        // 0x0040(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         m_formFlags;                                       // 0x0048(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UBlueprint>              Blueprint;                                         // 0x0050(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   BlueprintClass;                                    // 0x0078(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanBeUsedAsPropItem;                              // 0x00A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         BSXFlags;                                          // 0x00A8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TSoftObjectPtr<class UBlueprint>>      BlueprintVariants;                                 // 0x00B0(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<TSoftClassPtr<class UClass>>           BlueprintVariantClasses;                           // 0x00C0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                         Pad_D0[0x8];                                       // 0x00D0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static EFormID GetFormTypeFromFormString(int64 formString);

	class UClass* GetComponent();
	bool GetDelete();
	TSoftClassPtr<class UClass> GetEquipableBlueprintClass();
	class FString GetFormDetailedString();
	void UpdateBlueprintClassesPostEdit();

	bool CanFormBeUsedAsPropItem() const;
	int64 GetBPFormID() const;
	class FString GetFormEditorID() const;
	int64 GetFormFlags() const;
	EFormID GetFormType() const;
	class FString GetFormTypeString() const;
	class FString GetFormTypeStringFromFlags() const;
	class FString GetHexFormID() const;
	bool GetMaster() const;
	bool GetTemporary() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TESForm">();
	}
	static class UTESForm* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTESForm>();
	}
};
static_assert(alignof(UTESForm) == 0x000008, "Wrong alignment on UTESForm");
static_assert(sizeof(UTESForm) == 0x0000D8, "Wrong size on UTESForm");
static_assert(offsetof(UTESForm, m_formID) == 0x000028, "Member 'UTESForm::m_formID' has a wrong offset!");
static_assert(offsetof(UTESForm, m_formEditorID) == 0x000030, "Member 'UTESForm::m_formEditorID' has a wrong offset!");
static_assert(offsetof(UTESForm, m_formType) == 0x000040, "Member 'UTESForm::m_formType' has a wrong offset!");
static_assert(offsetof(UTESForm, m_formFlags) == 0x000048, "Member 'UTESForm::m_formFlags' has a wrong offset!");
static_assert(offsetof(UTESForm, Blueprint) == 0x000050, "Member 'UTESForm::Blueprint' has a wrong offset!");
static_assert(offsetof(UTESForm, BlueprintClass) == 0x000078, "Member 'UTESForm::BlueprintClass' has a wrong offset!");
static_assert(offsetof(UTESForm, bCanBeUsedAsPropItem) == 0x0000A0, "Member 'UTESForm::bCanBeUsedAsPropItem' has a wrong offset!");
static_assert(offsetof(UTESForm, BSXFlags) == 0x0000A8, "Member 'UTESForm::BSXFlags' has a wrong offset!");
static_assert(offsetof(UTESForm, BlueprintVariants) == 0x0000B0, "Member 'UTESForm::BlueprintVariants' has a wrong offset!");
static_assert(offsetof(UTESForm, BlueprintVariantClasses) == 0x0000C0, "Member 'UTESForm::BlueprintVariantClasses' has a wrong offset!");

// Class Altar.TESFaction
// 0x0000 (0x00D8 - 0x00D8)
class UTESFaction final : public UTESForm
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TESFaction">();
	}
	static class UTESFaction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTESFaction>();
	}
};
static_assert(alignof(UTESFaction) == 0x000008, "Wrong alignment on UTESFaction");
static_assert(sizeof(UTESFaction) == 0x0000D8, "Wrong size on UTESFaction");

// Class Altar.AltarGameModeBase
// 0x0090 (0x03C8 - 0x0338)
class AAltarGameModeBase : public AGameModeBase
{
public:
	bool                                          bShouldUseUnrealDebugTool;                         // 0x0338(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_339[0x7];                                      // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ANavMeshBoundsVolume*                   BackupNavMeshBoundsVolumeActor;                    // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_348[0x30];                                     // 0x0348(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(int32 NewValue)> OnClothQualityChanged;                            // 0x0378(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(int32 NewValue)> OnViewDistanceQualityChanged;                     // 0x0388(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                          bShouldUseDetourCrowdBehaviour;                    // 0x0398(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_399[0x7];                                      // 0x0399(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class AVPhysicsDebugPanel>     PhysicsDebugPanel;                                 // 0x03A0(0x0028)(Edit, EditConst, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AltarGameModeBase">();
	}
	static class AAltarGameModeBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAltarGameModeBase>();
	}
};
static_assert(alignof(AAltarGameModeBase) == 0x000008, "Wrong alignment on AAltarGameModeBase");
static_assert(sizeof(AAltarGameModeBase) == 0x0003C8, "Wrong size on AAltarGameModeBase");
static_assert(offsetof(AAltarGameModeBase, bShouldUseUnrealDebugTool) == 0x000338, "Member 'AAltarGameModeBase::bShouldUseUnrealDebugTool' has a wrong offset!");
static_assert(offsetof(AAltarGameModeBase, BackupNavMeshBoundsVolumeActor) == 0x000340, "Member 'AAltarGameModeBase::BackupNavMeshBoundsVolumeActor' has a wrong offset!");
static_assert(offsetof(AAltarGameModeBase, OnClothQualityChanged) == 0x000378, "Member 'AAltarGameModeBase::OnClothQualityChanged' has a wrong offset!");
static_assert(offsetof(AAltarGameModeBase, OnViewDistanceQualityChanged) == 0x000388, "Member 'AAltarGameModeBase::OnViewDistanceQualityChanged' has a wrong offset!");
static_assert(offsetof(AAltarGameModeBase, bShouldUseDetourCrowdBehaviour) == 0x000398, "Member 'AAltarGameModeBase::bShouldUseDetourCrowdBehaviour' has a wrong offset!");
static_assert(offsetof(AAltarGameModeBase, PhysicsDebugPanel) == 0x0003A0, "Member 'AAltarGameModeBase::PhysicsDebugPanel' has a wrong offset!");

// Class Altar.VActivable
// 0x00A8 (0x0398 - 0x02F0)
class AVActivable : public AVActor
{
public:
	uint8                                         Pad_2F0[0x40];                                     // 0x02F0(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	class UVTESObjectRefComponent*                TESRefComponent;                                   // 0x0330(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UVTransformPairingComponent*            TransformPairingComponent;                         // 0x0338(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UVAnimationObjectPairingComponent*      AnimationObjectPairingComponent;                   // 0x0340(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                 SkeletalMeshComponent;                             // 0x0348(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UVPhysicsControllerComponent*           PhysicsControllerComponent;                        // 0x0350(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UVAltarAkComponent*                     AkAudioComponent;                                  // 0x0358(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDoesDetonateItsProjectilesAsSoonAsTheyAppear;     // 0x0360(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bChangeNavModifierAreaOnOpenCloseState;            // 0x0361(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_362[0x6];                                      // 0x0362(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UNavArea>                   OpenNavArea;                                       // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UNavArea>                   CloseNavArea;                                      // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldPhysicsWaitForCustomTrigger;                // 0x0378(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bPortalStartsOpened;                               // 0x0379(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bForwardAnimationOpensPortal;                      // 0x037A(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsPortalOpened;                                   // 0x037B(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_37C[0x4];                                      // 0x037C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNavModifierComponent*                  OwnedNavModifierComponent;                         // 0x0380(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UVAltarAkPortalComponent*               PortalComponent;                                   // 0x0388(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_390[0x8];                                      // 0x0390(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnActivableSimulationStart();
	void OnActivableSimulationStop();
	void TriggerActivateForPhysics();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VActivable">();
	}
	static class AVActivable* GetDefaultObj()
	{
		return GetDefaultObjImpl<AVActivable>();
	}
};
static_assert(alignof(AVActivable) == 0x000008, "Wrong alignment on AVActivable");
static_assert(sizeof(AVActivable) == 0x000398, "Wrong size on AVActivable");
static_assert(offsetof(AVActivable, TESRefComponent) == 0x000330, "Member 'AVActivable::TESRefComponent' has a wrong offset!");
static_assert(offsetof(AVActivable, TransformPairingComponent) == 0x000338, "Member 'AVActivable::TransformPairingComponent' has a wrong offset!");
static_assert(offsetof(AVActivable, AnimationObjectPairingComponent) == 0x000340, "Member 'AVActivable::AnimationObjectPairingComponent' has a wrong offset!");
static_assert(offsetof(AVActivable, SkeletalMeshComponent) == 0x000348, "Member 'AVActivable::SkeletalMeshComponent' has a wrong offset!");
static_assert(offsetof(AVActivable, PhysicsControllerComponent) == 0x000350, "Member 'AVActivable::PhysicsControllerComponent' has a wrong offset!");
static_assert(offsetof(AVActivable, AkAudioComponent) == 0x000358, "Member 'AVActivable::AkAudioComponent' has a wrong offset!");
static_assert(offsetof(AVActivable, bDoesDetonateItsProjectilesAsSoonAsTheyAppear) == 0x000360, "Member 'AVActivable::bDoesDetonateItsProjectilesAsSoonAsTheyAppear' has a wrong offset!");
static_assert(offsetof(AVActivable, bChangeNavModifierAreaOnOpenCloseState) == 0x000361, "Member 'AVActivable::bChangeNavModifierAreaOnOpenCloseState' has a wrong offset!");
static_assert(offsetof(AVActivable, OpenNavArea) == 0x000368, "Member 'AVActivable::OpenNavArea' has a wrong offset!");
static_assert(offsetof(AVActivable, CloseNavArea) == 0x000370, "Member 'AVActivable::CloseNavArea' has a wrong offset!");
static_assert(offsetof(AVActivable, bShouldPhysicsWaitForCustomTrigger) == 0x000378, "Member 'AVActivable::bShouldPhysicsWaitForCustomTrigger' has a wrong offset!");
static_assert(offsetof(AVActivable, bPortalStartsOpened) == 0x000379, "Member 'AVActivable::bPortalStartsOpened' has a wrong offset!");
static_assert(offsetof(AVActivable, bForwardAnimationOpensPortal) == 0x00037A, "Member 'AVActivable::bForwardAnimationOpensPortal' has a wrong offset!");
static_assert(offsetof(AVActivable, bIsPortalOpened) == 0x00037B, "Member 'AVActivable::bIsPortalOpened' has a wrong offset!");
static_assert(offsetof(AVActivable, OwnedNavModifierComponent) == 0x000380, "Member 'AVActivable::OwnedNavModifierComponent' has a wrong offset!");
static_assert(offsetof(AVActivable, PortalComponent) == 0x000388, "Member 'AVActivable::PortalComponent' has a wrong offset!");

// Class Altar.VModularBodyPartBase
// 0x0060 (0x0340 - 0x02E0)
class AVModularBodyPartBase : public AVStatusEffectTarget
{
public:
	TSoftObjectPtr<class USkeletalMesh>           MaleMesh;                                          // 0x02E0(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class USkeletalMesh>           FemaleMesh;                                        // 0x0308(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                 RootSkeletalMeshComponent;                         // 0x0330(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        MaleBodySectionHidden;                             // 0x0338(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        FemaleBodySectionHidden;                           // 0x033C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static TSubclassOf<class AVModularBodyPartBase> GetModularBodyPartClassFromSlot(EBipedModularBodySlot Slot);

	void OnAttachedInFirstPerson();
	void OnAttachedToPhenotype(class UVCharacterPhenotypeData* PhenotypeData, class UTESRace* CharacterRace, ECharacterSex CharacterSex);
	void OnAttachToLeaderComponent(class USkeletalMeshComponent* MasterComponent);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VModularBodyPartBase">();
	}
	static class AVModularBodyPartBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<AVModularBodyPartBase>();
	}
};
static_assert(alignof(AVModularBodyPartBase) == 0x000008, "Wrong alignment on AVModularBodyPartBase");
static_assert(sizeof(AVModularBodyPartBase) == 0x000340, "Wrong size on AVModularBodyPartBase");
static_assert(offsetof(AVModularBodyPartBase, MaleMesh) == 0x0002E0, "Member 'AVModularBodyPartBase::MaleMesh' has a wrong offset!");
static_assert(offsetof(AVModularBodyPartBase, FemaleMesh) == 0x000308, "Member 'AVModularBodyPartBase::FemaleMesh' has a wrong offset!");
static_assert(offsetof(AVModularBodyPartBase, RootSkeletalMeshComponent) == 0x000330, "Member 'AVModularBodyPartBase::RootSkeletalMeshComponent' has a wrong offset!");
static_assert(offsetof(AVModularBodyPartBase, MaleBodySectionHidden) == 0x000338, "Member 'AVModularBodyPartBase::MaleBodySectionHidden' has a wrong offset!");
static_assert(offsetof(AVModularBodyPartBase, FemaleBodySectionHidden) == 0x00033C, "Member 'AVModularBodyPartBase::FemaleBodySectionHidden' has a wrong offset!");

// Class Altar.VHelmetModularBodyPart
// 0x0040 (0x0380 - 0x0340)
class AVHelmetModularBodyPart : public AVModularBodyPartBase
{
public:
	bool                                          ShouldHideHair;                                    // 0x0340(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ShouldHideHead;                                    // 0x0341(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_342[0x6];                                      // 0x0342(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UVHelmetHeadMorphDataAsset*             HeadMorphLimitsData;                               // 0x0348(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                UpscaleMultiplier;                                 // 0x0350(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                DownscaleMultiplier;                               // 0x0368(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VHelmetModularBodyPart">();
	}
	static class AVHelmetModularBodyPart* GetDefaultObj()
	{
		return GetDefaultObjImpl<AVHelmetModularBodyPart>();
	}
};
static_assert(alignof(AVHelmetModularBodyPart) == 0x000008, "Wrong alignment on AVHelmetModularBodyPart");
static_assert(sizeof(AVHelmetModularBodyPart) == 0x000380, "Wrong size on AVHelmetModularBodyPart");
static_assert(offsetof(AVHelmetModularBodyPart, ShouldHideHair) == 0x000340, "Member 'AVHelmetModularBodyPart::ShouldHideHair' has a wrong offset!");
static_assert(offsetof(AVHelmetModularBodyPart, ShouldHideHead) == 0x000341, "Member 'AVHelmetModularBodyPart::ShouldHideHead' has a wrong offset!");
static_assert(offsetof(AVHelmetModularBodyPart, HeadMorphLimitsData) == 0x000348, "Member 'AVHelmetModularBodyPart::HeadMorphLimitsData' has a wrong offset!");
static_assert(offsetof(AVHelmetModularBodyPart, UpscaleMultiplier) == 0x000350, "Member 'AVHelmetModularBodyPart::UpscaleMultiplier' has a wrong offset!");
static_assert(offsetof(AVHelmetModularBodyPart, DownscaleMultiplier) == 0x000368, "Member 'AVHelmetModularBodyPart::DownscaleMultiplier' has a wrong offset!");

// Class Altar.VAIProcedureExecution_Base
// 0x0018 (0x0040 - 0x0028)
class UVAIProcedureExecution_Base : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class AVPairedPawnAIController*               AIController;                                      // 0x0030(0x0008)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VAIProcedureExecution_Base">();
	}
	static class UVAIProcedureExecution_Base* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVAIProcedureExecution_Base>();
	}
};
static_assert(alignof(UVAIProcedureExecution_Base) == 0x000008, "Wrong alignment on UVAIProcedureExecution_Base");
static_assert(sizeof(UVAIProcedureExecution_Base) == 0x000040, "Wrong size on UVAIProcedureExecution_Base");
static_assert(offsetof(UVAIProcedureExecution_Base, AIController) == 0x000030, "Member 'UVAIProcedureExecution_Base::AIController' has a wrong offset!");

// Class Altar.VAIProcedureExecution_FOLLOW
// 0x0030 (0x0070 - 0x0040)
class UVAIProcedureExecution_FOLLOW final : public UVAIProcedureExecution_Base
{
public:
	uint8                                         Pad_40[0x10];                                      // 0x0040(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UNavigationQueryFilter>     NavigationQueryFilterClass;                        // 0x0050(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_58[0x18];                                      // 0x0058(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	float GetFollowDistance() const;
	class AActor* GetTargetActor() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VAIProcedureExecution_FOLLOW">();
	}
	static class UVAIProcedureExecution_FOLLOW* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVAIProcedureExecution_FOLLOW>();
	}
};
static_assert(alignof(UVAIProcedureExecution_FOLLOW) == 0x000008, "Wrong alignment on UVAIProcedureExecution_FOLLOW");
static_assert(sizeof(UVAIProcedureExecution_FOLLOW) == 0x000070, "Wrong size on UVAIProcedureExecution_FOLLOW");
static_assert(offsetof(UVAIProcedureExecution_FOLLOW, NavigationQueryFilterClass) == 0x000050, "Member 'UVAIProcedureExecution_FOLLOW::NavigationQueryFilterClass' has a wrong offset!");

// Class Altar.NiCollisionObject
// 0x0008 (0x0040 - 0x0038)
class UNiCollisionObject : public UNiObject
{
public:
	class UNiAvObject*                            Target;                                            // 0x0038(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiCollisionObject">();
	}
	static class UNiCollisionObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiCollisionObject>();
	}
};
static_assert(alignof(UNiCollisionObject) == 0x000008, "Wrong alignment on UNiCollisionObject");
static_assert(sizeof(UNiCollisionObject) == 0x000040, "Wrong size on UNiCollisionObject");
static_assert(offsetof(UNiCollisionObject, Target) == 0x000038, "Member 'UNiCollisionObject::Target' has a wrong offset!");

// Class Altar.bhkNiCollisionObject
// 0x0010 (0x0050 - 0x0040)
class UbhkNiCollisionObject : public UNiCollisionObject
{
public:
	EbhkCOFlags                                   Flags_0;                                           // 0x0040(0x0002)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UbhkWorldObject*                        Body;                                              // 0x0048(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"bhkNiCollisionObject">();
	}
	static class UbhkNiCollisionObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UbhkNiCollisionObject>();
	}
};
static_assert(alignof(UbhkNiCollisionObject) == 0x000008, "Wrong alignment on UbhkNiCollisionObject");
static_assert(sizeof(UbhkNiCollisionObject) == 0x000050, "Wrong size on UbhkNiCollisionObject");
static_assert(offsetof(UbhkNiCollisionObject, Flags_0) == 0x000040, "Member 'UbhkNiCollisionObject::Flags_0' has a wrong offset!");
static_assert(offsetof(UbhkNiCollisionObject, Body) == 0x000048, "Member 'UbhkNiCollisionObject::Body' has a wrong offset!");

// Class Altar.bhkCollisionObject
// 0x0000 (0x0050 - 0x0050)
class UbhkCollisionObject : public UbhkNiCollisionObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"bhkCollisionObject">();
	}
	static class UbhkCollisionObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UbhkCollisionObject>();
	}
};
static_assert(alignof(UbhkCollisionObject) == 0x000008, "Wrong alignment on UbhkCollisionObject");
static_assert(sizeof(UbhkCollisionObject) == 0x000050, "Wrong size on UbhkCollisionObject");

// Class Altar.bhkBlendCollisionObject
// 0x0010 (0x0060 - 0x0050)
class UbhkBlendCollisionObject final : public UbhkCollisionObject
{
public:
	float                                         HeirGain;                                          // 0x0050(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VelGain;                                           // 0x0054(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_58[0x8];                                       // 0x0058(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"bhkBlendCollisionObject">();
	}
	static class UbhkBlendCollisionObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UbhkBlendCollisionObject>();
	}
};
static_assert(alignof(UbhkBlendCollisionObject) == 0x000008, "Wrong alignment on UbhkBlendCollisionObject");
static_assert(sizeof(UbhkBlendCollisionObject) == 0x000060, "Wrong size on UbhkBlendCollisionObject");
static_assert(offsetof(UbhkBlendCollisionObject, HeirGain) == 0x000050, "Member 'UbhkBlendCollisionObject::HeirGain' has a wrong offset!");
static_assert(offsetof(UbhkBlendCollisionObject, VelGain) == 0x000054, "Member 'UbhkBlendCollisionObject::VelGain' has a wrong offset!");

// Class Altar.TESObject
// 0x0000 (0x00D8 - 0x00D8)
class UTESObject : public UTESForm
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TESObject">();
	}
	static class UTESObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTESObject>();
	}
};
static_assert(alignof(UTESObject) == 0x000008, "Wrong alignment on UTESObject");
static_assert(sizeof(UTESObject) == 0x0000D8, "Wrong size on UTESObject");

// Class Altar.TESBoundObject
// 0x00B8 (0x0190 - 0x00D8)
class UTESBoundObject : public UTESObject
{
public:
	TSoftClassPtr<class UClass>                   ImpactSystemVFXBlueprintClass;                     // 0x00D8(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ImpactSystemDuration;                              // 0x0100(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Mass;                                              // 0x0104(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UPhysicsAsset>           PhysicsAsset;                                      // 0x0108(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsUsingCustomPhysicsControlSettings;              // 0x0130(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVPhysicsControlSettings               PhysicsControlSettingsOverride;                    // 0x0134(0x001C)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
