#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ASP_VanityCamera

#include "Basic.hpp"


namespace SDK::Params
{

// Function ASP_VanityCamera.ASP_VanityCamera_C.ExecuteUbergraph_ASP_VanityCamera
// 0x0058 (0x0058 - 0x0000)
struct ASP_VanityCamera_C_ExecuteUbergraph_ASP_VanityCamera final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVStateBase*                            K2Node_Event_CurrentState_1;                       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAST_Vanity_Camera_C*                   K2Node_DynamicCast_AsAST_Vanity_Camera;            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AVAltarPlayerCameraManager*             K2Node_DynamicCast_AsVAltar_Player_Camera_Manager; // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVStateBase*                            K2Node_Event_CurrentState;                         // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AVAltarPlayerCameraManager*             K2Node_DynamicCast_AsVAltar_Player_Camera_Manager_1; // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetDesiredOverridePitchAngle_desiredAngle_ImplicitCast; // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ASP_VanityCamera_C_ExecuteUbergraph_ASP_VanityCamera) == 0x000008, "Wrong alignment on ASP_VanityCamera_C_ExecuteUbergraph_ASP_VanityCamera");
static_assert(sizeof(ASP_VanityCamera_C_ExecuteUbergraph_ASP_VanityCamera) == 0x000058, "Wrong size on ASP_VanityCamera_C_ExecuteUbergraph_ASP_VanityCamera");
static_assert(offsetof(ASP_VanityCamera_C_ExecuteUbergraph_ASP_VanityCamera, EntryPoint) == 0x000000, "Member 'ASP_VanityCamera_C_ExecuteUbergraph_ASP_VanityCamera::EntryPoint' has a wrong offset!");
static_assert(offsetof(ASP_VanityCamera_C_ExecuteUbergraph_ASP_VanityCamera, K2Node_Event_CurrentState_1) == 0x000008, "Member 'ASP_VanityCamera_C_ExecuteUbergraph_ASP_VanityCamera::K2Node_Event_CurrentState_1' has a wrong offset!");
static_assert(offsetof(ASP_VanityCamera_C_ExecuteUbergraph_ASP_VanityCamera, K2Node_DynamicCast_AsAST_Vanity_Camera) == 0x000010, "Member 'ASP_VanityCamera_C_ExecuteUbergraph_ASP_VanityCamera::K2Node_DynamicCast_AsAST_Vanity_Camera' has a wrong offset!");
static_assert(offsetof(ASP_VanityCamera_C_ExecuteUbergraph_ASP_VanityCamera, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'ASP_VanityCamera_C_ExecuteUbergraph_ASP_VanityCamera::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ASP_VanityCamera_C_ExecuteUbergraph_ASP_VanityCamera, CallFunc_GetOwner_ReturnValue) == 0x000020, "Member 'ASP_VanityCamera_C_ExecuteUbergraph_ASP_VanityCamera::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ASP_VanityCamera_C_ExecuteUbergraph_ASP_VanityCamera, K2Node_DynamicCast_AsVAltar_Player_Camera_Manager) == 0x000028, "Member 'ASP_VanityCamera_C_ExecuteUbergraph_ASP_VanityCamera::K2Node_DynamicCast_AsVAltar_Player_Camera_Manager' has a wrong offset!");
static_assert(offsetof(ASP_VanityCamera_C_ExecuteUbergraph_ASP_VanityCamera, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'ASP_VanityCamera_C_ExecuteUbergraph_ASP_VanityCamera::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ASP_VanityCamera_C_ExecuteUbergraph_ASP_VanityCamera, K2Node_Event_CurrentState) == 0x000038, "Member 'ASP_VanityCamera_C_ExecuteUbergraph_ASP_VanityCamera::K2Node_Event_CurrentState' has a wrong offset!");
static_assert(offsetof(ASP_VanityCamera_C_ExecuteUbergraph_ASP_VanityCamera, CallFunc_GetOwner_ReturnValue_1) == 0x000040, "Member 'ASP_VanityCamera_C_ExecuteUbergraph_ASP_VanityCamera::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ASP_VanityCamera_C_ExecuteUbergraph_ASP_VanityCamera, K2Node_DynamicCast_AsVAltar_Player_Camera_Manager_1) == 0x000048, "Member 'ASP_VanityCamera_C_ExecuteUbergraph_ASP_VanityCamera::K2Node_DynamicCast_AsVAltar_Player_Camera_Manager_1' has a wrong offset!");
static_assert(offsetof(ASP_VanityCamera_C_ExecuteUbergraph_ASP_VanityCamera, K2Node_DynamicCast_bSuccess_2) == 0x000050, "Member 'ASP_VanityCamera_C_ExecuteUbergraph_ASP_VanityCamera::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(ASP_VanityCamera_C_ExecuteUbergraph_ASP_VanityCamera, CallFunc_SetDesiredOverridePitchAngle_desiredAngle_ImplicitCast) == 0x000054, "Member 'ASP_VanityCamera_C_ExecuteUbergraph_ASP_VanityCamera::CallFunc_SetDesiredOverridePitchAngle_desiredAngle_ImplicitCast' has a wrong offset!");

// Function ASP_VanityCamera.ASP_VanityCamera_C.Remove
// 0x0008 (0x0008 - 0x0000)
struct ASP_VanityCamera_C_Remove final
{
public:
	class UVStateBase*                            CurrentState;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ASP_VanityCamera_C_Remove) == 0x000008, "Wrong alignment on ASP_VanityCamera_C_Remove");
static_assert(sizeof(ASP_VanityCamera_C_Remove) == 0x000008, "Wrong size on ASP_VanityCamera_C_Remove");
static_assert(offsetof(ASP_VanityCamera_C_Remove, CurrentState) == 0x000000, "Member 'ASP_VanityCamera_C_Remove::CurrentState' has a wrong offset!");

// Function ASP_VanityCamera.ASP_VanityCamera_C.Apply
// 0x0008 (0x0008 - 0x0000)
struct ASP_VanityCamera_C_Apply final
{
public:
	class UVStateBase*                            CurrentState;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ASP_VanityCamera_C_Apply) == 0x000008, "Wrong alignment on ASP_VanityCamera_C_Apply");
static_assert(sizeof(ASP_VanityCamera_C_Apply) == 0x000008, "Wrong size on ASP_VanityCamera_C_Apply");
static_assert(offsetof(ASP_VanityCamera_C_Apply, CurrentState) == 0x000000, "Member 'ASP_VanityCamera_C_Apply::CurrentState' has a wrong offset!");

}

