#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ASP_CameraTransitionOverride

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "VActorStateMachine_classes.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass ASP_CameraTransitionOverride.ASP_CameraTransitionOverride_C
// 0x00A8 (0x00D8 - 0x0030)
class UASP_CameraTransitionOverride_C final : public UVStateParameters
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0030(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TMap<struct FGameplayTag, double>             OverridedDurations;                                // 0x0038(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<struct FGameplayTag, class UCurveFloat*> OverridedCurve;                                    // 0x0088(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void Remove(class UVStateBase* CurrentState);
	void ExecuteUbergraph_ASP_CameraTransitionOverride(int32 EntryPoint);
	void Apply(class UVStateBase* CurrentState);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ASP_CameraTransitionOverride_C">();
	}
	static class UASP_CameraTransitionOverride_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UASP_CameraTransitionOverride_C>();
	}
};
static_assert(alignof(UASP_CameraTransitionOverride_C) == 0x000008, "Wrong alignment on UASP_CameraTransitionOverride_C");
static_assert(sizeof(UASP_CameraTransitionOverride_C) == 0x0000D8, "Wrong size on UASP_CameraTransitionOverride_C");
static_assert(offsetof(UASP_CameraTransitionOverride_C, UberGraphFrame) == 0x000030, "Member 'UASP_CameraTransitionOverride_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UASP_CameraTransitionOverride_C, OverridedDurations) == 0x000038, "Member 'UASP_CameraTransitionOverride_C::OverridedDurations' has a wrong offset!");
static_assert(offsetof(UASP_CameraTransitionOverride_C, OverridedCurve) == 0x000088, "Member 'UASP_CameraTransitionOverride_C::OverridedCurve' has a wrong offset!");

}

