#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ASP_CameraTransitionOverride

#include "Basic.hpp"


namespace SDK::Params
{

// Function ASP_CameraTransitionOverride.ASP_CameraTransitionOverride_C.Remove
// 0x0008 (0x0008 - 0x0000)
struct ASP_CameraTransitionOverride_C_Remove final
{
public:
	class UVStateBase*                            CurrentState;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ASP_CameraTransitionOverride_C_Remove) == 0x000008, "Wrong alignment on ASP_CameraTransitionOverride_C_Remove");
static_assert(sizeof(ASP_CameraTransitionOverride_C_Remove) == 0x000008, "Wrong size on ASP_CameraTransitionOverride_C_Remove");
static_assert(offsetof(ASP_CameraTransitionOverride_C_Remove, CurrentState) == 0x000000, "Member 'ASP_CameraTransitionOverride_C_Remove::CurrentState' has a wrong offset!");

// Function ASP_CameraTransitionOverride.ASP_CameraTransitionOverride_C.ExecuteUbergraph_ASP_CameraTransitionOverride
// 0x0028 (0x0028 - 0x0000)
struct ASP_CameraTransitionOverride_C_ExecuteUbergraph_ASP_CameraTransitionOverride final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVStateBase*                            K2Node_Event_CurrentState_1;                       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVStateBase*                            K2Node_Event_CurrentState;                         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAST_CameraBase_C*                      K2Node_DynamicCast_AsAST_Camera_Base;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ASP_CameraTransitionOverride_C_ExecuteUbergraph_ASP_CameraTransitionOverride) == 0x000008, "Wrong alignment on ASP_CameraTransitionOverride_C_ExecuteUbergraph_ASP_CameraTransitionOverride");
static_assert(sizeof(ASP_CameraTransitionOverride_C_ExecuteUbergraph_ASP_CameraTransitionOverride) == 0x000028, "Wrong size on ASP_CameraTransitionOverride_C_ExecuteUbergraph_ASP_CameraTransitionOverride");
static_assert(offsetof(ASP_CameraTransitionOverride_C_ExecuteUbergraph_ASP_CameraTransitionOverride, EntryPoint) == 0x000000, "Member 'ASP_CameraTransitionOverride_C_ExecuteUbergraph_ASP_CameraTransitionOverride::EntryPoint' has a wrong offset!");
static_assert(offsetof(ASP_CameraTransitionOverride_C_ExecuteUbergraph_ASP_CameraTransitionOverride, K2Node_Event_CurrentState_1) == 0x000008, "Member 'ASP_CameraTransitionOverride_C_ExecuteUbergraph_ASP_CameraTransitionOverride::K2Node_Event_CurrentState_1' has a wrong offset!");
static_assert(offsetof(ASP_CameraTransitionOverride_C_ExecuteUbergraph_ASP_CameraTransitionOverride, K2Node_Event_CurrentState) == 0x000010, "Member 'ASP_CameraTransitionOverride_C_ExecuteUbergraph_ASP_CameraTransitionOverride::K2Node_Event_CurrentState' has a wrong offset!");
static_assert(offsetof(ASP_CameraTransitionOverride_C_ExecuteUbergraph_ASP_CameraTransitionOverride, K2Node_DynamicCast_AsAST_Camera_Base) == 0x000018, "Member 'ASP_CameraTransitionOverride_C_ExecuteUbergraph_ASP_CameraTransitionOverride::K2Node_DynamicCast_AsAST_Camera_Base' has a wrong offset!");
static_assert(offsetof(ASP_CameraTransitionOverride_C_ExecuteUbergraph_ASP_CameraTransitionOverride, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'ASP_CameraTransitionOverride_C_ExecuteUbergraph_ASP_CameraTransitionOverride::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function ASP_CameraTransitionOverride.ASP_CameraTransitionOverride_C.Apply
// 0x0008 (0x0008 - 0x0000)
struct ASP_CameraTransitionOverride_C_Apply final
{
public:
	class UVStateBase*                            CurrentState;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ASP_CameraTransitionOverride_C_Apply) == 0x000008, "Wrong alignment on ASP_CameraTransitionOverride_C_Apply");
static_assert(sizeof(ASP_CameraTransitionOverride_C_Apply) == 0x000008, "Wrong size on ASP_CameraTransitionOverride_C_Apply");
static_assert(offsetof(ASP_CameraTransitionOverride_C_Apply, CurrentState) == 0x000000, "Member 'ASP_CameraTransitionOverride_C_Apply::CurrentState' has a wrong offset!");

}

