#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ASP_VanityCamera

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "VActorStateMachine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ASP_VanityCamera.ASP_VanityCamera_C
// 0x0020 (0x0050 - 0x0030)
class UASP_VanityCamera_C final : public UVStateParameters
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0030(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        TargetPitch;                                       // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RotationSpeed;                                     // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TimeBeforeResumeRotation;                          // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ASP_VanityCamera(int32 EntryPoint);
	void Remove(class UVStateBase* CurrentState);
	void Apply(class UVStateBase* CurrentState);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ASP_VanityCamera_C">();
	}
	static class UASP_VanityCamera_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UASP_VanityCamera_C>();
	}
};
static_assert(alignof(UASP_VanityCamera_C) == 0x000008, "Wrong alignment on UASP_VanityCamera_C");
static_assert(sizeof(UASP_VanityCamera_C) == 0x000050, "Wrong size on UASP_VanityCamera_C");
static_assert(offsetof(UASP_VanityCamera_C, UberGraphFrame) == 0x000030, "Member 'UASP_VanityCamera_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UASP_VanityCamera_C, TargetPitch) == 0x000038, "Member 'UASP_VanityCamera_C::TargetPitch' has a wrong offset!");
static_assert(offsetof(UASP_VanityCamera_C, RotationSpeed) == 0x000040, "Member 'UASP_VanityCamera_C::RotationSpeed' has a wrong offset!");
static_assert(offsetof(UASP_VanityCamera_C, TimeBeforeResumeRotation) == 0x000048, "Member 'UASP_VanityCamera_C::TimeBeforeResumeRotation' has a wrong offset!");

}

