#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ASP_CharacterLocomotionMaxVelocityDelta

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "VActorStateMachine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ASP_CharacterLocomotionMaxVelocityDelta.ASP_CharacterLocomotionMaxVelocityDelta_C
// 0x0018 (0x0048 - 0x0030)
class UASP_CharacterLocomotionMaxVelocityDelta_C final : public UVStateParameters
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0030(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        MaxVelocityDelta;                                  // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LastMaxVelocityDelta;                              // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Apply(class UVStateBase* CurrentState);
	void ExecuteUbergraph_ASP_CharacterLocomotionMaxVelocityDelta(int32 EntryPoint);
	void Remove(class UVStateBase* CurrentState);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ASP_CharacterLocomotionMaxVelocityDelta_C">();
	}
	static class UASP_CharacterLocomotionMaxVelocityDelta_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UASP_CharacterLocomotionMaxVelocityDelta_C>();
	}
};
static_assert(alignof(UASP_CharacterLocomotionMaxVelocityDelta_C) == 0x000008, "Wrong alignment on UASP_CharacterLocomotionMaxVelocityDelta_C");
static_assert(sizeof(UASP_CharacterLocomotionMaxVelocityDelta_C) == 0x000048, "Wrong size on UASP_CharacterLocomotionMaxVelocityDelta_C");
static_assert(offsetof(UASP_CharacterLocomotionMaxVelocityDelta_C, UberGraphFrame) == 0x000030, "Member 'UASP_CharacterLocomotionMaxVelocityDelta_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UASP_CharacterLocomotionMaxVelocityDelta_C, MaxVelocityDelta) == 0x000038, "Member 'UASP_CharacterLocomotionMaxVelocityDelta_C::MaxVelocityDelta' has a wrong offset!");
static_assert(offsetof(UASP_CharacterLocomotionMaxVelocityDelta_C, LastMaxVelocityDelta) == 0x000040, "Member 'UASP_CharacterLocomotionMaxVelocityDelta_C::LastMaxVelocityDelta' has a wrong offset!");

}

