#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ASP_CharacterLocomotionStartStopDuration

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "VActorStateMachine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ASP_CharacterLocomotionStartStopDuration.ASP_CharacterLocomotionStartStopDuration_C
// 0x0038 (0x0068 - 0x0030)
class UASP_CharacterLocomotionStartStopDuration_C final : public UVStateParameters
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0030(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        StartWalkDuration;                                 // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        StopWalkDuration;                                  // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        StartRunDuration;                                  // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        StopRunDuration;                                   // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        StartSprintDuration;                               // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        StopSprintDuration;                                // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Apply(class UVStateBase* CurrentState);
	void ExecuteUbergraph_ASP_CharacterLocomotionStartStopDuration(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ASP_CharacterLocomotionStartStopDuration_C">();
	}
	static class UASP_CharacterLocomotionStartStopDuration_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UASP_CharacterLocomotionStartStopDuration_C>();
	}
};
static_assert(alignof(UASP_CharacterLocomotionStartStopDuration_C) == 0x000008, "Wrong alignment on UASP_CharacterLocomotionStartStopDuration_C");
static_assert(sizeof(UASP_CharacterLocomotionStartStopDuration_C) == 0x000068, "Wrong size on UASP_CharacterLocomotionStartStopDuration_C");
static_assert(offsetof(UASP_CharacterLocomotionStartStopDuration_C, UberGraphFrame) == 0x000030, "Member 'UASP_CharacterLocomotionStartStopDuration_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UASP_CharacterLocomotionStartStopDuration_C, StartWalkDuration) == 0x000038, "Member 'UASP_CharacterLocomotionStartStopDuration_C::StartWalkDuration' has a wrong offset!");
static_assert(offsetof(UASP_CharacterLocomotionStartStopDuration_C, StopWalkDuration) == 0x000040, "Member 'UASP_CharacterLocomotionStartStopDuration_C::StopWalkDuration' has a wrong offset!");
static_assert(offsetof(UASP_CharacterLocomotionStartStopDuration_C, StartRunDuration) == 0x000048, "Member 'UASP_CharacterLocomotionStartStopDuration_C::StartRunDuration' has a wrong offset!");
static_assert(offsetof(UASP_CharacterLocomotionStartStopDuration_C, StopRunDuration) == 0x000050, "Member 'UASP_CharacterLocomotionStartStopDuration_C::StopRunDuration' has a wrong offset!");
static_assert(offsetof(UASP_CharacterLocomotionStartStopDuration_C, StartSprintDuration) == 0x000058, "Member 'UASP_CharacterLocomotionStartStopDuration_C::StartSprintDuration' has a wrong offset!");
static_assert(offsetof(UASP_CharacterLocomotionStartStopDuration_C, StopSprintDuration) == 0x000060, "Member 'UASP_CharacterLocomotionStartStopDuration_C::StopSprintDuration' has a wrong offset!");

}

