#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ASP_CharacterAnimation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "VActorStateMachine_classes.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass ASP_CharacterAnimation.ASP_CharacterAnimation_C
// 0x0020 (0x0050 - 0x0030)
class UASP_CharacterAnimation_C final : public UVStateParameters
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0030(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTag                           AnimTag;                                           // 0x0038(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnAnimTagApplied;                                  // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void Apply(class UVStateBase* CurrentState);
	void ExecuteUbergraph_ASP_CharacterAnimation(int32 EntryPoint);
	void Remove(class UVStateBase* CurrentState);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ASP_CharacterAnimation_C">();
	}
	static class UASP_CharacterAnimation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UASP_CharacterAnimation_C>();
	}
};
static_assert(alignof(UASP_CharacterAnimation_C) == 0x000008, "Wrong alignment on UASP_CharacterAnimation_C");
static_assert(sizeof(UASP_CharacterAnimation_C) == 0x000050, "Wrong size on UASP_CharacterAnimation_C");
static_assert(offsetof(UASP_CharacterAnimation_C, UberGraphFrame) == 0x000030, "Member 'UASP_CharacterAnimation_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UASP_CharacterAnimation_C, AnimTag) == 0x000038, "Member 'UASP_CharacterAnimation_C::AnimTag' has a wrong offset!");
static_assert(offsetof(UASP_CharacterAnimation_C, OnAnimTagApplied) == 0x000040, "Member 'UASP_CharacterAnimation_C::OnAnimTagApplied' has a wrong offset!");

}

