#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AST_CharacterDocking

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function AST_CharacterDocking.AST_CharacterDocking_C.ExecuteUbergraph_AST_CharacterDocking
// 0x0080 (0x0080 - 0x0000)
struct AST_CharacterDocking_C_ExecuteUbergraph_AST_CharacterDocking final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AVPairedCharacter*                      K2Node_DynamicCast_AsVPaired_Character;            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetBlendTimeFromSequence_ReturnValue;     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_GetAnimTagsOverride_OutGameplayTag;       // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UVPawnAnimatedAction*                   CallFunc_PlayAnimatedAction_Action;                // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStateMachinePlayAnimatedAction*        CallFunc_PlayAnimatedAction_ReturnValue;           // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0054(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimatedAction_DesiredDuration_ImplicitCast; // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AST_CharacterDocking_C_ExecuteUbergraph_AST_CharacterDocking) == 0x000008, "Wrong alignment on AST_CharacterDocking_C_ExecuteUbergraph_AST_CharacterDocking");
static_assert(sizeof(AST_CharacterDocking_C_ExecuteUbergraph_AST_CharacterDocking) == 0x000080, "Wrong size on AST_CharacterDocking_C_ExecuteUbergraph_AST_CharacterDocking");
static_assert(offsetof(AST_CharacterDocking_C_ExecuteUbergraph_AST_CharacterDocking, EntryPoint) == 0x000000, "Member 'AST_CharacterDocking_C_ExecuteUbergraph_AST_CharacterDocking::EntryPoint' has a wrong offset!");
static_assert(offsetof(AST_CharacterDocking_C_ExecuteUbergraph_AST_CharacterDocking, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'AST_CharacterDocking_C_ExecuteUbergraph_AST_CharacterDocking::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AST_CharacterDocking_C_ExecuteUbergraph_AST_CharacterDocking, K2Node_DynamicCast_AsVPaired_Character) == 0x000018, "Member 'AST_CharacterDocking_C_ExecuteUbergraph_AST_CharacterDocking::K2Node_DynamicCast_AsVPaired_Character' has a wrong offset!");
static_assert(offsetof(AST_CharacterDocking_C_ExecuteUbergraph_AST_CharacterDocking, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'AST_CharacterDocking_C_ExecuteUbergraph_AST_CharacterDocking::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AST_CharacterDocking_C_ExecuteUbergraph_AST_CharacterDocking, CallFunc_GetBlendTimeFromSequence_ReturnValue) == 0x000024, "Member 'AST_CharacterDocking_C_ExecuteUbergraph_AST_CharacterDocking::CallFunc_GetBlendTimeFromSequence_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_CharacterDocking_C_ExecuteUbergraph_AST_CharacterDocking, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'AST_CharacterDocking_C_ExecuteUbergraph_AST_CharacterDocking::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_CharacterDocking_C_ExecuteUbergraph_AST_CharacterDocking, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000030, "Member 'AST_CharacterDocking_C_ExecuteUbergraph_AST_CharacterDocking::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_CharacterDocking_C_ExecuteUbergraph_AST_CharacterDocking, CallFunc_GetAnimTagsOverride_OutGameplayTag) == 0x000038, "Member 'AST_CharacterDocking_C_ExecuteUbergraph_AST_CharacterDocking::CallFunc_GetAnimTagsOverride_OutGameplayTag' has a wrong offset!");
static_assert(offsetof(AST_CharacterDocking_C_ExecuteUbergraph_AST_CharacterDocking, CallFunc_PlayAnimatedAction_Action) == 0x000040, "Member 'AST_CharacterDocking_C_ExecuteUbergraph_AST_CharacterDocking::CallFunc_PlayAnimatedAction_Action' has a wrong offset!");
static_assert(offsetof(AST_CharacterDocking_C_ExecuteUbergraph_AST_CharacterDocking, CallFunc_PlayAnimatedAction_ReturnValue) == 0x000048, "Member 'AST_CharacterDocking_C_ExecuteUbergraph_AST_CharacterDocking::CallFunc_PlayAnimatedAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_CharacterDocking_C_ExecuteUbergraph_AST_CharacterDocking, CallFunc_IsValid_ReturnValue_1) == 0x000050, "Member 'AST_CharacterDocking_C_ExecuteUbergraph_AST_CharacterDocking::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AST_CharacterDocking_C_ExecuteUbergraph_AST_CharacterDocking, K2Node_CreateDelegate_OutputDelegate_1) == 0x000054, "Member 'AST_CharacterDocking_C_ExecuteUbergraph_AST_CharacterDocking::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AST_CharacterDocking_C_ExecuteUbergraph_AST_CharacterDocking, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x000068, "Member 'AST_CharacterDocking_C_ExecuteUbergraph_AST_CharacterDocking::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(AST_CharacterDocking_C_ExecuteUbergraph_AST_CharacterDocking, CallFunc_Subtract_DoubleDouble_B_ImplicitCast) == 0x000070, "Member 'AST_CharacterDocking_C_ExecuteUbergraph_AST_CharacterDocking::CallFunc_Subtract_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(AST_CharacterDocking_C_ExecuteUbergraph_AST_CharacterDocking, CallFunc_PlayAnimatedAction_DesiredDuration_ImplicitCast) == 0x000078, "Member 'AST_CharacterDocking_C_ExecuteUbergraph_AST_CharacterDocking::CallFunc_PlayAnimatedAction_DesiredDuration_ImplicitCast' has a wrong offset!");

// Function AST_CharacterDocking.AST_CharacterDocking_C.GetAnimTagsOverride
// 0x0038 (0x0038 - 0x0000)
struct AST_CharacterDocking_C_GetAnimTagsOverride final
{
public:
	struct FGameplayTag                           OutGameplayTag;                                    // 0x0000(0x0008)(Parm, OutParm, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x000C(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_1;                            // 0x0014(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AVPairedCreature*                       CallFunc_GetHorse_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_Select_Default;                             // 0x002C(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AST_CharacterDocking_C_GetAnimTagsOverride) == 0x000008, "Wrong alignment on AST_CharacterDocking_C_GetAnimTagsOverride");
static_assert(sizeof(AST_CharacterDocking_C_GetAnimTagsOverride) == 0x000038, "Wrong size on AST_CharacterDocking_C_GetAnimTagsOverride");
static_assert(offsetof(AST_CharacterDocking_C_GetAnimTagsOverride, OutGameplayTag) == 0x000000, "Member 'AST_CharacterDocking_C_GetAnimTagsOverride::OutGameplayTag' has a wrong offset!");
static_assert(offsetof(AST_CharacterDocking_C_GetAnimTagsOverride, Temp_bool_Variable) == 0x000008, "Member 'AST_CharacterDocking_C_GetAnimTagsOverride::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AST_CharacterDocking_C_GetAnimTagsOverride, Temp_struct_Variable) == 0x00000C, "Member 'AST_CharacterDocking_C_GetAnimTagsOverride::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(AST_CharacterDocking_C_GetAnimTagsOverride, Temp_struct_Variable_1) == 0x000014, "Member 'AST_CharacterDocking_C_GetAnimTagsOverride::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(AST_CharacterDocking_C_GetAnimTagsOverride, CallFunc_GetHorse_ReturnValue) == 0x000020, "Member 'AST_CharacterDocking_C_GetAnimTagsOverride::CallFunc_GetHorse_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_CharacterDocking_C_GetAnimTagsOverride, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'AST_CharacterDocking_C_GetAnimTagsOverride::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_CharacterDocking_C_GetAnimTagsOverride, K2Node_Select_Default) == 0x00002C, "Member 'AST_CharacterDocking_C_GetAnimTagsOverride::K2Node_Select_Default' has a wrong offset!");

}

