#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AST_Dialogue

#include "Basic.hpp"


namespace SDK::Params
{

// Function AST_Dialogue.AST_Dialogue_C.OnStateUpdate
// 0x0004 (0x0004 - 0x0000)
struct AST_Dialogue_C_OnStateUpdate final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AST_Dialogue_C_OnStateUpdate) == 0x000004, "Wrong alignment on AST_Dialogue_C_OnStateUpdate");
static_assert(sizeof(AST_Dialogue_C_OnStateUpdate) == 0x000004, "Wrong size on AST_Dialogue_C_OnStateUpdate");
static_assert(offsetof(AST_Dialogue_C_OnStateUpdate, DeltaTime) == 0x000000, "Member 'AST_Dialogue_C_OnStateUpdate::DeltaTime' has a wrong offset!");

// Function AST_Dialogue.AST_Dialogue_C.ExecuteUbergraph_AST_Dialogue
// 0x0088 (0x0088 - 0x0000)
struct AST_Dialogue_C_ExecuteUbergraph_AST_Dialogue final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVStateMachineComponent*                CallFunc_GetOwningStateMachineComponent_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UVStateMachineComponent*                CallFunc_GetOwningStateMachineComponent_ReturnValue_1; // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayerController_ReturnValue;    // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AVAltarPlayerController*                K2Node_DynamicCast_AsVAltar_Player_Controller;     // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AVAltarPlayerCameraManager*             K2Node_DynamicCast_AsVAltar_Player_Camera_Manager; // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AVOblivionPlayerCharacter*              CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTime;                            // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayerController_ReturnValue_1;  // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AVAltarPlayerController*                K2Node_DynamicCast_AsVAltar_Player_Controller_1;   // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast;          // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AST_Dialogue_C_ExecuteUbergraph_AST_Dialogue) == 0x000008, "Wrong alignment on AST_Dialogue_C_ExecuteUbergraph_AST_Dialogue");
static_assert(sizeof(AST_Dialogue_C_ExecuteUbergraph_AST_Dialogue) == 0x000088, "Wrong size on AST_Dialogue_C_ExecuteUbergraph_AST_Dialogue");
static_assert(offsetof(AST_Dialogue_C_ExecuteUbergraph_AST_Dialogue, EntryPoint) == 0x000000, "Member 'AST_Dialogue_C_ExecuteUbergraph_AST_Dialogue::EntryPoint' has a wrong offset!");
static_assert(offsetof(AST_Dialogue_C_ExecuteUbergraph_AST_Dialogue, CallFunc_GetOwningStateMachineComponent_ReturnValue) == 0x000008, "Member 'AST_Dialogue_C_ExecuteUbergraph_AST_Dialogue::CallFunc_GetOwningStateMachineComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_Dialogue_C_ExecuteUbergraph_AST_Dialogue, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000010, "Member 'AST_Dialogue_C_ExecuteUbergraph_AST_Dialogue::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_Dialogue_C_ExecuteUbergraph_AST_Dialogue, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'AST_Dialogue_C_ExecuteUbergraph_AST_Dialogue::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_Dialogue_C_ExecuteUbergraph_AST_Dialogue, CallFunc_GetOwningStateMachineComponent_ReturnValue_1) == 0x000018, "Member 'AST_Dialogue_C_ExecuteUbergraph_AST_Dialogue::CallFunc_GetOwningStateMachineComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AST_Dialogue_C_ExecuteUbergraph_AST_Dialogue, CallFunc_GetOwningPlayerController_ReturnValue) == 0x000020, "Member 'AST_Dialogue_C_ExecuteUbergraph_AST_Dialogue::CallFunc_GetOwningPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_Dialogue_C_ExecuteUbergraph_AST_Dialogue, CallFunc_GetOwner_ReturnValue) == 0x000028, "Member 'AST_Dialogue_C_ExecuteUbergraph_AST_Dialogue::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_Dialogue_C_ExecuteUbergraph_AST_Dialogue, K2Node_DynamicCast_AsVAltar_Player_Controller) == 0x000030, "Member 'AST_Dialogue_C_ExecuteUbergraph_AST_Dialogue::K2Node_DynamicCast_AsVAltar_Player_Controller' has a wrong offset!");
static_assert(offsetof(AST_Dialogue_C_ExecuteUbergraph_AST_Dialogue, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'AST_Dialogue_C_ExecuteUbergraph_AST_Dialogue::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AST_Dialogue_C_ExecuteUbergraph_AST_Dialogue, K2Node_DynamicCast_AsVAltar_Player_Camera_Manager) == 0x000040, "Member 'AST_Dialogue_C_ExecuteUbergraph_AST_Dialogue::K2Node_DynamicCast_AsVAltar_Player_Camera_Manager' has a wrong offset!");
static_assert(offsetof(AST_Dialogue_C_ExecuteUbergraph_AST_Dialogue, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'AST_Dialogue_C_ExecuteUbergraph_AST_Dialogue::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AST_Dialogue_C_ExecuteUbergraph_AST_Dialogue, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000050, "Member 'AST_Dialogue_C_ExecuteUbergraph_AST_Dialogue::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_Dialogue_C_ExecuteUbergraph_AST_Dialogue, K2Node_Event_DeltaTime) == 0x000058, "Member 'AST_Dialogue_C_ExecuteUbergraph_AST_Dialogue::K2Node_Event_DeltaTime' has a wrong offset!");
static_assert(offsetof(AST_Dialogue_C_ExecuteUbergraph_AST_Dialogue, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000060, "Member 'AST_Dialogue_C_ExecuteUbergraph_AST_Dialogue::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_Dialogue_C_ExecuteUbergraph_AST_Dialogue, CallFunc_GetOwningPlayerController_ReturnValue_1) == 0x000068, "Member 'AST_Dialogue_C_ExecuteUbergraph_AST_Dialogue::CallFunc_GetOwningPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AST_Dialogue_C_ExecuteUbergraph_AST_Dialogue, K2Node_DynamicCast_AsVAltar_Player_Controller_1) == 0x000070, "Member 'AST_Dialogue_C_ExecuteUbergraph_AST_Dialogue::K2Node_DynamicCast_AsVAltar_Player_Controller_1' has a wrong offset!");
static_assert(offsetof(AST_Dialogue_C_ExecuteUbergraph_AST_Dialogue, K2Node_DynamicCast_bSuccess_2) == 0x000078, "Member 'AST_Dialogue_C_ExecuteUbergraph_AST_Dialogue::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(AST_Dialogue_C_ExecuteUbergraph_AST_Dialogue, CallFunc_Add_DoubleDouble_B_ImplicitCast) == 0x000080, "Member 'AST_Dialogue_C_ExecuteUbergraph_AST_Dialogue::CallFunc_Add_DoubleDouble_B_ImplicitCast' has a wrong offset!");

}

