#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AST_CharacterParalyze

#include "Basic.hpp"


namespace SDK::Params
{

// Function AST_CharacterParalyze.AST_CharacterParalyze_C.ExecuteUbergraph_AST_CharacterParalyze
// 0x0040 (0x0040 - 0x0000)
struct AST_CharacterParalyze_C_ExecuteUbergraph_AST_CharacterParalyze final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPawnSpatialIndexSubsystem*             CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTime;                            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasGameplayTag_ReturnValue;               // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	const class UVOblivionInitialSettings*        CallFunc_GetOblivionInitialSettings_ReturnValue;   // 0x0018(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AVPairedPawn*                           K2Node_DynamicCast_AsVPaired_Pawn;                 // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_ChangeDampingValues_DampingValuesMultiplier_ImplicitCast; // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SlowPhysicDampingOverTime_DeltaTime_ImplicitCast; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AST_CharacterParalyze_C_ExecuteUbergraph_AST_CharacterParalyze) == 0x000008, "Wrong alignment on AST_CharacterParalyze_C_ExecuteUbergraph_AST_CharacterParalyze");
static_assert(sizeof(AST_CharacterParalyze_C_ExecuteUbergraph_AST_CharacterParalyze) == 0x000040, "Wrong size on AST_CharacterParalyze_C_ExecuteUbergraph_AST_CharacterParalyze");
static_assert(offsetof(AST_CharacterParalyze_C_ExecuteUbergraph_AST_CharacterParalyze, EntryPoint) == 0x000000, "Member 'AST_CharacterParalyze_C_ExecuteUbergraph_AST_CharacterParalyze::EntryPoint' has a wrong offset!");
static_assert(offsetof(AST_CharacterParalyze_C_ExecuteUbergraph_AST_CharacterParalyze, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000008, "Member 'AST_CharacterParalyze_C_ExecuteUbergraph_AST_CharacterParalyze::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_CharacterParalyze_C_ExecuteUbergraph_AST_CharacterParalyze, K2Node_Event_DeltaTime) == 0x000010, "Member 'AST_CharacterParalyze_C_ExecuteUbergraph_AST_CharacterParalyze::K2Node_Event_DeltaTime' has a wrong offset!");
static_assert(offsetof(AST_CharacterParalyze_C_ExecuteUbergraph_AST_CharacterParalyze, CallFunc_HasGameplayTag_ReturnValue) == 0x000014, "Member 'AST_CharacterParalyze_C_ExecuteUbergraph_AST_CharacterParalyze::CallFunc_HasGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_CharacterParalyze_C_ExecuteUbergraph_AST_CharacterParalyze, CallFunc_GetOblivionInitialSettings_ReturnValue) == 0x000018, "Member 'AST_CharacterParalyze_C_ExecuteUbergraph_AST_CharacterParalyze::CallFunc_GetOblivionInitialSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_CharacterParalyze_C_ExecuteUbergraph_AST_CharacterParalyze, CallFunc_GetOwner_ReturnValue) == 0x000020, "Member 'AST_CharacterParalyze_C_ExecuteUbergraph_AST_CharacterParalyze::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_CharacterParalyze_C_ExecuteUbergraph_AST_CharacterParalyze, K2Node_DynamicCast_AsVPaired_Pawn) == 0x000028, "Member 'AST_CharacterParalyze_C_ExecuteUbergraph_AST_CharacterParalyze::K2Node_DynamicCast_AsVPaired_Pawn' has a wrong offset!");
static_assert(offsetof(AST_CharacterParalyze_C_ExecuteUbergraph_AST_CharacterParalyze, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'AST_CharacterParalyze_C_ExecuteUbergraph_AST_CharacterParalyze::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AST_CharacterParalyze_C_ExecuteUbergraph_AST_CharacterParalyze, CallFunc_ChangeDampingValues_DampingValuesMultiplier_ImplicitCast) == 0x000034, "Member 'AST_CharacterParalyze_C_ExecuteUbergraph_AST_CharacterParalyze::CallFunc_ChangeDampingValues_DampingValuesMultiplier_ImplicitCast' has a wrong offset!");
static_assert(offsetof(AST_CharacterParalyze_C_ExecuteUbergraph_AST_CharacterParalyze, CallFunc_SlowPhysicDampingOverTime_DeltaTime_ImplicitCast) == 0x000038, "Member 'AST_CharacterParalyze_C_ExecuteUbergraph_AST_CharacterParalyze::CallFunc_SlowPhysicDampingOverTime_DeltaTime_ImplicitCast' has a wrong offset!");

// Function AST_CharacterParalyze.AST_CharacterParalyze_C.OnStateUpdate
// 0x0004 (0x0004 - 0x0000)
struct AST_CharacterParalyze_C_OnStateUpdate final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AST_CharacterParalyze_C_OnStateUpdate) == 0x000004, "Wrong alignment on AST_CharacterParalyze_C_OnStateUpdate");
static_assert(sizeof(AST_CharacterParalyze_C_OnStateUpdate) == 0x000004, "Wrong size on AST_CharacterParalyze_C_OnStateUpdate");
static_assert(offsetof(AST_CharacterParalyze_C_OnStateUpdate, DeltaTime) == 0x000000, "Member 'AST_CharacterParalyze_C_OnStateUpdate::DeltaTime' has a wrong offset!");

// Function AST_CharacterParalyze.AST_CharacterParalyze_C.SlowPhysicDampingOverTime
// 0x0080 (0x0080 - 0x0000)
struct AST_CharacterParalyze_C_SlowPhysicDampingOverTime final
{
public:
	double                                        DeltaTime;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_2;      // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast_1;   // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast;    // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast; // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ChangeDampingValues_DampingValuesMultiplier_ImplicitCast; // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AST_CharacterParalyze_C_SlowPhysicDampingOverTime) == 0x000008, "Wrong alignment on AST_CharacterParalyze_C_SlowPhysicDampingOverTime");
static_assert(sizeof(AST_CharacterParalyze_C_SlowPhysicDampingOverTime) == 0x000080, "Wrong size on AST_CharacterParalyze_C_SlowPhysicDampingOverTime");
static_assert(offsetof(AST_CharacterParalyze_C_SlowPhysicDampingOverTime, DeltaTime) == 0x000000, "Member 'AST_CharacterParalyze_C_SlowPhysicDampingOverTime::DeltaTime' has a wrong offset!");
static_assert(offsetof(AST_CharacterParalyze_C_SlowPhysicDampingOverTime, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000008, "Member 'AST_CharacterParalyze_C_SlowPhysicDampingOverTime::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_CharacterParalyze_C_SlowPhysicDampingOverTime, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000010, "Member 'AST_CharacterParalyze_C_SlowPhysicDampingOverTime::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_CharacterParalyze_C_SlowPhysicDampingOverTime, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000018, "Member 'AST_CharacterParalyze_C_SlowPhysicDampingOverTime::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AST_CharacterParalyze_C_SlowPhysicDampingOverTime, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000020, "Member 'AST_CharacterParalyze_C_SlowPhysicDampingOverTime::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_CharacterParalyze_C_SlowPhysicDampingOverTime, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000028, "Member 'AST_CharacterParalyze_C_SlowPhysicDampingOverTime::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_CharacterParalyze_C_SlowPhysicDampingOverTime, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000030, "Member 'AST_CharacterParalyze_C_SlowPhysicDampingOverTime::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AST_CharacterParalyze_C_SlowPhysicDampingOverTime, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000038, "Member 'AST_CharacterParalyze_C_SlowPhysicDampingOverTime::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_CharacterParalyze_C_SlowPhysicDampingOverTime, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000040, "Member 'AST_CharacterParalyze_C_SlowPhysicDampingOverTime::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_CharacterParalyze_C_SlowPhysicDampingOverTime, CallFunc_Subtract_DoubleDouble_ReturnValue_2) == 0x000048, "Member 'AST_CharacterParalyze_C_SlowPhysicDampingOverTime::CallFunc_Subtract_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AST_CharacterParalyze_C_SlowPhysicDampingOverTime, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000050, "Member 'AST_CharacterParalyze_C_SlowPhysicDampingOverTime::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AST_CharacterParalyze_C_SlowPhysicDampingOverTime, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x000058, "Member 'AST_CharacterParalyze_C_SlowPhysicDampingOverTime::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(AST_CharacterParalyze_C_SlowPhysicDampingOverTime, CallFunc_Subtract_DoubleDouble_A_ImplicitCast_1) == 0x000060, "Member 'AST_CharacterParalyze_C_SlowPhysicDampingOverTime::CallFunc_Subtract_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(AST_CharacterParalyze_C_SlowPhysicDampingOverTime, CallFunc_LessEqual_DoubleDouble_A_ImplicitCast) == 0x000068, "Member 'AST_CharacterParalyze_C_SlowPhysicDampingOverTime::CallFunc_LessEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(AST_CharacterParalyze_C_SlowPhysicDampingOverTime, CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast) == 0x000070, "Member 'AST_CharacterParalyze_C_SlowPhysicDampingOverTime::CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(AST_CharacterParalyze_C_SlowPhysicDampingOverTime, CallFunc_ChangeDampingValues_DampingValuesMultiplier_ImplicitCast) == 0x000078, "Member 'AST_CharacterParalyze_C_SlowPhysicDampingOverTime::CallFunc_ChangeDampingValues_DampingValuesMultiplier_ImplicitCast' has a wrong offset!");

}

