#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AST_CharacterLocomotionInAir

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "VActorStateMachine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AST_CharacterLocomotionInAir.AST_CharacterLocomotionInAir_C
// 0x0018 (0x00A0 - 0x0088)
class UAST_CharacterLocomotionInAir_C final : public UVState
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0088(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AVPairedPawn*                           PairedPawn;                                        // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsMoving;                                          // 0x0098(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AST_CharacterLocomotionInAir(int32 EntryPoint);
	void OnEntered();
	void OnExited();
	void OnStateUpdate(float DeltaTime);
	void PostInit();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AST_CharacterLocomotionInAir_C">();
	}
	static class UAST_CharacterLocomotionInAir_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAST_CharacterLocomotionInAir_C>();
	}
};
static_assert(alignof(UAST_CharacterLocomotionInAir_C) == 0x000008, "Wrong alignment on UAST_CharacterLocomotionInAir_C");
static_assert(sizeof(UAST_CharacterLocomotionInAir_C) == 0x0000A0, "Wrong size on UAST_CharacterLocomotionInAir_C");
static_assert(offsetof(UAST_CharacterLocomotionInAir_C, UberGraphFrame) == 0x000088, "Member 'UAST_CharacterLocomotionInAir_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAST_CharacterLocomotionInAir_C, PairedPawn) == 0x000090, "Member 'UAST_CharacterLocomotionInAir_C::PairedPawn' has a wrong offset!");
static_assert(offsetof(UAST_CharacterLocomotionInAir_C, IsMoving) == 0x000098, "Member 'UAST_CharacterLocomotionInAir_C::IsMoving' has a wrong offset!");

}

