#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AST_CharacterStunned

#include "Basic.hpp"


namespace SDK::Params
{

// Function AST_CharacterStunned.AST_CharacterStunned_C.ExecuteUbergraph_AST_CharacterStunned
// 0x0018 (0x0018 - 0x0000)
struct AST_CharacterStunned_C_ExecuteUbergraph_AST_CharacterStunned final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaxAcceleration_ReturnValue;           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_MaxAcceleration_ImplicitCast;   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_VariableSet_LastMaxVelocityDelta_ImplicitCast; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AST_CharacterStunned_C_ExecuteUbergraph_AST_CharacterStunned) == 0x000008, "Wrong alignment on AST_CharacterStunned_C_ExecuteUbergraph_AST_CharacterStunned");
static_assert(sizeof(AST_CharacterStunned_C_ExecuteUbergraph_AST_CharacterStunned) == 0x000018, "Wrong size on AST_CharacterStunned_C_ExecuteUbergraph_AST_CharacterStunned");
static_assert(offsetof(AST_CharacterStunned_C_ExecuteUbergraph_AST_CharacterStunned, EntryPoint) == 0x000000, "Member 'AST_CharacterStunned_C_ExecuteUbergraph_AST_CharacterStunned::EntryPoint' has a wrong offset!");
static_assert(offsetof(AST_CharacterStunned_C_ExecuteUbergraph_AST_CharacterStunned, CallFunc_GetMaxAcceleration_ReturnValue) == 0x000004, "Member 'AST_CharacterStunned_C_ExecuteUbergraph_AST_CharacterStunned::CallFunc_GetMaxAcceleration_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_CharacterStunned_C_ExecuteUbergraph_AST_CharacterStunned, K2Node_VariableSet_MaxAcceleration_ImplicitCast) == 0x000008, "Member 'AST_CharacterStunned_C_ExecuteUbergraph_AST_CharacterStunned::K2Node_VariableSet_MaxAcceleration_ImplicitCast' has a wrong offset!");
static_assert(offsetof(AST_CharacterStunned_C_ExecuteUbergraph_AST_CharacterStunned, K2Node_VariableSet_LastMaxVelocityDelta_ImplicitCast) == 0x000010, "Member 'AST_CharacterStunned_C_ExecuteUbergraph_AST_CharacterStunned::K2Node_VariableSet_LastMaxVelocityDelta_ImplicitCast' has a wrong offset!");

}

