#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AST_CharacterSingleActionState

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Altar_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AST_CharacterSingleActionState.AST_CharacterSingleActionState_C
// 0x0018 (0x00C0 - 0x00A8)
class UAST_CharacterSingleActionState_C : public UVAltarActionState
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UASP_CharacterAnimation_C*              CharacterAnimationStateParamater;                  // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldOverrideAnimTags;                            // 0x00B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AST_CharacterSingleActionState(int32 EntryPoint);
	void GetAnimTagsOverride(struct FGameplayTag* OutGameplayTag);
	void GetStateDuration(double* StateDuration);
	void OnActionCancelled();
	void OnActionCompleted();
	void OnCanceled_00AF04FA4968337331D09E84E78D166D();
	void OnCompleted_00AF04FA4968337331D09E84E78D166D();
	void OnEntered();
	void Override_AnimTags();
	void PostInit();
	void SetDurationOfIsLongerThenCondition(class UVState* State, bool OnAllNextStates, int32 StateIndex, int32 CondIndex, double Duratiion);
	void SetDurationOfIsLongerThenConditionForState(const struct FVNextState& NextState, int32 CondIndex, double Duration);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AST_CharacterSingleActionState_C">();
	}
	static class UAST_CharacterSingleActionState_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAST_CharacterSingleActionState_C>();
	}
};
static_assert(alignof(UAST_CharacterSingleActionState_C) == 0x000008, "Wrong alignment on UAST_CharacterSingleActionState_C");
static_assert(sizeof(UAST_CharacterSingleActionState_C) == 0x0000C0, "Wrong size on UAST_CharacterSingleActionState_C");
static_assert(offsetof(UAST_CharacterSingleActionState_C, UberGraphFrame) == 0x0000A8, "Member 'UAST_CharacterSingleActionState_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAST_CharacterSingleActionState_C, CharacterAnimationStateParamater) == 0x0000B0, "Member 'UAST_CharacterSingleActionState_C::CharacterAnimationStateParamater' has a wrong offset!");
static_assert(offsetof(UAST_CharacterSingleActionState_C, ShouldOverrideAnimTags) == 0x0000B8, "Member 'UAST_CharacterSingleActionState_C::ShouldOverrideAnimTags' has a wrong offset!");

}

