#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AST_Persuasion

#include "Basic.hpp"


namespace SDK::Params
{

// Function AST_Persuasion.AST_Persuasion_C.OnStateUpdate
// 0x0004 (0x0004 - 0x0000)
struct AST_Persuasion_C_OnStateUpdate final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AST_Persuasion_C_OnStateUpdate) == 0x000004, "Wrong alignment on AST_Persuasion_C_OnStateUpdate");
static_assert(sizeof(AST_Persuasion_C_OnStateUpdate) == 0x000004, "Wrong size on AST_Persuasion_C_OnStateUpdate");
static_assert(offsetof(AST_Persuasion_C_OnStateUpdate, DeltaTime) == 0x000000, "Member 'AST_Persuasion_C_OnStateUpdate::DeltaTime' has a wrong offset!");

// Function AST_Persuasion.AST_Persuasion_C.ExecuteUbergraph_AST_Persuasion
// 0x0050 (0x0050 - 0x0000)
struct AST_Persuasion_C_ExecuteUbergraph_AST_Persuasion final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTime;                            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVStateMachineComponent*                CallFunc_GetOwningStateMachineComponent_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVStateMachineComponent*                CallFunc_GetOwningStateMachineComponent_ReturnValue_1; // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AVAltarPlayerCameraManager*             K2Node_DynamicCast_AsVAltar_Player_Camera_Manager; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AST_Persuasion_C_ExecuteUbergraph_AST_Persuasion) == 0x000008, "Wrong alignment on AST_Persuasion_C_ExecuteUbergraph_AST_Persuasion");
static_assert(sizeof(AST_Persuasion_C_ExecuteUbergraph_AST_Persuasion) == 0x000050, "Wrong size on AST_Persuasion_C_ExecuteUbergraph_AST_Persuasion");
static_assert(offsetof(AST_Persuasion_C_ExecuteUbergraph_AST_Persuasion, EntryPoint) == 0x000000, "Member 'AST_Persuasion_C_ExecuteUbergraph_AST_Persuasion::EntryPoint' has a wrong offset!");
static_assert(offsetof(AST_Persuasion_C_ExecuteUbergraph_AST_Persuasion, K2Node_Event_DeltaTime) == 0x000004, "Member 'AST_Persuasion_C_ExecuteUbergraph_AST_Persuasion::K2Node_Event_DeltaTime' has a wrong offset!");
static_assert(offsetof(AST_Persuasion_C_ExecuteUbergraph_AST_Persuasion, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000008, "Member 'AST_Persuasion_C_ExecuteUbergraph_AST_Persuasion::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_Persuasion_C_ExecuteUbergraph_AST_Persuasion, CallFunc_GetOwningStateMachineComponent_ReturnValue) == 0x000010, "Member 'AST_Persuasion_C_ExecuteUbergraph_AST_Persuasion::CallFunc_GetOwningStateMachineComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_Persuasion_C_ExecuteUbergraph_AST_Persuasion, CallFunc_GetOwningStateMachineComponent_ReturnValue_1) == 0x000018, "Member 'AST_Persuasion_C_ExecuteUbergraph_AST_Persuasion::CallFunc_GetOwningStateMachineComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AST_Persuasion_C_ExecuteUbergraph_AST_Persuasion, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'AST_Persuasion_C_ExecuteUbergraph_AST_Persuasion::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_Persuasion_C_ExecuteUbergraph_AST_Persuasion, CallFunc_GetOwner_ReturnValue) == 0x000028, "Member 'AST_Persuasion_C_ExecuteUbergraph_AST_Persuasion::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_Persuasion_C_ExecuteUbergraph_AST_Persuasion, K2Node_DynamicCast_AsVAltar_Player_Camera_Manager) == 0x000030, "Member 'AST_Persuasion_C_ExecuteUbergraph_AST_Persuasion::K2Node_DynamicCast_AsVAltar_Player_Camera_Manager' has a wrong offset!");
static_assert(offsetof(AST_Persuasion_C_ExecuteUbergraph_AST_Persuasion, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'AST_Persuasion_C_ExecuteUbergraph_AST_Persuasion::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AST_Persuasion_C_ExecuteUbergraph_AST_Persuasion, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000040, "Member 'AST_Persuasion_C_ExecuteUbergraph_AST_Persuasion::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_Persuasion_C_ExecuteUbergraph_AST_Persuasion, CallFunc_Add_DoubleDouble_B_ImplicitCast) == 0x000048, "Member 'AST_Persuasion_C_ExecuteUbergraph_AST_Persuasion::CallFunc_Add_DoubleDouble_B_ImplicitCast' has a wrong offset!");

}

