#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AST_CharacterDead

#include "Basic.hpp"


namespace SDK::Params
{

// Function AST_CharacterDead.AST_CharacterDead_C.ExecuteUbergraph_AST_CharacterDead
// 0x0038 (0x0038 - 0x0000)
struct AST_CharacterDead_C_ExecuteUbergraph_AST_CharacterDead final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVActorBehaviorBase*                    CallFunc_StartBehaviorFromTag_StartedBehavior;     // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UActionStateStartBehavior*              CallFunc_StartBehaviorFromTag_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPawnSpatialIndexSubsystem*             CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AST_CharacterDead_C_ExecuteUbergraph_AST_CharacterDead) == 0x000008, "Wrong alignment on AST_CharacterDead_C_ExecuteUbergraph_AST_CharacterDead");
static_assert(sizeof(AST_CharacterDead_C_ExecuteUbergraph_AST_CharacterDead) == 0x000038, "Wrong size on AST_CharacterDead_C_ExecuteUbergraph_AST_CharacterDead");
static_assert(offsetof(AST_CharacterDead_C_ExecuteUbergraph_AST_CharacterDead, EntryPoint) == 0x000000, "Member 'AST_CharacterDead_C_ExecuteUbergraph_AST_CharacterDead::EntryPoint' has a wrong offset!");
static_assert(offsetof(AST_CharacterDead_C_ExecuteUbergraph_AST_CharacterDead, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'AST_CharacterDead_C_ExecuteUbergraph_AST_CharacterDead::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AST_CharacterDead_C_ExecuteUbergraph_AST_CharacterDead, CallFunc_StartBehaviorFromTag_StartedBehavior) == 0x000018, "Member 'AST_CharacterDead_C_ExecuteUbergraph_AST_CharacterDead::CallFunc_StartBehaviorFromTag_StartedBehavior' has a wrong offset!");
static_assert(offsetof(AST_CharacterDead_C_ExecuteUbergraph_AST_CharacterDead, CallFunc_StartBehaviorFromTag_ReturnValue) == 0x000020, "Member 'AST_CharacterDead_C_ExecuteUbergraph_AST_CharacterDead::CallFunc_StartBehaviorFromTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_CharacterDead_C_ExecuteUbergraph_AST_CharacterDead, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000028, "Member 'AST_CharacterDead_C_ExecuteUbergraph_AST_CharacterDead::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_CharacterDead_C_ExecuteUbergraph_AST_CharacterDead, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'AST_CharacterDead_C_ExecuteUbergraph_AST_CharacterDead::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

