#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AST_CharacterActionRecoil

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function AST_CharacterActionRecoil.AST_CharacterActionRecoil_C.ExecuteUbergraph_AST_CharacterActionRecoil
// 0x0050 (0x0050 - 0x0000)
struct AST_CharacterActionRecoil_C_ExecuteUbergraph_AST_CharacterActionRecoil final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVActorBehaviorBase*                    CallFunc_StartBehaviorFromTag_StartedBehavior;     // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UActionStateStartBehavior*              CallFunc_StartBehaviorFromTag_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AVOblivionPlayerCharacter*              K2Node_DynamicCast_AsVOblivion_Player_Character;   // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_1;            // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AST_CharacterActionRecoil_C_ExecuteUbergraph_AST_CharacterActionRecoil) == 0x000008, "Wrong alignment on AST_CharacterActionRecoil_C_ExecuteUbergraph_AST_CharacterActionRecoil");
static_assert(sizeof(AST_CharacterActionRecoil_C_ExecuteUbergraph_AST_CharacterActionRecoil) == 0x000050, "Wrong size on AST_CharacterActionRecoil_C_ExecuteUbergraph_AST_CharacterActionRecoil");
static_assert(offsetof(AST_CharacterActionRecoil_C_ExecuteUbergraph_AST_CharacterActionRecoil, EntryPoint) == 0x000000, "Member 'AST_CharacterActionRecoil_C_ExecuteUbergraph_AST_CharacterActionRecoil::EntryPoint' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionRecoil_C_ExecuteUbergraph_AST_CharacterActionRecoil, CallFunc_StartBehaviorFromTag_StartedBehavior) == 0x000008, "Member 'AST_CharacterActionRecoil_C_ExecuteUbergraph_AST_CharacterActionRecoil::CallFunc_StartBehaviorFromTag_StartedBehavior' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionRecoil_C_ExecuteUbergraph_AST_CharacterActionRecoil, CallFunc_StartBehaviorFromTag_ReturnValue) == 0x000010, "Member 'AST_CharacterActionRecoil_C_ExecuteUbergraph_AST_CharacterActionRecoil::CallFunc_StartBehaviorFromTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionRecoil_C_ExecuteUbergraph_AST_CharacterActionRecoil, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'AST_CharacterActionRecoil_C_ExecuteUbergraph_AST_CharacterActionRecoil::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionRecoil_C_ExecuteUbergraph_AST_CharacterActionRecoil, K2Node_DynamicCast_AsVOblivion_Player_Character) == 0x000020, "Member 'AST_CharacterActionRecoil_C_ExecuteUbergraph_AST_CharacterActionRecoil::K2Node_DynamicCast_AsVOblivion_Player_Character' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionRecoil_C_ExecuteUbergraph_AST_CharacterActionRecoil, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'AST_CharacterActionRecoil_C_ExecuteUbergraph_AST_CharacterActionRecoil::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionRecoil_C_ExecuteUbergraph_AST_CharacterActionRecoil, CallFunc_GetAnimInstance_ReturnValue) == 0x000030, "Member 'AST_CharacterActionRecoil_C_ExecuteUbergraph_AST_CharacterActionRecoil::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionRecoil_C_ExecuteUbergraph_AST_CharacterActionRecoil, CallFunc_GetAnimInstance_ReturnValue_1) == 0x000038, "Member 'AST_CharacterActionRecoil_C_ExecuteUbergraph_AST_CharacterActionRecoil::CallFunc_GetAnimInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionRecoil_C_ExecuteUbergraph_AST_CharacterActionRecoil, K2Node_CreateDelegate_OutputDelegate) == 0x000040, "Member 'AST_CharacterActionRecoil_C_ExecuteUbergraph_AST_CharacterActionRecoil::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function AST_CharacterActionRecoil.AST_CharacterActionRecoil_C.GetAnimTagsOverride
// 0x0020 (0x0020 - 0x0000)
struct AST_CharacterActionRecoil_C_GetAnimTagsOverride final
{
public:
	struct FGameplayTag                           OutGameplayTag;                                    // 0x0000(0x0008)(Parm, OutParm, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasShieldEquipped_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTESObjectWEAP*                         CallFunc_GetEquippedWeaponForm_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AST_CharacterActionRecoil_C_GetAnimTagsOverride) == 0x000008, "Wrong alignment on AST_CharacterActionRecoil_C_GetAnimTagsOverride");
static_assert(sizeof(AST_CharacterActionRecoil_C_GetAnimTagsOverride) == 0x000020, "Wrong size on AST_CharacterActionRecoil_C_GetAnimTagsOverride");
static_assert(offsetof(AST_CharacterActionRecoil_C_GetAnimTagsOverride, OutGameplayTag) == 0x000000, "Member 'AST_CharacterActionRecoil_C_GetAnimTagsOverride::OutGameplayTag' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionRecoil_C_GetAnimTagsOverride, CallFunc_HasShieldEquipped_ReturnValue) == 0x000008, "Member 'AST_CharacterActionRecoil_C_GetAnimTagsOverride::CallFunc_HasShieldEquipped_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionRecoil_C_GetAnimTagsOverride, CallFunc_GetEquippedWeaponForm_ReturnValue) == 0x000010, "Member 'AST_CharacterActionRecoil_C_GetAnimTagsOverride::CallFunc_GetEquippedWeaponForm_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionRecoil_C_GetAnimTagsOverride, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'AST_CharacterActionRecoil_C_GetAnimTagsOverride::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

