#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AST_CharacterActionShieldBash

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function AST_CharacterActionShieldBash.AST_CharacterActionShieldBash_C.ExecuteUbergraph_AST_CharacterActionShieldBash
// 0x0060 (0x0060 - 0x0000)
struct AST_CharacterActionShieldBash_C_ExecuteUbergraph_AST_CharacterActionShieldBash final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& EventTag, const class UAnimNotifyActionEventInfo* EventSource)> K2Node_CreateDelegate_OutputDelegate_2; // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVPawnAnimatedAction*                   CallFunc_PlayAnimatedAction_Action;                // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStateMachinePlayAnimatedAction*        CallFunc_PlayAnimatedAction_ReturnValue;           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTime;                            // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_EventTag;                       // 0x0050(0x0008)(NoDestructor, HasGetValueTypeHash)
	const class UAnimNotifyActionEventInfo*       K2Node_CustomEvent_EventSource;                    // 0x0058(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AST_CharacterActionShieldBash_C_ExecuteUbergraph_AST_CharacterActionShieldBash) == 0x000008, "Wrong alignment on AST_CharacterActionShieldBash_C_ExecuteUbergraph_AST_CharacterActionShieldBash");
static_assert(sizeof(AST_CharacterActionShieldBash_C_ExecuteUbergraph_AST_CharacterActionShieldBash) == 0x000060, "Wrong size on AST_CharacterActionShieldBash_C_ExecuteUbergraph_AST_CharacterActionShieldBash");
static_assert(offsetof(AST_CharacterActionShieldBash_C_ExecuteUbergraph_AST_CharacterActionShieldBash, EntryPoint) == 0x000000, "Member 'AST_CharacterActionShieldBash_C_ExecuteUbergraph_AST_CharacterActionShieldBash::EntryPoint' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionShieldBash_C_ExecuteUbergraph_AST_CharacterActionShieldBash, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'AST_CharacterActionShieldBash_C_ExecuteUbergraph_AST_CharacterActionShieldBash::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionShieldBash_C_ExecuteUbergraph_AST_CharacterActionShieldBash, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'AST_CharacterActionShieldBash_C_ExecuteUbergraph_AST_CharacterActionShieldBash::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionShieldBash_C_ExecuteUbergraph_AST_CharacterActionShieldBash, K2Node_CreateDelegate_OutputDelegate_2) == 0x000024, "Member 'AST_CharacterActionShieldBash_C_ExecuteUbergraph_AST_CharacterActionShieldBash::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionShieldBash_C_ExecuteUbergraph_AST_CharacterActionShieldBash, CallFunc_PlayAnimatedAction_Action) == 0x000038, "Member 'AST_CharacterActionShieldBash_C_ExecuteUbergraph_AST_CharacterActionShieldBash::CallFunc_PlayAnimatedAction_Action' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionShieldBash_C_ExecuteUbergraph_AST_CharacterActionShieldBash, CallFunc_PlayAnimatedAction_ReturnValue) == 0x000040, "Member 'AST_CharacterActionShieldBash_C_ExecuteUbergraph_AST_CharacterActionShieldBash::CallFunc_PlayAnimatedAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionShieldBash_C_ExecuteUbergraph_AST_CharacterActionShieldBash, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'AST_CharacterActionShieldBash_C_ExecuteUbergraph_AST_CharacterActionShieldBash::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionShieldBash_C_ExecuteUbergraph_AST_CharacterActionShieldBash, K2Node_Event_DeltaTime) == 0x00004C, "Member 'AST_CharacterActionShieldBash_C_ExecuteUbergraph_AST_CharacterActionShieldBash::K2Node_Event_DeltaTime' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionShieldBash_C_ExecuteUbergraph_AST_CharacterActionShieldBash, K2Node_CustomEvent_EventTag) == 0x000050, "Member 'AST_CharacterActionShieldBash_C_ExecuteUbergraph_AST_CharacterActionShieldBash::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionShieldBash_C_ExecuteUbergraph_AST_CharacterActionShieldBash, K2Node_CustomEvent_EventSource) == 0x000058, "Member 'AST_CharacterActionShieldBash_C_ExecuteUbergraph_AST_CharacterActionShieldBash::K2Node_CustomEvent_EventSource' has a wrong offset!");

// Function AST_CharacterActionShieldBash.AST_CharacterActionShieldBash_C.Find and Track Target
// 0x0038 (0x0038 - 0x0000)
struct AST_CharacterActionShieldBash_C_Find_and_Track_Target final
{
public:
	const class UVAnimNotify_ActionCameraTracking* Camera_Tracking_Window;                           // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Tracking_Duration;                                 // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AVPairedPawn*>                   CallFunc_GetAllActorsOfClass_OutActors;            // 0x0018(0x0010)(ReferenceParm)
	class AVPairedPawn*                           CallFunc_FindCameraTrackingTarget_ReturnValue;     // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldIgnoreTrackingOnTargetedPawn_ReturnValue; // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_StartCameraTrackingOnPawn_Duration_ImplicitCast; // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AST_CharacterActionShieldBash_C_Find_and_Track_Target) == 0x000008, "Wrong alignment on AST_CharacterActionShieldBash_C_Find_and_Track_Target");
static_assert(sizeof(AST_CharacterActionShieldBash_C_Find_and_Track_Target) == 0x000038, "Wrong size on AST_CharacterActionShieldBash_C_Find_and_Track_Target");
static_assert(offsetof(AST_CharacterActionShieldBash_C_Find_and_Track_Target, Camera_Tracking_Window) == 0x000000, "Member 'AST_CharacterActionShieldBash_C_Find_and_Track_Target::Camera_Tracking_Window' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionShieldBash_C_Find_and_Track_Target, Tracking_Duration) == 0x000008, "Member 'AST_CharacterActionShieldBash_C_Find_and_Track_Target::Tracking_Duration' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionShieldBash_C_Find_and_Track_Target, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'AST_CharacterActionShieldBash_C_Find_and_Track_Target::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionShieldBash_C_Find_and_Track_Target, CallFunc_GetAllActorsOfClass_OutActors) == 0x000018, "Member 'AST_CharacterActionShieldBash_C_Find_and_Track_Target::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionShieldBash_C_Find_and_Track_Target, CallFunc_FindCameraTrackingTarget_ReturnValue) == 0x000028, "Member 'AST_CharacterActionShieldBash_C_Find_and_Track_Target::CallFunc_FindCameraTrackingTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionShieldBash_C_Find_and_Track_Target, CallFunc_ShouldIgnoreTrackingOnTargetedPawn_ReturnValue) == 0x000030, "Member 'AST_CharacterActionShieldBash_C_Find_and_Track_Target::CallFunc_ShouldIgnoreTrackingOnTargetedPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionShieldBash_C_Find_and_Track_Target, CallFunc_IsValid_ReturnValue_1) == 0x000031, "Member 'AST_CharacterActionShieldBash_C_Find_and_Track_Target::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionShieldBash_C_Find_and_Track_Target, CallFunc_StartCameraTrackingOnPawn_Duration_ImplicitCast) == 0x000034, "Member 'AST_CharacterActionShieldBash_C_Find_and_Track_Target::CallFunc_StartCameraTrackingOnPawn_Duration_ImplicitCast' has a wrong offset!");

// Function AST_CharacterActionShieldBash.AST_CharacterActionShieldBash_C.On Controlled Pawn Animated Action Event
// 0x0110 (0x0110 - 0x0000)
struct AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event final
{
public:
	struct FGameplayTag                           Event_Tag;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class UAnimNotifyActionEventInfo*             Anim_Notify_Action_Event_Info;                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  TransmitTagsNotify;                                // 0x0010(0x0020)(Edit, BlueprintVisible)
	struct FGameplayTagContainer                  ChainWindowCancelTags;                             // 0x0030(0x0020)(Edit, BlueprintVisible)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AVAltarPlayerController*                K2Node_DynamicCast_AsVAltar_Player_Controller;     // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x2];                                       // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetNotifyDuration_ReturnValue;            // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UVAnimNotify_ActionCameraTracking* K2Node_DynamicCast_AsVAnim_Notify_Action_Camera_Tracking; // 0x0080(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UVAnimNotify_ActionMeleeHitWindow* K2Node_DynamicCast_AsVAnim_Notify_Action_Melee_Hit_Window; // 0x0090(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess;   // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9B[0x5];                                       // 0x009B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	const class UBP_ActionNotifyState_TagContainer_C* K2Node_DynamicCast_AsBP_Action_Notify_State_Tag_Container; // 0x00A0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesTag_ReturnValue;                   // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AA[0x6];                                       // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	const class UBP_ActionNotify_TagContainer_C*  K2Node_DynamicCast_AsBP_Action_Notify_Tag_Container; // 0x00B0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayTag>                   CallFunc_BreakGameplayTagContainer_GameplayTags;   // 0x00C0(0x0010)(ReferenceParm)
	struct FGameplayTag                           CallFunc_Array_Get_Item;                           // 0x00D0(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayTag>                   CallFunc_BreakGameplayTagContainer_GameplayTags_1; // 0x00E0(0x0010)(ReferenceParm)
	struct FGameplayTag                           CallFunc_Array_Get_Item_1;                         // 0x00F0(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess_1; // 0x00FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveGameplayTag_ReturnValue;            // 0x00FE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess_2; // 0x00FF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveGameplayTag_ReturnValue_1;          // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess_3; // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_102[0x6];                                      // 0x0102(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Find_and_Track_Target_Tracking_Duration_ImplicitCast; // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event) == 0x000008, "Wrong alignment on AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event");
static_assert(sizeof(AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event) == 0x000110, "Wrong size on AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event");
static_assert(offsetof(AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event, Event_Tag) == 0x000000, "Member 'AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event::Event_Tag' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event, Anim_Notify_Action_Event_Info) == 0x000008, "Member 'AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event::Anim_Notify_Action_Event_Info' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event, TransmitTagsNotify) == 0x000010, "Member 'AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event::TransmitTagsNotify' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event, ChainWindowCancelTags) == 0x000030, "Member 'AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event::ChainWindowCancelTags' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event, Temp_int_Loop_Counter_Variable) == 0x000050, "Member 'AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event, CallFunc_Add_IntInt_ReturnValue) == 0x000054, "Member 'AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event, Temp_int_Array_Index_Variable) == 0x000058, "Member 'AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event, Temp_int_Loop_Counter_Variable_1) == 0x00005C, "Member 'AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event, CallFunc_Add_IntInt_ReturnValue_1) == 0x000060, "Member 'AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event, Temp_int_Array_Index_Variable_1) == 0x000064, "Member 'AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event, CallFunc_GetController_ReturnValue) == 0x000068, "Member 'AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event, K2Node_DynamicCast_AsVAltar_Player_Controller) == 0x000070, "Member 'AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event::K2Node_DynamicCast_AsVAltar_Player_Controller' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event, CallFunc_IsValid_ReturnValue) == 0x000079, "Member 'AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event, CallFunc_GetNotifyDuration_ReturnValue) == 0x00007C, "Member 'AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event::CallFunc_GetNotifyDuration_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event, K2Node_DynamicCast_AsVAnim_Notify_Action_Camera_Tracking) == 0x000080, "Member 'AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event::K2Node_DynamicCast_AsVAnim_Notify_Action_Camera_Tracking' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event, K2Node_DynamicCast_bSuccess_1) == 0x000088, "Member 'AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event, K2Node_DynamicCast_AsVAnim_Notify_Action_Melee_Hit_Window) == 0x000090, "Member 'AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event::K2Node_DynamicCast_AsVAnim_Notify_Action_Melee_Hit_Window' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event, K2Node_DynamicCast_bSuccess_2) == 0x000098, "Member 'AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event, CallFunc_IsValid_ReturnValue_1) == 0x000099, "Member 'AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event, GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess) == 0x00009A, "Member 'AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event::GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event, K2Node_DynamicCast_AsBP_Action_Notify_State_Tag_Container) == 0x0000A0, "Member 'AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event::K2Node_DynamicCast_AsBP_Action_Notify_State_Tag_Container' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event, K2Node_DynamicCast_bSuccess_3) == 0x0000A8, "Member 'AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event, CallFunc_MatchesTag_ReturnValue) == 0x0000A9, "Member 'AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event::CallFunc_MatchesTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event, K2Node_DynamicCast_AsBP_Action_Notify_Tag_Container) == 0x0000B0, "Member 'AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event::K2Node_DynamicCast_AsBP_Action_Notify_Tag_Container' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event, K2Node_DynamicCast_bSuccess_4) == 0x0000B8, "Member 'AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event, CallFunc_BreakGameplayTagContainer_GameplayTags) == 0x0000C0, "Member 'AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event::CallFunc_BreakGameplayTagContainer_GameplayTags' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event, CallFunc_Array_Get_Item) == 0x0000D0, "Member 'AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event, CallFunc_Array_Length_ReturnValue) == 0x0000D8, "Member 'AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event, CallFunc_Less_IntInt_ReturnValue) == 0x0000DC, "Member 'AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event, CallFunc_BreakGameplayTagContainer_GameplayTags_1) == 0x0000E0, "Member 'AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event::CallFunc_BreakGameplayTagContainer_GameplayTags_1' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event, CallFunc_Array_Get_Item_1) == 0x0000F0, "Member 'AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event, CallFunc_Array_Length_ReturnValue_1) == 0x0000F8, "Member 'AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000FC, "Member 'AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event, GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess_1) == 0x0000FD, "Member 'AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event::GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event, CallFunc_RemoveGameplayTag_ReturnValue) == 0x0000FE, "Member 'AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event::CallFunc_RemoveGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event, GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess_2) == 0x0000FF, "Member 'AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event::GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event, CallFunc_RemoveGameplayTag_ReturnValue_1) == 0x000100, "Member 'AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event::CallFunc_RemoveGameplayTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event, GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess_3) == 0x000101, "Member 'AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event::GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess_3' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event, CallFunc_Find_and_Track_Target_Tracking_Duration_ImplicitCast) == 0x000108, "Member 'AST_CharacterActionShieldBash_C_On_Controlled_Pawn_Animated_Action_Event::CallFunc_Find_and_Track_Target_Tracking_Duration_ImplicitCast' has a wrong offset!");

// Function AST_CharacterActionShieldBash.AST_CharacterActionShieldBash_C.OnAnimatedActionEvent
// 0x0010 (0x0010 - 0x0000)
struct AST_CharacterActionShieldBash_C_OnAnimatedActionEvent final
{
public:
	struct FGameplayTag                           EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	const class UAnimNotifyActionEventInfo*       EventSource;                                       // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AST_CharacterActionShieldBash_C_OnAnimatedActionEvent) == 0x000008, "Wrong alignment on AST_CharacterActionShieldBash_C_OnAnimatedActionEvent");
static_assert(sizeof(AST_CharacterActionShieldBash_C_OnAnimatedActionEvent) == 0x000010, "Wrong size on AST_CharacterActionShieldBash_C_OnAnimatedActionEvent");
static_assert(offsetof(AST_CharacterActionShieldBash_C_OnAnimatedActionEvent, EventTag) == 0x000000, "Member 'AST_CharacterActionShieldBash_C_OnAnimatedActionEvent::EventTag' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionShieldBash_C_OnAnimatedActionEvent, EventSource) == 0x000008, "Member 'AST_CharacterActionShieldBash_C_OnAnimatedActionEvent::EventSource' has a wrong offset!");

// Function AST_CharacterActionShieldBash.AST_CharacterActionShieldBash_C.OnStateUpdate
// 0x0004 (0x0004 - 0x0000)
struct AST_CharacterActionShieldBash_C_OnStateUpdate final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AST_CharacterActionShieldBash_C_OnStateUpdate) == 0x000004, "Wrong alignment on AST_CharacterActionShieldBash_C_OnStateUpdate");
static_assert(sizeof(AST_CharacterActionShieldBash_C_OnStateUpdate) == 0x000004, "Wrong size on AST_CharacterActionShieldBash_C_OnStateUpdate");
static_assert(offsetof(AST_CharacterActionShieldBash_C_OnStateUpdate, DeltaTime) == 0x000000, "Member 'AST_CharacterActionShieldBash_C_OnStateUpdate::DeltaTime' has a wrong offset!");

// Function AST_CharacterActionShieldBash.AST_CharacterActionShieldBash_C.Run Shield Bash Hit Detection
// 0x00D0 (0x00D0 - 0x0000)
struct AST_CharacterActionShieldBash_C_Run_Shield_Bash_Hit_Detection final
{
public:
	TArray<class AVPairedPawn*>                   HitPawns;                                          // 0x0000(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<struct FHitResult>                     HitPrimitives;                                     // 0x0010(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	struct FBox                                   HitBox;                                            // 0x0020(0x0038)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AVPairedPawn*                           CallFunc_Array_Get_Item;                           // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Set_Contains_ReturnValue;                 // 0x007E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x007F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AVPairedPawn*>                   CallFunc_RunPawnMeleeHitDetection_ReturnValue;     // 0x0088(0x0010)(ReferenceParm)
	struct FBox                                   CallFunc_ComputeHitbox_ReturnValue;                // 0x0098(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AST_CharacterActionShieldBash_C_Run_Shield_Bash_Hit_Detection) == 0x000008, "Wrong alignment on AST_CharacterActionShieldBash_C_Run_Shield_Bash_Hit_Detection");
static_assert(sizeof(AST_CharacterActionShieldBash_C_Run_Shield_Bash_Hit_Detection) == 0x0000D0, "Wrong size on AST_CharacterActionShieldBash_C_Run_Shield_Bash_Hit_Detection");
static_assert(offsetof(AST_CharacterActionShieldBash_C_Run_Shield_Bash_Hit_Detection, HitPawns) == 0x000000, "Member 'AST_CharacterActionShieldBash_C_Run_Shield_Bash_Hit_Detection::HitPawns' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionShieldBash_C_Run_Shield_Bash_Hit_Detection, HitPrimitives) == 0x000010, "Member 'AST_CharacterActionShieldBash_C_Run_Shield_Bash_Hit_Detection::HitPrimitives' has a wrong offset!");
