#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AST_Dialogue

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AST_CameraBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AST_Dialogue.AST_Dialogue_C
// 0x0020 (0x03A0 - 0x0380)
class UAST_Dialogue_C final : public UAST_CameraBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_AST_Dialogue_C;                     // 0x0380(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AVAltarPlayerCameraManager*             CameraManager;                                     // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AVOblivionPlayerCharacter*              PlayerCharacter;                                   // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        Timer;                                             // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnStateUpdate(float DeltaTime);
	void OnExited();
	void OnEntered();
	void ExecuteUbergraph_AST_Dialogue(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AST_Dialogue_C">();
	}
	static class UAST_Dialogue_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAST_Dialogue_C>();
	}
};
static_assert(alignof(UAST_Dialogue_C) == 0x000008, "Wrong alignment on UAST_Dialogue_C");
static_assert(sizeof(UAST_Dialogue_C) == 0x0003A0, "Wrong size on UAST_Dialogue_C");
static_assert(offsetof(UAST_Dialogue_C, UberGraphFrame_AST_Dialogue_C) == 0x000380, "Member 'UAST_Dialogue_C::UberGraphFrame_AST_Dialogue_C' has a wrong offset!");
static_assert(offsetof(UAST_Dialogue_C, CameraManager) == 0x000388, "Member 'UAST_Dialogue_C::CameraManager' has a wrong offset!");
static_assert(offsetof(UAST_Dialogue_C, PlayerCharacter) == 0x000390, "Member 'UAST_Dialogue_C::PlayerCharacter' has a wrong offset!");
static_assert(offsetof(UAST_Dialogue_C, Timer) == 0x000398, "Member 'UAST_Dialogue_C::Timer' has a wrong offset!");

}

