#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AST_CharacterActionBlock

#include "Basic.hpp"


namespace SDK::Params
{

// Function AST_CharacterActionBlock.AST_CharacterActionBlock_C.ExecuteUbergraph_AST_CharacterActionBlock
// 0x0060 (0x0060 - 0x0000)
struct AST_CharacterActionBlock_C_ExecuteUbergraph_AST_CharacterActionBlock final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTime;                            // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVPawnAnimatedAction*                   CallFunc_PlayAnimatedAction_Action;                // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStateMachinePlayAnimatedAction*        CallFunc_PlayAnimatedAction_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasGameplayTag_ReturnValue;               // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AVOblivionPlayerCharacter*              K2Node_DynamicCast_AsVOblivion_Player_Character;   // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AVOblivionPlayerCharacter*              K2Node_DynamicCast_AsVOblivion_Player_Character_1; // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetConsoleVariableBoolValue_ReturnValue;  // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetConsoleVariableBoolValue_ReturnValue_1; // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AST_CharacterActionBlock_C_ExecuteUbergraph_AST_CharacterActionBlock) == 0x000008, "Wrong alignment on AST_CharacterActionBlock_C_ExecuteUbergraph_AST_CharacterActionBlock");
static_assert(sizeof(AST_CharacterActionBlock_C_ExecuteUbergraph_AST_CharacterActionBlock) == 0x000060, "Wrong size on AST_CharacterActionBlock_C_ExecuteUbergraph_AST_CharacterActionBlock");
static_assert(offsetof(AST_CharacterActionBlock_C_ExecuteUbergraph_AST_CharacterActionBlock, EntryPoint) == 0x000000, "Member 'AST_CharacterActionBlock_C_ExecuteUbergraph_AST_CharacterActionBlock::EntryPoint' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionBlock_C_ExecuteUbergraph_AST_CharacterActionBlock, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'AST_CharacterActionBlock_C_ExecuteUbergraph_AST_CharacterActionBlock::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionBlock_C_ExecuteUbergraph_AST_CharacterActionBlock, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'AST_CharacterActionBlock_C_ExecuteUbergraph_AST_CharacterActionBlock::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionBlock_C_ExecuteUbergraph_AST_CharacterActionBlock, K2Node_Event_DeltaTime) == 0x000024, "Member 'AST_CharacterActionBlock_C_ExecuteUbergraph_AST_CharacterActionBlock::K2Node_Event_DeltaTime' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionBlock_C_ExecuteUbergraph_AST_CharacterActionBlock, CallFunc_PlayAnimatedAction_Action) == 0x000028, "Member 'AST_CharacterActionBlock_C_ExecuteUbergraph_AST_CharacterActionBlock::CallFunc_PlayAnimatedAction_Action' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionBlock_C_ExecuteUbergraph_AST_CharacterActionBlock, CallFunc_PlayAnimatedAction_ReturnValue) == 0x000030, "Member 'AST_CharacterActionBlock_C_ExecuteUbergraph_AST_CharacterActionBlock::CallFunc_PlayAnimatedAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionBlock_C_ExecuteUbergraph_AST_CharacterActionBlock, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'AST_CharacterActionBlock_C_ExecuteUbergraph_AST_CharacterActionBlock::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionBlock_C_ExecuteUbergraph_AST_CharacterActionBlock, CallFunc_HasGameplayTag_ReturnValue) == 0x000039, "Member 'AST_CharacterActionBlock_C_ExecuteUbergraph_AST_CharacterActionBlock::CallFunc_HasGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionBlock_C_ExecuteUbergraph_AST_CharacterActionBlock, K2Node_DynamicCast_AsVOblivion_Player_Character) == 0x000040, "Member 'AST_CharacterActionBlock_C_ExecuteUbergraph_AST_CharacterActionBlock::K2Node_DynamicCast_AsVOblivion_Player_Character' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionBlock_C_ExecuteUbergraph_AST_CharacterActionBlock, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'AST_CharacterActionBlock_C_ExecuteUbergraph_AST_CharacterActionBlock::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionBlock_C_ExecuteUbergraph_AST_CharacterActionBlock, K2Node_DynamicCast_AsVOblivion_Player_Character_1) == 0x000050, "Member 'AST_CharacterActionBlock_C_ExecuteUbergraph_AST_CharacterActionBlock::K2Node_DynamicCast_AsVOblivion_Player_Character_1' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionBlock_C_ExecuteUbergraph_AST_CharacterActionBlock, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'AST_CharacterActionBlock_C_ExecuteUbergraph_AST_CharacterActionBlock::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionBlock_C_ExecuteUbergraph_AST_CharacterActionBlock, CallFunc_GetConsoleVariableBoolValue_ReturnValue) == 0x000059, "Member 'AST_CharacterActionBlock_C_ExecuteUbergraph_AST_CharacterActionBlock::CallFunc_GetConsoleVariableBoolValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionBlock_C_ExecuteUbergraph_AST_CharacterActionBlock, CallFunc_GetConsoleVariableBoolValue_ReturnValue_1) == 0x00005A, "Member 'AST_CharacterActionBlock_C_ExecuteUbergraph_AST_CharacterActionBlock::CallFunc_GetConsoleVariableBoolValue_ReturnValue_1' has a wrong offset!");

// Function AST_CharacterActionBlock.AST_CharacterActionBlock_C.OnStateUpdate
// 0x0004 (0x0004 - 0x0000)
struct AST_CharacterActionBlock_C_OnStateUpdate final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AST_CharacterActionBlock_C_OnStateUpdate) == 0x000004, "Wrong alignment on AST_CharacterActionBlock_C_OnStateUpdate");
static_assert(sizeof(AST_CharacterActionBlock_C_OnStateUpdate) == 0x000004, "Wrong size on AST_CharacterActionBlock_C_OnStateUpdate");
static_assert(offsetof(AST_CharacterActionBlock_C_OnStateUpdate, DeltaTime) == 0x000000, "Member 'AST_CharacterActionBlock_C_OnStateUpdate::DeltaTime' has a wrong offset!");

}

