#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AST_CharacterLocomotionOnGroundIdle

#include "Basic.hpp"


namespace SDK::Params
{

// Function AST_CharacterLocomotionOnGroundIdle.AST_CharacterLocomotionOnGroundIdle_C.ExecuteUbergraph_AST_CharacterLocomotionOnGroundIdle
// 0x0038 (0x0038 - 0x0000)
struct AST_CharacterLocomotionOnGroundIdle_C_ExecuteUbergraph_AST_CharacterLocomotionOnGroundIdle final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVStateMachineComponent*                CallFunc_GetOwningStateMachineComponent_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayerCharacter_ReturnValue;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AVPairedPawn*                           K2Node_DynamicCast_AsVPaired_Pawn;                 // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayerCharacter_ReturnValue_1;          // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AST_CharacterLocomotionOnGroundIdle_C_ExecuteUbergraph_AST_CharacterLocomotionOnGroundIdle) == 0x000008, "Wrong alignment on AST_CharacterLocomotionOnGroundIdle_C_ExecuteUbergraph_AST_CharacterLocomotionOnGroundIdle");
static_assert(sizeof(AST_CharacterLocomotionOnGroundIdle_C_ExecuteUbergraph_AST_CharacterLocomotionOnGroundIdle) == 0x000038, "Wrong size on AST_CharacterLocomotionOnGroundIdle_C_ExecuteUbergraph_AST_CharacterLocomotionOnGroundIdle");
static_assert(offsetof(AST_CharacterLocomotionOnGroundIdle_C_ExecuteUbergraph_AST_CharacterLocomotionOnGroundIdle, EntryPoint) == 0x000000, "Member 'AST_CharacterLocomotionOnGroundIdle_C_ExecuteUbergraph_AST_CharacterLocomotionOnGroundIdle::EntryPoint' has a wrong offset!");
static_assert(offsetof(AST_CharacterLocomotionOnGroundIdle_C_ExecuteUbergraph_AST_CharacterLocomotionOnGroundIdle, CallFunc_GetOwningStateMachineComponent_ReturnValue) == 0x000008, "Member 'AST_CharacterLocomotionOnGroundIdle_C_ExecuteUbergraph_AST_CharacterLocomotionOnGroundIdle::CallFunc_GetOwningStateMachineComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_CharacterLocomotionOnGroundIdle_C_ExecuteUbergraph_AST_CharacterLocomotionOnGroundIdle, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'AST_CharacterLocomotionOnGroundIdle_C_ExecuteUbergraph_AST_CharacterLocomotionOnGroundIdle::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_CharacterLocomotionOnGroundIdle_C_ExecuteUbergraph_AST_CharacterLocomotionOnGroundIdle, CallFunc_IsPlayerCharacter_ReturnValue) == 0x000011, "Member 'AST_CharacterLocomotionOnGroundIdle_C_ExecuteUbergraph_AST_CharacterLocomotionOnGroundIdle::CallFunc_IsPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_CharacterLocomotionOnGroundIdle_C_ExecuteUbergraph_AST_CharacterLocomotionOnGroundIdle, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'AST_CharacterLocomotionOnGroundIdle_C_ExecuteUbergraph_AST_CharacterLocomotionOnGroundIdle::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_CharacterLocomotionOnGroundIdle_C_ExecuteUbergraph_AST_CharacterLocomotionOnGroundIdle, CallFunc_Not_PreBool_ReturnValue) == 0x000020, "Member 'AST_CharacterLocomotionOnGroundIdle_C_ExecuteUbergraph_AST_CharacterLocomotionOnGroundIdle::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_CharacterLocomotionOnGroundIdle_C_ExecuteUbergraph_AST_CharacterLocomotionOnGroundIdle, K2Node_DynamicCast_AsVPaired_Pawn) == 0x000028, "Member 'AST_CharacterLocomotionOnGroundIdle_C_ExecuteUbergraph_AST_CharacterLocomotionOnGroundIdle::K2Node_DynamicCast_AsVPaired_Pawn' has a wrong offset!");
static_assert(offsetof(AST_CharacterLocomotionOnGroundIdle_C_ExecuteUbergraph_AST_CharacterLocomotionOnGroundIdle, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'AST_CharacterLocomotionOnGroundIdle_C_ExecuteUbergraph_AST_CharacterLocomotionOnGroundIdle::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AST_CharacterLocomotionOnGroundIdle_C_ExecuteUbergraph_AST_CharacterLocomotionOnGroundIdle, CallFunc_IsPlayerCharacter_ReturnValue_1) == 0x000031, "Member 'AST_CharacterLocomotionOnGroundIdle_C_ExecuteUbergraph_AST_CharacterLocomotionOnGroundIdle::CallFunc_IsPlayerCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AST_CharacterLocomotionOnGroundIdle_C_ExecuteUbergraph_AST_CharacterLocomotionOnGroundIdle, CallFunc_Not_PreBool_ReturnValue_1) == 0x000032, "Member 'AST_CharacterLocomotionOnGroundIdle_C_ExecuteUbergraph_AST_CharacterLocomotionOnGroundIdle::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");

}

