#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AST_CharacterActionBowDrawShoot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Altar_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AST_CharacterActionBowDrawShoot.AST_CharacterActionBowDrawShoot_C
// 0x0028 (0x00D0 - 0x00A8)
class UAST_CharacterActionBowDrawShoot_C final : public UVAltarActionState
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        BowDrawStartTime;                                  // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DrawDuration;                                      // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BowDrawInputHeldTime;                              // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPlayer;                                         // 0x00C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bReadyToShoot;                                     // 0x00C9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHasStartedReverseCrosshairAnimation;              // 0x00CA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AST_CharacterActionBowDrawShoot(int32 EntryPoint);
	void OnCanceled_1A72946C45AF9BBE990C72A395A81954();
	void OnCanceled_45BD62B24778BC05DF4C19A0480DE9D2();
	void OnCompleted_1A72946C45AF9BBE990C72A395A81954();
	void OnCompleted_45BD62B24778BC05DF4C19A0480DE9D2();
	void OnEntered();
	void OnExited();
	void OnStateUpdate(float DeltaTime);
	void PerformBowAttack();
	void ResetStateVariables();
	void StartAiming();
	void StopAiming();
	void Zoom(bool Exit);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AST_CharacterActionBowDrawShoot_C">();
	}
	static class UAST_CharacterActionBowDrawShoot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAST_CharacterActionBowDrawShoot_C>();
	}
};
static_assert(alignof(UAST_CharacterActionBowDrawShoot_C) == 0x000008, "Wrong alignment on UAST_CharacterActionBowDrawShoot_C");
static_assert(sizeof(UAST_CharacterActionBowDrawShoot_C) == 0x0000D0, "Wrong size on UAST_CharacterActionBowDrawShoot_C");
static_assert(offsetof(UAST_CharacterActionBowDrawShoot_C, UberGraphFrame) == 0x0000A8, "Member 'UAST_CharacterActionBowDrawShoot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAST_CharacterActionBowDrawShoot_C, BowDrawStartTime) == 0x0000B0, "Member 'UAST_CharacterActionBowDrawShoot_C::BowDrawStartTime' has a wrong offset!");
static_assert(offsetof(UAST_CharacterActionBowDrawShoot_C, DrawDuration) == 0x0000B8, "Member 'UAST_CharacterActionBowDrawShoot_C::DrawDuration' has a wrong offset!");
static_assert(offsetof(UAST_CharacterActionBowDrawShoot_C, BowDrawInputHeldTime) == 0x0000C0, "Member 'UAST_CharacterActionBowDrawShoot_C::BowDrawInputHeldTime' has a wrong offset!");
static_assert(offsetof(UAST_CharacterActionBowDrawShoot_C, bIsPlayer) == 0x0000C8, "Member 'UAST_CharacterActionBowDrawShoot_C::bIsPlayer' has a wrong offset!");
static_assert(offsetof(UAST_CharacterActionBowDrawShoot_C, bReadyToShoot) == 0x0000C9, "Member 'UAST_CharacterActionBowDrawShoot_C::bReadyToShoot' has a wrong offset!");
static_assert(offsetof(UAST_CharacterActionBowDrawShoot_C, bHasStartedReverseCrosshairAnimation) == 0x0000CA, "Member 'UAST_CharacterActionBowDrawShoot_C::bHasStartedReverseCrosshairAnimation' has a wrong offset!");

}

