#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AST_Vanity_Camera

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AST_CameraBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AST_Vanity_Camera.AST_Vanity_Camera_C
// 0x0018 (0x0398 - 0x0380)
class UAST_Vanity_Camera_C final : public UAST_CameraBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_AST_Vanity_Camera_C;                // 0x0380(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        RotationSpeed;                                     // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TimeBeforeResumeRotation;                          // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnStateUpdate(float DeltaTime);
	void OnExited();
	void OnEntered();
	void ExecuteUbergraph_AST_Vanity_Camera(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AST_Vanity_Camera_C">();
	}
	static class UAST_Vanity_Camera_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAST_Vanity_Camera_C>();
	}
};
static_assert(alignof(UAST_Vanity_Camera_C) == 0x000008, "Wrong alignment on UAST_Vanity_Camera_C");
static_assert(sizeof(UAST_Vanity_Camera_C) == 0x000398, "Wrong size on UAST_Vanity_Camera_C");
static_assert(offsetof(UAST_Vanity_Camera_C, UberGraphFrame_AST_Vanity_Camera_C) == 0x000380, "Member 'UAST_Vanity_Camera_C::UberGraphFrame_AST_Vanity_Camera_C' has a wrong offset!");
static_assert(offsetof(UAST_Vanity_Camera_C, RotationSpeed) == 0x000388, "Member 'UAST_Vanity_Camera_C::RotationSpeed' has a wrong offset!");
static_assert(offsetof(UAST_Vanity_Camera_C, TimeBeforeResumeRotation) == 0x000390, "Member 'UAST_Vanity_Camera_C::TimeBeforeResumeRotation' has a wrong offset!");

}

