#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AST_CharacterDocked

#include "Basic.hpp"

#include "Altar_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function AST_CharacterDocked.AST_CharacterDocked_C.ExecuteUbergraph_AST_CharacterDocked
// 0x00E8 (0x00E8 - 0x0000)
struct AST_CharacterDocked_C_ExecuteUbergraph_AST_CharacterDocked final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue; // 0x0008(0x0020)()
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AVPairedCharacter*                      K2Node_DynamicCast_AsVPaired_Character;            // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESitSleepState                                CallFunc_GetSitSleepState_ReturnValue;             // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetUsedDockActor_ReturnValue;             // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AVFurniture*                            K2Node_DynamicCast_AsVFurniture;                   // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldUseLowLyingAnimation_ReturnValue;   // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_1; // 0x0060(0x0020)()
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_2; // 0x0080(0x0020)()
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_3; // 0x00A0(0x0020)()
	bool                                          CallFunc_HasGameplayTag_ReturnValue;               // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasGameplayTag_ReturnValue_1;             // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_4; // 0x00C8(0x0020)()
};
static_assert(alignof(AST_CharacterDocked_C_ExecuteUbergraph_AST_CharacterDocked) == 0x000008, "Wrong alignment on AST_CharacterDocked_C_ExecuteUbergraph_AST_CharacterDocked");
static_assert(sizeof(AST_CharacterDocked_C_ExecuteUbergraph_AST_CharacterDocked) == 0x0000E8, "Wrong size on AST_CharacterDocked_C_ExecuteUbergraph_AST_CharacterDocked");
static_assert(offsetof(AST_CharacterDocked_C_ExecuteUbergraph_AST_CharacterDocked, EntryPoint) == 0x000000, "Member 'AST_CharacterDocked_C_ExecuteUbergraph_AST_CharacterDocked::EntryPoint' has a wrong offset!");
static_assert(offsetof(AST_CharacterDocked_C_ExecuteUbergraph_AST_CharacterDocked, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue) == 0x000008, "Member 'AST_CharacterDocked_C_ExecuteUbergraph_AST_CharacterDocked::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_CharacterDocked_C_ExecuteUbergraph_AST_CharacterDocked, CallFunc_GetOwner_ReturnValue) == 0x000028, "Member 'AST_CharacterDocked_C_ExecuteUbergraph_AST_CharacterDocked::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_CharacterDocked_C_ExecuteUbergraph_AST_CharacterDocked, K2Node_DynamicCast_AsVPaired_Character) == 0x000030, "Member 'AST_CharacterDocked_C_ExecuteUbergraph_AST_CharacterDocked::K2Node_DynamicCast_AsVPaired_Character' has a wrong offset!");
static_assert(offsetof(AST_CharacterDocked_C_ExecuteUbergraph_AST_CharacterDocked, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'AST_CharacterDocked_C_ExecuteUbergraph_AST_CharacterDocked::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AST_CharacterDocked_C_ExecuteUbergraph_AST_CharacterDocked, CallFunc_GetSitSleepState_ReturnValue) == 0x000039, "Member 'AST_CharacterDocked_C_ExecuteUbergraph_AST_CharacterDocked::CallFunc_GetSitSleepState_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_CharacterDocked_C_ExecuteUbergraph_AST_CharacterDocked, CallFunc_GetUsedDockActor_ReturnValue) == 0x000040, "Member 'AST_CharacterDocked_C_ExecuteUbergraph_AST_CharacterDocked::CallFunc_GetUsedDockActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_CharacterDocked_C_ExecuteUbergraph_AST_CharacterDocked, K2Node_SwitchEnum_CmpSuccess) == 0x000048, "Member 'AST_CharacterDocked_C_ExecuteUbergraph_AST_CharacterDocked::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(AST_CharacterDocked_C_ExecuteUbergraph_AST_CharacterDocked, K2Node_DynamicCast_AsVFurniture) == 0x000050, "Member 'AST_CharacterDocked_C_ExecuteUbergraph_AST_CharacterDocked::K2Node_DynamicCast_AsVFurniture' has a wrong offset!");
static_assert(offsetof(AST_CharacterDocked_C_ExecuteUbergraph_AST_CharacterDocked, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'AST_CharacterDocked_C_ExecuteUbergraph_AST_CharacterDocked::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AST_CharacterDocked_C_ExecuteUbergraph_AST_CharacterDocked, CallFunc_ShouldUseLowLyingAnimation_ReturnValue) == 0x000059, "Member 'AST_CharacterDocked_C_ExecuteUbergraph_AST_CharacterDocked::CallFunc_ShouldUseLowLyingAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_CharacterDocked_C_ExecuteUbergraph_AST_CharacterDocked, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_1) == 0x000060, "Member 'AST_CharacterDocked_C_ExecuteUbergraph_AST_CharacterDocked::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AST_CharacterDocked_C_ExecuteUbergraph_AST_CharacterDocked, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_2) == 0x000080, "Member 'AST_CharacterDocked_C_ExecuteUbergraph_AST_CharacterDocked::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AST_CharacterDocked_C_ExecuteUbergraph_AST_CharacterDocked, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_3) == 0x0000A0, "Member 'AST_CharacterDocked_C_ExecuteUbergraph_AST_CharacterDocked::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AST_CharacterDocked_C_ExecuteUbergraph_AST_CharacterDocked, CallFunc_HasGameplayTag_ReturnValue) == 0x0000C0, "Member 'AST_CharacterDocked_C_ExecuteUbergraph_AST_CharacterDocked::CallFunc_HasGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_CharacterDocked_C_ExecuteUbergraph_AST_CharacterDocked, CallFunc_HasGameplayTag_ReturnValue_1) == 0x0000C1, "Member 'AST_CharacterDocked_C_ExecuteUbergraph_AST_CharacterDocked::CallFunc_HasGameplayTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AST_CharacterDocked_C_ExecuteUbergraph_AST_CharacterDocked, CallFunc_Not_PreBool_ReturnValue) == 0x0000C2, "Member 'AST_CharacterDocked_C_ExecuteUbergraph_AST_CharacterDocked::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_CharacterDocked_C_ExecuteUbergraph_AST_CharacterDocked, CallFunc_Not_PreBool_ReturnValue_1) == 0x0000C3, "Member 'AST_CharacterDocked_C_ExecuteUbergraph_AST_CharacterDocked::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AST_CharacterDocked_C_ExecuteUbergraph_AST_CharacterDocked, CallFunc_BooleanAND_ReturnValue) == 0x0000C4, "Member 'AST_CharacterDocked_C_ExecuteUbergraph_AST_CharacterDocked::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_CharacterDocked_C_ExecuteUbergraph_AST_CharacterDocked, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_4) == 0x0000C8, "Member 'AST_CharacterDocked_C_ExecuteUbergraph_AST_CharacterDocked::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_4' has a wrong offset!");

}

