#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AST_CharacterActionBowDrawShoot

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function AST_CharacterActionBowDrawShoot.AST_CharacterActionBowDrawShoot_C.ExecuteUbergraph_AST_CharacterActionBowDrawShoot
// 0x00A8 (0x00A8 - 0x0000)
struct AST_CharacterActionBowDrawShoot_C_ExecuteUbergraph_AST_CharacterActionBowDrawShoot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVPawnAnimatedAction*                   CallFunc_PlayAnimatedAction_Action;                // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStateMachinePlayAnimatedAction*        CallFunc_PlayAnimatedAction_ReturnValue;           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTime;                            // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0050(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVPawnAnimatedAction*                   CallFunc_PlayAnimatedAction_Action_1;              // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStateMachinePlayAnimatedAction*        CallFunc_PlayAnimatedAction_ReturnValue_1;         // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue_1;                     // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AVAltarPlayerController*                K2Node_DynamicCast_AsVAltar_Player_Controller;     // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasGameplayTag_ReturnValue;               // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0093(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_VariableSet_DrawDuration_ImplicitCast;      // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast;          // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AST_CharacterActionBowDrawShoot_C_ExecuteUbergraph_AST_CharacterActionBowDrawShoot) == 0x000008, "Wrong alignment on AST_CharacterActionBowDrawShoot_C_ExecuteUbergraph_AST_CharacterActionBowDrawShoot");
static_assert(sizeof(AST_CharacterActionBowDrawShoot_C_ExecuteUbergraph_AST_CharacterActionBowDrawShoot) == 0x0000A8, "Wrong size on AST_CharacterActionBowDrawShoot_C_ExecuteUbergraph_AST_CharacterActionBowDrawShoot");
static_assert(offsetof(AST_CharacterActionBowDrawShoot_C_ExecuteUbergraph_AST_CharacterActionBowDrawShoot, EntryPoint) == 0x000000, "Member 'AST_CharacterActionBowDrawShoot_C_ExecuteUbergraph_AST_CharacterActionBowDrawShoot::EntryPoint' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionBowDrawShoot_C_ExecuteUbergraph_AST_CharacterActionBowDrawShoot, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'AST_CharacterActionBowDrawShoot_C_ExecuteUbergraph_AST_CharacterActionBowDrawShoot::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionBowDrawShoot_C_ExecuteUbergraph_AST_CharacterActionBowDrawShoot, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'AST_CharacterActionBowDrawShoot_C_ExecuteUbergraph_AST_CharacterActionBowDrawShoot::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionBowDrawShoot_C_ExecuteUbergraph_AST_CharacterActionBowDrawShoot, K2Node_CreateDelegate_OutputDelegate_2) == 0x000024, "Member 'AST_CharacterActionBowDrawShoot_C_ExecuteUbergraph_AST_CharacterActionBowDrawShoot::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionBowDrawShoot_C_ExecuteUbergraph_AST_CharacterActionBowDrawShoot, CallFunc_PlayAnimatedAction_Action) == 0x000038, "Member 'AST_CharacterActionBowDrawShoot_C_ExecuteUbergraph_AST_CharacterActionBowDrawShoot::CallFunc_PlayAnimatedAction_Action' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionBowDrawShoot_C_ExecuteUbergraph_AST_CharacterActionBowDrawShoot, CallFunc_PlayAnimatedAction_ReturnValue) == 0x000040, "Member 'AST_CharacterActionBowDrawShoot_C_ExecuteUbergraph_AST_CharacterActionBowDrawShoot::CallFunc_PlayAnimatedAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionBowDrawShoot_C_ExecuteUbergraph_AST_CharacterActionBowDrawShoot, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'AST_CharacterActionBowDrawShoot_C_ExecuteUbergraph_AST_CharacterActionBowDrawShoot::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionBowDrawShoot_C_ExecuteUbergraph_AST_CharacterActionBowDrawShoot, K2Node_Event_DeltaTime) == 0x00004C, "Member 'AST_CharacterActionBowDrawShoot_C_ExecuteUbergraph_AST_CharacterActionBowDrawShoot::K2Node_Event_DeltaTime' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionBowDrawShoot_C_ExecuteUbergraph_AST_CharacterActionBowDrawShoot, K2Node_CreateDelegate_OutputDelegate_3) == 0x000050, "Member 'AST_CharacterActionBowDrawShoot_C_ExecuteUbergraph_AST_CharacterActionBowDrawShoot::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionBowDrawShoot_C_ExecuteUbergraph_AST_CharacterActionBowDrawShoot, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000060, "Member 'AST_CharacterActionBowDrawShoot_C_ExecuteUbergraph_AST_CharacterActionBowDrawShoot::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionBowDrawShoot_C_ExecuteUbergraph_AST_CharacterActionBowDrawShoot, CallFunc_PlayAnimatedAction_Action_1) == 0x000068, "Member 'AST_CharacterActionBowDrawShoot_C_ExecuteUbergraph_AST_CharacterActionBowDrawShoot::CallFunc_PlayAnimatedAction_Action_1' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionBowDrawShoot_C_ExecuteUbergraph_AST_CharacterActionBowDrawShoot, CallFunc_PlayAnimatedAction_ReturnValue_1) == 0x000070, "Member 'AST_CharacterActionBowDrawShoot_C_ExecuteUbergraph_AST_CharacterActionBowDrawShoot::CallFunc_PlayAnimatedAction_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionBowDrawShoot_C_ExecuteUbergraph_AST_CharacterActionBowDrawShoot, CallFunc_IsValid_ReturnValue_1) == 0x000078, "Member 'AST_CharacterActionBowDrawShoot_C_ExecuteUbergraph_AST_CharacterActionBowDrawShoot::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionBowDrawShoot_C_ExecuteUbergraph_AST_CharacterActionBowDrawShoot, CallFunc_HasTag_ReturnValue) == 0x000079, "Member 'AST_CharacterActionBowDrawShoot_C_ExecuteUbergraph_AST_CharacterActionBowDrawShoot::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionBowDrawShoot_C_ExecuteUbergraph_AST_CharacterActionBowDrawShoot, CallFunc_HasTag_ReturnValue_1) == 0x00007A, "Member 'AST_CharacterActionBowDrawShoot_C_ExecuteUbergraph_AST_CharacterActionBowDrawShoot::CallFunc_HasTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionBowDrawShoot_C_ExecuteUbergraph_AST_CharacterActionBowDrawShoot, CallFunc_BooleanAND_ReturnValue) == 0x00007B, "Member 'AST_CharacterActionBowDrawShoot_C_ExecuteUbergraph_AST_CharacterActionBowDrawShoot::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionBowDrawShoot_C_ExecuteUbergraph_AST_CharacterActionBowDrawShoot, CallFunc_GetController_ReturnValue) == 0x000080, "Member 'AST_CharacterActionBowDrawShoot_C_ExecuteUbergraph_AST_CharacterActionBowDrawShoot::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionBowDrawShoot_C_ExecuteUbergraph_AST_CharacterActionBowDrawShoot, K2Node_DynamicCast_AsVAltar_Player_Controller) == 0x000088, "Member 'AST_CharacterActionBowDrawShoot_C_ExecuteUbergraph_AST_CharacterActionBowDrawShoot::K2Node_DynamicCast_AsVAltar_Player_Controller' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionBowDrawShoot_C_ExecuteUbergraph_AST_CharacterActionBowDrawShoot, K2Node_DynamicCast_bSuccess) == 0x000090, "Member 'AST_CharacterActionBowDrawShoot_C_ExecuteUbergraph_AST_CharacterActionBowDrawShoot::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionBowDrawShoot_C_ExecuteUbergraph_AST_CharacterActionBowDrawShoot, CallFunc_IsValid_ReturnValue_2) == 0x000091, "Member 'AST_CharacterActionBowDrawShoot_C_ExecuteUbergraph_AST_CharacterActionBowDrawShoot::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionBowDrawShoot_C_ExecuteUbergraph_AST_CharacterActionBowDrawShoot, CallFunc_HasGameplayTag_ReturnValue) == 0x000092, "Member 'AST_CharacterActionBowDrawShoot_C_ExecuteUbergraph_AST_CharacterActionBowDrawShoot::CallFunc_HasGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionBowDrawShoot_C_ExecuteUbergraph_AST_CharacterActionBowDrawShoot, CallFunc_Not_PreBool_ReturnValue) == 0x000093, "Member 'AST_CharacterActionBowDrawShoot_C_ExecuteUbergraph_AST_CharacterActionBowDrawShoot::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionBowDrawShoot_C_ExecuteUbergraph_AST_CharacterActionBowDrawShoot, CallFunc_BooleanAND_ReturnValue_1) == 0x000094, "Member 'AST_CharacterActionBowDrawShoot_C_ExecuteUbergraph_AST_CharacterActionBowDrawShoot::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionBowDrawShoot_C_ExecuteUbergraph_AST_CharacterActionBowDrawShoot, K2Node_VariableSet_DrawDuration_ImplicitCast) == 0x000098, "Member 'AST_CharacterActionBowDrawShoot_C_ExecuteUbergraph_AST_CharacterActionBowDrawShoot::K2Node_VariableSet_DrawDuration_ImplicitCast' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionBowDrawShoot_C_ExecuteUbergraph_AST_CharacterActionBowDrawShoot, CallFunc_Add_DoubleDouble_B_ImplicitCast) == 0x0000A0, "Member 'AST_CharacterActionBowDrawShoot_C_ExecuteUbergraph_AST_CharacterActionBowDrawShoot::CallFunc_Add_DoubleDouble_B_ImplicitCast' has a wrong offset!");

// Function AST_CharacterActionBowDrawShoot.AST_CharacterActionBowDrawShoot_C.OnStateUpdate
// 0x0004 (0x0004 - 0x0000)
struct AST_CharacterActionBowDrawShoot_C_OnStateUpdate final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AST_CharacterActionBowDrawShoot_C_OnStateUpdate) == 0x000004, "Wrong alignment on AST_CharacterActionBowDrawShoot_C_OnStateUpdate");
static_assert(sizeof(AST_CharacterActionBowDrawShoot_C_OnStateUpdate) == 0x000004, "Wrong size on AST_CharacterActionBowDrawShoot_C_OnStateUpdate");
static_assert(offsetof(AST_CharacterActionBowDrawShoot_C_OnStateUpdate, DeltaTime) == 0x000000, "Member 'AST_CharacterActionBowDrawShoot_C_OnStateUpdate::DeltaTime' has a wrong offset!");

// Function AST_CharacterActionBowDrawShoot.AST_CharacterActionBowDrawShoot_C.PerformBowAttack
// 0x0008 (0x0008 - 0x0000)
struct AST_CharacterActionBowDrawShoot_C_PerformBowAttack final
{
public:
	bool                                          CallFunc_IsSwimming_ReturnValue;                   // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SendBowAttack_DrawDuration_ImplicitCast;  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AST_CharacterActionBowDrawShoot_C_PerformBowAttack) == 0x000004, "Wrong alignment on AST_CharacterActionBowDrawShoot_C_PerformBowAttack");
static_assert(sizeof(AST_CharacterActionBowDrawShoot_C_PerformBowAttack) == 0x000008, "Wrong size on AST_CharacterActionBowDrawShoot_C_PerformBowAttack");
static_assert(offsetof(AST_CharacterActionBowDrawShoot_C_PerformBowAttack, CallFunc_IsSwimming_ReturnValue) == 0x000000, "Member 'AST_CharacterActionBowDrawShoot_C_PerformBowAttack::CallFunc_IsSwimming_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionBowDrawShoot_C_PerformBowAttack, CallFunc_SendBowAttack_DrawDuration_ImplicitCast) == 0x000004, "Member 'AST_CharacterActionBowDrawShoot_C_PerformBowAttack::CallFunc_SendBowAttack_DrawDuration_ImplicitCast' has a wrong offset!");

// Function AST_CharacterActionBowDrawShoot.AST_CharacterActionBowDrawShoot_C.ResetStateVariables
// 0x0008 (0x0008 - 0x0000)
struct AST_CharacterActionBowDrawShoot_C_ResetStateVariables final
{
public:
	double                                        CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AST_CharacterActionBowDrawShoot_C_ResetStateVariables) == 0x000008, "Wrong alignment on AST_CharacterActionBowDrawShoot_C_ResetStateVariables");
static_assert(sizeof(AST_CharacterActionBowDrawShoot_C_ResetStateVariables) == 0x000008, "Wrong size on AST_CharacterActionBowDrawShoot_C_ResetStateVariables");
static_assert(offsetof(AST_CharacterActionBowDrawShoot_C_ResetStateVariables, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000000, "Member 'AST_CharacterActionBowDrawShoot_C_ResetStateVariables::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");

// Function AST_CharacterActionBowDrawShoot.AST_CharacterActionBowDrawShoot_C.StartAiming
// 0x0030 (0x0030 - 0x0000)
struct AST_CharacterActionBowDrawShoot_C_StartAiming final
{
public:
	class AVOblivionPlayerCharacter*              K2Node_DynamicCast_AsVOblivion_Player_Character;   // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AVAltarPlayerController*                K2Node_DynamicCast_AsVAltar_Player_Controller;     // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AST_CharacterActionBowDrawShoot_C_StartAiming) == 0x000008, "Wrong alignment on AST_CharacterActionBowDrawShoot_C_StartAiming");
static_assert(sizeof(AST_CharacterActionBowDrawShoot_C_StartAiming) == 0x000030, "Wrong size on AST_CharacterActionBowDrawShoot_C_StartAiming");
static_assert(offsetof(AST_CharacterActionBowDrawShoot_C_StartAiming, K2Node_DynamicCast_AsVOblivion_Player_Character) == 0x000000, "Member 'AST_CharacterActionBowDrawShoot_C_StartAiming::K2Node_DynamicCast_AsVOblivion_Player_Character' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionBowDrawShoot_C_StartAiming, K2Node_DynamicCast_bSuccess) == 0x000008, "Member 'AST_CharacterActionBowDrawShoot_C_StartAiming::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionBowDrawShoot_C_StartAiming, CallFunc_GetController_ReturnValue) == 0x000010, "Member 'AST_CharacterActionBowDrawShoot_C_StartAiming::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionBowDrawShoot_C_StartAiming, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'AST_CharacterActionBowDrawShoot_C_StartAiming::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionBowDrawShoot_C_StartAiming, K2Node_DynamicCast_AsVAltar_Player_Controller) == 0x000020, "Member 'AST_CharacterActionBowDrawShoot_C_StartAiming::K2Node_DynamicCast_AsVAltar_Player_Controller' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionBowDrawShoot_C_StartAiming, K2Node_DynamicCast_bSuccess_1) == 0x000028, "Member 'AST_CharacterActionBowDrawShoot_C_StartAiming::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function AST_CharacterActionBowDrawShoot.AST_CharacterActionBowDrawShoot_C.StopAiming
// 0x0028 (0x0028 - 0x0000)
struct AST_CharacterActionBowDrawShoot_C_StopAiming final
{
public:
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AVAltarPlayerController*                K2Node_DynamicCast_AsVAltar_Player_Controller;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AVOblivionPlayerCharacter*              K2Node_DynamicCast_AsVOblivion_Player_Character;   // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AST_CharacterActionBowDrawShoot_C_StopAiming) == 0x000008, "Wrong alignment on AST_CharacterActionBowDrawShoot_C_StopAiming");
static_assert(sizeof(AST_CharacterActionBowDrawShoot_C_StopAiming) == 0x000028, "Wrong size on AST_CharacterActionBowDrawShoot_C_StopAiming");
static_assert(offsetof(AST_CharacterActionBowDrawShoot_C_StopAiming, CallFunc_GetController_ReturnValue) == 0x000000, "Member 'AST_CharacterActionBowDrawShoot_C_StopAiming::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionBowDrawShoot_C_StopAiming, K2Node_DynamicCast_AsVAltar_Player_Controller) == 0x000008, "Member 'AST_CharacterActionBowDrawShoot_C_StopAiming::K2Node_DynamicCast_AsVAltar_Player_Controller' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionBowDrawShoot_C_StopAiming, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'AST_CharacterActionBowDrawShoot_C_StopAiming::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionBowDrawShoot_C_StopAiming, K2Node_DynamicCast_AsVOblivion_Player_Character) == 0x000018, "Member 'AST_CharacterActionBowDrawShoot_C_StopAiming::K2Node_DynamicCast_AsVOblivion_Player_Character' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionBowDrawShoot_C_StopAiming, K2Node_DynamicCast_bSuccess_1) == 0x000020, "Member 'AST_CharacterActionBowDrawShoot_C_StopAiming::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionBowDrawShoot_C_StopAiming, CallFunc_IsValid_ReturnValue) == 0x000021, "Member 'AST_CharacterActionBowDrawShoot_C_StopAiming::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function AST_CharacterActionBowDrawShoot.AST_CharacterActionBowDrawShoot_C.Zoom
// 0x0058 (0x0058 - 0x0000)
struct AST_CharacterActionBowDrawShoot_C_Zoom final
{
public:
	bool                                          Exit;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromTag_ReturnValue; // 0x0008(0x0020)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromTag_ReturnValue_1; // 0x0030(0x0020)()
	bool                                          CallFunc_HasTag_ReturnValue_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AST_CharacterActionBowDrawShoot_C_Zoom) == 0x000008, "Wrong alignment on AST_CharacterActionBowDrawShoot_C_Zoom");
static_assert(sizeof(AST_CharacterActionBowDrawShoot_C_Zoom) == 0x000058, "Wrong size on AST_CharacterActionBowDrawShoot_C_Zoom");
static_assert(offsetof(AST_CharacterActionBowDrawShoot_C_Zoom, Exit) == 0x000000, "Member 'AST_CharacterActionBowDrawShoot_C_Zoom::Exit' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionBowDrawShoot_C_Zoom, CallFunc_MakeGameplayTagContainerFromTag_ReturnValue) == 0x000008, "Member 'AST_CharacterActionBowDrawShoot_C_Zoom::CallFunc_MakeGameplayTagContainerFromTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionBowDrawShoot_C_Zoom, CallFunc_Not_PreBool_ReturnValue) == 0x000028, "Member 'AST_CharacterActionBowDrawShoot_C_Zoom::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionBowDrawShoot_C_Zoom, CallFunc_HasTag_ReturnValue) == 0x000029, "Member 'AST_CharacterActionBowDrawShoot_C_Zoom::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionBowDrawShoot_C_Zoom, CallFunc_MakeGameplayTagContainerFromTag_ReturnValue_1) == 0x000030, "Member 'AST_CharacterActionBowDrawShoot_C_Zoom::CallFunc_MakeGameplayTagContainerFromTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionBowDrawShoot_C_Zoom, CallFunc_HasTag_ReturnValue_1) == 0x000050, "Member 'AST_CharacterActionBowDrawShoot_C_Zoom::CallFunc_HasTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionBowDrawShoot_C_Zoom, CallFunc_BooleanAND_ReturnValue) == 0x000051, "Member 'AST_CharacterActionBowDrawShoot_C_Zoom::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

