#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AST_CharacterActionSpellCasting

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function AST_CharacterActionSpellCasting.AST_CharacterActionSpellCasting_C.ExecuteUbergraph_AST_CharacterActionSpellCasting
// 0x0038 (0x0038 - 0x0000)
struct AST_CharacterActionSpellCasting_C_ExecuteUbergraph_AST_CharacterActionSpellCasting final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_GetCastActionTag_Action_Tag;              // 0x0014(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVActorBehaviorBase*                    CallFunc_StartBehaviorFromTag_StartedBehavior;     // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UActionStateStartBehavior*              CallFunc_StartBehaviorFromTag_ReturnValue;         // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AST_CharacterActionSpellCasting_C_ExecuteUbergraph_AST_CharacterActionSpellCasting) == 0x000008, "Wrong alignment on AST_CharacterActionSpellCasting_C_ExecuteUbergraph_AST_CharacterActionSpellCasting");
static_assert(sizeof(AST_CharacterActionSpellCasting_C_ExecuteUbergraph_AST_CharacterActionSpellCasting) == 0x000038, "Wrong size on AST_CharacterActionSpellCasting_C_ExecuteUbergraph_AST_CharacterActionSpellCasting");
static_assert(offsetof(AST_CharacterActionSpellCasting_C_ExecuteUbergraph_AST_CharacterActionSpellCasting, EntryPoint) == 0x000000, "Member 'AST_CharacterActionSpellCasting_C_ExecuteUbergraph_AST_CharacterActionSpellCasting::EntryPoint' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionSpellCasting_C_ExecuteUbergraph_AST_CharacterActionSpellCasting, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'AST_CharacterActionSpellCasting_C_ExecuteUbergraph_AST_CharacterActionSpellCasting::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionSpellCasting_C_ExecuteUbergraph_AST_CharacterActionSpellCasting, CallFunc_GetCastActionTag_Action_Tag) == 0x000014, "Member 'AST_CharacterActionSpellCasting_C_ExecuteUbergraph_AST_CharacterActionSpellCasting::CallFunc_GetCastActionTag_Action_Tag' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionSpellCasting_C_ExecuteUbergraph_AST_CharacterActionSpellCasting, CallFunc_StartBehaviorFromTag_StartedBehavior) == 0x000020, "Member 'AST_CharacterActionSpellCasting_C_ExecuteUbergraph_AST_CharacterActionSpellCasting::CallFunc_StartBehaviorFromTag_StartedBehavior' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionSpellCasting_C_ExecuteUbergraph_AST_CharacterActionSpellCasting, CallFunc_StartBehaviorFromTag_ReturnValue) == 0x000028, "Member 'AST_CharacterActionSpellCasting_C_ExecuteUbergraph_AST_CharacterActionSpellCasting::CallFunc_StartBehaviorFromTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionSpellCasting_C_ExecuteUbergraph_AST_CharacterActionSpellCasting, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'AST_CharacterActionSpellCasting_C_ExecuteUbergraph_AST_CharacterActionSpellCasting::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function AST_CharacterActionSpellCasting.AST_CharacterActionSpellCasting_C.GetCastActionTag
// 0x0010 (0x0010 - 0x0000)
struct AST_CharacterActionSpellCasting_C_GetCastActionTag final
{
public:
	struct FGameplayTag                           Action_Tag;                                        // 0x0000(0x0008)(Parm, OutParm, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldUseRightCast;                                // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTorchHeld_ReturnValue;                  // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasShieldEquipped_ReturnValue;            // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AST_CharacterActionSpellCasting_C_GetCastActionTag) == 0x000004, "Wrong alignment on AST_CharacterActionSpellCasting_C_GetCastActionTag");
static_assert(sizeof(AST_CharacterActionSpellCasting_C_GetCastActionTag) == 0x000010, "Wrong size on AST_CharacterActionSpellCasting_C_GetCastActionTag");
static_assert(offsetof(AST_CharacterActionSpellCasting_C_GetCastActionTag, Action_Tag) == 0x000000, "Member 'AST_CharacterActionSpellCasting_C_GetCastActionTag::Action_Tag' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionSpellCasting_C_GetCastActionTag, ShouldUseRightCast) == 0x000008, "Member 'AST_CharacterActionSpellCasting_C_GetCastActionTag::ShouldUseRightCast' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionSpellCasting_C_GetCastActionTag, CallFunc_IsTorchHeld_ReturnValue) == 0x000009, "Member 'AST_CharacterActionSpellCasting_C_GetCastActionTag::CallFunc_IsTorchHeld_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionSpellCasting_C_GetCastActionTag, CallFunc_HasTag_ReturnValue) == 0x00000A, "Member 'AST_CharacterActionSpellCasting_C_GetCastActionTag::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionSpellCasting_C_GetCastActionTag, CallFunc_HasShieldEquipped_ReturnValue) == 0x00000B, "Member 'AST_CharacterActionSpellCasting_C_GetCastActionTag::CallFunc_HasShieldEquipped_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionSpellCasting_C_GetCastActionTag, CallFunc_BooleanAND_ReturnValue) == 0x00000C, "Member 'AST_CharacterActionSpellCasting_C_GetCastActionTag::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionSpellCasting_C_GetCastActionTag, CallFunc_BooleanOR_ReturnValue) == 0x00000D, "Member 'AST_CharacterActionSpellCasting_C_GetCastActionTag::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionSpellCasting_C_GetCastActionTag, CallFunc_BooleanOR_ReturnValue_1) == 0x00000E, "Member 'AST_CharacterActionSpellCasting_C_GetCastActionTag::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AST_CharacterActionSpellCasting_C_GetCastActionTag, K2Node_SwitchEnum_CmpSuccess) == 0x00000F, "Member 'AST_CharacterActionSpellCasting_C_GetCastActionTag::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

}

