#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AST_Persuasion

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AST_CameraBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AST_Persuasion.AST_Persuasion_C
// 0x0018 (0x0398 - 0x0380)
class UAST_Persuasion_C final : public UAST_CameraBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_AST_Persuasion_C;                   // 0x0380(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AVAltarPlayerCameraManager*             Camera_Manager;                                    // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        Timer;                                             // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnStateUpdate(float DeltaTime);
	void OnExited();
	void OnEntered();
	void ExecuteUbergraph_AST_Persuasion(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AST_Persuasion_C">();
	}
	static class UAST_Persuasion_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAST_Persuasion_C>();
	}
};
static_assert(alignof(UAST_Persuasion_C) == 0x000008, "Wrong alignment on UAST_Persuasion_C");
static_assert(sizeof(UAST_Persuasion_C) == 0x000398, "Wrong size on UAST_Persuasion_C");
static_assert(offsetof(UAST_Persuasion_C, UberGraphFrame_AST_Persuasion_C) == 0x000380, "Member 'UAST_Persuasion_C::UberGraphFrame_AST_Persuasion_C' has a wrong offset!");
static_assert(offsetof(UAST_Persuasion_C, Camera_Manager) == 0x000388, "Member 'UAST_Persuasion_C::Camera_Manager' has a wrong offset!");
static_assert(offsetof(UAST_Persuasion_C, Timer) == 0x000390, "Member 'UAST_Persuasion_C::Timer' has a wrong offset!");

}

