#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AST_CharacterGetUp

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AST_CharacterSingleActionState_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AST_CharacterGetUp.AST_CharacterGetUp_C
// 0x0018 (0x00D8 - 0x00C0)
class UAST_CharacterGetUp_C final : public UAST_CharacterSingleActionState_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_AST_CharacterGetUp_C;               // 0x00C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AVPairedPawn*                           _PairedPawn;                                       // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	EMovementMode                                 PreviousMovementMode;                              // 0x00D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PreviousControlleDesiredRotation;                  // 0x00D1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AST_CharacterGetUp(int32 EntryPoint);
	void GetAnimTagsOverride(struct FGameplayTag* OutGameplayTag);
	void OnEntered();
	void OnExited();
	void PostInit();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AST_CharacterGetUp_C">();
	}
	static class UAST_CharacterGetUp_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAST_CharacterGetUp_C>();
	}
};
static_assert(alignof(UAST_CharacterGetUp_C) == 0x000008, "Wrong alignment on UAST_CharacterGetUp_C");
static_assert(sizeof(UAST_CharacterGetUp_C) == 0x0000D8, "Wrong size on UAST_CharacterGetUp_C");
static_assert(offsetof(UAST_CharacterGetUp_C, UberGraphFrame_AST_CharacterGetUp_C) == 0x0000C0, "Member 'UAST_CharacterGetUp_C::UberGraphFrame_AST_CharacterGetUp_C' has a wrong offset!");
static_assert(offsetof(UAST_CharacterGetUp_C, _PairedPawn) == 0x0000C8, "Member 'UAST_CharacterGetUp_C::_PairedPawn' has a wrong offset!");
static_assert(offsetof(UAST_CharacterGetUp_C, PreviousMovementMode) == 0x0000D0, "Member 'UAST_CharacterGetUp_C::PreviousMovementMode' has a wrong offset!");
static_assert(offsetof(UAST_CharacterGetUp_C, PreviousControlleDesiredRotation) == 0x0000D1, "Member 'UAST_CharacterGetUp_C::PreviousControlleDesiredRotation' has a wrong offset!");

}

