#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Behavior_Spellcast_Animated

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function Behavior_Spellcast_Animated.Behavior_Spellcast_Animated_C.ExecuteUbergraph_Behavior_Spellcast_Animated
// 0x00A0 (0x00A0 - 0x0000)
struct Behavior_Spellcast_Animated_C_ExecuteUbergraph_Behavior_Spellcast_Animated final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AVPairedPawn*                           CallFunc_GetControlledPawn_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& EventTag, const class UAnimNotifyActionEventInfo* EventSource)> K2Node_CreateDelegate_OutputDelegate_2; // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_GetCastActionTag_Action_Tag;              // 0x0040(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UVPawnAnimatedAction*                   CallFunc_PlayAnimatedAction_Action;                // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStateMachinePlayAnimatedAction*        CallFunc_PlayAnimatedAction_ReturnValue;           // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_EventTag;                       // 0x005C(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UAnimNotifyActionEventInfo*       K2Node_CustomEvent_EventSource;                    // 0x0068(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInterrupted;                         // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AVPairedPawn*                           CallFunc_GetControlledPawn_ReturnValue_1;          // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AVPairedPawn*                           CallFunc_GetControlledPawn_ReturnValue_2;          // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AVPairedPawn*                           CallFunc_GetControlledPawn_ReturnValue_3;          // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyTags_ReturnValue;                   // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AVPairedPawn*                           CallFunc_GetControlledPawn_ReturnValue_4;          // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Behavior_Spellcast_Animated_C_ExecuteUbergraph_Behavior_Spellcast_Animated) == 0x000008, "Wrong alignment on Behavior_Spellcast_Animated_C_ExecuteUbergraph_Behavior_Spellcast_Animated");
static_assert(sizeof(Behavior_Spellcast_Animated_C_ExecuteUbergraph_Behavior_Spellcast_Animated) == 0x0000A0, "Wrong size on Behavior_Spellcast_Animated_C_ExecuteUbergraph_Behavior_Spellcast_Animated");
static_assert(offsetof(Behavior_Spellcast_Animated_C_ExecuteUbergraph_Behavior_Spellcast_Animated, EntryPoint) == 0x000000, "Member 'Behavior_Spellcast_Animated_C_ExecuteUbergraph_Behavior_Spellcast_Animated::EntryPoint' has a wrong offset!");
static_assert(offsetof(Behavior_Spellcast_Animated_C_ExecuteUbergraph_Behavior_Spellcast_Animated, CallFunc_GetControlledPawn_ReturnValue) == 0x000008, "Member 'Behavior_Spellcast_Animated_C_ExecuteUbergraph_Behavior_Spellcast_Animated::CallFunc_GetControlledPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(Behavior_Spellcast_Animated_C_ExecuteUbergraph_Behavior_Spellcast_Animated, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'Behavior_Spellcast_Animated_C_ExecuteUbergraph_Behavior_Spellcast_Animated::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Behavior_Spellcast_Animated_C_ExecuteUbergraph_Behavior_Spellcast_Animated, K2Node_CreateDelegate_OutputDelegate_1) == 0x000020, "Member 'Behavior_Spellcast_Animated_C_ExecuteUbergraph_Behavior_Spellcast_Animated::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Behavior_Spellcast_Animated_C_ExecuteUbergraph_Behavior_Spellcast_Animated, K2Node_CreateDelegate_OutputDelegate_2) == 0x000030, "Member 'Behavior_Spellcast_Animated_C_ExecuteUbergraph_Behavior_Spellcast_Animated::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(Behavior_Spellcast_Animated_C_ExecuteUbergraph_Behavior_Spellcast_Animated, CallFunc_GetCastActionTag_Action_Tag) == 0x000040, "Member 'Behavior_Spellcast_Animated_C_ExecuteUbergraph_Behavior_Spellcast_Animated::CallFunc_GetCastActionTag_Action_Tag' has a wrong offset!");
static_assert(offsetof(Behavior_Spellcast_Animated_C_ExecuteUbergraph_Behavior_Spellcast_Animated, CallFunc_PlayAnimatedAction_Action) == 0x000048, "Member 'Behavior_Spellcast_Animated_C_ExecuteUbergraph_Behavior_Spellcast_Animated::CallFunc_PlayAnimatedAction_Action' has a wrong offset!");
static_assert(offsetof(Behavior_Spellcast_Animated_C_ExecuteUbergraph_Behavior_Spellcast_Animated, CallFunc_PlayAnimatedAction_ReturnValue) == 0x000050, "Member 'Behavior_Spellcast_Animated_C_ExecuteUbergraph_Behavior_Spellcast_Animated::CallFunc_PlayAnimatedAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(Behavior_Spellcast_Animated_C_ExecuteUbergraph_Behavior_Spellcast_Animated, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'Behavior_Spellcast_Animated_C_ExecuteUbergraph_Behavior_Spellcast_Animated::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Behavior_Spellcast_Animated_C_ExecuteUbergraph_Behavior_Spellcast_Animated, K2Node_CustomEvent_EventTag) == 0x00005C, "Member 'Behavior_Spellcast_Animated_C_ExecuteUbergraph_Behavior_Spellcast_Animated::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(Behavior_Spellcast_Animated_C_ExecuteUbergraph_Behavior_Spellcast_Animated, K2Node_CustomEvent_EventSource) == 0x000068, "Member 'Behavior_Spellcast_Animated_C_ExecuteUbergraph_Behavior_Spellcast_Animated::K2Node_CustomEvent_EventSource' has a wrong offset!");
static_assert(offsetof(Behavior_Spellcast_Animated_C_ExecuteUbergraph_Behavior_Spellcast_Animated, K2Node_Event_bInterrupted) == 0x000070, "Member 'Behavior_Spellcast_Animated_C_ExecuteUbergraph_Behavior_Spellcast_Animated::K2Node_Event_bInterrupted' has a wrong offset!");
static_assert(offsetof(Behavior_Spellcast_Animated_C_ExecuteUbergraph_Behavior_Spellcast_Animated, CallFunc_GetControlledPawn_ReturnValue_1) == 0x000078, "Member 'Behavior_Spellcast_Animated_C_ExecuteUbergraph_Behavior_Spellcast_Animated::CallFunc_GetControlledPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Behavior_Spellcast_Animated_C_ExecuteUbergraph_Behavior_Spellcast_Animated, CallFunc_GetControlledPawn_ReturnValue_2) == 0x000080, "Member 'Behavior_Spellcast_Animated_C_ExecuteUbergraph_Behavior_Spellcast_Animated::CallFunc_GetControlledPawn_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Behavior_Spellcast_Animated_C_ExecuteUbergraph_Behavior_Spellcast_Animated, CallFunc_GetControlledPawn_ReturnValue_3) == 0x000088, "Member 'Behavior_Spellcast_Animated_C_ExecuteUbergraph_Behavior_Spellcast_Animated::CallFunc_GetControlledPawn_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Behavior_Spellcast_Animated_C_ExecuteUbergraph_Behavior_Spellcast_Animated, CallFunc_HasAnyTags_ReturnValue) == 0x000090, "Member 'Behavior_Spellcast_Animated_C_ExecuteUbergraph_Behavior_Spellcast_Animated::CallFunc_HasAnyTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(Behavior_Spellcast_Animated_C_ExecuteUbergraph_Behavior_Spellcast_Animated, CallFunc_GetControlledPawn_ReturnValue_4) == 0x000098, "Member 'Behavior_Spellcast_Animated_C_ExecuteUbergraph_Behavior_Spellcast_Animated::CallFunc_GetControlledPawn_ReturnValue_4' has a wrong offset!");

// Function Behavior_Spellcast_Animated.Behavior_Spellcast_Animated_C.Find and Track Target
// 0x0040 (0x0040 - 0x0000)
struct Behavior_Spellcast_Animated_C_Find_and_Track_Target final
{
public:
	const class UVAnimNotify_ActionCameraTracking* Camera_Tracking_Window;                           // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Duration;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AVPairedPawn*                           CallFunc_GetControlledPawn_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AVPairedPawn*>                   CallFunc_GetAllActorsOfClass_OutActors;            // 0x0020(0x0010)(ReferenceParm)
	class AVPairedPawn*                           CallFunc_FindCameraTrackingTarget_ReturnValue;     // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldIgnoreTrackingOnTargetedPawn_ReturnValue; // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_StartCameraTrackingOnPawn_Duration_ImplicitCast; // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Behavior_Spellcast_Animated_C_Find_and_Track_Target) == 0x000008, "Wrong alignment on Behavior_Spellcast_Animated_C_Find_and_Track_Target");
static_assert(sizeof(Behavior_Spellcast_Animated_C_Find_and_Track_Target) == 0x000040, "Wrong size on Behavior_Spellcast_Animated_C_Find_and_Track_Target");
static_assert(offsetof(Behavior_Spellcast_Animated_C_Find_and_Track_Target, Camera_Tracking_Window) == 0x000000, "Member 'Behavior_Spellcast_Animated_C_Find_and_Track_Target::Camera_Tracking_Window' has a wrong offset!");
static_assert(offsetof(Behavior_Spellcast_Animated_C_Find_and_Track_Target, Duration) == 0x000008, "Member 'Behavior_Spellcast_Animated_C_Find_and_Track_Target::Duration' has a wrong offset!");
static_assert(offsetof(Behavior_Spellcast_Animated_C_Find_and_Track_Target, CallFunc_GetControlledPawn_ReturnValue) == 0x000010, "Member 'Behavior_Spellcast_Animated_C_Find_and_Track_Target::CallFunc_GetControlledPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(Behavior_Spellcast_Animated_C_Find_and_Track_Target, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'Behavior_Spellcast_Animated_C_Find_and_Track_Target::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Behavior_Spellcast_Animated_C_Find_and_Track_Target, CallFunc_GetAllActorsOfClass_OutActors) == 0x000020, "Member 'Behavior_Spellcast_Animated_C_Find_and_Track_Target::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(Behavior_Spellcast_Animated_C_Find_and_Track_Target, CallFunc_FindCameraTrackingTarget_ReturnValue) == 0x000030, "Member 'Behavior_Spellcast_Animated_C_Find_and_Track_Target::CallFunc_FindCameraTrackingTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(Behavior_Spellcast_Animated_C_Find_and_Track_Target, CallFunc_ShouldIgnoreTrackingOnTargetedPawn_ReturnValue) == 0x000038, "Member 'Behavior_Spellcast_Animated_C_Find_and_Track_Target::CallFunc_ShouldIgnoreTrackingOnTargetedPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(Behavior_Spellcast_Animated_C_Find_and_Track_Target, CallFunc_IsValid_ReturnValue_1) == 0x000039, "Member 'Behavior_Spellcast_Animated_C_Find_and_Track_Target::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Behavior_Spellcast_Animated_C_Find_and_Track_Target, CallFunc_StartCameraTrackingOnPawn_Duration_ImplicitCast) == 0x00003C, "Member 'Behavior_Spellcast_Animated_C_Find_and_Track_Target::CallFunc_StartCameraTrackingOnPawn_Duration_ImplicitCast' has a wrong offset!");

// Function Behavior_Spellcast_Animated.Behavior_Spellcast_Animated_C.GetCastActionTag
// 0x0030 (0x0030 - 0x0000)
struct Behavior_Spellcast_Animated_C_GetCastActionTag final
{
public:
	struct FGameplayTag                           Action_Tag;                                        // 0x0000(0x0008)(Parm, OutParm, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldUseRightCast;                                // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AVPairedPawn*                           CallFunc_GetControlledPawn_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTorchHeld_ReturnValue;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasShieldEquipped_ReturnValue;            // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AVPairedPawn*                           CallFunc_GetControlledPawn_ReturnValue_1;          // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Behavior_Spellcast_Animated_C_GetCastActionTag) == 0x000008, "Wrong alignment on Behavior_Spellcast_Animated_C_GetCastActionTag");
static_assert(sizeof(Behavior_Spellcast_Animated_C_GetCastActionTag) == 0x000030, "Wrong size on Behavior_Spellcast_Animated_C_GetCastActionTag");
static_assert(offsetof(Behavior_Spellcast_Animated_C_GetCastActionTag, Action_Tag) == 0x000000, "Member 'Behavior_Spellcast_Animated_C_GetCastActionTag::Action_Tag' has a wrong offset!");
static_assert(offsetof(Behavior_Spellcast_Animated_C_GetCastActionTag, ShouldUseRightCast) == 0x000008, "Member 'Behavior_Spellcast_Animated_C_GetCastActionTag::ShouldUseRightCast' has a wrong offset!");
static_assert(offsetof(Behavior_Spellcast_Animated_C_GetCastActionTag, CallFunc_GetControlledPawn_ReturnValue) == 0x000010, "Member 'Behavior_Spellcast_Animated_C_GetCastActionTag::CallFunc_GetControlledPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(Behavior_Spellcast_Animated_C_GetCastActionTag, CallFunc_HasTag_ReturnValue) == 0x000018, "Member 'Behavior_Spellcast_Animated_C_GetCastActionTag::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(Behavior_Spellcast_Animated_C_GetCastActionTag, CallFunc_IsTorchHeld_ReturnValue) == 0x000019, "Member 'Behavior_Spellcast_Animated_C_GetCastActionTag::CallFunc_IsTorchHeld_ReturnValue' has a wrong offset!");
static_assert(offsetof(Behavior_Spellcast_Animated_C_GetCastActionTag, CallFunc_BooleanAND_ReturnValue) == 0x00001A, "Member 'Behavior_Spellcast_Animated_C_GetCastActionTag::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Behavior_Spellcast_Animated_C_GetCastActionTag, CallFunc_HasShieldEquipped_ReturnValue) == 0x00001B, "Member 'Behavior_Spellcast_Animated_C_GetCastActionTag::CallFunc_HasShieldEquipped_ReturnValue' has a wrong offset!");
static_assert(offsetof(Behavior_Spellcast_Animated_C_GetCastActionTag, CallFunc_BooleanOR_ReturnValue) == 0x00001C, "Member 'Behavior_Spellcast_Animated_C_GetCastActionTag::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Behavior_Spellcast_Animated_C_GetCastActionTag, CallFunc_BooleanOR_ReturnValue_1) == 0x00001D, "Member 'Behavior_Spellcast_Animated_C_GetCastActionTag::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Behavior_Spellcast_Animated_C_GetCastActionTag, CallFunc_GetControlledPawn_ReturnValue_1) == 0x000020, "Member 'Behavior_Spellcast_Animated_C_GetCastActionTag::CallFunc_GetControlledPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Behavior_Spellcast_Animated_C_GetCastActionTag, K2Node_SwitchEnum_CmpSuccess) == 0x000028, "Member 'Behavior_Spellcast_Animated_C_GetCastActionTag::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function Behavior_Spellcast_Animated.Behavior_Spellcast_Animated_C.OnAnimatedActionEvent
// 0x0010 (0x0010 - 0x0000)
struct Behavior_Spellcast_Animated_C_OnAnimatedActionEvent final
{
public:
	struct FGameplayTag                           EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	const class UAnimNotifyActionEventInfo*       EventSource;                                       // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Behavior_Spellcast_Animated_C_OnAnimatedActionEvent) == 0x000008, "Wrong alignment on Behavior_Spellcast_Animated_C_OnAnimatedActionEvent");
static_assert(sizeof(Behavior_Spellcast_Animated_C_OnAnimatedActionEvent) == 0x000010, "Wrong size on Behavior_Spellcast_Animated_C_OnAnimatedActionEvent");
static_assert(offsetof(Behavior_Spellcast_Animated_C_OnAnimatedActionEvent, EventTag) == 0x000000, "Member 'Behavior_Spellcast_Animated_C_OnAnimatedActionEvent::EventTag' has a wrong offset!");
static_assert(offsetof(Behavior_Spellcast_Animated_C_OnAnimatedActionEvent, EventSource) == 0x000008, "Member 'Behavior_Spellcast_Animated_C_OnAnimatedActionEvent::EventSource' has a wrong offset!");

// Function Behavior_Spellcast_Animated.Behavior_Spellcast_Animated_C.OnControlledPawnAnimatedActionEvent
// 0x0050 (0x0050 - 0x0000)
struct Behavior_Spellcast_Animated_C_OnControlledPawnAnimatedActionEvent final
{
public:
	struct FGameplayTag                           EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class UAnimNotifyActionEventInfo*             Anim_Notify_Action_Event_Info;                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AVPairedPawn*                           CallFunc_GetControlledPawn_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AVAltarPlayerController*                K2Node_DynamicCast_AsVAltar_Player_Controller;     // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetNotifyDuration_ReturnValue;            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess;   // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UVAnimNotify_ActionCameraTracking* K2Node_DynamicCast_AsVAnim_Notify_Action_Camera_Tracking; // 0x0038(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesTag_ReturnValue;                   // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43[0x5];                                       // 0x0043(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Find_And_Track_Target_Duration_ImplicitCast; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Behavior_Spellcast_Animated_C_OnControlledPawnAnimatedActionEvent) == 0x000008, "Wrong alignment on Behavior_Spellcast_Animated_C_OnControlledPawnAnimatedActionEvent");
static_assert(sizeof(Behavior_Spellcast_Animated_C_OnControlledPawnAnimatedActionEvent) == 0x000050, "Wrong size on Behavior_Spellcast_Animated_C_OnControlledPawnAnimatedActionEvent");
static_assert(offsetof(Behavior_Spellcast_Animated_C_OnControlledPawnAnimatedActionEvent, EventTag) == 0x000000, "Member 'Behavior_Spellcast_Animated_C_OnControlledPawnAnimatedActionEvent::EventTag' has a wrong offset!");
static_assert(offsetof(Behavior_Spellcast_Animated_C_OnControlledPawnAnimatedActionEvent, Anim_Notify_Action_Event_Info) == 0x000008, "Member 'Behavior_Spellcast_Animated_C_OnControlledPawnAnimatedActionEvent::Anim_Notify_Action_Event_Info' has a wrong offset!");
static_assert(offsetof(Behavior_Spellcast_Animated_C_OnControlledPawnAnimatedActionEvent, CallFunc_GetControlledPawn_ReturnValue) == 0x000010, "Member 'Behavior_Spellcast_Animated_C_OnControlledPawnAnimatedActionEvent::CallFunc_GetControlledPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(Behavior_Spellcast_Animated_C_OnControlledPawnAnimatedActionEvent, CallFunc_GetController_ReturnValue) == 0x000018, "Member 'Behavior_Spellcast_Animated_C_OnControlledPawnAnimatedActionEvent::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Behavior_Spellcast_Animated_C_OnControlledPawnAnimatedActionEvent, K2Node_DynamicCast_AsVAltar_Player_Controller) == 0x000020, "Member 'Behavior_Spellcast_Animated_C_OnControlledPawnAnimatedActionEvent::K2Node_DynamicCast_AsVAltar_Player_Controller' has a wrong offset!");
static_assert(offsetof(Behavior_Spellcast_Animated_C_OnControlledPawnAnimatedActionEvent, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'Behavior_Spellcast_Animated_C_OnControlledPawnAnimatedActionEvent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Behavior_Spellcast_Animated_C_OnControlledPawnAnimatedActionEvent, CallFunc_GetNotifyDuration_ReturnValue) == 0x00002C, "Member 'Behavior_Spellcast_Animated_C_OnControlledPawnAnimatedActionEvent::CallFunc_GetNotifyDuration_ReturnValue' has a wrong offset!");
static_assert(offsetof(Behavior_Spellcast_Animated_C_OnControlledPawnAnimatedActionEvent, GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess) == 0x000030, "Member 'Behavior_Spellcast_Animated_C_OnControlledPawnAnimatedActionEvent::GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Behavior_Spellcast_Animated_C_OnControlledPawnAnimatedActionEvent, K2Node_DynamicCast_AsVAnim_Notify_Action_Camera_Tracking) == 0x000038, "Member 'Behavior_Spellcast_Animated_C_OnControlledPawnAnimatedActionEvent::K2Node_DynamicCast_AsVAnim_Notify_Action_Camera_Tracking' has a wrong offset!");
static_assert(offsetof(Behavior_Spellcast_Animated_C_OnControlledPawnAnimatedActionEvent, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'Behavior_Spellcast_Animated_C_OnControlledPawnAnimatedActionEvent::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Behavior_Spellcast_Animated_C_OnControlledPawnAnimatedActionEvent, CallFunc_MatchesTag_ReturnValue) == 0x000041, "Member 'Behavior_Spellcast_Animated_C_OnControlledPawnAnimatedActionEvent::CallFunc_MatchesTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(Behavior_Spellcast_Animated_C_OnControlledPawnAnimatedActionEvent, CallFunc_IsValid_ReturnValue) == 0x000042, "Member 'Behavior_Spellcast_Animated_C_OnControlledPawnAnimatedActionEvent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Behavior_Spellcast_Animated_C_OnControlledPawnAnimatedActionEvent, CallFunc_Find_And_Track_Target_Duration_ImplicitCast) == 0x000048, "Member 'Behavior_Spellcast_Animated_C_OnControlledPawnAnimatedActionEvent::CallFunc_Find_And_Track_Target_Duration_ImplicitCast' has a wrong offset!");

// Function Behavior_Spellcast_Animated.Behavior_Spellcast_Animated_C.OnEnd
// 0x0001 (0x0001 - 0x0000)
struct Behavior_Spellcast_Animated_C_OnEnd final
{
public:
	bool                                          bInterrupted;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Behavior_Spellcast_Animated_C_OnEnd) == 0x000001, "Wrong alignment on Behavior_Spellcast_Animated_C_OnEnd");
static_assert(sizeof(Behavior_Spellcast_Animated_C_OnEnd) == 0x000001, "Wrong size on Behavior_Spellcast_Animated_C_OnEnd");
static_assert(offsetof(Behavior_Spellcast_Animated_C_OnEnd, bInterrupted) == 0x000000, "Member 'Behavior_Spellcast_Animated_C_OnEnd::bInterrupted' has a wrong offset!");

}

