#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Behavior_PlaySingleAnimatedAction

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Altar_classes.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Behavior_PlaySingleAnimatedAction.Behavior_PlaySingleAnimatedAction_C
// 0x0028 (0x0078 - 0x0050)
class UBehavior_PlaySingleAnimatedAction_C : public UVActorBehaviorBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0050(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        DesiredDuration;                                   // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ActionTag;                                         // 0x0060(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	bool                                          AnimatedActionEnded;                               // 0x0068(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         AnimationIndex;                                    // 0x006C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVPawnAnimatedAction*                   PlayedAction;                                      // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Behavior_PlaySingleAnimatedAction(int32 EntryPoint);
	void OnCanceled_1055A2F247153AEE3EDEE2B334BB1AC1();
	void OnCompleted_1055A2F247153AEE3EDEE2B334BB1AC1();
	void OnEnd(bool bInterrupted);
	void OnInit();
	void OnUpdate(float DeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Behavior_PlaySingleAnimatedAction_C">();
	}
	static class UBehavior_PlaySingleAnimatedAction_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBehavior_PlaySingleAnimatedAction_C>();
	}
};
static_assert(alignof(UBehavior_PlaySingleAnimatedAction_C) == 0x000008, "Wrong alignment on UBehavior_PlaySingleAnimatedAction_C");
static_assert(sizeof(UBehavior_PlaySingleAnimatedAction_C) == 0x000078, "Wrong size on UBehavior_PlaySingleAnimatedAction_C");
static_assert(offsetof(UBehavior_PlaySingleAnimatedAction_C, UberGraphFrame) == 0x000050, "Member 'UBehavior_PlaySingleAnimatedAction_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBehavior_PlaySingleAnimatedAction_C, DesiredDuration) == 0x000058, "Member 'UBehavior_PlaySingleAnimatedAction_C::DesiredDuration' has a wrong offset!");
static_assert(offsetof(UBehavior_PlaySingleAnimatedAction_C, ActionTag) == 0x000060, "Member 'UBehavior_PlaySingleAnimatedAction_C::ActionTag' has a wrong offset!");
static_assert(offsetof(UBehavior_PlaySingleAnimatedAction_C, AnimatedActionEnded) == 0x000068, "Member 'UBehavior_PlaySingleAnimatedAction_C::AnimatedActionEnded' has a wrong offset!");
static_assert(offsetof(UBehavior_PlaySingleAnimatedAction_C, AnimationIndex) == 0x00006C, "Member 'UBehavior_PlaySingleAnimatedAction_C::AnimationIndex' has a wrong offset!");
static_assert(offsetof(UBehavior_PlaySingleAnimatedAction_C, PlayedAction) == 0x000070, "Member 'UBehavior_PlaySingleAnimatedAction_C::PlayedAction' has a wrong offset!");

}

