#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Behavior_PlaySingleAnimatedAction

#include "Basic.hpp"


namespace SDK::Params
{

// Function Behavior_PlaySingleAnimatedAction.Behavior_PlaySingleAnimatedAction_C.ExecuteUbergraph_Behavior_PlaySingleAnimatedAction
// 0x0050 (0x0050 - 0x0000)
struct Behavior_PlaySingleAnimatedAction_C_ExecuteUbergraph_Behavior_PlaySingleAnimatedAction final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AVPairedPawn*                           CallFunc_GetControlledPawn_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInterrupted;                         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTime;                            // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVPawnAnimatedAction*                   CallFunc_PlayAnimatedAction_Action;                // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStateMachinePlayAnimatedAction*        CallFunc_PlayAnimatedAction_ReturnValue;           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_PlayAnimatedAction_DesiredDuration_ImplicitCast; // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Behavior_PlaySingleAnimatedAction_C_ExecuteUbergraph_Behavior_PlaySingleAnimatedAction) == 0x000008, "Wrong alignment on Behavior_PlaySingleAnimatedAction_C_ExecuteUbergraph_Behavior_PlaySingleAnimatedAction");
static_assert(sizeof(Behavior_PlaySingleAnimatedAction_C_ExecuteUbergraph_Behavior_PlaySingleAnimatedAction) == 0x000050, "Wrong size on Behavior_PlaySingleAnimatedAction_C_ExecuteUbergraph_Behavior_PlaySingleAnimatedAction");
static_assert(offsetof(Behavior_PlaySingleAnimatedAction_C_ExecuteUbergraph_Behavior_PlaySingleAnimatedAction, EntryPoint) == 0x000000, "Member 'Behavior_PlaySingleAnimatedAction_C_ExecuteUbergraph_Behavior_PlaySingleAnimatedAction::EntryPoint' has a wrong offset!");
static_assert(offsetof(Behavior_PlaySingleAnimatedAction_C_ExecuteUbergraph_Behavior_PlaySingleAnimatedAction, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'Behavior_PlaySingleAnimatedAction_C_ExecuteUbergraph_Behavior_PlaySingleAnimatedAction::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Behavior_PlaySingleAnimatedAction_C_ExecuteUbergraph_Behavior_PlaySingleAnimatedAction, CallFunc_GetControlledPawn_ReturnValue) == 0x000018, "Member 'Behavior_PlaySingleAnimatedAction_C_ExecuteUbergraph_Behavior_PlaySingleAnimatedAction::CallFunc_GetControlledPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(Behavior_PlaySingleAnimatedAction_C_ExecuteUbergraph_Behavior_PlaySingleAnimatedAction, K2Node_Event_bInterrupted) == 0x000020, "Member 'Behavior_PlaySingleAnimatedAction_C_ExecuteUbergraph_Behavior_PlaySingleAnimatedAction::K2Node_Event_bInterrupted' has a wrong offset!");
static_assert(offsetof(Behavior_PlaySingleAnimatedAction_C_ExecuteUbergraph_Behavior_PlaySingleAnimatedAction, K2Node_CreateDelegate_OutputDelegate_1) == 0x000024, "Member 'Behavior_PlaySingleAnimatedAction_C_ExecuteUbergraph_Behavior_PlaySingleAnimatedAction::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Behavior_PlaySingleAnimatedAction_C_ExecuteUbergraph_Behavior_PlaySingleAnimatedAction, K2Node_Event_DeltaTime) == 0x000034, "Member 'Behavior_PlaySingleAnimatedAction_C_ExecuteUbergraph_Behavior_PlaySingleAnimatedAction::K2Node_Event_DeltaTime' has a wrong offset!");
static_assert(offsetof(Behavior_PlaySingleAnimatedAction_C_ExecuteUbergraph_Behavior_PlaySingleAnimatedAction, CallFunc_PlayAnimatedAction_Action) == 0x000038, "Member 'Behavior_PlaySingleAnimatedAction_C_ExecuteUbergraph_Behavior_PlaySingleAnimatedAction::CallFunc_PlayAnimatedAction_Action' has a wrong offset!");
static_assert(offsetof(Behavior_PlaySingleAnimatedAction_C_ExecuteUbergraph_Behavior_PlaySingleAnimatedAction, CallFunc_PlayAnimatedAction_ReturnValue) == 0x000040, "Member 'Behavior_PlaySingleAnimatedAction_C_ExecuteUbergraph_Behavior_PlaySingleAnimatedAction::CallFunc_PlayAnimatedAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(Behavior_PlaySingleAnimatedAction_C_ExecuteUbergraph_Behavior_PlaySingleAnimatedAction, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'Behavior_PlaySingleAnimatedAction_C_ExecuteUbergraph_Behavior_PlaySingleAnimatedAction::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Behavior_PlaySingleAnimatedAction_C_ExecuteUbergraph_Behavior_PlaySingleAnimatedAction, CallFunc_PlayAnimatedAction_DesiredDuration_ImplicitCast) == 0x00004C, "Member 'Behavior_PlaySingleAnimatedAction_C_ExecuteUbergraph_Behavior_PlaySingleAnimatedAction::CallFunc_PlayAnimatedAction_DesiredDuration_ImplicitCast' has a wrong offset!");

// Function Behavior_PlaySingleAnimatedAction.Behavior_PlaySingleAnimatedAction_C.OnEnd
// 0x0001 (0x0001 - 0x0000)
struct Behavior_PlaySingleAnimatedAction_C_OnEnd final
{
public:
	bool                                          bInterrupted;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Behavior_PlaySingleAnimatedAction_C_OnEnd) == 0x000001, "Wrong alignment on Behavior_PlaySingleAnimatedAction_C_OnEnd");
static_assert(sizeof(Behavior_PlaySingleAnimatedAction_C_OnEnd) == 0x000001, "Wrong size on Behavior_PlaySingleAnimatedAction_C_OnEnd");
static_assert(offsetof(Behavior_PlaySingleAnimatedAction_C_OnEnd, bInterrupted) == 0x000000, "Member 'Behavior_PlaySingleAnimatedAction_C_OnEnd::bInterrupted' has a wrong offset!");

// Function Behavior_PlaySingleAnimatedAction.Behavior_PlaySingleAnimatedAction_C.OnUpdate
// 0x0004 (0x0004 - 0x0000)
struct Behavior_PlaySingleAnimatedAction_C_OnUpdate final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Behavior_PlaySingleAnimatedAction_C_OnUpdate) == 0x000004, "Wrong alignment on Behavior_PlaySingleAnimatedAction_C_OnUpdate");
static_assert(sizeof(Behavior_PlaySingleAnimatedAction_C_OnUpdate) == 0x000004, "Wrong size on Behavior_PlaySingleAnimatedAction_C_OnUpdate");
static_assert(offsetof(Behavior_PlaySingleAnimatedAction_C_OnUpdate, DeltaTime) == 0x000000, "Member 'Behavior_PlaySingleAnimatedAction_C_OnUpdate::DeltaTime' has a wrong offset!");

}

