#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Behavior_RecoilNPC

#include "Basic.hpp"


namespace SDK::Params
{

// Function Behavior_RecoilNPC.Behavior_RecoilNPC_C.ExecuteUbergraph_Behavior_RecoilNPC
// 0x0050 (0x0050 - 0x0000)
struct Behavior_RecoilNPC_C_ExecuteUbergraph_Behavior_RecoilNPC final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInterrupted;                         // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AVPairedPawn*                           CallFunc_GetControlledPawn_ReturnValue;            // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AVPairedPawn*                           CallFunc_GetControlledPawn_ReturnValue_1;          // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVPawnAnimatedAction*                   CallFunc_PlayAnimatedAction_Action;                // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStateMachinePlayAnimatedAction*        CallFunc_PlayAnimatedAction_ReturnValue;           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Behavior_RecoilNPC_C_ExecuteUbergraph_Behavior_RecoilNPC) == 0x000008, "Wrong alignment on Behavior_RecoilNPC_C_ExecuteUbergraph_Behavior_RecoilNPC");
static_assert(sizeof(Behavior_RecoilNPC_C_ExecuteUbergraph_Behavior_RecoilNPC) == 0x000050, "Wrong size on Behavior_RecoilNPC_C_ExecuteUbergraph_Behavior_RecoilNPC");
static_assert(offsetof(Behavior_RecoilNPC_C_ExecuteUbergraph_Behavior_RecoilNPC, EntryPoint) == 0x000000, "Member 'Behavior_RecoilNPC_C_ExecuteUbergraph_Behavior_RecoilNPC::EntryPoint' has a wrong offset!");
static_assert(offsetof(Behavior_RecoilNPC_C_ExecuteUbergraph_Behavior_RecoilNPC, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'Behavior_RecoilNPC_C_ExecuteUbergraph_Behavior_RecoilNPC::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Behavior_RecoilNPC_C_ExecuteUbergraph_Behavior_RecoilNPC, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'Behavior_RecoilNPC_C_ExecuteUbergraph_Behavior_RecoilNPC::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Behavior_RecoilNPC_C_ExecuteUbergraph_Behavior_RecoilNPC, K2Node_Event_bInterrupted) == 0x000024, "Member 'Behavior_RecoilNPC_C_ExecuteUbergraph_Behavior_RecoilNPC::K2Node_Event_bInterrupted' has a wrong offset!");
static_assert(offsetof(Behavior_RecoilNPC_C_ExecuteUbergraph_Behavior_RecoilNPC, CallFunc_GetControlledPawn_ReturnValue) == 0x000028, "Member 'Behavior_RecoilNPC_C_ExecuteUbergraph_Behavior_RecoilNPC::CallFunc_GetControlledPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(Behavior_RecoilNPC_C_ExecuteUbergraph_Behavior_RecoilNPC, CallFunc_GetControlledPawn_ReturnValue_1) == 0x000030, "Member 'Behavior_RecoilNPC_C_ExecuteUbergraph_Behavior_RecoilNPC::CallFunc_GetControlledPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Behavior_RecoilNPC_C_ExecuteUbergraph_Behavior_RecoilNPC, CallFunc_PlayAnimatedAction_Action) == 0x000038, "Member 'Behavior_RecoilNPC_C_ExecuteUbergraph_Behavior_RecoilNPC::CallFunc_PlayAnimatedAction_Action' has a wrong offset!");
static_assert(offsetof(Behavior_RecoilNPC_C_ExecuteUbergraph_Behavior_RecoilNPC, CallFunc_PlayAnimatedAction_ReturnValue) == 0x000040, "Member 'Behavior_RecoilNPC_C_ExecuteUbergraph_Behavior_RecoilNPC::CallFunc_PlayAnimatedAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(Behavior_RecoilNPC_C_ExecuteUbergraph_Behavior_RecoilNPC, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'Behavior_RecoilNPC_C_ExecuteUbergraph_Behavior_RecoilNPC::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function Behavior_RecoilNPC.Behavior_RecoilNPC_C.OnEnd
// 0x0001 (0x0001 - 0x0000)
struct Behavior_RecoilNPC_C_OnEnd final
{
public:
	bool                                          bInterrupted;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Behavior_RecoilNPC_C_OnEnd) == 0x000001, "Wrong alignment on Behavior_RecoilNPC_C_OnEnd");
static_assert(sizeof(Behavior_RecoilNPC_C_OnEnd) == 0x000001, "Wrong size on Behavior_RecoilNPC_C_OnEnd");
static_assert(offsetof(Behavior_RecoilNPC_C_OnEnd, bInterrupted) == 0x000000, "Member 'Behavior_RecoilNPC_C_OnEnd::bInterrupted' has a wrong offset!");

}

