#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Behavior_Spellcast_Animated

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Altar_classes.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Behavior_Spellcast_Animated.Behavior_Spellcast_Animated_C
// 0x0040 (0x0090 - 0x0050)
class UBehavior_Spellcast_Animated_C final : public UVActorBehaviorBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0050(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTagContainer                  RotatingSpellCastAnimTags;                         // 0x0058(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	bool                                          ShouldDisableControllerRotation;                   // 0x0078(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVPawnAnimatedAction*                   AnimatedAction;                                    // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AVAltarPlayerController*                Player_controller;                                 // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Behavior_Spellcast_Animated(int32 EntryPoint);
	void Find_and_Track_Target(const class UVAnimNotify_ActionCameraTracking* Camera_Tracking_Window, double Duration);
	void GetCastActionTag(struct FGameplayTag* Action_Tag);
	void OnAnimatedActionEvent(const struct FGameplayTag& EventTag, const class UAnimNotifyActionEventInfo* EventSource);
	void OnCanceled_CC0E7A5B45750E42B4B4E7A29F35B9B3();
	void OnCompleted_CC0E7A5B45750E42B4B4E7A29F35B9B3();
	void OnControlledPawnAnimatedActionEvent(const struct FGameplayTag& EventTag, class UAnimNotifyActionEventInfo* Anim_Notify_Action_Event_Info);
	void OnEnd(bool bInterrupted);
	void OnInit();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Behavior_Spellcast_Animated_C">();
	}
	static class UBehavior_Spellcast_Animated_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBehavior_Spellcast_Animated_C>();
	}
};
static_assert(alignof(UBehavior_Spellcast_Animated_C) == 0x000008, "Wrong alignment on UBehavior_Spellcast_Animated_C");
static_assert(sizeof(UBehavior_Spellcast_Animated_C) == 0x000090, "Wrong size on UBehavior_Spellcast_Animated_C");
static_assert(offsetof(UBehavior_Spellcast_Animated_C, UberGraphFrame) == 0x000050, "Member 'UBehavior_Spellcast_Animated_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBehavior_Spellcast_Animated_C, RotatingSpellCastAnimTags) == 0x000058, "Member 'UBehavior_Spellcast_Animated_C::RotatingSpellCastAnimTags' has a wrong offset!");
static_assert(offsetof(UBehavior_Spellcast_Animated_C, ShouldDisableControllerRotation) == 0x000078, "Member 'UBehavior_Spellcast_Animated_C::ShouldDisableControllerRotation' has a wrong offset!");
static_assert(offsetof(UBehavior_Spellcast_Animated_C, AnimatedAction) == 0x000080, "Member 'UBehavior_Spellcast_Animated_C::AnimatedAction' has a wrong offset!");
static_assert(offsetof(UBehavior_Spellcast_Animated_C, Player_controller) == 0x000088, "Member 'UBehavior_Spellcast_Animated_C::Player_controller' has a wrong offset!");

}

