#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Behavior_Death_Animation

#include "Basic.hpp"


namespace SDK::Params
{

// Function Behavior_Death_Animation.Behavior_Death_Animation_C.ExecuteUbergraph_Behavior_Death_Animation
// 0x00B8 (0x00B8 - 0x0000)
struct Behavior_Death_Animation_C_ExecuteUbergraph_Behavior_Death_Animation final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x002C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x003C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0054(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_DynamicCast_AsAnim_Montage;                 // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AVPairedPawn*                           CallFunc_GetControlledPawn_ReturnValue;            // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x0080(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x009C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x00AC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Behavior_Death_Animation_C_ExecuteUbergraph_Behavior_Death_Animation) == 0x000008, "Wrong alignment on Behavior_Death_Animation_C_ExecuteUbergraph_Behavior_Death_Animation");
static_assert(sizeof(Behavior_Death_Animation_C_ExecuteUbergraph_Behavior_Death_Animation) == 0x0000B8, "Wrong size on Behavior_Death_Animation_C_ExecuteUbergraph_Behavior_Death_Animation");
static_assert(offsetof(Behavior_Death_Animation_C_ExecuteUbergraph_Behavior_Death_Animation, EntryPoint) == 0x000000, "Member 'Behavior_Death_Animation_C_ExecuteUbergraph_Behavior_Death_Animation::EntryPoint' has a wrong offset!");
static_assert(offsetof(Behavior_Death_Animation_C_ExecuteUbergraph_Behavior_Death_Animation, K2Node_CustomEvent_NotifyName_3) == 0x000004, "Member 'Behavior_Death_Animation_C_ExecuteUbergraph_Behavior_Death_Animation::K2Node_CustomEvent_NotifyName_3' has a wrong offset!");
static_assert(offsetof(Behavior_Death_Animation_C_ExecuteUbergraph_Behavior_Death_Animation, K2Node_CustomEvent_NotifyName_2) == 0x00000C, "Member 'Behavior_Death_Animation_C_ExecuteUbergraph_Behavior_Death_Animation::K2Node_CustomEvent_NotifyName_2' has a wrong offset!");
static_assert(offsetof(Behavior_Death_Animation_C_ExecuteUbergraph_Behavior_Death_Animation, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'Behavior_Death_Animation_C_ExecuteUbergraph_Behavior_Death_Animation::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Behavior_Death_Animation_C_ExecuteUbergraph_Behavior_Death_Animation, K2Node_CustomEvent_NotifyName_1) == 0x000024, "Member 'Behavior_Death_Animation_C_ExecuteUbergraph_Behavior_Death_Animation::K2Node_CustomEvent_NotifyName_1' has a wrong offset!");
static_assert(offsetof(Behavior_Death_Animation_C_ExecuteUbergraph_Behavior_Death_Animation, K2Node_CreateDelegate_OutputDelegate_1) == 0x00002C, "Member 'Behavior_Death_Animation_C_ExecuteUbergraph_Behavior_Death_Animation::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Behavior_Death_Animation_C_ExecuteUbergraph_Behavior_Death_Animation, K2Node_CustomEvent_NotifyName) == 0x00003C, "Member 'Behavior_Death_Animation_C_ExecuteUbergraph_Behavior_Death_Animation::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(Behavior_Death_Animation_C_ExecuteUbergraph_Behavior_Death_Animation, K2Node_CreateDelegate_OutputDelegate_2) == 0x000044, "Member 'Behavior_Death_Animation_C_ExecuteUbergraph_Behavior_Death_Animation::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(Behavior_Death_Animation_C_ExecuteUbergraph_Behavior_Death_Animation, Temp_name_Variable) == 0x000054, "Member 'Behavior_Death_Animation_C_ExecuteUbergraph_Behavior_Death_Animation::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(Behavior_Death_Animation_C_ExecuteUbergraph_Behavior_Death_Animation, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x00005C, "Member 'Behavior_Death_Animation_C_ExecuteUbergraph_Behavior_Death_Animation::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(Behavior_Death_Animation_C_ExecuteUbergraph_Behavior_Death_Animation, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000060, "Member 'Behavior_Death_Animation_C_ExecuteUbergraph_Behavior_Death_Animation::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Behavior_Death_Animation_C_ExecuteUbergraph_Behavior_Death_Animation, K2Node_DynamicCast_AsAnim_Montage) == 0x000068, "Member 'Behavior_Death_Animation_C_ExecuteUbergraph_Behavior_Death_Animation::K2Node_DynamicCast_AsAnim_Montage' has a wrong offset!");
static_assert(offsetof(Behavior_Death_Animation_C_ExecuteUbergraph_Behavior_Death_Animation, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'Behavior_Death_Animation_C_ExecuteUbergraph_Behavior_Death_Animation::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Behavior_Death_Animation_C_ExecuteUbergraph_Behavior_Death_Animation, CallFunc_IsValid_ReturnValue) == 0x000071, "Member 'Behavior_Death_Animation_C_ExecuteUbergraph_Behavior_Death_Animation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Behavior_Death_Animation_C_ExecuteUbergraph_Behavior_Death_Animation, CallFunc_GetControlledPawn_ReturnValue) == 0x000078, "Member 'Behavior_Death_Animation_C_ExecuteUbergraph_Behavior_Death_Animation::CallFunc_GetControlledPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(Behavior_Death_Animation_C_ExecuteUbergraph_Behavior_Death_Animation, K2Node_CreateDelegate_OutputDelegate_3) == 0x000080, "Member 'Behavior_Death_Animation_C_ExecuteUbergraph_Behavior_Death_Animation::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(Behavior_Death_Animation_C_ExecuteUbergraph_Behavior_Death_Animation, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue) == 0x000090, "Member 'Behavior_Death_Animation_C_ExecuteUbergraph_Behavior_Death_Animation::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(Behavior_Death_Animation_C_ExecuteUbergraph_Behavior_Death_Animation, CallFunc_IsValid_ReturnValue_1) == 0x000098, "Member 'Behavior_Death_Animation_C_ExecuteUbergraph_Behavior_Death_Animation::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Behavior_Death_Animation_C_ExecuteUbergraph_Behavior_Death_Animation, K2Node_CreateDelegate_OutputDelegate_4) == 0x00009C, "Member 'Behavior_Death_Animation_C_ExecuteUbergraph_Behavior_Death_Animation::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(Behavior_Death_Animation_C_ExecuteUbergraph_Behavior_Death_Animation, K2Node_CustomEvent_NotifyName_4) == 0x0000AC, "Member 'Behavior_Death_Animation_C_ExecuteUbergraph_Behavior_Death_Animation::K2Node_CustomEvent_NotifyName_4' has a wrong offset!");

// Function Behavior_Death_Animation.Behavior_Death_Animation_C.OnBlendOut_1464FB71440D0E08F22AD7AEF6FC4670
// 0x0008 (0x0008 - 0x0000)
struct Behavior_Death_Animation_C_OnBlendOut_1464FB71440D0E08F22AD7AEF6FC4670 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Behavior_Death_Animation_C_OnBlendOut_1464FB71440D0E08F22AD7AEF6FC4670) == 0x000004, "Wrong alignment on Behavior_Death_Animation_C_OnBlendOut_1464FB71440D0E08F22AD7AEF6FC4670");
static_assert(sizeof(Behavior_Death_Animation_C_OnBlendOut_1464FB71440D0E08F22AD7AEF6FC4670) == 0x000008, "Wrong size on Behavior_Death_Animation_C_OnBlendOut_1464FB71440D0E08F22AD7AEF6FC4670");
static_assert(offsetof(Behavior_Death_Animation_C_OnBlendOut_1464FB71440D0E08F22AD7AEF6FC4670, NotifyName) == 0x000000, "Member 'Behavior_Death_Animation_C_OnBlendOut_1464FB71440D0E08F22AD7AEF6FC4670::NotifyName' has a wrong offset!");

// Function Behavior_Death_Animation.Behavior_Death_Animation_C.OnCompleted_1464FB71440D0E08F22AD7AEF6FC4670
// 0x0008 (0x0008 - 0x0000)
struct Behavior_Death_Animation_C_OnCompleted_1464FB71440D0E08F22AD7AEF6FC4670 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Behavior_Death_Animation_C_OnCompleted_1464FB71440D0E08F22AD7AEF6FC4670) == 0x000004, "Wrong alignment on Behavior_Death_Animation_C_OnCompleted_1464FB71440D0E08F22AD7AEF6FC4670");
static_assert(sizeof(Behavior_Death_Animation_C_OnCompleted_1464FB71440D0E08F22AD7AEF6FC4670) == 0x000008, "Wrong size on Behavior_Death_Animation_C_OnCompleted_1464FB71440D0E08F22AD7AEF6FC4670");
static_assert(offsetof(Behavior_Death_Animation_C_OnCompleted_1464FB71440D0E08F22AD7AEF6FC4670, NotifyName) == 0x000000, "Member 'Behavior_Death_Animation_C_OnCompleted_1464FB71440D0E08F22AD7AEF6FC4670::NotifyName' has a wrong offset!");

// Function Behavior_Death_Animation.Behavior_Death_Animation_C.OnInterrupted_1464FB71440D0E08F22AD7AEF6FC4670
// 0x0008 (0x0008 - 0x0000)
struct Behavior_Death_Animation_C_OnInterrupted_1464FB71440D0E08F22AD7AEF6FC4670 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Behavior_Death_Animation_C_OnInterrupted_1464FB71440D0E08F22AD7AEF6FC4670) == 0x000004, "Wrong alignment on Behavior_Death_Animation_C_OnInterrupted_1464FB71440D0E08F22AD7AEF6FC4670");
static_assert(sizeof(Behavior_Death_Animation_C_OnInterrupted_1464FB71440D0E08F22AD7AEF6FC4670) == 0x000008, "Wrong size on Behavior_Death_Animation_C_OnInterrupted_1464FB71440D0E08F22AD7AEF6FC4670");
static_assert(offsetof(Behavior_Death_Animation_C_OnInterrupted_1464FB71440D0E08F22AD7AEF6FC4670, NotifyName) == 0x000000, "Member 'Behavior_Death_Animation_C_OnInterrupted_1464FB71440D0E08F22AD7AEF6FC4670::NotifyName' has a wrong offset!");

// Function Behavior_Death_Animation.Behavior_Death_Animation_C.OnNotifyBegin_1464FB71440D0E08F22AD7AEF6FC4670
// 0x0008 (0x0008 - 0x0000)
struct Behavior_Death_Animation_C_OnNotifyBegin_1464FB71440D0E08F22AD7AEF6FC4670 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Behavior_Death_Animation_C_OnNotifyBegin_1464FB71440D0E08F22AD7AEF6FC4670) == 0x000004, "Wrong alignment on Behavior_Death_Animation_C_OnNotifyBegin_1464FB71440D0E08F22AD7AEF6FC4670");
static_assert(sizeof(Behavior_Death_Animation_C_OnNotifyBegin_1464FB71440D0E08F22AD7AEF6FC4670) == 0x000008, "Wrong size on Behavior_Death_Animation_C_OnNotifyBegin_1464FB71440D0E08F22AD7AEF6FC4670");
static_assert(offsetof(Behavior_Death_Animation_C_OnNotifyBegin_1464FB71440D0E08F22AD7AEF6FC4670, NotifyName) == 0x000000, "Member 'Behavior_Death_Animation_C_OnNotifyBegin_1464FB71440D0E08F22AD7AEF6FC4670::NotifyName' has a wrong offset!");

// Function Behavior_Death_Animation.Behavior_Death_Animation_C.OnNotifyEnd_1464FB71440D0E08F22AD7AEF6FC4670
// 0x0008 (0x0008 - 0x0000)
struct Behavior_Death_Animation_C_OnNotifyEnd_1464FB71440D0E08F22AD7AEF6FC4670 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Behavior_Death_Animation_C_OnNotifyEnd_1464FB71440D0E08F22AD7AEF6FC4670) == 0x000004, "Wrong alignment on Behavior_Death_Animation_C_OnNotifyEnd_1464FB71440D0E08F22AD7AEF6FC4670");
static_assert(sizeof(Behavior_Death_Animation_C_OnNotifyEnd_1464FB71440D0E08F22AD7AEF6FC4670) == 0x000008, "Wrong size on Behavior_Death_Animation_C_OnNotifyEnd_1464FB71440D0E08F22AD7AEF6FC4670");
static_assert(offsetof(Behavior_Death_Animation_C_OnNotifyEnd_1464FB71440D0E08F22AD7AEF6FC4670, NotifyName) == 0x000000, "Member 'Behavior_Death_Animation_C_OnNotifyEnd_1464FB71440D0E08F22AD7AEF6FC4670::NotifyName' has a wrong offset!");

}

