#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Behavior_Death_Animation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Altar_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Behavior_Death_Animation.Behavior_Death_Animation_C
// 0x0038 (0x0088 - 0x0050)
class UBehavior_Death_Animation_C final : public UVActorBehaviorBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0050(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AVPairedPawn*                           ControlledPawn;                                    // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimMontage>            DeathMontage;                                      // 0x0060(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Behavior_Death_Animation(int32 EntryPoint);
	void OnBlendOut_1464FB71440D0E08F22AD7AEF6FC4670(class FName NotifyName);
	void OnCompleted_1464FB71440D0E08F22AD7AEF6FC4670(class FName NotifyName);
	void OnInit();
	void OnInterrupted_1464FB71440D0E08F22AD7AEF6FC4670(class FName NotifyName);
	void OnNotifyBegin_1464FB71440D0E08F22AD7AEF6FC4670(class FName NotifyName);
	void OnNotifyEnd_1464FB71440D0E08F22AD7AEF6FC4670(class FName NotifyName);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Behavior_Death_Animation_C">();
	}
	static class UBehavior_Death_Animation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBehavior_Death_Animation_C>();
	}
};
static_assert(alignof(UBehavior_Death_Animation_C) == 0x000008, "Wrong alignment on UBehavior_Death_Animation_C");
static_assert(sizeof(UBehavior_Death_Animation_C) == 0x000088, "Wrong size on UBehavior_Death_Animation_C");
static_assert(offsetof(UBehavior_Death_Animation_C, UberGraphFrame) == 0x000050, "Member 'UBehavior_Death_Animation_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBehavior_Death_Animation_C, ControlledPawn) == 0x000058, "Member 'UBehavior_Death_Animation_C::ControlledPawn' has a wrong offset!");
static_assert(offsetof(UBehavior_Death_Animation_C, DeathMontage) == 0x000060, "Member 'UBehavior_Death_Animation_C::DeathMontage' has a wrong offset!");

}

