#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Behavior_AttackBehaviorBase

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Behavior_AttackBehaviorBase.Behavior_AttackBehaviorBase_C.AttemptCancellation
// 0x0001 (0x0001 - 0x0000)
struct Behavior_AttackBehaviorBase_C_AttemptCancellation final
{
public:
	bool                                          CallFunc_ShouldCancelToOtherAction_ShouldCancel;   // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Behavior_AttackBehaviorBase_C_AttemptCancellation) == 0x000001, "Wrong alignment on Behavior_AttackBehaviorBase_C_AttemptCancellation");
static_assert(sizeof(Behavior_AttackBehaviorBase_C_AttemptCancellation) == 0x000001, "Wrong size on Behavior_AttackBehaviorBase_C_AttemptCancellation");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_AttemptCancellation, CallFunc_ShouldCancelToOtherAction_ShouldCancel) == 0x000000, "Member 'Behavior_AttackBehaviorBase_C_AttemptCancellation::CallFunc_ShouldCancelToOtherAction_ShouldCancel' has a wrong offset!");

// Function Behavior_AttackBehaviorBase.Behavior_AttackBehaviorBase_C.BeginHitWindow
// 0x0020 (0x0020 - 0x0000)
struct Behavior_AttackBehaviorBase_C_BeginHitWindow final
{
public:
	class UObject*                                HitWindowEventSource;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AVPairedPawn*                           CallFunc_GetControlledPawn_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UVAnimNotify_ActionMeleeHitWindow* K2Node_DynamicCast_AsVAnim_Notify_Action_Melee_Hit_Window; // 0x0010(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Behavior_AttackBehaviorBase_C_BeginHitWindow) == 0x000008, "Wrong alignment on Behavior_AttackBehaviorBase_C_BeginHitWindow");
static_assert(sizeof(Behavior_AttackBehaviorBase_C_BeginHitWindow) == 0x000020, "Wrong size on Behavior_AttackBehaviorBase_C_BeginHitWindow");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_BeginHitWindow, HitWindowEventSource) == 0x000000, "Member 'Behavior_AttackBehaviorBase_C_BeginHitWindow::HitWindowEventSource' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_BeginHitWindow, CallFunc_GetControlledPawn_ReturnValue) == 0x000008, "Member 'Behavior_AttackBehaviorBase_C_BeginHitWindow::CallFunc_GetControlledPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_BeginHitWindow, K2Node_DynamicCast_AsVAnim_Notify_Action_Melee_Hit_Window) == 0x000010, "Member 'Behavior_AttackBehaviorBase_C_BeginHitWindow::K2Node_DynamicCast_AsVAnim_Notify_Action_Melee_Hit_Window' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_BeginHitWindow, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'Behavior_AttackBehaviorBase_C_BeginHitWindow::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function Behavior_AttackBehaviorBase.Behavior_AttackBehaviorBase_C.DrawDebugHitbox
// 0x0100 (0x0100 - 0x0000)
struct Behavior_AttackBehaviorBase_C_DrawDebugHitbox final
{
public:
	struct FVector                                HitboxCenterOffset;                                // 0x0000(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBox                                   HitBox;                                            // 0x0018(0x0038)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class AVPairedPawn*                           CallFunc_GetControlledPawn_ReturnValue;            // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetMeleeHitboxFromBase_OutHitboxCenter;   // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetMeleeHitboxFromBase_OutHitboxHalfExtent; // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_88[0x8];                                       // 0x0088(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  CallFunc_GetMeleeHitboxFromBase_OutHitboxQuat;     // 0x0090(0x0020)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBox                                   CallFunc_ComputeHitbox_ReturnValue;                // 0x00B0(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_Quat_Rotator_ReturnValue;                 // 0x00E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Behavior_AttackBehaviorBase_C_DrawDebugHitbox) == 0x000010, "Wrong alignment on Behavior_AttackBehaviorBase_C_DrawDebugHitbox");
static_assert(sizeof(Behavior_AttackBehaviorBase_C_DrawDebugHitbox) == 0x000100, "Wrong size on Behavior_AttackBehaviorBase_C_DrawDebugHitbox");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_DrawDebugHitbox, HitboxCenterOffset) == 0x000000, "Member 'Behavior_AttackBehaviorBase_C_DrawDebugHitbox::HitboxCenterOffset' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_DrawDebugHitbox, HitBox) == 0x000018, "Member 'Behavior_AttackBehaviorBase_C_DrawDebugHitbox::HitBox' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_DrawDebugHitbox, CallFunc_GetControlledPawn_ReturnValue) == 0x000050, "Member 'Behavior_AttackBehaviorBase_C_DrawDebugHitbox::CallFunc_GetControlledPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_DrawDebugHitbox, CallFunc_GetMeleeHitboxFromBase_OutHitboxCenter) == 0x000058, "Member 'Behavior_AttackBehaviorBase_C_DrawDebugHitbox::CallFunc_GetMeleeHitboxFromBase_OutHitboxCenter' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_DrawDebugHitbox, CallFunc_GetMeleeHitboxFromBase_OutHitboxHalfExtent) == 0x000070, "Member 'Behavior_AttackBehaviorBase_C_DrawDebugHitbox::CallFunc_GetMeleeHitboxFromBase_OutHitboxHalfExtent' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_DrawDebugHitbox, CallFunc_GetMeleeHitboxFromBase_OutHitboxQuat) == 0x000090, "Member 'Behavior_AttackBehaviorBase_C_DrawDebugHitbox::CallFunc_GetMeleeHitboxFromBase_OutHitboxQuat' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_DrawDebugHitbox, CallFunc_ComputeHitbox_ReturnValue) == 0x0000B0, "Member 'Behavior_AttackBehaviorBase_C_DrawDebugHitbox::CallFunc_ComputeHitbox_ReturnValue' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_DrawDebugHitbox, CallFunc_Quat_Rotator_ReturnValue) == 0x0000E8, "Member 'Behavior_AttackBehaviorBase_C_DrawDebugHitbox::CallFunc_Quat_Rotator_ReturnValue' has a wrong offset!");

// Function Behavior_AttackBehaviorBase.Behavior_AttackBehaviorBase_C.ExecuteUbergraph_Behavior_AttackBehaviorBase
// 0x0030 (0x0030 - 0x0000)
struct Behavior_AttackBehaviorBase_C_ExecuteUbergraph_Behavior_AttackBehaviorBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AVPairedPawn*                           CallFunc_GetControlledPawn_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInterrupted;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AVPairedPawn*                           CallFunc_GetControlledPawn_ReturnValue_1;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AVPairedPawn*                           CallFunc_GetControlledPawn_ReturnValue_2;          // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTime;                            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Behavior_AttackBehaviorBase_C_ExecuteUbergraph_Behavior_AttackBehaviorBase) == 0x000008, "Wrong alignment on Behavior_AttackBehaviorBase_C_ExecuteUbergraph_Behavior_AttackBehaviorBase");
static_assert(sizeof(Behavior_AttackBehaviorBase_C_ExecuteUbergraph_Behavior_AttackBehaviorBase) == 0x000030, "Wrong size on Behavior_AttackBehaviorBase_C_ExecuteUbergraph_Behavior_AttackBehaviorBase");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_ExecuteUbergraph_Behavior_AttackBehaviorBase, EntryPoint) == 0x000000, "Member 'Behavior_AttackBehaviorBase_C_ExecuteUbergraph_Behavior_AttackBehaviorBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_ExecuteUbergraph_Behavior_AttackBehaviorBase, CallFunc_GetControlledPawn_ReturnValue) == 0x000008, "Member 'Behavior_AttackBehaviorBase_C_ExecuteUbergraph_Behavior_AttackBehaviorBase::CallFunc_GetControlledPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_ExecuteUbergraph_Behavior_AttackBehaviorBase, K2Node_Event_bInterrupted) == 0x000010, "Member 'Behavior_AttackBehaviorBase_C_ExecuteUbergraph_Behavior_AttackBehaviorBase::K2Node_Event_bInterrupted' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_ExecuteUbergraph_Behavior_AttackBehaviorBase, CallFunc_GetControlledPawn_ReturnValue_1) == 0x000018, "Member 'Behavior_AttackBehaviorBase_C_ExecuteUbergraph_Behavior_AttackBehaviorBase::CallFunc_GetControlledPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_ExecuteUbergraph_Behavior_AttackBehaviorBase, CallFunc_GetControlledPawn_ReturnValue_2) == 0x000020, "Member 'Behavior_AttackBehaviorBase_C_ExecuteUbergraph_Behavior_AttackBehaviorBase::CallFunc_GetControlledPawn_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_ExecuteUbergraph_Behavior_AttackBehaviorBase, K2Node_Event_DeltaTime) == 0x000028, "Member 'Behavior_AttackBehaviorBase_C_ExecuteUbergraph_Behavior_AttackBehaviorBase::K2Node_Event_DeltaTime' has a wrong offset!");

// Function Behavior_AttackBehaviorBase.Behavior_AttackBehaviorBase_C.FindAndTrackTarget
// 0x0040 (0x0040 - 0x0000)
struct Behavior_AttackBehaviorBase_C_FindAndTrackTarget final
{
public:
	const class UVAnimNotify_ActionCameraTracking* CameraTracking_Notify;                            // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Tracking_Duration;                                 // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AVPairedPawn*                           CallFunc_GetControlledPawn_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class AVPairedPawn*>                   CallFunc_GetAllActorsOfClass_OutActors;            // 0x0018(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AVPairedPawn*                           CallFunc_FindCameraTrackingTarget_ReturnValue;     // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldIgnoreTrackingOnTargetedPawn_ReturnValue; // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_StartCameraTrackingOnPawn_Duration_ImplicitCast; // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Behavior_AttackBehaviorBase_C_FindAndTrackTarget) == 0x000008, "Wrong alignment on Behavior_AttackBehaviorBase_C_FindAndTrackTarget");
static_assert(sizeof(Behavior_AttackBehaviorBase_C_FindAndTrackTarget) == 0x000040, "Wrong size on Behavior_AttackBehaviorBase_C_FindAndTrackTarget");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_FindAndTrackTarget, CameraTracking_Notify) == 0x000000, "Member 'Behavior_AttackBehaviorBase_C_FindAndTrackTarget::CameraTracking_Notify' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_FindAndTrackTarget, Tracking_Duration) == 0x000008, "Member 'Behavior_AttackBehaviorBase_C_FindAndTrackTarget::Tracking_Duration' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_FindAndTrackTarget, CallFunc_GetControlledPawn_ReturnValue) == 0x000010, "Member 'Behavior_AttackBehaviorBase_C_FindAndTrackTarget::CallFunc_GetControlledPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_FindAndTrackTarget, CallFunc_GetAllActorsOfClass_OutActors) == 0x000018, "Member 'Behavior_AttackBehaviorBase_C_FindAndTrackTarget::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_FindAndTrackTarget, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'Behavior_AttackBehaviorBase_C_FindAndTrackTarget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_FindAndTrackTarget, CallFunc_FindCameraTrackingTarget_ReturnValue) == 0x000030, "Member 'Behavior_AttackBehaviorBase_C_FindAndTrackTarget::CallFunc_FindCameraTrackingTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_FindAndTrackTarget, CallFunc_IsValid_ReturnValue_1) == 0x000038, "Member 'Behavior_AttackBehaviorBase_C_FindAndTrackTarget::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_FindAndTrackTarget, CallFunc_ShouldIgnoreTrackingOnTargetedPawn_ReturnValue) == 0x000039, "Member 'Behavior_AttackBehaviorBase_C_FindAndTrackTarget::CallFunc_ShouldIgnoreTrackingOnTargetedPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_FindAndTrackTarget, CallFunc_StartCameraTrackingOnPawn_Duration_ImplicitCast) == 0x00003C, "Member 'Behavior_AttackBehaviorBase_C_FindAndTrackTarget::CallFunc_StartCameraTrackingOnPawn_Duration_ImplicitCast' has a wrong offset!");

// Function Behavior_AttackBehaviorBase.Behavior_AttackBehaviorBase_C.HandleAttackActionEvent
// 0x0130 (0x0130 - 0x0000)
struct Behavior_AttackBehaviorBase_C_HandleAttackActionEvent final
{
public:
	struct FGameplayTag                           Event_Tag;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class UAnimNotifyActionEventInfo*             Anim_Notify_Action_Event;                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  ChainWindowCancelTags;                             // 0x0010(0x0020)(Edit, BlueprintVisible)
	struct FGameplayTagContainer                  TransmitTagsNotify;                                // 0x0030(0x0020)(Edit, BlueprintVisible)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AVPairedPawn*                           CallFunc_GetControlledPawn_ReturnValue;            // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetNotifyDuration_ReturnValue;            // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AVAltarPlayerController*                K2Node_DynamicCast_AsVAltar_Player_Controller;     // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess;   // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UVAnimNotify_ActionCameraTracking* K2Node_DynamicCast_AsVAnim_Notify_Action_Camera_Tracking; // 0x0090(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesTag_ReturnValue;                   // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	const class UVAnimNotify_ActionMeleeHitWindow* K2Node_DynamicCast_AsVAnim_Notify_Action_Melee_Hit_Window; // 0x00A0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UBP_ActionNotifyState_TagContainer_C* K2Node_DynamicCast_AsBP_Action_Notify_State_Tag_Container; // 0x00B0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UBP_ActionNotify_TagContainer_C*  K2Node_DynamicCast_AsBP_Action_Notify_Tag_Container; // 0x00C0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess_1; // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesTag_ReturnValue_1;                 // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess_2; // 0x00CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayTag>                   CallFunc_BreakGameplayTagContainer_GameplayTags;   // 0x00D0(0x0010)(ReferenceParm)
	struct FGameplayTag                           CallFunc_Array_Get_Item;                           // 0x00E0(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveGameplayTag_ReturnValue;            // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess_3; // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FD[0x3];                                       // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayTag>                   CallFunc_BreakGameplayTagContainer_GameplayTags_1; // 0x0100(0x0010)(ReferenceParm)
	struct FGameplayTag                           CallFunc_Array_Get_Item_1;                         // 0x0110(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveGameplayTag_ReturnValue_1;          // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FindAndTrackTarget_Tracking_Duration_ImplicitCast; // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Behavior_AttackBehaviorBase_C_HandleAttackActionEvent) == 0x000008, "Wrong alignment on Behavior_AttackBehaviorBase_C_HandleAttackActionEvent");
static_assert(sizeof(Behavior_AttackBehaviorBase_C_HandleAttackActionEvent) == 0x000130, "Wrong size on Behavior_AttackBehaviorBase_C_HandleAttackActionEvent");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_HandleAttackActionEvent, Event_Tag) == 0x000000, "Member 'Behavior_AttackBehaviorBase_C_HandleAttackActionEvent::Event_Tag' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_HandleAttackActionEvent, Anim_Notify_Action_Event) == 0x000008, "Member 'Behavior_AttackBehaviorBase_C_HandleAttackActionEvent::Anim_Notify_Action_Event' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_HandleAttackActionEvent, ChainWindowCancelTags) == 0x000010, "Member 'Behavior_AttackBehaviorBase_C_HandleAttackActionEvent::ChainWindowCancelTags' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_HandleAttackActionEvent, TransmitTagsNotify) == 0x000030, "Member 'Behavior_AttackBehaviorBase_C_HandleAttackActionEvent::TransmitTagsNotify' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_HandleAttackActionEvent, Temp_int_Loop_Counter_Variable) == 0x000050, "Member 'Behavior_AttackBehaviorBase_C_HandleAttackActionEvent::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_HandleAttackActionEvent, CallFunc_Add_IntInt_ReturnValue) == 0x000054, "Member 'Behavior_AttackBehaviorBase_C_HandleAttackActionEvent::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_HandleAttackActionEvent, Temp_int_Array_Index_Variable) == 0x000058, "Member 'Behavior_AttackBehaviorBase_C_HandleAttackActionEvent::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_HandleAttackActionEvent, CallFunc_GetControlledPawn_ReturnValue) == 0x000060, "Member 'Behavior_AttackBehaviorBase_C_HandleAttackActionEvent::CallFunc_GetControlledPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_HandleAttackActionEvent, CallFunc_GetController_ReturnValue) == 0x000068, "Member 'Behavior_AttackBehaviorBase_C_HandleAttackActionEvent::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_HandleAttackActionEvent, CallFunc_GetNotifyDuration_ReturnValue) == 0x000070, "Member 'Behavior_AttackBehaviorBase_C_HandleAttackActionEvent::CallFunc_GetNotifyDuration_ReturnValue' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_HandleAttackActionEvent, K2Node_DynamicCast_AsVAltar_Player_Controller) == 0x000078, "Member 'Behavior_AttackBehaviorBase_C_HandleAttackActionEvent::K2Node_DynamicCast_AsVAltar_Player_Controller' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_HandleAttackActionEvent, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'Behavior_AttackBehaviorBase_C_HandleAttackActionEvent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_HandleAttackActionEvent, Temp_int_Array_Index_Variable_1) == 0x000084, "Member 'Behavior_AttackBehaviorBase_C_HandleAttackActionEvent::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_HandleAttackActionEvent, GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess) == 0x000088, "Member 'Behavior_AttackBehaviorBase_C_HandleAttackActionEvent::GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_HandleAttackActionEvent, K2Node_DynamicCast_AsVAnim_Notify_Action_Camera_Tracking) == 0x000090, "Member 'Behavior_AttackBehaviorBase_C_HandleAttackActionEvent::K2Node_DynamicCast_AsVAnim_Notify_Action_Camera_Tracking' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_HandleAttackActionEvent, K2Node_DynamicCast_bSuccess_1) == 0x000098, "Member 'Behavior_AttackBehaviorBase_C_HandleAttackActionEvent::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_HandleAttackActionEvent, CallFunc_MatchesTag_ReturnValue) == 0x000099, "Member 'Behavior_AttackBehaviorBase_C_HandleAttackActionEvent::CallFunc_MatchesTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_HandleAttackActionEvent, K2Node_DynamicCast_AsVAnim_Notify_Action_Melee_Hit_Window) == 0x0000A0, "Member 'Behavior_AttackBehaviorBase_C_HandleAttackActionEvent::K2Node_DynamicCast_AsVAnim_Notify_Action_Melee_Hit_Window' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_HandleAttackActionEvent, K2Node_DynamicCast_bSuccess_2) == 0x0000A8, "Member 'Behavior_AttackBehaviorBase_C_HandleAttackActionEvent::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_HandleAttackActionEvent, K2Node_DynamicCast_AsBP_Action_Notify_State_Tag_Container) == 0x0000B0, "Member 'Behavior_AttackBehaviorBase_C_HandleAttackActionEvent::K2Node_DynamicCast_AsBP_Action_Notify_State_Tag_Container' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_HandleAttackActionEvent, K2Node_DynamicCast_bSuccess_3) == 0x0000B8, "Member 'Behavior_AttackBehaviorBase_C_HandleAttackActionEvent::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_HandleAttackActionEvent, K2Node_DynamicCast_AsBP_Action_Notify_Tag_Container) == 0x0000C0, "Member 'Behavior_AttackBehaviorBase_C_HandleAttackActionEvent::K2Node_DynamicCast_AsBP_Action_Notify_Tag_Container' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_HandleAttackActionEvent, K2Node_DynamicCast_bSuccess_4) == 0x0000C8, "Member 'Behavior_AttackBehaviorBase_C_HandleAttackActionEvent::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_HandleAttackActionEvent, GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess_1) == 0x0000C9, "Member 'Behavior_AttackBehaviorBase_C_HandleAttackActionEvent::GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_HandleAttackActionEvent, CallFunc_MatchesTag_ReturnValue_1) == 0x0000CA, "Member 'Behavior_AttackBehaviorBase_C_HandleAttackActionEvent::CallFunc_MatchesTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_HandleAttackActionEvent, GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess_2) == 0x0000CB, "Member 'Behavior_AttackBehaviorBase_C_HandleAttackActionEvent::GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_HandleAttackActionEvent, CallFunc_BreakGameplayTagContainer_GameplayTags) == 0x0000D0, "Member 'Behavior_AttackBehaviorBase_C_HandleAttackActionEvent::CallFunc_BreakGameplayTagContainer_GameplayTags' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_HandleAttackActionEvent, CallFunc_Array_Get_Item) == 0x0000E0, "Member 'Behavior_AttackBehaviorBase_C_HandleAttackActionEvent::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_HandleAttackActionEvent, CallFunc_Array_Length_ReturnValue) == 0x0000E8, "Member 'Behavior_AttackBehaviorBase_C_HandleAttackActionEvent::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_HandleAttackActionEvent, CallFunc_RemoveGameplayTag_ReturnValue) == 0x0000EC, "Member 'Behavior_AttackBehaviorBase_C_HandleAttackActionEvent::CallFunc_RemoveGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_HandleAttackActionEvent, Temp_int_Loop_Counter_Variable_1) == 0x0000F0, "Member 'Behavior_AttackBehaviorBase_C_HandleAttackActionEvent::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_HandleAttackActionEvent, CallFunc_Less_IntInt_ReturnValue) == 0x0000F4, "Member 'Behavior_AttackBehaviorBase_C_HandleAttackActionEvent::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_HandleAttackActionEvent, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000F8, "Member 'Behavior_AttackBehaviorBase_C_HandleAttackActionEvent::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_HandleAttackActionEvent, GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess_3) == 0x0000FC, "Member 'Behavior_AttackBehaviorBase_C_HandleAttackActionEvent::GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess_3' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_HandleAttackActionEvent, CallFunc_BreakGameplayTagContainer_GameplayTags_1) == 0x000100, "Member 'Behavior_AttackBehaviorBase_C_HandleAttackActionEvent::CallFunc_BreakGameplayTagContainer_GameplayTags_1' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_HandleAttackActionEvent, CallFunc_Array_Get_Item_1) == 0x000110, "Member 'Behavior_AttackBehaviorBase_C_HandleAttackActionEvent::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_HandleAttackActionEvent, CallFunc_RemoveGameplayTag_ReturnValue_1) == 0x000118, "Member 'Behavior_AttackBehaviorBase_C_HandleAttackActionEvent::CallFunc_RemoveGameplayTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_HandleAttackActionEvent, CallFunc_Array_Length_ReturnValue_1) == 0x00011C, "Member 'Behavior_AttackBehaviorBase_C_HandleAttackActionEvent::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_HandleAttackActionEvent, CallFunc_Less_IntInt_ReturnValue_1) == 0x000120, "Member 'Behavior_AttackBehaviorBase_C_HandleAttackActionEvent::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_HandleAttackActionEvent, CallFunc_FindAndTrackTarget_Tracking_Duration_ImplicitCast) == 0x000128, "Member 'Behavior_AttackBehaviorBase_C_HandleAttackActionEvent::CallFunc_FindAndTrackTarget_Tracking_Duration_ImplicitCast' has a wrong offset!");

// Function Behavior_AttackBehaviorBase.Behavior_AttackBehaviorBase_C.OnEnd
// 0x0001 (0x0001 - 0x0000)
struct Behavior_AttackBehaviorBase_C_OnEnd final
{
public:
	bool                                          bInterrupted;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Behavior_AttackBehaviorBase_C_OnEnd) == 0x000001, "Wrong alignment on Behavior_AttackBehaviorBase_C_OnEnd");
static_assert(sizeof(Behavior_AttackBehaviorBase_C_OnEnd) == 0x000001, "Wrong size on Behavior_AttackBehaviorBase_C_OnEnd");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_OnEnd, bInterrupted) == 0x000000, "Member 'Behavior_AttackBehaviorBase_C_OnEnd::bInterrupted' has a wrong offset!");

// Function Behavior_AttackBehaviorBase.Behavior_AttackBehaviorBase_C.OnUpdate
// 0x0004 (0x0004 - 0x0000)
struct Behavior_AttackBehaviorBase_C_OnUpdate final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Behavior_AttackBehaviorBase_C_OnUpdate) == 0x000004, "Wrong alignment on Behavior_AttackBehaviorBase_C_OnUpdate");
static_assert(sizeof(Behavior_AttackBehaviorBase_C_OnUpdate) == 0x000004, "Wrong size on Behavior_AttackBehaviorBase_C_OnUpdate");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_OnUpdate, DeltaTime) == 0x000000, "Member 'Behavior_AttackBehaviorBase_C_OnUpdate::DeltaTime' has a wrong offset!");

// Function Behavior_AttackBehaviorBase.Behavior_AttackBehaviorBase_C.RunHitDetection
// 0x0120 (0x0120 - 0x0000)
struct Behavior_AttackBehaviorBase_C_RunHitDetection final
{
public:
	double                                        MaxHorizontalAngle;                                // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxVerticalAngle;                                  // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitboxCenterOffset;                                // 0x0010(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AVPairedPawn*>                   HitPawns;                                          // 0x0028(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<struct FHitResult>                     HitPrimitives;                                     // 0x0038(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	struct FBox                                   HitBox;                                            // 0x0048(0x0038)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_86[0x2];                                       // 0x0086(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_93[0x5];                                       // 0x0093(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AVPairedPawn*                           CallFunc_GetControlledPawn_ReturnValue;            // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AVPairedPawn*                           CallFunc_Array_Get_Item;                           // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Set_Contains_ReturnValue;                 // 0x00AE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x00AF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AVPairedPawn*                           CallFunc_GetControlledPawn_ReturnValue_1;          // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class AVPairedPawn*>                   CallFunc_RunPawnMeleeHitDetection_ReturnValue;     // 0x00B8(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBox                                   CallFunc_ComputeHitbox_ReturnValue;                // 0x00D0(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        K2Node_VariableSet_MaxHorizontalAngle_ImplicitCast; // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_MaxVerticalAngle_ImplicitCast;  // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RunPawnMeleeHitDetection_MaxHorizontalAngleDegrees_ImplicitCast; // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RunPawnMeleeHitDetection_MaxVerticalAngleDegrees_ImplicitCast; // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Behavior_AttackBehaviorBase_C_RunHitDetection) == 0x000008, "Wrong alignment on Behavior_AttackBehaviorBase_C_RunHitDetection");
static_assert(sizeof(Behavior_AttackBehaviorBase_C_RunHitDetection) == 0x000120, "Wrong size on Behavior_AttackBehaviorBase_C_RunHitDetection");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_RunHitDetection, MaxHorizontalAngle) == 0x000000, "Member 'Behavior_AttackBehaviorBase_C_RunHitDetection::MaxHorizontalAngle' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_RunHitDetection, MaxVerticalAngle) == 0x000008, "Member 'Behavior_AttackBehaviorBase_C_RunHitDetection::MaxVerticalAngle' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_RunHitDetection, HitboxCenterOffset) == 0x000010, "Member 'Behavior_AttackBehaviorBase_C_RunHitDetection::HitboxCenterOffset' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_RunHitDetection, HitPawns) == 0x000028, "Member 'Behavior_AttackBehaviorBase_C_RunHitDetection::HitPawns' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_RunHitDetection, HitPrimitives) == 0x000038, "Member 'Behavior_AttackBehaviorBase_C_RunHitDetection::HitPrimitives' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_RunHitDetection, HitBox) == 0x000048, "Member 'Behavior_AttackBehaviorBase_C_RunHitDetection::HitBox' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_RunHitDetection, Temp_int_Array_Index_Variable) == 0x000080, "Member 'Behavior_AttackBehaviorBase_C_RunHitDetection::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_RunHitDetection, Temp_bool_True_if_break_was_hit_Variable) == 0x000084, "Member 'Behavior_AttackBehaviorBase_C_RunHitDetection::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_RunHitDetection, CallFunc_Not_PreBool_ReturnValue) == 0x000085, "Member 'Behavior_AttackBehaviorBase_C_RunHitDetection::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_RunHitDetection, Temp_int_Loop_Counter_Variable) == 0x000088, "Member 'Behavior_AttackBehaviorBase_C_RunHitDetection::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_RunHitDetection, CallFunc_Add_IntInt_ReturnValue) == 0x00008C, "Member 'Behavior_AttackBehaviorBase_C_RunHitDetection::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_RunHitDetection, CallFunc_Not_PreBool_ReturnValue_1) == 0x000090, "Member 'Behavior_AttackBehaviorBase_C_RunHitDetection::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_RunHitDetection, CallFunc_BooleanOR_ReturnValue) == 0x000091, "Member 'Behavior_AttackBehaviorBase_C_RunHitDetection::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_RunHitDetection, CallFunc_Not_PreBool_ReturnValue_2) == 0x000092, "Member 'Behavior_AttackBehaviorBase_C_RunHitDetection::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_RunHitDetection, CallFunc_GetControlledPawn_ReturnValue) == 0x000098, "Member 'Behavior_AttackBehaviorBase_C_RunHitDetection::CallFunc_GetControlledPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_RunHitDetection, CallFunc_Array_Get_Item) == 0x0000A0, "Member 'Behavior_AttackBehaviorBase_C_RunHitDetection::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_RunHitDetection, CallFunc_Array_Length_ReturnValue) == 0x0000A8, "Member 'Behavior_AttackBehaviorBase_C_RunHitDetection::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_RunHitDetection, CallFunc_Less_IntInt_ReturnValue) == 0x0000AC, "Member 'Behavior_AttackBehaviorBase_C_RunHitDetection::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_RunHitDetection, CallFunc_BooleanAND_ReturnValue) == 0x0000AD, "Member 'Behavior_AttackBehaviorBase_C_RunHitDetection::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_RunHitDetection, CallFunc_Set_Contains_ReturnValue) == 0x0000AE, "Member 'Behavior_AttackBehaviorBase_C_RunHitDetection::CallFunc_Set_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_RunHitDetection, CallFunc_Not_PreBool_ReturnValue_3) == 0x0000AF, "Member 'Behavior_AttackBehaviorBase_C_RunHitDetection::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_RunHitDetection, CallFunc_GetControlledPawn_ReturnValue_1) == 0x0000B0, "Member 'Behavior_AttackBehaviorBase_C_RunHitDetection::CallFunc_GetControlledPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_RunHitDetection, CallFunc_RunPawnMeleeHitDetection_ReturnValue) == 0x0000B8, "Member 'Behavior_AttackBehaviorBase_C_RunHitDetection::CallFunc_RunPawnMeleeHitDetection_ReturnValue' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_RunHitDetection, CallFunc_IsValid_ReturnValue) == 0x0000C8, "Member 'Behavior_AttackBehaviorBase_C_RunHitDetection::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_RunHitDetection, CallFunc_ComputeHitbox_ReturnValue) == 0x0000D0, "Member 'Behavior_AttackBehaviorBase_C_RunHitDetection::CallFunc_ComputeHitbox_ReturnValue' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_RunHitDetection, K2Node_VariableSet_MaxHorizontalAngle_ImplicitCast) == 0x000108, "Member 'Behavior_AttackBehaviorBase_C_RunHitDetection::K2Node_VariableSet_MaxHorizontalAngle_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_RunHitDetection, K2Node_VariableSet_MaxVerticalAngle_ImplicitCast) == 0x000110, "Member 'Behavior_AttackBehaviorBase_C_RunHitDetection::K2Node_VariableSet_MaxVerticalAngle_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_RunHitDetection, CallFunc_RunPawnMeleeHitDetection_MaxHorizontalAngleDegrees_ImplicitCast) == 0x000118, "Member 'Behavior_AttackBehaviorBase_C_RunHitDetection::CallFunc_RunPawnMeleeHitDetection_MaxHorizontalAngleDegrees_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_RunHitDetection, CallFunc_RunPawnMeleeHitDetection_MaxVerticalAngleDegrees_ImplicitCast) == 0x00011C, "Member 'Behavior_AttackBehaviorBase_C_RunHitDetection::CallFunc_RunPawnMeleeHitDetection_MaxVerticalAngleDegrees_ImplicitCast' has a wrong offset!");

// Function Behavior_AttackBehaviorBase.Behavior_AttackBehaviorBase_C.ShouldCancelToOtherAction
// 0x0018 (0x0018 - 0x0000)
struct Behavior_AttackBehaviorBase_C_ShouldCancelToOtherAction final
{
public:
	bool                                          ShouldCancel;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AVPairedPawn*                           CallFunc_GetControlledPawn_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyGameplayTag_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Behavior_AttackBehaviorBase_C_ShouldCancelToOtherAction) == 0x000008, "Wrong alignment on Behavior_AttackBehaviorBase_C_ShouldCancelToOtherAction");
static_assert(sizeof(Behavior_AttackBehaviorBase_C_ShouldCancelToOtherAction) == 0x000018, "Wrong size on Behavior_AttackBehaviorBase_C_ShouldCancelToOtherAction");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_ShouldCancelToOtherAction, ShouldCancel) == 0x000000, "Member 'Behavior_AttackBehaviorBase_C_ShouldCancelToOtherAction::ShouldCancel' has a wrong offset!");
static_assert(offsetof(Behavior_AttackBehaviorBase_C_ShouldCancelToOtherAction, CallFunc_GetControlledPawn_ReturnValue) == 0x000008, "Member 'Behavior_AttackBehaviorBase_C_ShouldCancelToOtherAction::CallFunc_GetControlledPawn_ReturnValue' has a wrong offset!");
