#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AltarPlayerCameraManager

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BP_AltarPlayerCameraManager.BP_AltarPlayerCameraManager_C.UpdateForVanityCamera
// 0x0008 (0x0008 - 0x0000)
struct BP_AltarPlayerCameraManager_C_UpdateForVanityCamera final
{
public:
	double                                        DeltaTime;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AltarPlayerCameraManager_C_UpdateForVanityCamera) == 0x000008, "Wrong alignment on BP_AltarPlayerCameraManager_C_UpdateForVanityCamera");
static_assert(sizeof(BP_AltarPlayerCameraManager_C_UpdateForVanityCamera) == 0x000008, "Wrong size on BP_AltarPlayerCameraManager_C_UpdateForVanityCamera");
static_assert(offsetof(BP_AltarPlayerCameraManager_C_UpdateForVanityCamera, DeltaTime) == 0x000000, "Member 'BP_AltarPlayerCameraManager_C_UpdateForVanityCamera::DeltaTime' has a wrong offset!");

// Function BP_AltarPlayerCameraManager.BP_AltarPlayerCameraManager_C.HasTagsToEnterVanityCam
// 0x0038 (0x0038 - 0x0000)
struct BP_AltarPlayerCameraManager_C_HasTagsToEnterVanityCam final
{
public:
	bool                                          HasCorrectTags;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayerController_ReturnValue;    // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AVPairedPawn*                           K2Node_DynamicCast_AsVPaired_Pawn;                 // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_GetActionStateTag_ReturnValue;            // 0x0024(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_GetLocomotionStateTag_ReturnValue;        // 0x002C(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue_1;                     // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AltarPlayerCameraManager_C_HasTagsToEnterVanityCam) == 0x000008, "Wrong alignment on BP_AltarPlayerCameraManager_C_HasTagsToEnterVanityCam");
static_assert(sizeof(BP_AltarPlayerCameraManager_C_HasTagsToEnterVanityCam) == 0x000038, "Wrong size on BP_AltarPlayerCameraManager_C_HasTagsToEnterVanityCam");
static_assert(offsetof(BP_AltarPlayerCameraManager_C_HasTagsToEnterVanityCam, HasCorrectTags) == 0x000000, "Member 'BP_AltarPlayerCameraManager_C_HasTagsToEnterVanityCam::HasCorrectTags' has a wrong offset!");
static_assert(offsetof(BP_AltarPlayerCameraManager_C_HasTagsToEnterVanityCam, CallFunc_GetOwningPlayerController_ReturnValue) == 0x000008, "Member 'BP_AltarPlayerCameraManager_C_HasTagsToEnterVanityCam::CallFunc_GetOwningPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AltarPlayerCameraManager_C_HasTagsToEnterVanityCam, CallFunc_K2_GetPawn_ReturnValue) == 0x000010, "Member 'BP_AltarPlayerCameraManager_C_HasTagsToEnterVanityCam::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AltarPlayerCameraManager_C_HasTagsToEnterVanityCam, K2Node_DynamicCast_AsVPaired_Pawn) == 0x000018, "Member 'BP_AltarPlayerCameraManager_C_HasTagsToEnterVanityCam::K2Node_DynamicCast_AsVPaired_Pawn' has a wrong offset!");
static_assert(offsetof(BP_AltarPlayerCameraManager_C_HasTagsToEnterVanityCam, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_AltarPlayerCameraManager_C_HasTagsToEnterVanityCam::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AltarPlayerCameraManager_C_HasTagsToEnterVanityCam, CallFunc_GetActionStateTag_ReturnValue) == 0x000024, "Member 'BP_AltarPlayerCameraManager_C_HasTagsToEnterVanityCam::CallFunc_GetActionStateTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AltarPlayerCameraManager_C_HasTagsToEnterVanityCam, CallFunc_GetLocomotionStateTag_ReturnValue) == 0x00002C, "Member 'BP_AltarPlayerCameraManager_C_HasTagsToEnterVanityCam::CallFunc_GetLocomotionStateTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AltarPlayerCameraManager_C_HasTagsToEnterVanityCam, CallFunc_HasTag_ReturnValue) == 0x000034, "Member 'BP_AltarPlayerCameraManager_C_HasTagsToEnterVanityCam::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AltarPlayerCameraManager_C_HasTagsToEnterVanityCam, CallFunc_HasTag_ReturnValue_1) == 0x000035, "Member 'BP_AltarPlayerCameraManager_C_HasTagsToEnterVanityCam::CallFunc_HasTag_ReturnValue_1' has a wrong offset!");

}

