#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BloodImpact

#include "Basic.hpp"

#include "Altar_structs.hpp"
#include "Niagara_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BPE_EffectSize_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_BloodImpact.BP_BloodImpact_C.Activate FPV Blood PP
// 0x0001 (0x0001 - 0x0000)
struct BP_BloodImpact_C_Activate_FPV_Blood_PP final
{
public:
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BloodImpact_C_Activate_FPV_Blood_PP) == 0x000001, "Wrong alignment on BP_BloodImpact_C_Activate_FPV_Blood_PP");
static_assert(sizeof(BP_BloodImpact_C_Activate_FPV_Blood_PP) == 0x000001, "Wrong size on BP_BloodImpact_C_Activate_FPV_Blood_PP");
static_assert(offsetof(BP_BloodImpact_C_Activate_FPV_Blood_PP, K2Node_SwitchEnum_CmpSuccess) == 0x000000, "Member 'BP_BloodImpact_C_Activate_FPV_Blood_PP::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BP_BloodImpact.BP_BloodImpact_C.Activate FPV Distortion PP
// 0x0001 (0x0001 - 0x0000)
struct BP_BloodImpact_C_Activate_FPV_Distortion_PP final
{
public:
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BloodImpact_C_Activate_FPV_Distortion_PP) == 0x000001, "Wrong alignment on BP_BloodImpact_C_Activate_FPV_Distortion_PP");
static_assert(sizeof(BP_BloodImpact_C_Activate_FPV_Distortion_PP) == 0x000001, "Wrong size on BP_BloodImpact_C_Activate_FPV_Distortion_PP");
static_assert(offsetof(BP_BloodImpact_C_Activate_FPV_Distortion_PP, K2Node_SwitchEnum_CmpSuccess) == 0x000000, "Member 'BP_BloodImpact_C_Activate_FPV_Distortion_PP::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BP_BloodImpact.BP_BloodImpact_C.Blood PP Activate
// 0x0001 (0x0001 - 0x0000)
struct BP_BloodImpact_C_Blood_PP_Activate final
{
public:
	bool                                          Is_Fading;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BloodImpact_C_Blood_PP_Activate) == 0x000001, "Wrong alignment on BP_BloodImpact_C_Blood_PP_Activate");
static_assert(sizeof(BP_BloodImpact_C_Blood_PP_Activate) == 0x000001, "Wrong size on BP_BloodImpact_C_Blood_PP_Activate");
static_assert(offsetof(BP_BloodImpact_C_Blood_PP_Activate, Is_Fading) == 0x000000, "Member 'BP_BloodImpact_C_Blood_PP_Activate::Is_Fading' has a wrong offset!");

// Function BP_BloodImpact.BP_BloodImpact_C.Blood PP Deactivate
// 0x0002 (0x0002 - 0x0000)
struct BP_BloodImpact_C_Blood_PP_Deactivate final
{
public:
	bool                                          Is_Fading;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Is_Fast;                                           // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BloodImpact_C_Blood_PP_Deactivate) == 0x000001, "Wrong alignment on BP_BloodImpact_C_Blood_PP_Deactivate");
static_assert(sizeof(BP_BloodImpact_C_Blood_PP_Deactivate) == 0x000002, "Wrong size on BP_BloodImpact_C_Blood_PP_Deactivate");
static_assert(offsetof(BP_BloodImpact_C_Blood_PP_Deactivate, Is_Fading) == 0x000000, "Member 'BP_BloodImpact_C_Blood_PP_Deactivate::Is_Fading' has a wrong offset!");
static_assert(offsetof(BP_BloodImpact_C_Blood_PP_Deactivate, Is_Fast) == 0x000001, "Member 'BP_BloodImpact_C_Blood_PP_Deactivate::Is_Fast' has a wrong offset!");

// Function BP_BloodImpact.BP_BloodImpact_C.BndEvt__BP_BloodImpact_BloodSpray VFX_K2Node_ComponentBoundEvent_0_OnNiagaraSystemFinished__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_BloodImpact_C_BndEvt__BP_BloodImpact_BloodSpray_VFX_K2Node_ComponentBoundEvent_0_OnNiagaraSystemFinished__DelegateSignature final
{
public:
	class UNiagaraComponent*                      PSystem;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BloodImpact_C_BndEvt__BP_BloodImpact_BloodSpray_VFX_K2Node_ComponentBoundEvent_0_OnNiagaraSystemFinished__DelegateSignature) == 0x000008, "Wrong alignment on BP_BloodImpact_C_BndEvt__BP_BloodImpact_BloodSpray_VFX_K2Node_ComponentBoundEvent_0_OnNiagaraSystemFinished__DelegateSignature");
static_assert(sizeof(BP_BloodImpact_C_BndEvt__BP_BloodImpact_BloodSpray_VFX_K2Node_ComponentBoundEvent_0_OnNiagaraSystemFinished__DelegateSignature) == 0x000008, "Wrong size on BP_BloodImpact_C_BndEvt__BP_BloodImpact_BloodSpray_VFX_K2Node_ComponentBoundEvent_0_OnNiagaraSystemFinished__DelegateSignature");
static_assert(offsetof(BP_BloodImpact_C_BndEvt__BP_BloodImpact_BloodSpray_VFX_K2Node_ComponentBoundEvent_0_OnNiagaraSystemFinished__DelegateSignature, PSystem) == 0x000000, "Member 'BP_BloodImpact_C_BndEvt__BP_BloodImpact_BloodSpray_VFX_K2Node_ComponentBoundEvent_0_OnNiagaraSystemFinished__DelegateSignature::PSystem' has a wrong offset!");

// Function BP_BloodImpact.BP_BloodImpact_C.Calculate PP Screen Position
// 0x0148 (0x0148 - 0x0000)
struct BP_BloodImpact_C_Calculate_PP_Screen_Position final
{
public:
	struct FVector2D                              CallFunc_GetViewportSize_ReturnValue;              // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetCameraRotation_ReturnValue;            // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_ProjectWorldToScreen_ScreenPosition;      // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ProjectWorldToScreen_ReturnValue;         // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_1;                        // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_1;                        // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue_1;            // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue;                    // 0x00E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_NormalizeAxis_ReturnValue;                // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MapRangeClamped_ReturnValue_2;            // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeColor_G_ImplicitCast;                 // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeColor_R_ImplicitCast;                 // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast;          // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_NormalizeAxis_Angle_ImplicitCast;         // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MapRangeClamped_Value_ImplicitCast;       // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BloodImpact_C_Calculate_PP_Screen_Position) == 0x000008, "Wrong alignment on BP_BloodImpact_C_Calculate_PP_Screen_Position");
static_assert(sizeof(BP_BloodImpact_C_Calculate_PP_Screen_Position) == 0x000148, "Wrong size on BP_BloodImpact_C_Calculate_PP_Screen_Position");
static_assert(offsetof(BP_BloodImpact_C_Calculate_PP_Screen_Position, CallFunc_GetViewportSize_ReturnValue) == 0x000000, "Member 'BP_BloodImpact_C_Calculate_PP_Screen_Position::CallFunc_GetViewportSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BloodImpact_C_Calculate_PP_Screen_Position, CallFunc_BreakVector2D_X) == 0x000010, "Member 'BP_BloodImpact_C_Calculate_PP_Screen_Position::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(BP_BloodImpact_C_Calculate_PP_Screen_Position, CallFunc_BreakVector2D_Y) == 0x000018, "Member 'BP_BloodImpact_C_Calculate_PP_Screen_Position::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(BP_BloodImpact_C_Calculate_PP_Screen_Position, CallFunc_GetPlayerController_ReturnValue) == 0x000020, "Member 'BP_BloodImpact_C_Calculate_PP_Screen_Position::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BloodImpact_C_Calculate_PP_Screen_Position, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000028, "Member 'BP_BloodImpact_C_Calculate_PP_Screen_Position::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BloodImpact_C_Calculate_PP_Screen_Position, CallFunc_GetCameraRotation_ReturnValue) == 0x000030, "Member 'BP_BloodImpact_C_Calculate_PP_Screen_Position::CallFunc_GetCameraRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BloodImpact_C_Calculate_PP_Screen_Position, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000048, "Member 'BP_BloodImpact_C_Calculate_PP_Screen_Position::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BloodImpact_C_Calculate_PP_Screen_Position, CallFunc_BreakRotator_Roll) == 0x000060, "Member 'BP_BloodImpact_C_Calculate_PP_Screen_Position::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_BloodImpact_C_Calculate_PP_Screen_Position, CallFunc_BreakRotator_Pitch) == 0x000064, "Member 'BP_BloodImpact_C_Calculate_PP_Screen_Position::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_BloodImpact_C_Calculate_PP_Screen_Position, CallFunc_BreakRotator_Yaw) == 0x000068, "Member 'BP_BloodImpact_C_Calculate_PP_Screen_Position::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_BloodImpact_C_Calculate_PP_Screen_Position, CallFunc_ProjectWorldToScreen_ScreenPosition) == 0x000070, "Member 'BP_BloodImpact_C_Calculate_PP_Screen_Position::CallFunc_ProjectWorldToScreen_ScreenPosition' has a wrong offset!");
static_assert(offsetof(BP_BloodImpact_C_Calculate_PP_Screen_Position, CallFunc_ProjectWorldToScreen_ReturnValue) == 0x000080, "Member 'BP_BloodImpact_C_Calculate_PP_Screen_Position::CallFunc_ProjectWorldToScreen_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BloodImpact_C_Calculate_PP_Screen_Position, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000088, "Member 'BP_BloodImpact_C_Calculate_PP_Screen_Position::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BloodImpact_C_Calculate_PP_Screen_Position, CallFunc_BreakVector2D_X_1) == 0x000090, "Member 'BP_BloodImpact_C_Calculate_PP_Screen_Position::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(BP_BloodImpact_C_Calculate_PP_Screen_Position, CallFunc_BreakVector2D_Y_1) == 0x000098, "Member 'BP_BloodImpact_C_Calculate_PP_Screen_Position::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(BP_BloodImpact_C_Calculate_PP_Screen_Position, CallFunc_GetPlayerCharacter_ReturnValue) == 0x0000A0, "Member 'BP_BloodImpact_C_Calculate_PP_Screen_Position::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BloodImpact_C_Calculate_PP_Screen_Position, CallFunc_MapRangeClamped_ReturnValue) == 0x0000A8, "Member 'BP_BloodImpact_C_Calculate_PP_Screen_Position::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BloodImpact_C_Calculate_PP_Screen_Position, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0000B0, "Member 'BP_BloodImpact_C_Calculate_PP_Screen_Position::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BloodImpact_C_Calculate_PP_Screen_Position, CallFunc_MapRangeClamped_ReturnValue_1) == 0x0000C8, "Member 'BP_BloodImpact_C_Calculate_PP_Screen_Position::CallFunc_MapRangeClamped_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BloodImpact_C_Calculate_PP_Screen_Position, CallFunc_FindLookAtRotation_ReturnValue) == 0x0000D0, "Member 'BP_BloodImpact_C_Calculate_PP_Screen_Position::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BloodImpact_C_Calculate_PP_Screen_Position, CallFunc_MakeColor_ReturnValue) == 0x0000E8, "Member 'BP_BloodImpact_C_Calculate_PP_Screen_Position::CallFunc_MakeColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BloodImpact_C_Calculate_PP_Screen_Position, CallFunc_BreakRotator_Roll_1) == 0x0000F8, "Member 'BP_BloodImpact_C_Calculate_PP_Screen_Position::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(BP_BloodImpact_C_Calculate_PP_Screen_Position, CallFunc_BreakRotator_Pitch_1) == 0x0000FC, "Member 'BP_BloodImpact_C_Calculate_PP_Screen_Position::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(BP_BloodImpact_C_Calculate_PP_Screen_Position, CallFunc_BreakRotator_Yaw_1) == 0x000100, "Member 'BP_BloodImpact_C_Calculate_PP_Screen_Position::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");
static_assert(offsetof(BP_BloodImpact_C_Calculate_PP_Screen_Position, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000108, "Member 'BP_BloodImpact_C_Calculate_PP_Screen_Position::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BloodImpact_C_Calculate_PP_Screen_Position, CallFunc_NormalizeAxis_ReturnValue) == 0x000110, "Member 'BP_BloodImpact_C_Calculate_PP_Screen_Position::CallFunc_NormalizeAxis_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BloodImpact_C_Calculate_PP_Screen_Position, CallFunc_MapRangeClamped_ReturnValue_2) == 0x000118, "Member 'BP_BloodImpact_C_Calculate_PP_Screen_Position::CallFunc_MapRangeClamped_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BloodImpact_C_Calculate_PP_Screen_Position, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000120, "Member 'BP_BloodImpact_C_Calculate_PP_Screen_Position::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_BloodImpact_C_Calculate_PP_Screen_Position, CallFunc_MakeColor_G_ImplicitCast) == 0x000128, "Member 'BP_BloodImpact_C_Calculate_PP_Screen_Position::CallFunc_MakeColor_G_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_BloodImpact_C_Calculate_PP_Screen_Position, CallFunc_MakeColor_R_ImplicitCast) == 0x00012C, "Member 'BP_BloodImpact_C_Calculate_PP_Screen_Position::CallFunc_MakeColor_R_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_BloodImpact_C_Calculate_PP_Screen_Position, CallFunc_Add_DoubleDouble_B_ImplicitCast) == 0x000130, "Member 'BP_BloodImpact_C_Calculate_PP_Screen_Position::CallFunc_Add_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_BloodImpact_C_Calculate_PP_Screen_Position, CallFunc_NormalizeAxis_Angle_ImplicitCast) == 0x000138, "Member 'BP_BloodImpact_C_Calculate_PP_Screen_Position::CallFunc_NormalizeAxis_Angle_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_BloodImpact_C_Calculate_PP_Screen_Position, CallFunc_MapRangeClamped_Value_ImplicitCast) == 0x000140, "Member 'BP_BloodImpact_C_Calculate_PP_Screen_Position::CallFunc_MapRangeClamped_Value_ImplicitCast' has a wrong offset!");

// Function BP_BloodImpact.BP_BloodImpact_C.Call Fist Blood Event
// 0x0020 (0x0020 - 0x0000)
struct BP_BloodImpact_C_Call_Fist_Blood_Event final
{
public:
	EVBloodColor                                  Blood_Color_0;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVHitSourceType                               Hit_Source_Type;                                   // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVHitSourceType                               Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVHitSourceType                               Temp_byte_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default;                             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_6;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_7;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default_1;                           // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F[0x1];                                        // 0x000F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_OblivionPlayerCharacter_C*          K2Node_DynamicCast_AsBP_Oblivion_Player_Character; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BloodImpact_C_Call_Fist_Blood_Event) == 0x000008, "Wrong alignment on BP_BloodImpact_C_Call_Fist_Blood_Event");
static_assert(sizeof(BP_BloodImpact_C_Call_Fist_Blood_Event) == 0x000020, "Wrong size on BP_BloodImpact_C_Call_Fist_Blood_Event");
static_assert(offsetof(BP_BloodImpact_C_Call_Fist_Blood_Event, Blood_Color_0) == 0x000000, "Member 'BP_BloodImpact_C_Call_Fist_Blood_Event::Blood_Color_0' has a wrong offset!");
static_assert(offsetof(BP_BloodImpact_C_Call_Fist_Blood_Event, Hit_Source_Type) == 0x000001, "Member 'BP_BloodImpact_C_Call_Fist_Blood_Event::Hit_Source_Type' has a wrong offset!");
static_assert(offsetof(BP_BloodImpact_C_Call_Fist_Blood_Event, Temp_byte_Variable) == 0x000002, "Member 'BP_BloodImpact_C_Call_Fist_Blood_Event::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_BloodImpact_C_Call_Fist_Blood_Event, Temp_bool_Variable) == 0x000003, "Member 'BP_BloodImpact_C_Call_Fist_Blood_Event::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_BloodImpact_C_Call_Fist_Blood_Event, Temp_bool_Variable_1) == 0x000004, "Member 'BP_BloodImpact_C_Call_Fist_Blood_Event::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BloodImpact_C_Call_Fist_Blood_Event, Temp_bool_Variable_2) == 0x000005, "Member 'BP_BloodImpact_C_Call_Fist_Blood_Event::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_BloodImpact_C_Call_Fist_Blood_Event, Temp_bool_Variable_3) == 0x000006, "Member 'BP_BloodImpact_C_Call_Fist_Blood_Event::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_BloodImpact_C_Call_Fist_Blood_Event, Temp_byte_Variable_1) == 0x000007, "Member 'BP_BloodImpact_C_Call_Fist_Blood_Event::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BloodImpact_C_Call_Fist_Blood_Event, K2Node_Select_Default) == 0x000008, "Member 'BP_BloodImpact_C_Call_Fist_Blood_Event::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_BloodImpact_C_Call_Fist_Blood_Event, Temp_bool_Variable_4) == 0x000009, "Member 'BP_BloodImpact_C_Call_Fist_Blood_Event::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_BloodImpact_C_Call_Fist_Blood_Event, Temp_bool_Variable_5) == 0x00000A, "Member 'BP_BloodImpact_C_Call_Fist_Blood_Event::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_BloodImpact_C_Call_Fist_Blood_Event, Temp_bool_Variable_6) == 0x00000B, "Member 'BP_BloodImpact_C_Call_Fist_Blood_Event::Temp_bool_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_BloodImpact_C_Call_Fist_Blood_Event, Temp_bool_Variable_7) == 0x00000C, "Member 'BP_BloodImpact_C_Call_Fist_Blood_Event::Temp_bool_Variable_7' has a wrong offset!");
static_assert(offsetof(BP_BloodImpact_C_Call_Fist_Blood_Event, K2Node_Select_Default_1) == 0x00000D, "Member 'BP_BloodImpact_C_Call_Fist_Blood_Event::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_BloodImpact_C_Call_Fist_Blood_Event, CallFunc_BooleanOR_ReturnValue) == 0x00000E, "Member 'BP_BloodImpact_C_Call_Fist_Blood_Event::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BloodImpact_C_Call_Fist_Blood_Event, K2Node_DynamicCast_AsBP_Oblivion_Player_Character) == 0x000010, "Member 'BP_BloodImpact_C_Call_Fist_Blood_Event::K2Node_DynamicCast_AsBP_Oblivion_Player_Character' has a wrong offset!");
static_assert(offsetof(BP_BloodImpact_C_Call_Fist_Blood_Event, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_BloodImpact_C_Call_Fist_Blood_Event::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_BloodImpact_C_Call_Fist_Blood_Event, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'BP_BloodImpact_C_Call_Fist_Blood_Event::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_BloodImpact.BP_BloodImpact_C.Call Weapon Blood Event
// 0x0048 (0x0048 - 0x0000)
struct BP_BloodImpact_C_Call_Weapon_Blood_Event final
{
public:
	EVBloodColor                                  Blood_Color_0;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Weap_GenericBlade_Scabbard_C*       K2Node_DynamicCast_AsBP_Weap_Generic_Blade_Scabbard; // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Weap_GenericBlade_C*                K2Node_DynamicCast_AsBP_Weap_Generic_Blade;        // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33[0x5];                                       // 0x0033(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Weap_GenericBlunt_C*                K2Node_DynamicCast_AsBP_Weap_Generic_Blunt;        // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BloodImpact_C_Call_Weapon_Blood_Event) == 0x000008, "Wrong alignment on BP_BloodImpact_C_Call_Weapon_Blood_Event");
static_assert(sizeof(BP_BloodImpact_C_Call_Weapon_Blood_Event) == 0x000048, "Wrong size on BP_BloodImpact_C_Call_Weapon_Blood_Event");
static_assert(offsetof(BP_BloodImpact_C_Call_Weapon_Blood_Event, Blood_Color_0) == 0x000000, "Member 'BP_BloodImpact_C_Call_Weapon_Blood_Event::Blood_Color_0' has a wrong offset!");
static_assert(offsetof(BP_BloodImpact_C_Call_Weapon_Blood_Event, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'BP_BloodImpact_C_Call_Weapon_Blood_Event::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BloodImpact_C_Call_Weapon_Blood_Event, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_BloodImpact_C_Call_Weapon_Blood_Event::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BloodImpact_C_Call_Weapon_Blood_Event, CallFunc_IsValid_ReturnValue_1) == 0x000010, "Member 'BP_BloodImpact_C_Call_Weapon_Blood_Event::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BloodImpact_C_Call_Weapon_Blood_Event, K2Node_DynamicCast_AsBP_Weap_Generic_Blade_Scabbard) == 0x000018, "Member 'BP_BloodImpact_C_Call_Weapon_Blood_Event::K2Node_DynamicCast_AsBP_Weap_Generic_Blade_Scabbard' has a wrong offset!");
static_assert(offsetof(BP_BloodImpact_C_Call_Weapon_Blood_Event, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_BloodImpact_C_Call_Weapon_Blood_Event::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_BloodImpact_C_Call_Weapon_Blood_Event, K2Node_DynamicCast_AsBP_Weap_Generic_Blade) == 0x000028, "Member 'BP_BloodImpact_C_Call_Weapon_Blood_Event::K2Node_DynamicCast_AsBP_Weap_Generic_Blade' has a wrong offset!");
static_assert(offsetof(BP_BloodImpact_C_Call_Weapon_Blood_Event, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'BP_BloodImpact_C_Call_Weapon_Blood_Event::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_BloodImpact_C_Call_Weapon_Blood_Event, CallFunc_IsValid_ReturnValue_2) == 0x000031, "Member 'BP_BloodImpact_C_Call_Weapon_Blood_Event::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BloodImpact_C_Call_Weapon_Blood_Event, CallFunc_IsValid_ReturnValue_3) == 0x000032, "Member 'BP_BloodImpact_C_Call_Weapon_Blood_Event::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BloodImpact_C_Call_Weapon_Blood_Event, K2Node_DynamicCast_AsBP_Weap_Generic_Blunt) == 0x000038, "Member 'BP_BloodImpact_C_Call_Weapon_Blood_Event::K2Node_DynamicCast_AsBP_Weap_Generic_Blunt' has a wrong offset!");
static_assert(offsetof(BP_BloodImpact_C_Call_Weapon_Blood_Event, K2Node_DynamicCast_bSuccess_2) == 0x000040, "Member 'BP_BloodImpact_C_Call_Weapon_Blood_Event::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_BloodImpact_C_Call_Weapon_Blood_Event, CallFunc_IsValid_ReturnValue_4) == 0x000041, "Member 'BP_BloodImpact_C_Call_Weapon_Blood_Event::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");

// Function BP_BloodImpact.BP_BloodImpact_C.Distortion PP Activate
// 0x0001 (0x0001 - 0x0000)
struct BP_BloodImpact_C_Distortion_PP_Activate final
{
public:
	bool                                          Is_Fading;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BloodImpact_C_Distortion_PP_Activate) == 0x000001, "Wrong alignment on BP_BloodImpact_C_Distortion_PP_Activate");
static_assert(sizeof(BP_BloodImpact_C_Distortion_PP_Activate) == 0x000001, "Wrong size on BP_BloodImpact_C_Distortion_PP_Activate");
static_assert(offsetof(BP_BloodImpact_C_Distortion_PP_Activate, Is_Fading) == 0x000000, "Member 'BP_BloodImpact_C_Distortion_PP_Activate::Is_Fading' has a wrong offset!");

// Function BP_BloodImpact.BP_BloodImpact_C.Distortion PP Deactivate
// 0x0001 (0x0001 - 0x0000)
struct BP_BloodImpact_C_Distortion_PP_Deactivate final
{
public:
	bool                                          Is_Fading;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BloodImpact_C_Distortion_PP_Deactivate) == 0x000001, "Wrong alignment on BP_BloodImpact_C_Distortion_PP_Deactivate");
static_assert(sizeof(BP_BloodImpact_C_Distortion_PP_Deactivate) == 0x000001, "Wrong size on BP_BloodImpact_C_Distortion_PP_Deactivate");
static_assert(offsetof(BP_BloodImpact_C_Distortion_PP_Deactivate, Is_Fading) == 0x000000, "Member 'BP_BloodImpact_C_Distortion_PP_Deactivate::Is_Fading' has a wrong offset!");

// Function BP_BloodImpact.BP_BloodImpact_C.ExecuteUbergraph_BP_BloodImpact
// 0x0280 (0x0280 - 0x0000)
struct BP_BloodImpact_C_ExecuteUbergraph_BP_BloodImpact final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector_NetQuantizeNormal              CallFunc_MakeVector_NetQuantizeNormal_ReturnValue; // 0x0040(0x0018)(NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FBasicParticleData>             K2Node_Event_Data;                                 // 0x0060(0x0010)(ConstParm, ReferenceParm)
	class UNiagaraSystem*                         K2Node_Event_NiagaraSystem;                        // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_SimulationPositionOffset;             // 0x0078(0x0018)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      K2Node_ComponentBoundEvent_PSystem;                // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Damages;                              // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVBloodColor                                  K2Node_Event_BloodColor;                           // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsUsingWeapon;                       // 0x00AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AE[0x2];                                       // 0x00AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Target;                               // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class AActor*                           K2Node_Event_Attacker;                             // 0x00B8(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_TargetMaxHP;                          // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bDoesBeginInFirstPerson;              // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVHitSourceType                               K2Node_Event_HitSourceType;                        // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C6[0x2];                                       // 0x00C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	const class UStaticMeshComponent*             K2Node_Event_WeaponComp;                           // 0x00C8(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector_NetQuantizeNormal              K2Node_Event_ImpactNormal;                         // 0x00D0(0x0018)(ConstParm, NoDestructor, HasGetValueTypeHash)
	EVHitSourceWeaponType                         K2Node_Event_HitWeaponType;                        // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_HitDirection;                         // 0x00F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBasicParticleData                     CallFunc_Array_Get_Item;                           // 0x0118(0x0038)(NoDestructor)
	bool                                          K2Node_Event_bIsFirstPerson;                       // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Is_Fading_3;                    // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Is_Fading_2;                    // 0x0152(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Is_Fast;                        // 0x0153(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_3;                    // 0x0155(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_156[0x2];                                      // 0x0156(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Is_Fading_1;                    // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Is_Fading;                      // 0x0162(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0163(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0165(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_4;                    // 0x0166(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_5;                    // 0x0167(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_6;                    // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_7;                    // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_8;                    // 0x016A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_9;                    // 0x016B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_2;        // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default;                             // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_3;        // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AA[0x6];                                      // 0x01AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetGameTimeInSeconds_ReturnValue_1;       // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x01CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CB[0x5];                                      // 0x01CB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default_1;                           // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AVEnhancedAltarPlayerController*        K2Node_DynamicCast_AsVEnhanced_Altar_Player_Controller; // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBlendableInterface>   CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput; // 0x01F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TScriptInterface<class IBlendableInterface>   CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput_1; // 0x0200(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TScriptInterface<class IBlendableInterface>   CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput_2; // 0x0210(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TScriptInterface<class IBlendableInterface>   CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput_3; // 0x0220(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	double                                        CallFunc_Store_Data_From_Blood_Event_Event_Damages_ImplicitCast; // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Store_Data_From_Blood_Event_EventTarget_Max_HP_ImplicitCast; // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_Distortion_PP_Fading_Value_ImplicitCast; // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_Blood_PP_Fading_Value_ImplicitCast; // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1;   // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPlayRate_NewRate_ImplicitCast;         // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPlayRate_NewRate_ImplicitCast_1;       // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPlayRate_NewRate_ImplicitCast_2;       // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPlayRate_NewRate_ImplicitCast_3;       // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast_1;            // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BloodImpact_C_ExecuteUbergraph_BP_BloodImpact) == 0x000008, "Wrong alignment on BP_BloodImpact_C_ExecuteUbergraph_BP_BloodImpact");
static_assert(sizeof(BP_BloodImpact_C_ExecuteUbergraph_BP_BloodImpact) == 0x000280, "Wrong size on BP_BloodImpact_C_ExecuteUbergraph_BP_BloodImpact");
static_assert(offsetof(BP_BloodImpact_C_ExecuteUbergraph_BP_BloodImpact, EntryPoint) == 0x000000, "Member 'BP_BloodImpact_C_ExecuteUbergraph_BP_BloodImpact::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BloodImpact_C_ExecuteUbergraph_BP_BloodImpact, Temp_bool_Variable) == 0x000004, "Member 'BP_BloodImpact_C_ExecuteUbergraph_BP_BloodImpact::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_BloodImpact_C_ExecuteUbergraph_BP_BloodImpact, K2Node_SwitchEnum_CmpSuccess) == 0x000005, "Member 'BP_BloodImpact_C_ExecuteUbergraph_BP_BloodImpact::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_BloodImpact_C_ExecuteUbergraph_BP_BloodImpact, K2Node_SwitchEnum_CmpSuccess_1) == 0x000006, "Member 'BP_BloodImpact_C_ExecuteUbergraph_BP_BloodImpact::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_BloodImpact_C_ExecuteUbergraph_BP_BloodImpact, Temp_bool_Variable_1) == 0x000007, "Member 'BP_BloodImpact_C_ExecuteUbergraph_BP_BloodImpact::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BloodImpact_C_ExecuteUbergraph_BP_BloodImpact, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_BloodImpact_C_ExecuteUbergraph_BP_BloodImpact::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_BloodImpact_C_ExecuteUbergraph_BP_BloodImpact, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'BP_BloodImpact_C_ExecuteUbergraph_BP_BloodImpact::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_BloodImpact_C_ExecuteUbergraph_BP_BloodImpact, CallFunc_BreakVector_X) == 0x000028, "Member 'BP_BloodImpact_C_ExecuteUbergraph_BP_BloodImpact::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_BloodImpact_C_ExecuteUbergraph_BP_BloodImpact, CallFunc_BreakVector_Y) == 0x000030, "Member 'BP_BloodImpact_C_ExecuteUbergraph_BP_BloodImpact::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_BloodImpact_C_ExecuteUbergraph_BP_BloodImpact, CallFunc_BreakVector_Z) == 0x000038, "Member 'BP_BloodImpact_C_ExecuteUbergraph_BP_BloodImpact::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_BloodImpact_C_ExecuteUbergraph_BP_BloodImpact, CallFunc_MakeVector_NetQuantizeNormal_ReturnValue) == 0x000040, "Member 'BP_BloodImpact_C_ExecuteUbergraph_BP_BloodImpact::CallFunc_MakeVector_NetQuantizeNormal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BloodImpact_C_ExecuteUbergraph_BP_BloodImpact, Temp_int_Loop_Counter_Variable) == 0x000058, "Member 'BP_BloodImpact_C_ExecuteUbergraph_BP_BloodImpact::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_BloodImpact_C_ExecuteUbergraph_BP_BloodImpact, K2Node_Event_Data) == 0x000060, "Member 'BP_BloodImpact_C_ExecuteUbergraph_BP_BloodImpact::K2Node_Event_Data' has a wrong offset!");
static_assert(offsetof(BP_BloodImpact_C_ExecuteUbergraph_BP_BloodImpact, K2Node_Event_NiagaraSystem) == 0x000070, "Member 'BP_BloodImpact_C_ExecuteUbergraph_BP_BloodImpact::K2Node_Event_NiagaraSystem' has a wrong offset!");
static_assert(offsetof(BP_BloodImpact_C_ExecuteUbergraph_BP_BloodImpact, K2Node_Event_SimulationPositionOffset) == 0x000078, "Member 'BP_BloodImpact_C_ExecuteUbergraph_BP_BloodImpact::K2Node_Event_SimulationPositionOffset' has a wrong offset!");
static_assert(offsetof(BP_BloodImpact_C_ExecuteUbergraph_BP_BloodImpact, CallFunc_Add_IntInt_ReturnValue) == 0x000090, "Member 'BP_BloodImpact_C_ExecuteUbergraph_BP_BloodImpact::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BloodImpact_C_ExecuteUbergraph_BP_BloodImpact, CallFunc_Array_Length_ReturnValue) == 0x000094, "Member 'BP_BloodImpact_C_ExecuteUbergraph_BP_BloodImpact::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BloodImpact_C_ExecuteUbergraph_BP_BloodImpact, CallFunc_Less_IntInt_ReturnValue) == 0x000098, "Member 'BP_BloodImpact_C_ExecuteUbergraph_BP_BloodImpact::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BloodImpact_C_ExecuteUbergraph_BP_BloodImpact, K2Node_ComponentBoundEvent_PSystem) == 0x0000A0, "Member 'BP_BloodImpact_C_ExecuteUbergraph_BP_BloodImpact::K2Node_ComponentBoundEvent_PSystem' has a wrong offset!");
static_assert(offsetof(BP_BloodImpact_C_ExecuteUbergraph_BP_BloodImpact, K2Node_Event_Damages) == 0x0000A8, "Member 'BP_BloodImpact_C_ExecuteUbergraph_BP_BloodImpact::K2Node_Event_Damages' has a wrong offset!");
static_assert(offsetof(BP_BloodImpact_C_ExecuteUbergraph_BP_BloodImpact, K2Node_Event_BloodColor) == 0x0000AC, "Member 'BP_BloodImpact_C_ExecuteUbergraph_BP_BloodImpact::K2Node_Event_BloodColor' has a wrong offset!");
