#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DrinkAle

#include "Basic.hpp"

#include "Altar_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DrinkAle.BP_DrinkAle_C
// 0x0020 (0x0378 - 0x0358)
class ABP_DrinkAle_C final : public AVPotion
{
public:
	class ULocalMapComponent*                     LocalMapComponent;                                 // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NiagaraComponent;                                  // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UVTESObjectRefComponent*                ObjectRefComponent;                                // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UVParticleEffectPairingComponent*       VParticleEffectPairingComponent;                   // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_DrinkAle_C">();
	}
	static class ABP_DrinkAle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DrinkAle_C>();
	}
};
static_assert(alignof(ABP_DrinkAle_C) == 0x000008, "Wrong alignment on ABP_DrinkAle_C");
static_assert(sizeof(ABP_DrinkAle_C) == 0x000378, "Wrong size on ABP_DrinkAle_C");
static_assert(offsetof(ABP_DrinkAle_C, LocalMapComponent) == 0x000358, "Member 'ABP_DrinkAle_C::LocalMapComponent' has a wrong offset!");
static_assert(offsetof(ABP_DrinkAle_C, NiagaraComponent) == 0x000360, "Member 'ABP_DrinkAle_C::NiagaraComponent' has a wrong offset!");
static_assert(offsetof(ABP_DrinkAle_C, ObjectRefComponent) == 0x000368, "Member 'ABP_DrinkAle_C::ObjectRefComponent' has a wrong offset!");
static_assert(offsetof(ABP_DrinkAle_C, VParticleEffectPairingComponent) == 0x000370, "Member 'ABP_DrinkAle_C::VParticleEffectPairingComponent' has a wrong offset!");

}

