#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Door_SewerManHoleCover01

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Door_SewerManHoleCover01.BP_Door_SewerManHoleCover01_C.ExecuteUbergraph_BP_Door_SewerManHoleCover01
// 0x0018 (0x0018 - 0x0000)
struct BP_Door_SewerManHoleCover01_C_ExecuteUbergraph_BP_Door_SewerManHoleCover01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Event_1_2_sec;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Event_Second_1_2_sec;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Door_SewerManHoleCover01_C_ExecuteUbergraph_BP_Door_SewerManHoleCover01) == 0x000008, "Wrong alignment on BP_Door_SewerManHoleCover01_C_ExecuteUbergraph_BP_Door_SewerManHoleCover01");
static_assert(sizeof(BP_Door_SewerManHoleCover01_C_ExecuteUbergraph_BP_Door_SewerManHoleCover01) == 0x000018, "Wrong size on BP_Door_SewerManHoleCover01_C_ExecuteUbergraph_BP_Door_SewerManHoleCover01");
static_assert(offsetof(BP_Door_SewerManHoleCover01_C_ExecuteUbergraph_BP_Door_SewerManHoleCover01, EntryPoint) == 0x000000, "Member 'BP_Door_SewerManHoleCover01_C_ExecuteUbergraph_BP_Door_SewerManHoleCover01::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Door_SewerManHoleCover01_C_ExecuteUbergraph_BP_Door_SewerManHoleCover01, K2Node_Event_1_2_sec) == 0x000008, "Member 'BP_Door_SewerManHoleCover01_C_ExecuteUbergraph_BP_Door_SewerManHoleCover01::K2Node_Event_1_2_sec' has a wrong offset!");
static_assert(offsetof(BP_Door_SewerManHoleCover01_C_ExecuteUbergraph_BP_Door_SewerManHoleCover01, K2Node_Event_Second_1_2_sec) == 0x000010, "Member 'BP_Door_SewerManHoleCover01_C_ExecuteUbergraph_BP_Door_SewerManHoleCover01::K2Node_Event_Second_1_2_sec' has a wrong offset!");

// Function BP_Door_SewerManHoleCover01.BP_Door_SewerManHoleCover01_C.Update Timeline
// 0x0010 (0x0010 - 0x0000)
struct BP_Door_SewerManHoleCover01_C_Update_Timeline final
{
public:
	double                                        Two_sec;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Two_sec_0;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Door_SewerManHoleCover01_C_Update_Timeline) == 0x000008, "Wrong alignment on BP_Door_SewerManHoleCover01_C_Update_Timeline");
static_assert(sizeof(BP_Door_SewerManHoleCover01_C_Update_Timeline) == 0x000010, "Wrong size on BP_Door_SewerManHoleCover01_C_Update_Timeline");
static_assert(offsetof(BP_Door_SewerManHoleCover01_C_Update_Timeline, Two_sec) == 0x000000, "Member 'BP_Door_SewerManHoleCover01_C_Update_Timeline::Two_sec' has a wrong offset!");
static_assert(offsetof(BP_Door_SewerManHoleCover01_C_Update_Timeline, Two_sec_0) == 0x000008, "Member 'BP_Door_SewerManHoleCover01_C_Update_Timeline::Two_sec_0' has a wrong offset!");

}

