#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FallingDust

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_FallingDust.BP_FallingDust_C.UserConstructionScript
// 0x0024 (0x0024 - 0x0000)
struct BP_FallingDust_C_UserConstructionScript final
{
public:
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast;    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast_1;  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast_2;  // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast_3;  // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast_4;  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast_5;  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast_6;  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast_7;  // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast_8;  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FallingDust_C_UserConstructionScript) == 0x000004, "Wrong alignment on BP_FallingDust_C_UserConstructionScript");
static_assert(sizeof(BP_FallingDust_C_UserConstructionScript) == 0x000024, "Wrong size on BP_FallingDust_C_UserConstructionScript");
static_assert(offsetof(BP_FallingDust_C_UserConstructionScript, CallFunc_SetVariableFloat_InValue_ImplicitCast) == 0x000000, "Member 'BP_FallingDust_C_UserConstructionScript::CallFunc_SetVariableFloat_InValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_FallingDust_C_UserConstructionScript, CallFunc_SetVariableFloat_InValue_ImplicitCast_1) == 0x000004, "Member 'BP_FallingDust_C_UserConstructionScript::CallFunc_SetVariableFloat_InValue_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_FallingDust_C_UserConstructionScript, CallFunc_SetVariableFloat_InValue_ImplicitCast_2) == 0x000008, "Member 'BP_FallingDust_C_UserConstructionScript::CallFunc_SetVariableFloat_InValue_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_FallingDust_C_UserConstructionScript, CallFunc_SetVariableFloat_InValue_ImplicitCast_3) == 0x00000C, "Member 'BP_FallingDust_C_UserConstructionScript::CallFunc_SetVariableFloat_InValue_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(BP_FallingDust_C_UserConstructionScript, CallFunc_SetVariableFloat_InValue_ImplicitCast_4) == 0x000010, "Member 'BP_FallingDust_C_UserConstructionScript::CallFunc_SetVariableFloat_InValue_ImplicitCast_4' has a wrong offset!");
static_assert(offsetof(BP_FallingDust_C_UserConstructionScript, CallFunc_SetVariableFloat_InValue_ImplicitCast_5) == 0x000014, "Member 'BP_FallingDust_C_UserConstructionScript::CallFunc_SetVariableFloat_InValue_ImplicitCast_5' has a wrong offset!");
static_assert(offsetof(BP_FallingDust_C_UserConstructionScript, CallFunc_SetVariableFloat_InValue_ImplicitCast_6) == 0x000018, "Member 'BP_FallingDust_C_UserConstructionScript::CallFunc_SetVariableFloat_InValue_ImplicitCast_6' has a wrong offset!");
static_assert(offsetof(BP_FallingDust_C_UserConstructionScript, CallFunc_SetVariableFloat_InValue_ImplicitCast_7) == 0x00001C, "Member 'BP_FallingDust_C_UserConstructionScript::CallFunc_SetVariableFloat_InValue_ImplicitCast_7' has a wrong offset!");
static_assert(offsetof(BP_FallingDust_C_UserConstructionScript, CallFunc_SetVariableFloat_InValue_ImplicitCast_8) == 0x000020, "Member 'BP_FallingDust_C_UserConstructionScript::CallFunc_SetVariableFloat_InValue_ImplicitCast_8' has a wrong offset!");

}

