#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FogSheet

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_FogSheet.BP_FogSheet_C.UserConstructionScript
// 0x00F0 (0x00F0 - 0x0000)
struct BP_FogSheet_C_UserConstructionScript final
{
public:
	float                                         CallFunc_RandomFloatInRangeFromStream_ReturnValue; // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0040(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_2; // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_3; // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_4; // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_5; // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_6; // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_7; // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_8; // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_9; // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_10; // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_11; // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_12; // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_13; // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_14; // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FogSheet_C_UserConstructionScript) == 0x000010, "Wrong alignment on BP_FogSheet_C_UserConstructionScript");
static_assert(sizeof(BP_FogSheet_C_UserConstructionScript) == 0x0000F0, "Wrong size on BP_FogSheet_C_UserConstructionScript");
static_assert(offsetof(BP_FogSheet_C_UserConstructionScript, CallFunc_RandomFloatInRangeFromStream_ReturnValue) == 0x000000, "Member 'BP_FogSheet_C_UserConstructionScript::CallFunc_RandomFloatInRangeFromStream_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FogSheet_C_UserConstructionScript, CallFunc_BreakVector_X) == 0x000008, "Member 'BP_FogSheet_C_UserConstructionScript::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_FogSheet_C_UserConstructionScript, CallFunc_BreakVector_Y) == 0x000010, "Member 'BP_FogSheet_C_UserConstructionScript::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_FogSheet_C_UserConstructionScript, CallFunc_BreakVector_Z) == 0x000018, "Member 'BP_FogSheet_C_UserConstructionScript::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_FogSheet_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue) == 0x000020, "Member 'BP_FogSheet_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FogSheet_C_UserConstructionScript, CallFunc_MakeTransform_ReturnValue) == 0x000040, "Member 'BP_FogSheet_C_UserConstructionScript::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FogSheet_C_UserConstructionScript, CallFunc_AddComponent_ReturnValue) == 0x0000A0, "Member 'BP_FogSheet_C_UserConstructionScript::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FogSheet_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0000A8, "Member 'BP_FogSheet_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FogSheet_C_UserConstructionScript, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x0000B0, "Member 'BP_FogSheet_C_UserConstructionScript::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_FogSheet_C_UserConstructionScript, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x0000B4, "Member 'BP_FogSheet_C_UserConstructionScript::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_FogSheet_C_UserConstructionScript, CallFunc_SetScalarParameterValue_Value_ImplicitCast_2) == 0x0000B8, "Member 'BP_FogSheet_C_UserConstructionScript::CallFunc_SetScalarParameterValue_Value_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_FogSheet_C_UserConstructionScript, CallFunc_SetScalarParameterValue_Value_ImplicitCast_3) == 0x0000BC, "Member 'BP_FogSheet_C_UserConstructionScript::CallFunc_SetScalarParameterValue_Value_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(BP_FogSheet_C_UserConstructionScript, CallFunc_SetScalarParameterValue_Value_ImplicitCast_4) == 0x0000C0, "Member 'BP_FogSheet_C_UserConstructionScript::CallFunc_SetScalarParameterValue_Value_ImplicitCast_4' has a wrong offset!");
static_assert(offsetof(BP_FogSheet_C_UserConstructionScript, CallFunc_SetScalarParameterValue_Value_ImplicitCast_5) == 0x0000C4, "Member 'BP_FogSheet_C_UserConstructionScript::CallFunc_SetScalarParameterValue_Value_ImplicitCast_5' has a wrong offset!");
static_assert(offsetof(BP_FogSheet_C_UserConstructionScript, CallFunc_SetScalarParameterValue_Value_ImplicitCast_6) == 0x0000C8, "Member 'BP_FogSheet_C_UserConstructionScript::CallFunc_SetScalarParameterValue_Value_ImplicitCast_6' has a wrong offset!");
static_assert(offsetof(BP_FogSheet_C_UserConstructionScript, CallFunc_SetScalarParameterValue_Value_ImplicitCast_7) == 0x0000CC, "Member 'BP_FogSheet_C_UserConstructionScript::CallFunc_SetScalarParameterValue_Value_ImplicitCast_7' has a wrong offset!");
static_assert(offsetof(BP_FogSheet_C_UserConstructionScript, CallFunc_SetScalarParameterValue_Value_ImplicitCast_8) == 0x0000D0, "Member 'BP_FogSheet_C_UserConstructionScript::CallFunc_SetScalarParameterValue_Value_ImplicitCast_8' has a wrong offset!");
static_assert(offsetof(BP_FogSheet_C_UserConstructionScript, CallFunc_SetScalarParameterValue_Value_ImplicitCast_9) == 0x0000D4, "Member 'BP_FogSheet_C_UserConstructionScript::CallFunc_SetScalarParameterValue_Value_ImplicitCast_9' has a wrong offset!");
static_assert(offsetof(BP_FogSheet_C_UserConstructionScript, CallFunc_SetScalarParameterValue_Value_ImplicitCast_10) == 0x0000D8, "Member 'BP_FogSheet_C_UserConstructionScript::CallFunc_SetScalarParameterValue_Value_ImplicitCast_10' has a wrong offset!");
static_assert(offsetof(BP_FogSheet_C_UserConstructionScript, CallFunc_SetScalarParameterValue_Value_ImplicitCast_11) == 0x0000DC, "Member 'BP_FogSheet_C_UserConstructionScript::CallFunc_SetScalarParameterValue_Value_ImplicitCast_11' has a wrong offset!");
static_assert(offsetof(BP_FogSheet_C_UserConstructionScript, CallFunc_SetScalarParameterValue_Value_ImplicitCast_12) == 0x0000E0, "Member 'BP_FogSheet_C_UserConstructionScript::CallFunc_SetScalarParameterValue_Value_ImplicitCast_12' has a wrong offset!");
static_assert(offsetof(BP_FogSheet_C_UserConstructionScript, CallFunc_SetScalarParameterValue_Value_ImplicitCast_13) == 0x0000E4, "Member 'BP_FogSheet_C_UserConstructionScript::CallFunc_SetScalarParameterValue_Value_ImplicitCast_13' has a wrong offset!");
static_assert(offsetof(BP_FogSheet_C_UserConstructionScript, CallFunc_SetScalarParameterValue_Value_ImplicitCast_14) == 0x0000E8, "Member 'BP_FogSheet_C_UserConstructionScript::CallFunc_SetScalarParameterValue_Value_ImplicitCast_14' has a wrong offset!");

}

