#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Footstep

#include "Basic.hpp"

#include "Altar_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Footstep.BP_Footstep_C.BndEvt__BP_Footstep_NiagaraFX_K2Node_ComponentBoundEvent_0_OnNiagaraSystemFinished__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_Footstep_C_BndEvt__BP_Footstep_NiagaraFX_K2Node_ComponentBoundEvent_0_OnNiagaraSystemFinished__DelegateSignature final
{
public:
	class UNiagaraComponent*                      PSystem;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Footstep_C_BndEvt__BP_Footstep_NiagaraFX_K2Node_ComponentBoundEvent_0_OnNiagaraSystemFinished__DelegateSignature) == 0x000008, "Wrong alignment on BP_Footstep_C_BndEvt__BP_Footstep_NiagaraFX_K2Node_ComponentBoundEvent_0_OnNiagaraSystemFinished__DelegateSignature");
static_assert(sizeof(BP_Footstep_C_BndEvt__BP_Footstep_NiagaraFX_K2Node_ComponentBoundEvent_0_OnNiagaraSystemFinished__DelegateSignature) == 0x000008, "Wrong size on BP_Footstep_C_BndEvt__BP_Footstep_NiagaraFX_K2Node_ComponentBoundEvent_0_OnNiagaraSystemFinished__DelegateSignature");
static_assert(offsetof(BP_Footstep_C_BndEvt__BP_Footstep_NiagaraFX_K2Node_ComponentBoundEvent_0_OnNiagaraSystemFinished__DelegateSignature, PSystem) == 0x000000, "Member 'BP_Footstep_C_BndEvt__BP_Footstep_NiagaraFX_K2Node_ComponentBoundEvent_0_OnNiagaraSystemFinished__DelegateSignature::PSystem' has a wrong offset!");

// Function BP_Footstep.BP_Footstep_C.ExecuteUbergraph_BP_Footstep
// 0x0030 (0x0030 - 0x0000)
struct BP_Footstep_C_ExecuteUbergraph_BP_Footstep final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVLocomotionType                              K2Node_Event_LocomotionType;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bDoesBeginInFirstPerson;              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_Velocity;                             // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      K2Node_ComponentBoundEvent_PSystem;                // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Footstep_C_ExecuteUbergraph_BP_Footstep) == 0x000008, "Wrong alignment on BP_Footstep_C_ExecuteUbergraph_BP_Footstep");
static_assert(sizeof(BP_Footstep_C_ExecuteUbergraph_BP_Footstep) == 0x000030, "Wrong size on BP_Footstep_C_ExecuteUbergraph_BP_Footstep");
static_assert(offsetof(BP_Footstep_C_ExecuteUbergraph_BP_Footstep, EntryPoint) == 0x000000, "Member 'BP_Footstep_C_ExecuteUbergraph_BP_Footstep::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Footstep_C_ExecuteUbergraph_BP_Footstep, K2Node_Event_LocomotionType) == 0x000004, "Member 'BP_Footstep_C_ExecuteUbergraph_BP_Footstep::K2Node_Event_LocomotionType' has a wrong offset!");
static_assert(offsetof(BP_Footstep_C_ExecuteUbergraph_BP_Footstep, K2Node_Event_bDoesBeginInFirstPerson) == 0x000005, "Member 'BP_Footstep_C_ExecuteUbergraph_BP_Footstep::K2Node_Event_bDoesBeginInFirstPerson' has a wrong offset!");
static_assert(offsetof(BP_Footstep_C_ExecuteUbergraph_BP_Footstep, K2Node_Event_Velocity) == 0x000008, "Member 'BP_Footstep_C_ExecuteUbergraph_BP_Footstep::K2Node_Event_Velocity' has a wrong offset!");
static_assert(offsetof(BP_Footstep_C_ExecuteUbergraph_BP_Footstep, K2Node_ComponentBoundEvent_PSystem) == 0x000020, "Member 'BP_Footstep_C_ExecuteUbergraph_BP_Footstep::K2Node_ComponentBoundEvent_PSystem' has a wrong offset!");
static_assert(offsetof(BP_Footstep_C_ExecuteUbergraph_BP_Footstep, CallFunc_BooleanAND_ReturnValue) == 0x000028, "Member 'BP_Footstep_C_ExecuteUbergraph_BP_Footstep::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_Footstep.BP_Footstep_C.OnStartPlay
// 0x0020 (0x0020 - 0x0000)
struct BP_Footstep_C_OnStartPlay final
{
public:
	EVLocomotionType                              LocomotionType;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDoesBeginInFirstPerson;                           // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Velocity;                                          // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Footstep_C_OnStartPlay) == 0x000008, "Wrong alignment on BP_Footstep_C_OnStartPlay");
static_assert(sizeof(BP_Footstep_C_OnStartPlay) == 0x000020, "Wrong size on BP_Footstep_C_OnStartPlay");
static_assert(offsetof(BP_Footstep_C_OnStartPlay, LocomotionType) == 0x000000, "Member 'BP_Footstep_C_OnStartPlay::LocomotionType' has a wrong offset!");
static_assert(offsetof(BP_Footstep_C_OnStartPlay, bDoesBeginInFirstPerson) == 0x000001, "Member 'BP_Footstep_C_OnStartPlay::bDoesBeginInFirstPerson' has a wrong offset!");
static_assert(offsetof(BP_Footstep_C_OnStartPlay, Velocity) == 0x000008, "Member 'BP_Footstep_C_OnStartPlay::Velocity' has a wrong offset!");

// Function BP_Footstep.BP_Footstep_C.Setup Niagara Variables
// 0x0018 (0x0018 - 0x0000)
struct BP_Footstep_C_Setup_Niagara_Variables final
{
public:
	EVLocomotionType                              Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         K2Node_Select_Default;                             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Footstep_C_Setup_Niagara_Variables) == 0x000008, "Wrong alignment on BP_Footstep_C_Setup_Niagara_Variables");
static_assert(sizeof(BP_Footstep_C_Setup_Niagara_Variables) == 0x000018, "Wrong size on BP_Footstep_C_Setup_Niagara_Variables");
static_assert(offsetof(BP_Footstep_C_Setup_Niagara_Variables, Temp_byte_Variable) == 0x000000, "Member 'BP_Footstep_C_Setup_Niagara_Variables::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_Footstep_C_Setup_Niagara_Variables, K2Node_Select_Default) == 0x000008, "Member 'BP_Footstep_C_Setup_Niagara_Variables::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_Footstep_C_Setup_Niagara_Variables, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000010, "Member 'BP_Footstep_C_Setup_Niagara_Variables::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");

// Function BP_Footstep.BP_Footstep_C.UserConstructionScript
// 0x0040 (0x0040 - 0x0000)
struct BP_Footstep_C_UserConstructionScript final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         K2Node_Select_Default;                             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         K2Node_Select_Default_1;                           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         K2Node_Select_Default_2;                           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         K2Node_Select_Default_3;                           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         K2Node_Select_Default_4;                           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Footstep_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_Footstep_C_UserConstructionScript");
static_assert(sizeof(BP_Footstep_C_UserConstructionScript) == 0x000040, "Wrong size on BP_Footstep_C_UserConstructionScript");
static_assert(offsetof(BP_Footstep_C_UserConstructionScript, Temp_bool_Variable) == 0x000000, "Member 'BP_Footstep_C_UserConstructionScript::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_Footstep_C_UserConstructionScript, Temp_bool_Variable_1) == 0x000001, "Member 'BP_Footstep_C_UserConstructionScript::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Footstep_C_UserConstructionScript, Temp_bool_Variable_2) == 0x000002, "Member 'BP_Footstep_C_UserConstructionScript::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Footstep_C_UserConstructionScript, Temp_bool_Variable_3) == 0x000003, "Member 'BP_Footstep_C_UserConstructionScript::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_Footstep_C_UserConstructionScript, Temp_bool_Variable_4) == 0x000004, "Member 'BP_Footstep_C_UserConstructionScript::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_Footstep_C_UserConstructionScript, CallFunc_IsValid_ReturnValue) == 0x000005, "Member 'BP_Footstep_C_UserConstructionScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Footstep_C_UserConstructionScript, CallFunc_IsValid_ReturnValue_1) == 0x000006, "Member 'BP_Footstep_C_UserConstructionScript::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Footstep_C_UserConstructionScript, K2Node_Select_Default) == 0x000008, "Member 'BP_Footstep_C_UserConstructionScript::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_Footstep_C_UserConstructionScript, K2Node_Select_Default_1) == 0x000010, "Member 'BP_Footstep_C_UserConstructionScript::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_Footstep_C_UserConstructionScript, CallFunc_IsValid_ReturnValue_2) == 0x000018, "Member 'BP_Footstep_C_UserConstructionScript::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Footstep_C_UserConstructionScript, CallFunc_IsValid_ReturnValue_3) == 0x000019, "Member 'BP_Footstep_C_UserConstructionScript::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Footstep_C_UserConstructionScript, K2Node_Select_Default_2) == 0x000020, "Member 'BP_Footstep_C_UserConstructionScript::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(BP_Footstep_C_UserConstructionScript, K2Node_Select_Default_3) == 0x000028, "Member 'BP_Footstep_C_UserConstructionScript::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(BP_Footstep_C_UserConstructionScript, CallFunc_IsValid_ReturnValue_4) == 0x000030, "Member 'BP_Footstep_C_UserConstructionScript::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Footstep_C_UserConstructionScript, K2Node_Select_Default_4) == 0x000038, "Member 'BP_Footstep_C_UserConstructionScript::K2Node_Select_Default_4' has a wrong offset!");

}

