#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Flora_InteractibleObjects

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Altar_classes.hpp"
#include "BPE_InteractibleObjectList_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Flora_InteractibleObjects.BP_Flora_InteractibleObjects_C
// 0x01A0 (0x04E8 - 0x0348)
class ABP_Flora_InteractibleObjects_C final : public AVFlora
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0348(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Pod;                                               // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Pickable_Empty;                                 // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Pickable;                                       // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_8_Location_105B97344735CDDF138430B54817E35D; // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_8_Scale_105B97344735CDDF138430B54817E35D; // 0x036C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_8__Direction_105B97344735CDDF138430B54817E35D; // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_371[0x7];                                      // 0x0371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_8;                                        // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_2_NewTrack_0_C8BBC8284CDC242F2E290AB60853F635; // 0x0380(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_2__Direction_C8BBC8284CDC242F2E290AB60853F635; // 0x0384(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_385[0x3];                                      // 0x0385(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_2;                                        // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_7_Scale_3ACE2EC5413ECB972CC5D395E77497C3; // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_7_Location_3ACE2EC5413ECB972CC5D395E77497C3; // 0x0394(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_7__Direction_3ACE2EC5413ECB972CC5D395E77497C3; // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_399[0x7];                                      // 0x0399(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_7;                                        // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_NewTrack_0_D220BC69476D30B756163AAA565BE002; // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_D220BC69476D30B756163AAA565BE002; // 0x03AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AD[0x3];                                      // 0x03AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_6_WindRandomizeDirection_D19E8EC349BE248A39CA689BD5383784; // 0x03B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_6__Direction_D19E8EC349BE248A39CA689BD5383784; // 0x03BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BD[0x3];                                      // 0x03BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_6;                                        // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_5_WindRandomizeDirection_26F5D0B045C4E70A486AF4857ABE4098; // 0x03C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_5__Direction_26F5D0B045C4E70A486AF4857ABE4098; // 0x03CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CD[0x3];                                      // 0x03CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_5;                                        // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_3_Z_16AACE474757604B76457AA0BB584C31;     // 0x03D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_3_X_Y_16AACE474757604B76457AA0BB584C31;   // 0x03DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_3__Direction_16AACE474757604B76457AA0BB584C31; // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E1[0x7];                                      // 0x03E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_3;                                        // 0x03E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_4_Z_949C1C5F4C132DA46E3232988409F3A6;     // 0x03F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_4_X_Y_949C1C5F4C132DA46E3232988409F3A6;   // 0x03F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_4__Direction_949C1C5F4C132DA46E3232988409F3A6; // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F9[0x7];                                      // 0x03F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_4;                                        // 0x0400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_NewTrack_0_2CF8104F4CCEA02ACDC2E4803AD166EF; // 0x0408(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_2CF8104F4CCEA02ACDC2E4803AD166EF; // 0x040C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_40D[0x3];                                      // 0x040D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0410(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_1_Location_35D7F43049B051300FC4C48FE767CCED; // 0x0418(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_1_Scale_35D7F43049B051300FC4C48FE767CCED; // 0x041C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_1__Direction_35D7F43049B051300FC4C48FE767CCED; // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_421[0x7];                                      // 0x0421(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_1;                                        // 0x0428(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            FullMesh;                                          // 0x0430(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            EmptyMesh;                                         // 0x0438(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EBPE_InteractibleObjectList                   Kind_of_Flora;                                     // 0x0440(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_441[0x7];                                      // 0x0441(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Mesh_Component_Material;                           // 0x0448(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Pickable_RelativeScale;                            // 0x0450(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location_Offset;                                   // 0x0468(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Pickable_Location;                                 // 0x0480(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PickableEmpty_RelativeScale;                       // 0x0498(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PickableEmpty_Location;                            // 0x04B0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Pod____Egg;                                        // 0x04C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Pod____Base;                                       // 0x04D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Pod____Eye;                                        // 0x04D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Plant_interaction_intensity;                       // 0x04E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Flora_InteractibleObjects(int32 EntryPoint);
	void OnEmptyFlagChanged();
	void ReceiveBeginPlay();
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void Timeline_1__FinishedFunc();
	void Timeline_1__UpdateFunc();
	void Timeline_2__FinishedFunc();
	void Timeline_2__UpdateFunc();
	void Timeline_3__FinishedFunc();
	void Timeline_3__UpdateFunc();
	void Timeline_4__FinishedFunc();
	void Timeline_4__UpdateFunc();
	void Timeline_5__FinishedFunc();
	void Timeline_5__UpdateFunc();
	void Timeline_6__FinishedFunc();
	void Timeline_6__UpdateFunc();
	void Timeline_7__FinishedFunc();
	void Timeline_7__UpdateFunc();
	void Timeline_8__FinishedFunc();
	void Timeline_8__UpdateFunc();
	void Timeline__FinishedFunc();
	void Timeline__UpdateFunc();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Flora_InteractibleObjects_C">();
	}
	static class ABP_Flora_InteractibleObjects_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Flora_InteractibleObjects_C>();
	}
};
static_assert(alignof(ABP_Flora_InteractibleObjects_C) == 0x000008, "Wrong alignment on ABP_Flora_InteractibleObjects_C");
static_assert(sizeof(ABP_Flora_InteractibleObjects_C) == 0x0004E8, "Wrong size on ABP_Flora_InteractibleObjects_C");
static_assert(offsetof(ABP_Flora_InteractibleObjects_C, UberGraphFrame) == 0x000348, "Member 'ABP_Flora_InteractibleObjects_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Flora_InteractibleObjects_C, Pod) == 0x000350, "Member 'ABP_Flora_InteractibleObjects_C::Pod' has a wrong offset!");
static_assert(offsetof(ABP_Flora_InteractibleObjects_C, SM_Pickable_Empty) == 0x000358, "Member 'ABP_Flora_InteractibleObjects_C::SM_Pickable_Empty' has a wrong offset!");
static_assert(offsetof(ABP_Flora_InteractibleObjects_C, SM_Pickable) == 0x000360, "Member 'ABP_Flora_InteractibleObjects_C::SM_Pickable' has a wrong offset!");
static_assert(offsetof(ABP_Flora_InteractibleObjects_C, Timeline_8_Location_105B97344735CDDF138430B54817E35D) == 0x000368, "Member 'ABP_Flora_InteractibleObjects_C::Timeline_8_Location_105B97344735CDDF138430B54817E35D' has a wrong offset!");
static_assert(offsetof(ABP_Flora_InteractibleObjects_C, Timeline_8_Scale_105B97344735CDDF138430B54817E35D) == 0x00036C, "Member 'ABP_Flora_InteractibleObjects_C::Timeline_8_Scale_105B97344735CDDF138430B54817E35D' has a wrong offset!");
static_assert(offsetof(ABP_Flora_InteractibleObjects_C, Timeline_8__Direction_105B97344735CDDF138430B54817E35D) == 0x000370, "Member 'ABP_Flora_InteractibleObjects_C::Timeline_8__Direction_105B97344735CDDF138430B54817E35D' has a wrong offset!");
static_assert(offsetof(ABP_Flora_InteractibleObjects_C, Timeline_8) == 0x000378, "Member 'ABP_Flora_InteractibleObjects_C::Timeline_8' has a wrong offset!");
static_assert(offsetof(ABP_Flora_InteractibleObjects_C, Timeline_2_NewTrack_0_C8BBC8284CDC242F2E290AB60853F635) == 0x000380, "Member 'ABP_Flora_InteractibleObjects_C::Timeline_2_NewTrack_0_C8BBC8284CDC242F2E290AB60853F635' has a wrong offset!");
static_assert(offsetof(ABP_Flora_InteractibleObjects_C, Timeline_2__Direction_C8BBC8284CDC242F2E290AB60853F635) == 0x000384, "Member 'ABP_Flora_InteractibleObjects_C::Timeline_2__Direction_C8BBC8284CDC242F2E290AB60853F635' has a wrong offset!");
static_assert(offsetof(ABP_Flora_InteractibleObjects_C, Timeline_2) == 0x000388, "Member 'ABP_Flora_InteractibleObjects_C::Timeline_2' has a wrong offset!");
static_assert(offsetof(ABP_Flora_InteractibleObjects_C, Timeline_7_Scale_3ACE2EC5413ECB972CC5D395E77497C3) == 0x000390, "Member 'ABP_Flora_InteractibleObjects_C::Timeline_7_Scale_3ACE2EC5413ECB972CC5D395E77497C3' has a wrong offset!");
static_assert(offsetof(ABP_Flora_InteractibleObjects_C, Timeline_7_Location_3ACE2EC5413ECB972CC5D395E77497C3) == 0x000394, "Member 'ABP_Flora_InteractibleObjects_C::Timeline_7_Location_3ACE2EC5413ECB972CC5D395E77497C3' has a wrong offset!");
static_assert(offsetof(ABP_Flora_InteractibleObjects_C, Timeline_7__Direction_3ACE2EC5413ECB972CC5D395E77497C3) == 0x000398, "Member 'ABP_Flora_InteractibleObjects_C::Timeline_7__Direction_3ACE2EC5413ECB972CC5D395E77497C3' has a wrong offset!");
static_assert(offsetof(ABP_Flora_InteractibleObjects_C, Timeline_7) == 0x0003A0, "Member 'ABP_Flora_InteractibleObjects_C::Timeline_7' has a wrong offset!");
static_assert(offsetof(ABP_Flora_InteractibleObjects_C, Timeline_NewTrack_0_D220BC69476D30B756163AAA565BE002) == 0x0003A8, "Member 'ABP_Flora_InteractibleObjects_C::Timeline_NewTrack_0_D220BC69476D30B756163AAA565BE002' has a wrong offset!");
static_assert(offsetof(ABP_Flora_InteractibleObjects_C, Timeline__Direction_D220BC69476D30B756163AAA565BE002) == 0x0003AC, "Member 'ABP_Flora_InteractibleObjects_C::Timeline__Direction_D220BC69476D30B756163AAA565BE002' has a wrong offset!");
static_assert(offsetof(ABP_Flora_InteractibleObjects_C, Timeline) == 0x0003B0, "Member 'ABP_Flora_InteractibleObjects_C::Timeline' has a wrong offset!");
static_assert(offsetof(ABP_Flora_InteractibleObjects_C, Timeline_6_WindRandomizeDirection_D19E8EC349BE248A39CA689BD5383784) == 0x0003B8, "Member 'ABP_Flora_InteractibleObjects_C::Timeline_6_WindRandomizeDirection_D19E8EC349BE248A39CA689BD5383784' has a wrong offset!");
static_assert(offsetof(ABP_Flora_InteractibleObjects_C, Timeline_6__Direction_D19E8EC349BE248A39CA689BD5383784) == 0x0003BC, "Member 'ABP_Flora_InteractibleObjects_C::Timeline_6__Direction_D19E8EC349BE248A39CA689BD5383784' has a wrong offset!");
static_assert(offsetof(ABP_Flora_InteractibleObjects_C, Timeline_6) == 0x0003C0, "Member 'ABP_Flora_InteractibleObjects_C::Timeline_6' has a wrong offset!");
static_assert(offsetof(ABP_Flora_InteractibleObjects_C, Timeline_5_WindRandomizeDirection_26F5D0B045C4E70A486AF4857ABE4098) == 0x0003C8, "Member 'ABP_Flora_InteractibleObjects_C::Timeline_5_WindRandomizeDirection_26F5D0B045C4E70A486AF4857ABE4098' has a wrong offset!");
static_assert(offsetof(ABP_Flora_InteractibleObjects_C, Timeline_5__Direction_26F5D0B045C4E70A486AF4857ABE4098) == 0x0003CC, "Member 'ABP_Flora_InteractibleObjects_C::Timeline_5__Direction_26F5D0B045C4E70A486AF4857ABE4098' has a wrong offset!");
static_assert(offsetof(ABP_Flora_InteractibleObjects_C, Timeline_5) == 0x0003D0, "Member 'ABP_Flora_InteractibleObjects_C::Timeline_5' has a wrong offset!");
static_assert(offsetof(ABP_Flora_InteractibleObjects_C, Timeline_3_Z_16AACE474757604B76457AA0BB584C31) == 0x0003D8, "Member 'ABP_Flora_InteractibleObjects_C::Timeline_3_Z_16AACE474757604B76457AA0BB584C31' has a wrong offset!");
static_assert(offsetof(ABP_Flora_InteractibleObjects_C, Timeline_3_X_Y_16AACE474757604B76457AA0BB584C31) == 0x0003DC, "Member 'ABP_Flora_InteractibleObjects_C::Timeline_3_X_Y_16AACE474757604B76457AA0BB584C31' has a wrong offset!");
static_assert(offsetof(ABP_Flora_InteractibleObjects_C, Timeline_3__Direction_16AACE474757604B76457AA0BB584C31) == 0x0003E0, "Member 'ABP_Flora_InteractibleObjects_C::Timeline_3__Direction_16AACE474757604B76457AA0BB584C31' has a wrong offset!");
static_assert(offsetof(ABP_Flora_InteractibleObjects_C, Timeline_3) == 0x0003E8, "Member 'ABP_Flora_InteractibleObjects_C::Timeline_3' has a wrong offset!");
static_assert(offsetof(ABP_Flora_InteractibleObjects_C, Timeline_4_Z_949C1C5F4C132DA46E3232988409F3A6) == 0x0003F0, "Member 'ABP_Flora_InteractibleObjects_C::Timeline_4_Z_949C1C5F4C132DA46E3232988409F3A6' has a wrong offset!");
static_assert(offsetof(ABP_Flora_InteractibleObjects_C, Timeline_4_X_Y_949C1C5F4C132DA46E3232988409F3A6) == 0x0003F4, "Member 'ABP_Flora_InteractibleObjects_C::Timeline_4_X_Y_949C1C5F4C132DA46E3232988409F3A6' has a wrong offset!");
static_assert(offsetof(ABP_Flora_InteractibleObjects_C, Timeline_4__Direction_949C1C5F4C132DA46E3232988409F3A6) == 0x0003F8, "Member 'ABP_Flora_InteractibleObjects_C::Timeline_4__Direction_949C1C5F4C132DA46E3232988409F3A6' has a wrong offset!");
static_assert(offsetof(ABP_Flora_InteractibleObjects_C, Timeline_4) == 0x000400, "Member 'ABP_Flora_InteractibleObjects_C::Timeline_4' has a wrong offset!");
static_assert(offsetof(ABP_Flora_InteractibleObjects_C, Timeline_0_NewTrack_0_2CF8104F4CCEA02ACDC2E4803AD166EF) == 0x000408, "Member 'ABP_Flora_InteractibleObjects_C::Timeline_0_NewTrack_0_2CF8104F4CCEA02ACDC2E4803AD166EF' has a wrong offset!");
static_assert(offsetof(ABP_Flora_InteractibleObjects_C, Timeline_0__Direction_2CF8104F4CCEA02ACDC2E4803AD166EF) == 0x00040C, "Member 'ABP_Flora_InteractibleObjects_C::Timeline_0__Direction_2CF8104F4CCEA02ACDC2E4803AD166EF' has a wrong offset!");
static_assert(offsetof(ABP_Flora_InteractibleObjects_C, Timeline_0) == 0x000410, "Member 'ABP_Flora_InteractibleObjects_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ABP_Flora_InteractibleObjects_C, Timeline_1_Location_35D7F43049B051300FC4C48FE767CCED) == 0x000418, "Member 'ABP_Flora_InteractibleObjects_C::Timeline_1_Location_35D7F43049B051300FC4C48FE767CCED' has a wrong offset!");
static_assert(offsetof(ABP_Flora_InteractibleObjects_C, Timeline_1_Scale_35D7F43049B051300FC4C48FE767CCED) == 0x00041C, "Member 'ABP_Flora_InteractibleObjects_C::Timeline_1_Scale_35D7F43049B051300FC4C48FE767CCED' has a wrong offset!");
static_assert(offsetof(ABP_Flora_InteractibleObjects_C, Timeline_1__Direction_35D7F43049B051300FC4C48FE767CCED) == 0x000420, "Member 'ABP_Flora_InteractibleObjects_C::Timeline_1__Direction_35D7F43049B051300FC4C48FE767CCED' has a wrong offset!");
static_assert(offsetof(ABP_Flora_InteractibleObjects_C, Timeline_1) == 0x000428, "Member 'ABP_Flora_InteractibleObjects_C::Timeline_1' has a wrong offset!");
static_assert(offsetof(ABP_Flora_InteractibleObjects_C, FullMesh) == 0x000430, "Member 'ABP_Flora_InteractibleObjects_C::FullMesh' has a wrong offset!");
static_assert(offsetof(ABP_Flora_InteractibleObjects_C, EmptyMesh) == 0x000438, "Member 'ABP_Flora_InteractibleObjects_C::EmptyMesh' has a wrong offset!");
static_assert(offsetof(ABP_Flora_InteractibleObjects_C, Kind_of_Flora) == 0x000440, "Member 'ABP_Flora_InteractibleObjects_C::Kind_of_Flora' has a wrong offset!");
static_assert(offsetof(ABP_Flora_InteractibleObjects_C, Mesh_Component_Material) == 0x000448, "Member 'ABP_Flora_InteractibleObjects_C::Mesh_Component_Material' has a wrong offset!");
static_assert(offsetof(ABP_Flora_InteractibleObjects_C, Pickable_RelativeScale) == 0x000450, "Member 'ABP_Flora_InteractibleObjects_C::Pickable_RelativeScale' has a wrong offset!");
static_assert(offsetof(ABP_Flora_InteractibleObjects_C, Location_Offset) == 0x000468, "Member 'ABP_Flora_InteractibleObjects_C::Location_Offset' has a wrong offset!");
static_assert(offsetof(ABP_Flora_InteractibleObjects_C, Pickable_Location) == 0x000480, "Member 'ABP_Flora_InteractibleObjects_C::Pickable_Location' has a wrong offset!");
static_assert(offsetof(ABP_Flora_InteractibleObjects_C, PickableEmpty_RelativeScale) == 0x000498, "Member 'ABP_Flora_InteractibleObjects_C::PickableEmpty_RelativeScale' has a wrong offset!");
static_assert(offsetof(ABP_Flora_InteractibleObjects_C, PickableEmpty_Location) == 0x0004B0, "Member 'ABP_Flora_InteractibleObjects_C::PickableEmpty_Location' has a wrong offset!");
static_assert(offsetof(ABP_Flora_InteractibleObjects_C, Pod____Egg) == 0x0004C8, "Member 'ABP_Flora_InteractibleObjects_C::Pod____Egg' has a wrong offset!");
static_assert(offsetof(ABP_Flora_InteractibleObjects_C, Pod____Base) == 0x0004D0, "Member 'ABP_Flora_InteractibleObjects_C::Pod____Base' has a wrong offset!");
static_assert(offsetof(ABP_Flora_InteractibleObjects_C, Pod____Eye) == 0x0004D8, "Member 'ABP_Flora_InteractibleObjects_C::Pod____Eye' has a wrong offset!");
static_assert(offsetof(ABP_Flora_InteractibleObjects_C, Plant_interaction_intensity) == 0x0004E0, "Member 'ABP_Flora_InteractibleObjects_C::Plant_interaction_intensity' has a wrong offset!");

}

