#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FXLightBeamDust01

#include "Basic.hpp"

#include "Altar_classes.hpp"


namespace SDK
{

// VModdableBlueprintGeneratedClass BP_FXLightBeamDust01.BP_FXLightBeamDust01_C
// 0x0018 (0x0360 - 0x0348)
class ABP_FXLightBeamDust01_C final : public AVStatic
{
public:
	class UNiagaraComponent*                      NiagaraComponent;                                  // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UVTESObjectRefComponent*                ObjectRefComponent;                                // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UVParticleEffectPairingComponent*       VParticleEffectPairingComponent;                   // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_FXLightBeamDust01_C">();
	}
	static class ABP_FXLightBeamDust01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_FXLightBeamDust01_C>();
	}
};
static_assert(alignof(ABP_FXLightBeamDust01_C) == 0x000008, "Wrong alignment on ABP_FXLightBeamDust01_C");
static_assert(sizeof(ABP_FXLightBeamDust01_C) == 0x000360, "Wrong size on ABP_FXLightBeamDust01_C");
static_assert(offsetof(ABP_FXLightBeamDust01_C, NiagaraComponent) == 0x000348, "Member 'ABP_FXLightBeamDust01_C::NiagaraComponent' has a wrong offset!");
static_assert(offsetof(ABP_FXLightBeamDust01_C, ObjectRefComponent) == 0x000350, "Member 'ABP_FXLightBeamDust01_C::ObjectRefComponent' has a wrong offset!");
static_assert(offsetof(ABP_FXLightBeamDust01_C, VParticleEffectPairingComponent) == 0x000358, "Member 'ABP_FXLightBeamDust01_C::VParticleEffectPairingComponent' has a wrong offset!");

}

