#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FlyingInsects

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_FlyingInsects.BP_FlyingInsects_C.UserConstructionScript
// 0x0038 (0x0038 - 0x0000)
struct BP_FlyingInsects_C_UserConstructionScript final
{
public:
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast;    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast_1;  // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1;   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast_2;  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast_3;  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast_4;  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast_5;  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FlyingInsects_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_FlyingInsects_C_UserConstructionScript");
static_assert(sizeof(BP_FlyingInsects_C_UserConstructionScript) == 0x000038, "Wrong size on BP_FlyingInsects_C_UserConstructionScript");
static_assert(offsetof(BP_FlyingInsects_C_UserConstructionScript, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000000, "Member 'BP_FlyingInsects_C_UserConstructionScript::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FlyingInsects_C_UserConstructionScript, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000008, "Member 'BP_FlyingInsects_C_UserConstructionScript::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FlyingInsects_C_UserConstructionScript, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000010, "Member 'BP_FlyingInsects_C_UserConstructionScript::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_FlyingInsects_C_UserConstructionScript, CallFunc_SetVariableFloat_InValue_ImplicitCast) == 0x000018, "Member 'BP_FlyingInsects_C_UserConstructionScript::CallFunc_SetVariableFloat_InValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_FlyingInsects_C_UserConstructionScript, CallFunc_SetVariableFloat_InValue_ImplicitCast_1) == 0x00001C, "Member 'BP_FlyingInsects_C_UserConstructionScript::CallFunc_SetVariableFloat_InValue_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_FlyingInsects_C_UserConstructionScript, CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1) == 0x000020, "Member 'BP_FlyingInsects_C_UserConstructionScript::CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_FlyingInsects_C_UserConstructionScript, CallFunc_SetVariableFloat_InValue_ImplicitCast_2) == 0x000028, "Member 'BP_FlyingInsects_C_UserConstructionScript::CallFunc_SetVariableFloat_InValue_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_FlyingInsects_C_UserConstructionScript, CallFunc_SetVariableFloat_InValue_ImplicitCast_3) == 0x00002C, "Member 'BP_FlyingInsects_C_UserConstructionScript::CallFunc_SetVariableFloat_InValue_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(BP_FlyingInsects_C_UserConstructionScript, CallFunc_SetVariableFloat_InValue_ImplicitCast_4) == 0x000030, "Member 'BP_FlyingInsects_C_UserConstructionScript::CallFunc_SetVariableFloat_InValue_ImplicitCast_4' has a wrong offset!");
static_assert(offsetof(BP_FlyingInsects_C_UserConstructionScript, CallFunc_SetVariableFloat_InValue_ImplicitCast_5) == 0x000034, "Member 'BP_FlyingInsects_C_UserConstructionScript::CallFunc_SetVariableFloat_InValue_ImplicitCast_5' has a wrong offset!");

}

