#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Footstep

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Altar_structs.hpp"
#include "Altar_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Footstep.BP_Footstep_C
// 0x0078 (0x0318 - 0x02A0)
class ABP_Footstep_C : public AVFootStepVFXBlueprint
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      NiagaraFX;                                         // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	EVLocomotionType                              Footstep_Type;                                     // 0x02B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         Walk_Niagara_System;                               // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         Footstep_Lifetime;                                 // 0x02C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         Run_Niagara_System;                                // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         Sneaky_Niagara_System;                             // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         Sneaky_Run_Niagara_System;                         // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         Jump_Niagara_System;                               // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         Current_Run_Niagara_System;                        // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	class UNiagaraSystem*                         Current_Sneaky_Niagara_System;                     // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	class UNiagaraSystem*                         Current_Sneaky_Run_Niagara_System;                 // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	class UNiagaraSystem*                         Current_Jump_Niagara_System;                       // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	bool                                          Delay_Done;                                        // 0x0310(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	bool                                          System_Finished;                                   // 0x0311(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)

public:
	void BndEvt__BP_Footstep_NiagaraFX_K2Node_ComponentBoundEvent_0_OnNiagaraSystemFinished__DelegateSignature(class UNiagaraComponent* PSystem);
	void Child_Behavior__After_Setup();
	void Child_Behavior__Before_Setup();
	void ExecuteUbergraph_BP_Footstep(int32 EntryPoint);
	void OnStartPlay(EVLocomotionType LocomotionType, bool bDoesBeginInFirstPerson, const struct FVector& Velocity);
	void Setup_Niagara_Variables();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Footstep_C">();
	}
	static class ABP_Footstep_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Footstep_C>();
	}
};
static_assert(alignof(ABP_Footstep_C) == 0x000008, "Wrong alignment on ABP_Footstep_C");
static_assert(sizeof(ABP_Footstep_C) == 0x000318, "Wrong size on ABP_Footstep_C");
static_assert(offsetof(ABP_Footstep_C, UberGraphFrame) == 0x0002A0, "Member 'ABP_Footstep_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Footstep_C, NiagaraFX) == 0x0002A8, "Member 'ABP_Footstep_C::NiagaraFX' has a wrong offset!");
static_assert(offsetof(ABP_Footstep_C, DefaultSceneRoot) == 0x0002B0, "Member 'ABP_Footstep_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Footstep_C, Footstep_Type) == 0x0002B8, "Member 'ABP_Footstep_C::Footstep_Type' has a wrong offset!");
static_assert(offsetof(ABP_Footstep_C, Walk_Niagara_System) == 0x0002C0, "Member 'ABP_Footstep_C::Walk_Niagara_System' has a wrong offset!");
static_assert(offsetof(ABP_Footstep_C, Footstep_Lifetime) == 0x0002C8, "Member 'ABP_Footstep_C::Footstep_Lifetime' has a wrong offset!");
static_assert(offsetof(ABP_Footstep_C, Run_Niagara_System) == 0x0002D0, "Member 'ABP_Footstep_C::Run_Niagara_System' has a wrong offset!");
static_assert(offsetof(ABP_Footstep_C, Sneaky_Niagara_System) == 0x0002D8, "Member 'ABP_Footstep_C::Sneaky_Niagara_System' has a wrong offset!");
static_assert(offsetof(ABP_Footstep_C, Sneaky_Run_Niagara_System) == 0x0002E0, "Member 'ABP_Footstep_C::Sneaky_Run_Niagara_System' has a wrong offset!");
static_assert(offsetof(ABP_Footstep_C, Jump_Niagara_System) == 0x0002E8, "Member 'ABP_Footstep_C::Jump_Niagara_System' has a wrong offset!");
static_assert(offsetof(ABP_Footstep_C, Current_Run_Niagara_System) == 0x0002F0, "Member 'ABP_Footstep_C::Current_Run_Niagara_System' has a wrong offset!");
static_assert(offsetof(ABP_Footstep_C, Current_Sneaky_Niagara_System) == 0x0002F8, "Member 'ABP_Footstep_C::Current_Sneaky_Niagara_System' has a wrong offset!");
static_assert(offsetof(ABP_Footstep_C, Current_Sneaky_Run_Niagara_System) == 0x000300, "Member 'ABP_Footstep_C::Current_Sneaky_Run_Niagara_System' has a wrong offset!");
static_assert(offsetof(ABP_Footstep_C, Current_Jump_Niagara_System) == 0x000308, "Member 'ABP_Footstep_C::Current_Jump_Niagara_System' has a wrong offset!");
static_assert(offsetof(ABP_Footstep_C, Delay_Done) == 0x000310, "Member 'ABP_Footstep_C::Delay_Done' has a wrong offset!");
static_assert(offsetof(ABP_Footstep_C, System_Finished) == 0x000311, "Member 'ABP_Footstep_C::System_Finished' has a wrong offset!");

}

