#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Generic_BDP_Hands

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Generic_BDP_Hands.BP_Generic_BDP_Hands_C.ExecuteUbergraph_BP_Generic_BDP_Hands
// 0x0050 (0x0050 - 0x0000)
struct BP_Generic_BDP_Hands_C_ExecuteUbergraph_BP_Generic_BDP_Hands final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AVPairedPawn*                           K2Node_DynamicCast_AsVPaired_Pawn;                 // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPrimitiveComponent*>            CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0028(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UBPC_StatusEffect_C*                    CallFunc_GetComponentByClass_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Generic_BDP_Hands_C_ExecuteUbergraph_BP_Generic_BDP_Hands) == 0x000008, "Wrong alignment on BP_Generic_BDP_Hands_C_ExecuteUbergraph_BP_Generic_BDP_Hands");
static_assert(sizeof(BP_Generic_BDP_Hands_C_ExecuteUbergraph_BP_Generic_BDP_Hands) == 0x000050, "Wrong size on BP_Generic_BDP_Hands_C_ExecuteUbergraph_BP_Generic_BDP_Hands");
static_assert(offsetof(BP_Generic_BDP_Hands_C_ExecuteUbergraph_BP_Generic_BDP_Hands, EntryPoint) == 0x000000, "Member 'BP_Generic_BDP_Hands_C_ExecuteUbergraph_BP_Generic_BDP_Hands::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Hands_C_ExecuteUbergraph_BP_Generic_BDP_Hands, Temp_int_Variable) == 0x000004, "Member 'BP_Generic_BDP_Hands_C_ExecuteUbergraph_BP_Generic_BDP_Hands::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Hands_C_ExecuteUbergraph_BP_Generic_BDP_Hands, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_Generic_BDP_Hands_C_ExecuteUbergraph_BP_Generic_BDP_Hands::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Hands_C_ExecuteUbergraph_BP_Generic_BDP_Hands, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000010, "Member 'BP_Generic_BDP_Hands_C_ExecuteUbergraph_BP_Generic_BDP_Hands::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Hands_C_ExecuteUbergraph_BP_Generic_BDP_Hands, K2Node_DynamicCast_AsVPaired_Pawn) == 0x000018, "Member 'BP_Generic_BDP_Hands_C_ExecuteUbergraph_BP_Generic_BDP_Hands::K2Node_DynamicCast_AsVPaired_Pawn' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Hands_C_ExecuteUbergraph_BP_Generic_BDP_Hands, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_Generic_BDP_Hands_C_ExecuteUbergraph_BP_Generic_BDP_Hands::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Hands_C_ExecuteUbergraph_BP_Generic_BDP_Hands, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000028, "Member 'BP_Generic_BDP_Hands_C_ExecuteUbergraph_BP_Generic_BDP_Hands::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Hands_C_ExecuteUbergraph_BP_Generic_BDP_Hands, CallFunc_GetComponentByClass_ReturnValue) == 0x000038, "Member 'BP_Generic_BDP_Hands_C_ExecuteUbergraph_BP_Generic_BDP_Hands::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Hands_C_ExecuteUbergraph_BP_Generic_BDP_Hands, CallFunc_Array_Get_Item) == 0x000040, "Member 'BP_Generic_BDP_Hands_C_ExecuteUbergraph_BP_Generic_BDP_Hands::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Hands_C_ExecuteUbergraph_BP_Generic_BDP_Hands, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'BP_Generic_BDP_Hands_C_ExecuteUbergraph_BP_Generic_BDP_Hands::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Hands_C_ExecuteUbergraph_BP_Generic_BDP_Hands, CallFunc_Less_IntInt_ReturnValue) == 0x00004C, "Member 'BP_Generic_BDP_Hands_C_ExecuteUbergraph_BP_Generic_BDP_Hands::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

}

