#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Generic_BDP_LowerBody

#include "Basic.hpp"

#include "BPE_ClothingInstanceType_structs.hpp"
#include "Engine_structs.hpp"
#include "Altar_structs.hpp"
#include "Altar_classes.hpp"
#include "BPS_ClothAssetAndMaterialSections_structs.hpp"
#include "BPE_ClothAssetPriority_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Generic_BDP_LowerBody.BP_Generic_BDP_LowerBody_C
// 0x0090 (0x03D0 - 0x0340)
class ABP_Generic_BDP_LowerBody_C : public AVLowerBodyModularBodyPart
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBPC_Cloth_Scalabilty_C*                BPC_Cloth_Scalabilty;                              // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class UChaosClothComponent*>           ClothComponents;                                   // 0x0350(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<struct FBPS_ClothAssetAndMaterialSections> MaleClothAssets;                               // 0x0360(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FBPS_ClothAssetAndMaterialSections> FemaleClothAssets;                             // 0x0370(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UTESRace*                               CharacterRace;                                     // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	ECharacterSex                                 CharacterSex;                                      // 0x0388(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsRendered;                                        // 0x0389(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38A[0x2];                                      // 0x038A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CurrentLOD;                                        // 0x038C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ClothCullingLOD;                                   // 0x0390(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBPE_ClothingInstanceType                     ClothingInstanceType;                              // 0x0394(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ClothInLODRange;                                   // 0x0395(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_396[0x2];                                      // 0x0396(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInstance*>              FemaleMaterialsOverride;                           // 0x0398(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	EBPE_ClothAssetPriority                       MaleClothAssetPriority;                            // 0x03A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A9[0x3];                                      // 0x03A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ClothQuality;                                      // 0x03AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBPE_ClothAssetPriority                       FemaleClothAssetPriority;                          // 0x03B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B1[0x7];                                      // 0x03B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInstance*>              MaleMaterialsOverride;                             // 0x03B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         MinLOD;                                            // 0x03C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ClothEnabled;                                      // 0x03CC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPlayer;                                          // 0x03CD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ActivateCloth();
	void BindMappingSwitchEvents();
	void DeactivateCloth();
	void DeactiveClothPhysics();
	void DisableCloth();
	void EnableCloth(bool ResetCloth);
	void ExecuteUbergraph_BP_Generic_BDP_LowerBody(int32 EntryPoint);
	void OnAttachedToPhenotype(class UVCharacterPhenotypeData* PhenotypeData, class UTESRace* CharacterRace_0, ECharacterSex CharacterSex_0);
	void OnClothQualityChanged_Event(int32 NewValue);
	void OnPhysicsSimulationStarted_Event();
	void OnPhysicsSimulationStopped();
	void OnSwitchToGameMappings();
	void OnSwitchToUIMappings();
	void OnViewDistanceQualityChanged_Event(int32 NewValue);
	void OverrideFemaleMaterials(ECharacterSex CharacterSex_0);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void UpdateCloth();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Generic_BDP_LowerBody_C">();
	}
	static class ABP_Generic_BDP_LowerBody_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Generic_BDP_LowerBody_C>();
	}
};
static_assert(alignof(ABP_Generic_BDP_LowerBody_C) == 0x000008, "Wrong alignment on ABP_Generic_BDP_LowerBody_C");
static_assert(sizeof(ABP_Generic_BDP_LowerBody_C) == 0x0003D0, "Wrong size on ABP_Generic_BDP_LowerBody_C");
static_assert(offsetof(ABP_Generic_BDP_LowerBody_C, UberGraphFrame) == 0x000340, "Member 'ABP_Generic_BDP_LowerBody_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Generic_BDP_LowerBody_C, BPC_Cloth_Scalabilty) == 0x000348, "Member 'ABP_Generic_BDP_LowerBody_C::BPC_Cloth_Scalabilty' has a wrong offset!");
static_assert(offsetof(ABP_Generic_BDP_LowerBody_C, ClothComponents) == 0x000350, "Member 'ABP_Generic_BDP_LowerBody_C::ClothComponents' has a wrong offset!");
static_assert(offsetof(ABP_Generic_BDP_LowerBody_C, MaleClothAssets) == 0x000360, "Member 'ABP_Generic_BDP_LowerBody_C::MaleClothAssets' has a wrong offset!");
static_assert(offsetof(ABP_Generic_BDP_LowerBody_C, FemaleClothAssets) == 0x000370, "Member 'ABP_Generic_BDP_LowerBody_C::FemaleClothAssets' has a wrong offset!");
static_assert(offsetof(ABP_Generic_BDP_LowerBody_C, CharacterRace) == 0x000380, "Member 'ABP_Generic_BDP_LowerBody_C::CharacterRace' has a wrong offset!");
static_assert(offsetof(ABP_Generic_BDP_LowerBody_C, CharacterSex) == 0x000388, "Member 'ABP_Generic_BDP_LowerBody_C::CharacterSex' has a wrong offset!");
static_assert(offsetof(ABP_Generic_BDP_LowerBody_C, IsRendered) == 0x000389, "Member 'ABP_Generic_BDP_LowerBody_C::IsRendered' has a wrong offset!");
static_assert(offsetof(ABP_Generic_BDP_LowerBody_C, CurrentLOD) == 0x00038C, "Member 'ABP_Generic_BDP_LowerBody_C::CurrentLOD' has a wrong offset!");
static_assert(offsetof(ABP_Generic_BDP_LowerBody_C, ClothCullingLOD) == 0x000390, "Member 'ABP_Generic_BDP_LowerBody_C::ClothCullingLOD' has a wrong offset!");
static_assert(offsetof(ABP_Generic_BDP_LowerBody_C, ClothingInstanceType) == 0x000394, "Member 'ABP_Generic_BDP_LowerBody_C::ClothingInstanceType' has a wrong offset!");
static_assert(offsetof(ABP_Generic_BDP_LowerBody_C, ClothInLODRange) == 0x000395, "Member 'ABP_Generic_BDP_LowerBody_C::ClothInLODRange' has a wrong offset!");
static_assert(offsetof(ABP_Generic_BDP_LowerBody_C, FemaleMaterialsOverride) == 0x000398, "Member 'ABP_Generic_BDP_LowerBody_C::FemaleMaterialsOverride' has a wrong offset!");
static_assert(offsetof(ABP_Generic_BDP_LowerBody_C, MaleClothAssetPriority) == 0x0003A8, "Member 'ABP_Generic_BDP_LowerBody_C::MaleClothAssetPriority' has a wrong offset!");
static_assert(offsetof(ABP_Generic_BDP_LowerBody_C, ClothQuality) == 0x0003AC, "Member 'ABP_Generic_BDP_LowerBody_C::ClothQuality' has a wrong offset!");
static_assert(offsetof(ABP_Generic_BDP_LowerBody_C, FemaleClothAssetPriority) == 0x0003B0, "Member 'ABP_Generic_BDP_LowerBody_C::FemaleClothAssetPriority' has a wrong offset!");
static_assert(offsetof(ABP_Generic_BDP_LowerBody_C, MaleMaterialsOverride) == 0x0003B8, "Member 'ABP_Generic_BDP_LowerBody_C::MaleMaterialsOverride' has a wrong offset!");
static_assert(offsetof(ABP_Generic_BDP_LowerBody_C, MinLOD) == 0x0003C8, "Member 'ABP_Generic_BDP_LowerBody_C::MinLOD' has a wrong offset!");
static_assert(offsetof(ABP_Generic_BDP_LowerBody_C, ClothEnabled) == 0x0003CC, "Member 'ABP_Generic_BDP_LowerBody_C::ClothEnabled' has a wrong offset!");
static_assert(offsetof(ABP_Generic_BDP_LowerBody_C, IsPlayer) == 0x0003CD, "Member 'ABP_Generic_BDP_LowerBody_C::IsPlayer' has a wrong offset!");

}

