#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Generic_BDP_Amulet

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Altar_structs.hpp"
#include "Altar_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Generic_BDP_Amulet.BP_Generic_BDP_Amulet_C
// 0x01A0 (0x04E0 - 0x0340)
class ABP_Generic_BDP_Amulet_C : public AVAmuletModularBodyPart
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          bIgnoreChestSnapping;                              // 0x0348(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_349[0x7];                                      // 0x0349(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             FemaleNeckOffset;                                  // 0x0350(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             FemaleSpineOffset;                                 // 0x03B0(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             MaleNeckOffset;                                    // 0x0410(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             MaleSpineOffset;                                   // 0x0470(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSnapUsingSpine04;                                 // 0x04D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Generic_BDP_Amulet(int32 EntryPoint);
	void OnAttachedToPhenotype(class UVCharacterPhenotypeData* PhenotypeData, class UTESRace* CharacterRace, ECharacterSex CharacterSex);
	void OnAttachToLeaderComponent(class USkeletalMeshComponent* MasterComponent);
	void SetChestOffsetAlpha(double ChestSnappingAlpha);
	void SetCopyPoseComponent(class USkeletalMeshComponent* MasterComponent);
	void SetCorrectChestOffset(ECharacterSex Selection);
	void UpdateChestSnappingAlpha(const float NewAlpha);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Generic_BDP_Amulet_C">();
	}
	static class ABP_Generic_BDP_Amulet_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Generic_BDP_Amulet_C>();
	}
};
static_assert(alignof(ABP_Generic_BDP_Amulet_C) == 0x000010, "Wrong alignment on ABP_Generic_BDP_Amulet_C");
static_assert(sizeof(ABP_Generic_BDP_Amulet_C) == 0x0004E0, "Wrong size on ABP_Generic_BDP_Amulet_C");
static_assert(offsetof(ABP_Generic_BDP_Amulet_C, UberGraphFrame) == 0x000340, "Member 'ABP_Generic_BDP_Amulet_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Generic_BDP_Amulet_C, bIgnoreChestSnapping) == 0x000348, "Member 'ABP_Generic_BDP_Amulet_C::bIgnoreChestSnapping' has a wrong offset!");
static_assert(offsetof(ABP_Generic_BDP_Amulet_C, FemaleNeckOffset) == 0x000350, "Member 'ABP_Generic_BDP_Amulet_C::FemaleNeckOffset' has a wrong offset!");
static_assert(offsetof(ABP_Generic_BDP_Amulet_C, FemaleSpineOffset) == 0x0003B0, "Member 'ABP_Generic_BDP_Amulet_C::FemaleSpineOffset' has a wrong offset!");
static_assert(offsetof(ABP_Generic_BDP_Amulet_C, MaleNeckOffset) == 0x000410, "Member 'ABP_Generic_BDP_Amulet_C::MaleNeckOffset' has a wrong offset!");
static_assert(offsetof(ABP_Generic_BDP_Amulet_C, MaleSpineOffset) == 0x000470, "Member 'ABP_Generic_BDP_Amulet_C::MaleSpineOffset' has a wrong offset!");
static_assert(offsetof(ABP_Generic_BDP_Amulet_C, bSnapUsingSpine04) == 0x0004D0, "Member 'ABP_Generic_BDP_Amulet_C::bSnapUsingSpine04' has a wrong offset!");

}

