#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Generic_FoldableArmor

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Altar_structs.hpp"


namespace SDK::Params
{

// Function BP_Generic_FoldableArmor.BP_Generic_FoldableArmor_C.ExecuteUbergraph_BP_Generic_FoldableArmor
// 0x0150 (0x0150 - 0x0000)
struct BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSimulatingPhysics_ReturnValue;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharacterSex                                 CallFunc_GetDroppedItemSexVariant_ReturnValue;     // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_MakeLiteralString_ReturnValue;            // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UStaticMesh*                            CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            CallFunc_Array_Get_Item_1;                         // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_1;              // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharacterSex                                 CallFunc_GetDroppedItemSexVariant_ReturnValue_1;   // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33[0x5];                                       // 0x0033(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AVPairedCharacter*                      CallFunc_GetVariantReferenceCharacter_ReturnValue; // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x007C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0084(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_MakeLiteralString_ReturnValue_1;          // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_1;          // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_1;            // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            CallFunc_Array_Get_Item_2;                         // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FStaticMaterial>                CallFunc_GetStaticMaterials_ReturnValue;           // 0x00C8(0x0010)(ConstParm, ReferenceParm)
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterial*                              CallFunc_GetBaseMaterial_ReturnValue;              // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstance*                      CallFunc_Map_Find_Value;                           // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      K2Node_DynamicCast_AsMaterial_Instance;            // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x013C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor) == 0x000008, "Wrong alignment on BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor");
static_assert(sizeof(BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor) == 0x000150, "Wrong size on BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor");
static_assert(offsetof(BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor, EntryPoint) == 0x000000, "Member 'BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor, CallFunc_IsSimulatingPhysics_ReturnValue) == 0x000008, "Member 'BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor::CallFunc_IsSimulatingPhysics_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor, CallFunc_GetDroppedItemSexVariant_ReturnValue) == 0x000009, "Member 'BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor::CallFunc_GetDroppedItemSexVariant_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor, CallFunc_Conv_ByteToInt_ReturnValue) == 0x00000C, "Member 'BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor, CallFunc_MakeLiteralString_ReturnValue) == 0x000010, "Member 'BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor::CallFunc_MakeLiteralString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor, CallFunc_Array_Get_Item_1) == 0x000028, "Member 'BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor, CallFunc_SetStaticMesh_ReturnValue) == 0x000030, "Member 'BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor, CallFunc_SetStaticMesh_ReturnValue_1) == 0x000031, "Member 'BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor::CallFunc_SetStaticMesh_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor, CallFunc_GetDroppedItemSexVariant_ReturnValue_1) == 0x000032, "Member 'BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor::CallFunc_GetDroppedItemSexVariant_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor, CallFunc_GetVariantReferenceCharacter_ReturnValue) == 0x000038, "Member 'BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor::CallFunc_GetVariantReferenceCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor, K2Node_SwitchEnum_CmpSuccess) == 0x000040, "Member 'BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor, Temp_int_Variable) == 0x000044, "Member 'BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor, CallFunc_Conv_IntToString_ReturnValue) == 0x000048, "Member 'BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000058, "Member 'BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor, CallFunc_Concat_StrStr_ReturnValue) == 0x000068, "Member 'BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor, CallFunc_Add_IntInt_ReturnValue) == 0x000078, "Member 'BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor, CallFunc_Conv_StringToName_ReturnValue) == 0x00007C, "Member 'BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor, CallFunc_MakeLiteralName_ReturnValue) == 0x000084, "Member 'BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor, CallFunc_MakeLiteralString_ReturnValue_1) == 0x000090, "Member 'BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor::CallFunc_MakeLiteralString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0000A0, "Member 'BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor, CallFunc_Conv_StringToName_ReturnValue_1) == 0x0000B0, "Member 'BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor::CallFunc_Conv_StringToName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor, CallFunc_MakeLiteralName_ReturnValue_1) == 0x0000B8, "Member 'BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor::CallFunc_MakeLiteralName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor, CallFunc_Array_Get_Item_2) == 0x0000C0, "Member 'BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor, CallFunc_GetStaticMaterials_ReturnValue) == 0x0000C8, "Member 'BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor::CallFunc_GetStaticMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor, CallFunc_GetMaterial_ReturnValue) == 0x0000D8, "Member 'BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor, CallFunc_Array_Length_ReturnValue) == 0x0000E0, "Member 'BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor, CallFunc_GetBaseMaterial_ReturnValue) == 0x0000E8, "Member 'BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor::CallFunc_GetBaseMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000F0, "Member 'BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor, CallFunc_GetDisplayName_ReturnValue) == 0x0000F8, "Member 'BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000108, "Member 'BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor, CallFunc_Map_Find_Value) == 0x000110, "Member 'BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor, CallFunc_Map_Find_ReturnValue) == 0x000118, "Member 'BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000120, "Member 'BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000128, "Member 'BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor, K2Node_DynamicCast_AsMaterial_Instance) == 0x000130, "Member 'BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor::K2Node_DynamicCast_AsMaterial_Instance' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor, K2Node_DynamicCast_bSuccess) == 0x000138, "Member 'BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor, K2Node_CreateDelegate_OutputDelegate) == 0x00013C, "Member 'BP_Generic_FoldableArmor_C_ExecuteUbergraph_BP_Generic_FoldableArmor::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function BP_Generic_FoldableArmor.BP_Generic_FoldableArmor_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Generic_FoldableArmor_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Generic_FoldableArmor_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Generic_FoldableArmor_C_ReceiveTick");
static_assert(sizeof(BP_Generic_FoldableArmor_C_ReceiveTick) == 0x000004, "Wrong size on BP_Generic_FoldableArmor_C_ReceiveTick");
static_assert(offsetof(BP_Generic_FoldableArmor_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Generic_FoldableArmor_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_Generic_FoldableArmor.BP_Generic_FoldableArmor_C.SetScale
// 0x03A0 (0x03A0 - 0x0000)
struct BP_Generic_FoldableArmor_C_SetScale final
{
public:
	double                                        NewScale;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetParentActor_ReturnValue;               // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_1;        // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentScale_ReturnValue;         // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_2;        // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_3;        // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_2;      // 0x00E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBox                                   CallFunc_GetBoundingBox_ReturnValue;               // 0x0100(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FBox                                   CallFunc_GetBoundingBox_ReturnValue_1;             // 0x0138(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_BreakVector_X;                            // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue;                          // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_2;                          // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_2;                          // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_2;                          // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_3;                          // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_3;                          // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_3;                          // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue_1;                        // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_2;      // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0200(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0220(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_3;      // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0320(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_3;      // 0x0338(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_4;      // 0x0350(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_5;      // 0x0368(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_VectorToString_ReturnValue;          // 0x0380(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_VectorToString_ReturnValue_1;        // 0x0390(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Generic_FoldableArmor_C_SetScale) == 0x000008, "Wrong alignment on BP_Generic_FoldableArmor_C_SetScale");
static_assert(sizeof(BP_Generic_FoldableArmor_C_SetScale) == 0x0003A0, "Wrong size on BP_Generic_FoldableArmor_C_SetScale");
static_assert(offsetof(BP_Generic_FoldableArmor_C_SetScale, NewScale) == 0x000000, "Member 'BP_Generic_FoldableArmor_C_SetScale::NewScale' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_SetScale, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000008, "Member 'BP_Generic_FoldableArmor_C_SetScale::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_SetScale, CallFunc_GetParentActor_ReturnValue) == 0x000020, "Member 'BP_Generic_FoldableArmor_C_SetScale::CallFunc_GetParentActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_SetScale, CallFunc_Conv_DoubleToVector_ReturnValue_1) == 0x000028, "Member 'BP_Generic_FoldableArmor_C_SetScale::CallFunc_Conv_DoubleToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_SetScale, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000040, "Member 'BP_Generic_FoldableArmor_C_SetScale::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_SetScale, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000048, "Member 'BP_Generic_FoldableArmor_C_SetScale::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_SetScale, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'BP_Generic_FoldableArmor_C_SetScale::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_SetScale, CallFunc_K2_GetComponentScale_ReturnValue) == 0x000068, "Member 'BP_Generic_FoldableArmor_C_SetScale::CallFunc_K2_GetComponentScale_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_SetScale, CallFunc_IsValid_ReturnValue_1) == 0x000080, "Member 'BP_Generic_FoldableArmor_C_SetScale::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_SetScale, CallFunc_SelectVector_ReturnValue) == 0x000088, "Member 'BP_Generic_FoldableArmor_C_SetScale::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_SetScale, CallFunc_Conv_DoubleToVector_ReturnValue_2) == 0x0000A0, "Member 'BP_Generic_FoldableArmor_C_SetScale::CallFunc_Conv_DoubleToVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_SetScale, CallFunc_Conv_DoubleToVector_ReturnValue_3) == 0x0000B8, "Member 'BP_Generic_FoldableArmor_C_SetScale::CallFunc_Conv_DoubleToVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_SetScale, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x0000D0, "Member 'BP_Generic_FoldableArmor_C_SetScale::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_SetScale, CallFunc_Multiply_VectorVector_ReturnValue_2) == 0x0000E8, "Member 'BP_Generic_FoldableArmor_C_SetScale::CallFunc_Multiply_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_SetScale, CallFunc_GetBoundingBox_ReturnValue) == 0x000100, "Member 'BP_Generic_FoldableArmor_C_SetScale::CallFunc_GetBoundingBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_SetScale, CallFunc_GetBoundingBox_ReturnValue_1) == 0x000138, "Member 'BP_Generic_FoldableArmor_C_SetScale::CallFunc_GetBoundingBox_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_SetScale, CallFunc_BreakVector_X) == 0x000170, "Member 'BP_Generic_FoldableArmor_C_SetScale::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_SetScale, CallFunc_BreakVector_Y) == 0x000178, "Member 'BP_Generic_FoldableArmor_C_SetScale::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_SetScale, CallFunc_BreakVector_Z) == 0x000180, "Member 'BP_Generic_FoldableArmor_C_SetScale::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_SetScale, CallFunc_BreakVector_X_1) == 0x000188, "Member 'BP_Generic_FoldableArmor_C_SetScale::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_SetScale, CallFunc_BreakVector_Y_1) == 0x000190, "Member 'BP_Generic_FoldableArmor_C_SetScale::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_SetScale, CallFunc_BreakVector_Z_1) == 0x000198, "Member 'BP_Generic_FoldableArmor_C_SetScale::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_SetScale, CallFunc_Abs_ReturnValue) == 0x0001A0, "Member 'BP_Generic_FoldableArmor_C_SetScale::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_SetScale, CallFunc_BreakVector_X_2) == 0x0001A8, "Member 'BP_Generic_FoldableArmor_C_SetScale::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_SetScale, CallFunc_BreakVector_Y_2) == 0x0001B0, "Member 'BP_Generic_FoldableArmor_C_SetScale::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_SetScale, CallFunc_BreakVector_Z_2) == 0x0001B8, "Member 'BP_Generic_FoldableArmor_C_SetScale::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_SetScale, CallFunc_BreakVector_X_3) == 0x0001C0, "Member 'BP_Generic_FoldableArmor_C_SetScale::CallFunc_BreakVector_X_3' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_SetScale, CallFunc_BreakVector_Y_3) == 0x0001C8, "Member 'BP_Generic_FoldableArmor_C_SetScale::CallFunc_BreakVector_Y_3' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_SetScale, CallFunc_BreakVector_Z_3) == 0x0001D0, "Member 'BP_Generic_FoldableArmor_C_SetScale::CallFunc_BreakVector_Z_3' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_SetScale, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x0001D8, "Member 'BP_Generic_FoldableArmor_C_SetScale::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_SetScale, CallFunc_Abs_ReturnValue_1) == 0x0001E0, "Member 'BP_Generic_FoldableArmor_C_SetScale::CallFunc_Abs_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_SetScale, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0001E8, "Member 'BP_Generic_FoldableArmor_C_SetScale::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_SetScale, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x0001F0, "Member 'BP_Generic_FoldableArmor_C_SetScale::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_SetScale, CallFunc_Subtract_DoubleDouble_ReturnValue_2) == 0x0001F8, "Member 'BP_Generic_FoldableArmor_C_SetScale::CallFunc_Subtract_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_SetScale, CallFunc_MakeVector_ReturnValue) == 0x000200, "Member 'BP_Generic_FoldableArmor_C_SetScale::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_SetScale, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000218, "Member 'BP_Generic_FoldableArmor_C_SetScale::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_SetScale, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000220, "Member 'BP_Generic_FoldableArmor_C_SetScale::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_SetScale, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000308, "Member 'BP_Generic_FoldableArmor_C_SetScale::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_SetScale, CallFunc_Subtract_DoubleDouble_ReturnValue_3) == 0x000310, "Member 'BP_Generic_FoldableArmor_C_SetScale::CallFunc_Subtract_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_SetScale, CallFunc_Multiply_DoubleDouble_ReturnValue_3) == 0x000318, "Member 'BP_Generic_FoldableArmor_C_SetScale::CallFunc_Multiply_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_SetScale, CallFunc_MakeVector_ReturnValue_1) == 0x000320, "Member 'BP_Generic_FoldableArmor_C_SetScale::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_SetScale, CallFunc_Multiply_VectorVector_ReturnValue_3) == 0x000338, "Member 'BP_Generic_FoldableArmor_C_SetScale::CallFunc_Multiply_VectorVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_SetScale, CallFunc_Multiply_VectorVector_ReturnValue_4) == 0x000350, "Member 'BP_Generic_FoldableArmor_C_SetScale::CallFunc_Multiply_VectorVector_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_SetScale, CallFunc_Multiply_VectorVector_ReturnValue_5) == 0x000368, "Member 'BP_Generic_FoldableArmor_C_SetScale::CallFunc_Multiply_VectorVector_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_SetScale, CallFunc_Conv_VectorToString_ReturnValue) == 0x000380, "Member 'BP_Generic_FoldableArmor_C_SetScale::CallFunc_Conv_VectorToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_SetScale, CallFunc_Conv_VectorToString_ReturnValue_1) == 0x000390, "Member 'BP_Generic_FoldableArmor_C_SetScale::CallFunc_Conv_VectorToString_ReturnValue_1' has a wrong offset!");

// Function BP_Generic_FoldableArmor.BP_Generic_FoldableArmor_C.Stop Simulation
// 0x01D8 (0x01D8 - 0x0000)
struct BP_Generic_FoldableArmor_C_Stop_Simulation final
{
public:
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue_1;       // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0008(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_1;  // 0x00F0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_Generic_FoldableArmor_C_Stop_Simulation) == 0x000008, "Wrong alignment on BP_Generic_FoldableArmor_C_Stop_Simulation");
static_assert(sizeof(BP_Generic_FoldableArmor_C_Stop_Simulation) == 0x0001D8, "Wrong size on BP_Generic_FoldableArmor_C_Stop_Simulation");
static_assert(offsetof(BP_Generic_FoldableArmor_C_Stop_Simulation, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000000, "Member 'BP_Generic_FoldableArmor_C_Stop_Simulation::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_Stop_Simulation, CallFunc_K2_AttachToComponent_ReturnValue_1) == 0x000001, "Member 'BP_Generic_FoldableArmor_C_Stop_Simulation::CallFunc_K2_AttachToComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_Stop_Simulation, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000008, "Member 'BP_Generic_FoldableArmor_C_Stop_Simulation::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_Stop_Simulation, CallFunc_K2_SetRelativeLocation_SweepHitResult_1) == 0x0000F0, "Member 'BP_Generic_FoldableArmor_C_Stop_Simulation::CallFunc_K2_SetRelativeLocation_SweepHitResult_1' has a wrong offset!");

// Function BP_Generic_FoldableArmor.BP_Generic_FoldableArmor_C.UpdateDMI
// 0x0160 (0x0160 - 0x0000)
struct BP_Generic_FoldableArmor_C_UpdateDMI final
{
public:
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0020(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue_1;     // 0x0080(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformLocation_ReturnValue;            // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformLocation_ReturnValue_1;          // 0x0110(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0128(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x0140(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Generic_FoldableArmor_C_UpdateDMI) == 0x000010, "Wrong alignment on BP_Generic_FoldableArmor_C_UpdateDMI");
static_assert(sizeof(BP_Generic_FoldableArmor_C_UpdateDMI) == 0x000160, "Wrong size on BP_Generic_FoldableArmor_C_UpdateDMI");
static_assert(offsetof(BP_Generic_FoldableArmor_C_UpdateDMI, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000000, "Member 'BP_Generic_FoldableArmor_C_UpdateDMI::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_UpdateDMI, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000020, "Member 'BP_Generic_FoldableArmor_C_UpdateDMI::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_UpdateDMI, CallFunc_K2_GetComponentToWorld_ReturnValue_1) == 0x000080, "Member 'BP_Generic_FoldableArmor_C_UpdateDMI::CallFunc_K2_GetComponentToWorld_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_UpdateDMI, CallFunc_TransformLocation_ReturnValue) == 0x0000E0, "Member 'BP_Generic_FoldableArmor_C_UpdateDMI::CallFunc_TransformLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_UpdateDMI, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0000F8, "Member 'BP_Generic_FoldableArmor_C_UpdateDMI::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_UpdateDMI, CallFunc_TransformLocation_ReturnValue_1) == 0x000110, "Member 'BP_Generic_FoldableArmor_C_UpdateDMI::CallFunc_TransformLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_UpdateDMI, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000128, "Member 'BP_Generic_FoldableArmor_C_UpdateDMI::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_UpdateDMI, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x000140, "Member 'BP_Generic_FoldableArmor_C_UpdateDMI::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");

// Function BP_Generic_FoldableArmor.BP_Generic_FoldableArmor_C.UserConstructionScript
// 0x0010 (0x0010 - 0x0000)
struct BP_Generic_FoldableArmor_C_UserConstructionScript final
{
public:
	class UStaticMesh*                            CallFunc_Array_Get_Item;                           // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Generic_FoldableArmor_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_Generic_FoldableArmor_C_UserConstructionScript");
static_assert(sizeof(BP_Generic_FoldableArmor_C_UserConstructionScript) == 0x000010, "Wrong size on BP_Generic_FoldableArmor_C_UserConstructionScript");
static_assert(offsetof(BP_Generic_FoldableArmor_C_UserConstructionScript, CallFunc_Array_Get_Item) == 0x000000, "Member 'BP_Generic_FoldableArmor_C_UserConstructionScript::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Generic_FoldableArmor_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue) == 0x000008, "Member 'BP_Generic_FoldableArmor_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");

}

