#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Generic_BDP_StaticHelmet

#include "Basic.hpp"

#include "Altar_structs.hpp"


namespace SDK::Params
{

// Function BP_Generic_BDP_StaticHelmet.BP_Generic_BDP_StaticHelmet_C.ExecuteUbergraph_BP_Generic_BDP_StaticHelmet
// 0x00D8 (0x00D8 - 0x0000)
struct BP_Generic_BDP_StaticHelmet_C_ExecuteUbergraph_BP_Generic_BDP_StaticHelmet final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            CallFunc_Array_Get_Item_1;                         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVCharacterPhenotypeData*               K2Node_Event_PhenotypeData;                        // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTESRace*                               K2Node_Event_CharacterRace;                        // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECharacterSex                                 K2Node_Event_CharacterSex;                         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            CallFunc_Array_Get_Item_2;                         // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            CallFunc_Array_Get_Item_3;                         // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue;          // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue_1;        // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue_2;        // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            CallFunc_Array_Get_Item_4;                         // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            CallFunc_Array_Get_Item_5;                         // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            CallFunc_Array_Get_Item_6;                         // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            CallFunc_Array_Get_Item_7;                         // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            CallFunc_Array_Get_Item_8;                         // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            CallFunc_Array_Get_Item_9;                         // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            CallFunc_Array_Get_Item_10;                        // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            CallFunc_Array_Get_Item_11;                        // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            CallFunc_Array_Get_Item_12;                        // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C3[0x5];                                       // 0x00C3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            CallFunc_Array_Get_Item_13;                        // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_5;                 // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Generic_BDP_StaticHelmet_C_ExecuteUbergraph_BP_Generic_BDP_StaticHelmet) == 0x000008, "Wrong alignment on BP_Generic_BDP_StaticHelmet_C_ExecuteUbergraph_BP_Generic_BDP_StaticHelmet");
static_assert(sizeof(BP_Generic_BDP_StaticHelmet_C_ExecuteUbergraph_BP_Generic_BDP_StaticHelmet) == 0x0000D8, "Wrong size on BP_Generic_BDP_StaticHelmet_C_ExecuteUbergraph_BP_Generic_BDP_StaticHelmet");
static_assert(offsetof(BP_Generic_BDP_StaticHelmet_C_ExecuteUbergraph_BP_Generic_BDP_StaticHelmet, EntryPoint) == 0x000000, "Member 'BP_Generic_BDP_StaticHelmet_C_ExecuteUbergraph_BP_Generic_BDP_StaticHelmet::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_StaticHelmet_C_ExecuteUbergraph_BP_Generic_BDP_StaticHelmet, CallFunc_Array_Get_Item) == 0x000008, "Member 'BP_Generic_BDP_StaticHelmet_C_ExecuteUbergraph_BP_Generic_BDP_StaticHelmet::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_StaticHelmet_C_ExecuteUbergraph_BP_Generic_BDP_StaticHelmet, CallFunc_Array_Get_Item_1) == 0x000010, "Member 'BP_Generic_BDP_StaticHelmet_C_ExecuteUbergraph_BP_Generic_BDP_StaticHelmet::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_StaticHelmet_C_ExecuteUbergraph_BP_Generic_BDP_StaticHelmet, K2Node_Event_PhenotypeData) == 0x000018, "Member 'BP_Generic_BDP_StaticHelmet_C_ExecuteUbergraph_BP_Generic_BDP_StaticHelmet::K2Node_Event_PhenotypeData' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_StaticHelmet_C_ExecuteUbergraph_BP_Generic_BDP_StaticHelmet, K2Node_Event_CharacterRace) == 0x000020, "Member 'BP_Generic_BDP_StaticHelmet_C_ExecuteUbergraph_BP_Generic_BDP_StaticHelmet::K2Node_Event_CharacterRace' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_StaticHelmet_C_ExecuteUbergraph_BP_Generic_BDP_StaticHelmet, K2Node_Event_CharacterSex) == 0x000028, "Member 'BP_Generic_BDP_StaticHelmet_C_ExecuteUbergraph_BP_Generic_BDP_StaticHelmet::K2Node_Event_CharacterSex' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_StaticHelmet_C_ExecuteUbergraph_BP_Generic_BDP_StaticHelmet, CallFunc_Array_Get_Item_2) == 0x000030, "Member 'BP_Generic_BDP_StaticHelmet_C_ExecuteUbergraph_BP_Generic_BDP_StaticHelmet::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_StaticHelmet_C_ExecuteUbergraph_BP_Generic_BDP_StaticHelmet, CallFunc_Array_Get_Item_3) == 0x000038, "Member 'BP_Generic_BDP_StaticHelmet_C_ExecuteUbergraph_BP_Generic_BDP_StaticHelmet::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_StaticHelmet_C_ExecuteUbergraph_BP_Generic_BDP_StaticHelmet, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'BP_Generic_BDP_StaticHelmet_C_ExecuteUbergraph_BP_Generic_BDP_StaticHelmet::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_StaticHelmet_C_ExecuteUbergraph_BP_Generic_BDP_StaticHelmet, CallFunc_IsValid_ReturnValue_1) == 0x000041, "Member 'BP_Generic_BDP_StaticHelmet_C_ExecuteUbergraph_BP_Generic_BDP_StaticHelmet::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_StaticHelmet_C_ExecuteUbergraph_BP_Generic_BDP_StaticHelmet, CallFunc_EqualEqual_StriStri_ReturnValue) == 0x000042, "Member 'BP_Generic_BDP_StaticHelmet_C_ExecuteUbergraph_BP_Generic_BDP_StaticHelmet::CallFunc_EqualEqual_StriStri_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_StaticHelmet_C_ExecuteUbergraph_BP_Generic_BDP_StaticHelmet, CallFunc_EqualEqual_StriStri_ReturnValue_1) == 0x000043, "Member 'BP_Generic_BDP_StaticHelmet_C_ExecuteUbergraph_BP_Generic_BDP_StaticHelmet::CallFunc_EqualEqual_StriStri_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_StaticHelmet_C_ExecuteUbergraph_BP_Generic_BDP_StaticHelmet, CallFunc_EqualEqual_StriStri_ReturnValue_2) == 0x000044, "Member 'BP_Generic_BDP_StaticHelmet_C_ExecuteUbergraph_BP_Generic_BDP_StaticHelmet::CallFunc_EqualEqual_StriStri_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_StaticHelmet_C_ExecuteUbergraph_BP_Generic_BDP_StaticHelmet, CallFunc_Array_Get_Item_4) == 0x000048, "Member 'BP_Generic_BDP_StaticHelmet_C_ExecuteUbergraph_BP_Generic_BDP_StaticHelmet::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_StaticHelmet_C_ExecuteUbergraph_BP_Generic_BDP_StaticHelmet, CallFunc_BooleanAND_ReturnValue) == 0x000050, "Member 'BP_Generic_BDP_StaticHelmet_C_ExecuteUbergraph_BP_Generic_BDP_StaticHelmet::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_StaticHelmet_C_ExecuteUbergraph_BP_Generic_BDP_StaticHelmet, CallFunc_Array_Get_Item_5) == 0x000058, "Member 'BP_Generic_BDP_StaticHelmet_C_ExecuteUbergraph_BP_Generic_BDP_StaticHelmet::CallFunc_Array_Get_Item_5' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_StaticHelmet_C_ExecuteUbergraph_BP_Generic_BDP_StaticHelmet, CallFunc_BooleanAND_ReturnValue_1) == 0x000060, "Member 'BP_Generic_BDP_StaticHelmet_C_ExecuteUbergraph_BP_Generic_BDP_StaticHelmet::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_StaticHelmet_C_ExecuteUbergraph_BP_Generic_BDP_StaticHelmet, CallFunc_Array_Get_Item_6) == 0x000068, "Member 'BP_Generic_BDP_StaticHelmet_C_ExecuteUbergraph_BP_Generic_BDP_StaticHelmet::CallFunc_Array_Get_Item_6' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_StaticHelmet_C_ExecuteUbergraph_BP_Generic_BDP_StaticHelmet, CallFunc_IsValid_ReturnValue_2) == 0x000070, "Member 'BP_Generic_BDP_StaticHelmet_C_ExecuteUbergraph_BP_Generic_BDP_StaticHelmet::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_StaticHelmet_C_ExecuteUbergraph_BP_Generic_BDP_StaticHelmet, CallFunc_Array_Get_Item_7) == 0x000078, "Member 'BP_Generic_BDP_StaticHelmet_C_ExecuteUbergraph_BP_Generic_BDP_StaticHelmet::CallFunc_Array_Get_Item_7' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_StaticHelmet_C_ExecuteUbergraph_BP_Generic_BDP_StaticHelmet, CallFunc_Array_Get_Item_8) == 0x000080, "Member 'BP_Generic_BDP_StaticHelmet_C_ExecuteUbergraph_BP_Generic_BDP_StaticHelmet::CallFunc_Array_Get_Item_8' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_StaticHelmet_C_ExecuteUbergraph_BP_Generic_BDP_StaticHelmet, CallFunc_Array_Get_Item_9) == 0x000088, "Member 'BP_Generic_BDP_StaticHelmet_C_ExecuteUbergraph_BP_Generic_BDP_StaticHelmet::CallFunc_Array_Get_Item_9' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_StaticHelmet_C_ExecuteUbergraph_BP_Generic_BDP_StaticHelmet, CallFunc_IsValid_ReturnValue_3) == 0x000090, "Member 'BP_Generic_BDP_StaticHelmet_C_ExecuteUbergraph_BP_Generic_BDP_StaticHelmet::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_StaticHelmet_C_ExecuteUbergraph_BP_Generic_BDP_StaticHelmet, CallFunc_Array_Get_Item_10) == 0x000098, "Member 'BP_Generic_BDP_StaticHelmet_C_ExecuteUbergraph_BP_Generic_BDP_StaticHelmet::CallFunc_Array_Get_Item_10' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_StaticHelmet_C_ExecuteUbergraph_BP_Generic_BDP_StaticHelmet, CallFunc_BooleanAND_ReturnValue_2) == 0x0000A0, "Member 'BP_Generic_BDP_StaticHelmet_C_ExecuteUbergraph_BP_Generic_BDP_StaticHelmet::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_StaticHelmet_C_ExecuteUbergraph_BP_Generic_BDP_StaticHelmet, CallFunc_Array_Get_Item_11) == 0x0000A8, "Member 'BP_Generic_BDP_StaticHelmet_C_ExecuteUbergraph_BP_Generic_BDP_StaticHelmet::CallFunc_Array_Get_Item_11' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_StaticHelmet_C_ExecuteUbergraph_BP_Generic_BDP_StaticHelmet, CallFunc_IsValid_ReturnValue_4) == 0x0000B0, "Member 'BP_Generic_BDP_StaticHelmet_C_ExecuteUbergraph_BP_Generic_BDP_StaticHelmet::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_StaticHelmet_C_ExecuteUbergraph_BP_Generic_BDP_StaticHelmet, CallFunc_Array_Get_Item_12) == 0x0000B8, "Member 'BP_Generic_BDP_StaticHelmet_C_ExecuteUbergraph_BP_Generic_BDP_StaticHelmet::CallFunc_Array_Get_Item_12' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_StaticHelmet_C_ExecuteUbergraph_BP_Generic_BDP_StaticHelmet, CallFunc_BooleanAND_ReturnValue_3) == 0x0000C0, "Member 'BP_Generic_BDP_StaticHelmet_C_ExecuteUbergraph_BP_Generic_BDP_StaticHelmet::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_StaticHelmet_C_ExecuteUbergraph_BP_Generic_BDP_StaticHelmet, CallFunc_IsValid_ReturnValue_5) == 0x0000C1, "Member 'BP_Generic_BDP_StaticHelmet_C_ExecuteUbergraph_BP_Generic_BDP_StaticHelmet::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_StaticHelmet_C_ExecuteUbergraph_BP_Generic_BDP_StaticHelmet, CallFunc_BooleanAND_ReturnValue_4) == 0x0000C2, "Member 'BP_Generic_BDP_StaticHelmet_C_ExecuteUbergraph_BP_Generic_BDP_StaticHelmet::CallFunc_BooleanAND_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_StaticHelmet_C_ExecuteUbergraph_BP_Generic_BDP_StaticHelmet, CallFunc_Array_Get_Item_13) == 0x0000C8, "Member 'BP_Generic_BDP_StaticHelmet_C_ExecuteUbergraph_BP_Generic_BDP_StaticHelmet::CallFunc_Array_Get_Item_13' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_StaticHelmet_C_ExecuteUbergraph_BP_Generic_BDP_StaticHelmet, CallFunc_IsValid_ReturnValue_6) == 0x0000D0, "Member 'BP_Generic_BDP_StaticHelmet_C_ExecuteUbergraph_BP_Generic_BDP_StaticHelmet::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_StaticHelmet_C_ExecuteUbergraph_BP_Generic_BDP_StaticHelmet, CallFunc_BooleanAND_ReturnValue_5) == 0x0000D1, "Member 'BP_Generic_BDP_StaticHelmet_C_ExecuteUbergraph_BP_Generic_BDP_StaticHelmet::CallFunc_BooleanAND_ReturnValue_5' has a wrong offset!");

// Function BP_Generic_BDP_StaticHelmet.BP_Generic_BDP_StaticHelmet_C.OnAttachedToPhenotype
// 0x0018 (0x0018 - 0x0000)
struct BP_Generic_BDP_StaticHelmet_C_OnAttachedToPhenotype final
{
public:
	class UVCharacterPhenotypeData*               PhenotypeData;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTESRace*                               CharacterRace;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECharacterSex                                 CharacterSex;                                      // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Generic_BDP_StaticHelmet_C_OnAttachedToPhenotype) == 0x000008, "Wrong alignment on BP_Generic_BDP_StaticHelmet_C_OnAttachedToPhenotype");
static_assert(sizeof(BP_Generic_BDP_StaticHelmet_C_OnAttachedToPhenotype) == 0x000018, "Wrong size on BP_Generic_BDP_StaticHelmet_C_OnAttachedToPhenotype");
static_assert(offsetof(BP_Generic_BDP_StaticHelmet_C_OnAttachedToPhenotype, PhenotypeData) == 0x000000, "Member 'BP_Generic_BDP_StaticHelmet_C_OnAttachedToPhenotype::PhenotypeData' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_StaticHelmet_C_OnAttachedToPhenotype, CharacterRace) == 0x000008, "Member 'BP_Generic_BDP_StaticHelmet_C_OnAttachedToPhenotype::CharacterRace' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_StaticHelmet_C_OnAttachedToPhenotype, CharacterSex) == 0x000010, "Member 'BP_Generic_BDP_StaticHelmet_C_OnAttachedToPhenotype::CharacterSex' has a wrong offset!");

// Function BP_Generic_BDP_StaticHelmet.BP_Generic_BDP_StaticHelmet_C.SetGenderedStaticMeshes
// 0x0020 (0x0020 - 0x0000)
struct BP_Generic_BDP_StaticHelmet_C_SetGenderedStaticMeshes final
{
public:
	ECharacterSex                                 Selection;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            MaleVersion;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            FemaleVersion;                                     // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_1;              // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Generic_BDP_StaticHelmet_C_SetGenderedStaticMeshes) == 0x000008, "Wrong alignment on BP_Generic_BDP_StaticHelmet_C_SetGenderedStaticMeshes");
static_assert(sizeof(BP_Generic_BDP_StaticHelmet_C_SetGenderedStaticMeshes) == 0x000020, "Wrong size on BP_Generic_BDP_StaticHelmet_C_SetGenderedStaticMeshes");
static_assert(offsetof(BP_Generic_BDP_StaticHelmet_C_SetGenderedStaticMeshes, Selection) == 0x000000, "Member 'BP_Generic_BDP_StaticHelmet_C_SetGenderedStaticMeshes::Selection' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_StaticHelmet_C_SetGenderedStaticMeshes, MaleVersion) == 0x000008, "Member 'BP_Generic_BDP_StaticHelmet_C_SetGenderedStaticMeshes::MaleVersion' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_StaticHelmet_C_SetGenderedStaticMeshes, FemaleVersion) == 0x000010, "Member 'BP_Generic_BDP_StaticHelmet_C_SetGenderedStaticMeshes::FemaleVersion' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_StaticHelmet_C_SetGenderedStaticMeshes, K2Node_SwitchEnum_CmpSuccess) == 0x000018, "Member 'BP_Generic_BDP_StaticHelmet_C_SetGenderedStaticMeshes::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_StaticHelmet_C_SetGenderedStaticMeshes, CallFunc_SetStaticMesh_ReturnValue) == 0x000019, "Member 'BP_Generic_BDP_StaticHelmet_C_SetGenderedStaticMeshes::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_StaticHelmet_C_SetGenderedStaticMeshes, CallFunc_SetStaticMesh_ReturnValue_1) == 0x00001A, "Member 'BP_Generic_BDP_StaticHelmet_C_SetGenderedStaticMeshes::CallFunc_SetStaticMesh_ReturnValue_1' has a wrong offset!");

}

