#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Generic_BDP_Robe

#include "Basic.hpp"

#include "Altar_structs.hpp"
#include "BPE_ClothingInstanceType_structs.hpp"


namespace SDK::Params
{

// Function BP_Generic_BDP_Robe.BP_Generic_BDP_Robe_C.ActivateCloth
// 0x0028 (0x0028 - 0x0000)
struct BP_Generic_BDP_Robe_C_ActivateCloth final
{
public:
	bool                                          IsFP;                                              // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetPredictedLODLevel_ReturnValue;         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetParentActor_ReturnValue;               // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AVOblivionPlayerCharacter*              K2Node_DynamicCast_AsVOblivion_Player_Character;   // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Generic_BDP_Robe_C_ActivateCloth) == 0x000008, "Wrong alignment on BP_Generic_BDP_Robe_C_ActivateCloth");
static_assert(sizeof(BP_Generic_BDP_Robe_C_ActivateCloth) == 0x000028, "Wrong size on BP_Generic_BDP_Robe_C_ActivateCloth");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ActivateCloth, IsFP) == 0x000000, "Member 'BP_Generic_BDP_Robe_C_ActivateCloth::IsFP' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ActivateCloth, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'BP_Generic_BDP_Robe_C_ActivateCloth::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ActivateCloth, K2Node_SwitchEnum_CmpSuccess) == 0x000002, "Member 'BP_Generic_BDP_Robe_C_ActivateCloth::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ActivateCloth, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'BP_Generic_BDP_Robe_C_ActivateCloth::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ActivateCloth, CallFunc_Less_IntInt_ReturnValue) == 0x000008, "Member 'BP_Generic_BDP_Robe_C_ActivateCloth::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ActivateCloth, CallFunc_GetPredictedLODLevel_ReturnValue) == 0x00000C, "Member 'BP_Generic_BDP_Robe_C_ActivateCloth::CallFunc_GetPredictedLODLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ActivateCloth, CallFunc_GetParentActor_ReturnValue) == 0x000010, "Member 'BP_Generic_BDP_Robe_C_ActivateCloth::CallFunc_GetParentActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ActivateCloth, K2Node_DynamicCast_AsVOblivion_Player_Character) == 0x000018, "Member 'BP_Generic_BDP_Robe_C_ActivateCloth::K2Node_DynamicCast_AsVOblivion_Player_Character' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ActivateCloth, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_Generic_BDP_Robe_C_ActivateCloth::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_Generic_BDP_Robe.BP_Generic_BDP_Robe_C.ClothQualityDelegate
// 0x0004 (0x0004 - 0x0000)
struct BP_Generic_BDP_Robe_C_ClothQualityDelegate final
{
public:
	int32                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Generic_BDP_Robe_C_ClothQualityDelegate) == 0x000004, "Wrong alignment on BP_Generic_BDP_Robe_C_ClothQualityDelegate");
static_assert(sizeof(BP_Generic_BDP_Robe_C_ClothQualityDelegate) == 0x000004, "Wrong size on BP_Generic_BDP_Robe_C_ClothQualityDelegate");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ClothQualityDelegate, NewValue) == 0x000000, "Member 'BP_Generic_BDP_Robe_C_ClothQualityDelegate::NewValue' has a wrong offset!");

// Function BP_Generic_BDP_Robe.BP_Generic_BDP_Robe_C.DisableCloth
// 0x0030 (0x0030 - 0x0000)
struct BP_Generic_BDP_Robe_C_DisableCloth final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UChaosClothComponent*                   CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UChaosClothAsset*                       CallFunc_GetClothAsset_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Generic_BDP_Robe_C_DisableCloth) == 0x000008, "Wrong alignment on BP_Generic_BDP_Robe_C_DisableCloth");
static_assert(sizeof(BP_Generic_BDP_Robe_C_DisableCloth) == 0x000030, "Wrong size on BP_Generic_BDP_Robe_C_DisableCloth");
static_assert(offsetof(BP_Generic_BDP_Robe_C_DisableCloth, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_Generic_BDP_Robe_C_DisableCloth::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_DisableCloth, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_Generic_BDP_Robe_C_DisableCloth::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_DisableCloth, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_Generic_BDP_Robe_C_DisableCloth::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_DisableCloth, CallFunc_Array_Length_ReturnValue) == 0x00000C, "Member 'BP_Generic_BDP_Robe_C_DisableCloth::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_DisableCloth, CallFunc_Array_Get_Item) == 0x000010, "Member 'BP_Generic_BDP_Robe_C_DisableCloth::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_DisableCloth, CallFunc_Less_IntInt_ReturnValue) == 0x000018, "Member 'BP_Generic_BDP_Robe_C_DisableCloth::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_DisableCloth, CallFunc_GetClothAsset_ReturnValue) == 0x000020, "Member 'BP_Generic_BDP_Robe_C_DisableCloth::CallFunc_GetClothAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_DisableCloth, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'BP_Generic_BDP_Robe_C_DisableCloth::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_Generic_BDP_Robe.BP_Generic_BDP_Robe_C.EnableCloth
// 0x0038 (0x0038 - 0x0000)
struct BP_Generic_BDP_Robe_C_EnableCloth final
{
public:
	bool                                          ResetCloth;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UChaosClothComponent*                   CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UChaosClothAsset*                       CallFunc_GetClothAsset_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Generic_BDP_Robe_C_EnableCloth) == 0x000008, "Wrong alignment on BP_Generic_BDP_Robe_C_EnableCloth");
static_assert(sizeof(BP_Generic_BDP_Robe_C_EnableCloth) == 0x000038, "Wrong size on BP_Generic_BDP_Robe_C_EnableCloth");
static_assert(offsetof(BP_Generic_BDP_Robe_C_EnableCloth, ResetCloth) == 0x000000, "Member 'BP_Generic_BDP_Robe_C_EnableCloth::ResetCloth' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_EnableCloth, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_Generic_BDP_Robe_C_EnableCloth::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_EnableCloth, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_Generic_BDP_Robe_C_EnableCloth::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_EnableCloth, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_Generic_BDP_Robe_C_EnableCloth::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_EnableCloth, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'BP_Generic_BDP_Robe_C_EnableCloth::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_EnableCloth, CallFunc_Array_Get_Item) == 0x000018, "Member 'BP_Generic_BDP_Robe_C_EnableCloth::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_EnableCloth, CallFunc_Less_IntInt_ReturnValue) == 0x000020, "Member 'BP_Generic_BDP_Robe_C_EnableCloth::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_EnableCloth, CallFunc_GetClothAsset_ReturnValue) == 0x000028, "Member 'BP_Generic_BDP_Robe_C_EnableCloth::CallFunc_GetClothAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_EnableCloth, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'BP_Generic_BDP_Robe_C_EnableCloth::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_Generic_BDP_Robe.BP_Generic_BDP_Robe_C.ExecuteUbergraph_BP_Generic_BDP_Robe
// 0x0200 (0x0200 - 0x0000)
struct BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 NewValue)>               K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetParentActor_ReturnValue;               // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AVPairedPawn*                           K2Node_DynamicCast_AsVPaired_Pawn;                 // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetConsoleVariableIntValue_ReturnValue;   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_NewValue_3;                     // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_NewValue_2;                     // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPredictedLODLevel_ReturnValue;         // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WasRecentlyRendered_ReturnValue;          // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x006E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F[0x1];                                       // 0x006F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UVCharacterPhenotypeData*               K2Node_Event_PhenotypeData;                        // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTESRace*                               K2Node_Event_CharacterRace;                        // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECharacterSex                                 K2Node_Event_CharacterSex;                         // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetParentActor_ReturnValue_1;             // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AVOblivionPlayerCharacter*              K2Node_DynamicCast_AsVOblivion_Player_Character;   // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UChaosClothComponent*                   CallFunc_Array_Get_Item;                           // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C6[0x2];                                       // 0x00C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_NewValue_1;                     // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UChildActorComponent*                   CallFunc_GetParentComponent_ReturnValue;           // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetParentActor_ReturnValue_2;             // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetObjectName_ReturnValue_1;              // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldSimulateCharacterCloth_Simulate;    // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBPE_ClothingInstanceType                     CallFunc_GetClothingInstanceType_Type;             // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F2[0x2];                                       // 0x00F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_NewValue;                       // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetConsoleVariableIntValue_ReturnValue_1; // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetParentActor_ReturnValue_3;             // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AVOblivionPlayerCharacter*              K2Node_DynamicCast_AsVOblivion_Player_Character_1; // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_112[0x6];                                      // 0x0112(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_OblivionPlayerCharacter_C*          K2Node_DynamicCast_AsBP_Oblivion_Player_Character; // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBPC_StatusEffect_C*                    CallFunc_GetComponentByClass_ReturnValue;          // 0x0130(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AVEnhancedAltarPlayerController*        K2Node_DynamicCast_AsVEnhanced_Altar_Player_Controller; // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x3];                                      // 0x0151(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15A[0x6];                                      // 0x015A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue_1;         // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AVOblivionPlayerCharacter*              K2Node_DynamicCast_AsVOblivion_Player_Character_2; // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x3];                                      // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0174(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0184(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0194(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_195[0x3];                                      // 0x0195(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0198(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue_1;          // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A9[0x3];                                      // 0x01A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x01AC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 NewValue)>               K2Node_CreateDelegate_OutputDelegate_5;            // 0x01BC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetClothQuality_ClothQuality;             // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetClothQuality_ViewDistanceQuality;      // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPrimitiveComponent*>            CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x01D8(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EC[0x4];                                      // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    CallFunc_Array_Get_Item_1;                         // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe) == 0x000008, "Wrong alignment on BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe");
static_assert(sizeof(BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe) == 0x000200, "Wrong size on BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe, EntryPoint) == 0x000000, "Member 'BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x000004, "Member 'BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe, Temp_bool_IsClosed_Variable) == 0x00000C, "Member 'BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe, Temp_bool_Has_Been_Initd_Variable) == 0x000020, "Member 'BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe, Temp_bool_Has_Been_Initd_Variable_1) == 0x000021, "Member 'BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe, CallFunc_GetParentActor_ReturnValue) == 0x000028, "Member 'BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe::CallFunc_GetParentActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x000030, "Member 'BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe, K2Node_DynamicCast_AsVPaired_Pawn) == 0x000038, "Member 'BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe::K2Node_DynamicCast_AsVPaired_Pawn' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe, CallFunc_GetConsoleVariableIntValue_ReturnValue) == 0x000044, "Member 'BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe::CallFunc_GetConsoleVariableIntValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe, K2Node_CustomEvent_NewValue_3) == 0x000048, "Member 'BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe::K2Node_CustomEvent_NewValue_3' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe, K2Node_CustomEvent_NewValue_2) == 0x00004C, "Member 'BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe::K2Node_CustomEvent_NewValue_2' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe, K2Node_Event_DeltaSeconds) == 0x000050, "Member 'BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe, CallFunc_GetPredictedLODLevel_ReturnValue) == 0x000054, "Member 'BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe::CallFunc_GetPredictedLODLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000058, "Member 'BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe, Temp_int_Loop_Counter_Variable) == 0x00005C, "Member 'BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe, CallFunc_Add_IntInt_ReturnValue) == 0x000060, "Member 'BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe, CallFunc_WasRecentlyRendered_ReturnValue) == 0x000064, "Member 'BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe::CallFunc_WasRecentlyRendered_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe, CallFunc_Add_IntInt_ReturnValue_1) == 0x000068, "Member 'BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x00006C, "Member 'BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe, CallFunc_BooleanOR_ReturnValue) == 0x00006D, "Member 'BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe, CallFunc_BooleanAND_ReturnValue) == 0x00006E, "Member 'BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe, K2Node_Event_PhenotypeData) == 0x000070, "Member 'BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe::K2Node_Event_PhenotypeData' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe, K2Node_Event_CharacterRace) == 0x000078, "Member 'BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe::K2Node_Event_CharacterRace' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe, K2Node_Event_CharacterSex) == 0x000080, "Member 'BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe::K2Node_Event_CharacterSex' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe, CallFunc_GetParentActor_ReturnValue_1) == 0x000088, "Member 'BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe::CallFunc_GetParentActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe, K2Node_DynamicCast_AsVOblivion_Player_Character) == 0x000090, "Member 'BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe::K2Node_DynamicCast_AsVOblivion_Player_Character' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe, K2Node_DynamicCast_bSuccess_1) == 0x000098, "Member 'BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe, CallFunc_GetObjectName_ReturnValue) == 0x0000A0, "Member 'BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe::CallFunc_GetObjectName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe, K2Node_SwitchEnum_CmpSuccess) == 0x0000B0, "Member 'BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe, CallFunc_Array_Get_Item) == 0x0000B8, "Member 'BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe, CallFunc_Array_Length_ReturnValue) == 0x0000C0, "Member 'BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe, CallFunc_Less_IntInt_ReturnValue) == 0x0000C4, "Member 'BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe, Temp_bool_IsClosed_Variable_1) == 0x0000C5, "Member 'BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe, K2Node_CustomEvent_NewValue_1) == 0x0000C8, "Member 'BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe::K2Node_CustomEvent_NewValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe, CallFunc_GetParentComponent_ReturnValue) == 0x0000D0, "Member 'BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe::CallFunc_GetParentComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe, CallFunc_GetParentActor_ReturnValue_2) == 0x0000D8, "Member 'BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe::CallFunc_GetParentActor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe, CallFunc_GetObjectName_ReturnValue_1) == 0x0000E0, "Member 'BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe::CallFunc_GetObjectName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe, CallFunc_ShouldSimulateCharacterCloth_Simulate) == 0x0000F0, "Member 'BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe::CallFunc_ShouldSimulateCharacterCloth_Simulate' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe, CallFunc_GetClothingInstanceType_Type) == 0x0000F1, "Member 'BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe::CallFunc_GetClothingInstanceType_Type' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe, K2Node_CustomEvent_NewValue) == 0x0000F4, "Member 'BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe::K2Node_CustomEvent_NewValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe, CallFunc_GetConsoleVariableIntValue_ReturnValue_1) == 0x0000F8, "Member 'BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe::CallFunc_GetConsoleVariableIntValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe, CallFunc_GetParentActor_ReturnValue_3) == 0x000100, "Member 'BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe::CallFunc_GetParentActor_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe, K2Node_DynamicCast_AsVOblivion_Player_Character_1) == 0x000108, "Member 'BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe::K2Node_DynamicCast_AsVOblivion_Player_Character_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe, K2Node_DynamicCast_bSuccess_2) == 0x000110, "Member 'BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000111, "Member 'BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000118, "Member 'BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe, K2Node_DynamicCast_AsBP_Oblivion_Player_Character) == 0x000120, "Member 'BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe::K2Node_DynamicCast_AsBP_Oblivion_Player_Character' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe, K2Node_DynamicCast_bSuccess_3) == 0x000128, "Member 'BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe, CallFunc_GetComponentByClass_ReturnValue) == 0x000130, "Member 'BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe, CallFunc_GetPlayerController_ReturnValue) == 0x000138, "Member 'BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe, Temp_int_Variable) == 0x000140, "Member 'BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe, K2Node_DynamicCast_AsVEnhanced_Altar_Player_Controller) == 0x000148, "Member 'BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe::K2Node_DynamicCast_AsVEnhanced_Altar_Player_Controller' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe, K2Node_DynamicCast_bSuccess_4) == 0x000150, "Member 'BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe, CallFunc_Add_IntInt_ReturnValue_2) == 0x000154, "Member 'BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe, K2Node_SwitchEnum_CmpSuccess_1) == 0x000158, "Member 'BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe, K2Node_SwitchEnum_CmpSuccess_2) == 0x000159, "Member 'BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe, CallFunc_GetPlayerCharacter_ReturnValue_1) == 0x000160, "Member 'BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe::CallFunc_GetPlayerCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe, K2Node_DynamicCast_AsVOblivion_Player_Character_2) == 0x000168, "Member 'BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe::K2Node_DynamicCast_AsVOblivion_Player_Character_2' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe, K2Node_DynamicCast_bSuccess_5) == 0x000170, "Member 'BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe, K2Node_CreateDelegate_OutputDelegate_1) == 0x000174, "Member 'BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe, K2Node_CreateDelegate_OutputDelegate_2) == 0x000184, "Member 'BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe, CallFunc_Less_IntInt_ReturnValue_1) == 0x000194, "Member 'BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe, K2Node_CreateDelegate_OutputDelegate_3) == 0x000198, "Member 'BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe, CallFunc_NotEqual_BoolBool_ReturnValue_1) == 0x0001A8, "Member 'BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe::CallFunc_NotEqual_BoolBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe, K2Node_CreateDelegate_OutputDelegate_4) == 0x0001AC, "Member 'BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe, K2Node_CreateDelegate_OutputDelegate_5) == 0x0001BC, "Member 'BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe, CallFunc_GetClothQuality_ClothQuality) == 0x0001CC, "Member 'BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe::CallFunc_GetClothQuality_ClothQuality' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe, CallFunc_GetClothQuality_ViewDistanceQuality) == 0x0001D0, "Member 'BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe::CallFunc_GetClothQuality_ViewDistanceQuality' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x0001D8, "Member 'BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe, CallFunc_Array_Length_ReturnValue_1) == 0x0001E8, "Member 'BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe, CallFunc_Array_Get_Item_1) == 0x0001F0, "Member 'BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe, CallFunc_Less_IntInt_ReturnValue_2) == 0x0001F8, "Member 'BP_Generic_BDP_Robe_C_ExecuteUbergraph_BP_Generic_BDP_Robe::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");

// Function BP_Generic_BDP_Robe.BP_Generic_BDP_Robe_C.OnAttachedToPhenotype
// 0x0018 (0x0018 - 0x0000)
struct BP_Generic_BDP_Robe_C_OnAttachedToPhenotype final
{
public:
	class UVCharacterPhenotypeData*               PhenotypeData;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTESRace*                               CharacterRace_0;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECharacterSex                                 CharacterSex_0;                                    // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Generic_BDP_Robe_C_OnAttachedToPhenotype) == 0x000008, "Wrong alignment on BP_Generic_BDP_Robe_C_OnAttachedToPhenotype");
static_assert(sizeof(BP_Generic_BDP_Robe_C_OnAttachedToPhenotype) == 0x000018, "Wrong size on BP_Generic_BDP_Robe_C_OnAttachedToPhenotype");
static_assert(offsetof(BP_Generic_BDP_Robe_C_OnAttachedToPhenotype, PhenotypeData) == 0x000000, "Member 'BP_Generic_BDP_Robe_C_OnAttachedToPhenotype::PhenotypeData' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_OnAttachedToPhenotype, CharacterRace_0) == 0x000008, "Member 'BP_Generic_BDP_Robe_C_OnAttachedToPhenotype::CharacterRace_0' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_OnAttachedToPhenotype, CharacterSex_0) == 0x000010, "Member 'BP_Generic_BDP_Robe_C_OnAttachedToPhenotype::CharacterSex_0' has a wrong offset!");

// Function BP_Generic_BDP_Robe.BP_Generic_BDP_Robe_C.OnClothQualityChanged_Event
// 0x0004 (0x0004 - 0x0000)
struct BP_Generic_BDP_Robe_C_OnClothQualityChanged_Event final
{
public:
	int32                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Generic_BDP_Robe_C_OnClothQualityChanged_Event) == 0x000004, "Wrong alignment on BP_Generic_BDP_Robe_C_OnClothQualityChanged_Event");
static_assert(sizeof(BP_Generic_BDP_Robe_C_OnClothQualityChanged_Event) == 0x000004, "Wrong size on BP_Generic_BDP_Robe_C_OnClothQualityChanged_Event");
static_assert(offsetof(BP_Generic_BDP_Robe_C_OnClothQualityChanged_Event, NewValue) == 0x000000, "Member 'BP_Generic_BDP_Robe_C_OnClothQualityChanged_Event::NewValue' has a wrong offset!");

// Function BP_Generic_BDP_Robe.BP_Generic_BDP_Robe_C.OnViewDistanceQualityChanged_Event
// 0x0004 (0x0004 - 0x0000)
struct BP_Generic_BDP_Robe_C_OnViewDistanceQualityChanged_Event final
{
public:
	int32                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Generic_BDP_Robe_C_OnViewDistanceQualityChanged_Event) == 0x000004, "Wrong alignment on BP_Generic_BDP_Robe_C_OnViewDistanceQualityChanged_Event");
static_assert(sizeof(BP_Generic_BDP_Robe_C_OnViewDistanceQualityChanged_Event) == 0x000004, "Wrong size on BP_Generic_BDP_Robe_C_OnViewDistanceQualityChanged_Event");
static_assert(offsetof(BP_Generic_BDP_Robe_C_OnViewDistanceQualityChanged_Event, NewValue) == 0x000000, "Member 'BP_Generic_BDP_Robe_C_OnViewDistanceQualityChanged_Event::NewValue' has a wrong offset!");

// Function BP_Generic_BDP_Robe.BP_Generic_BDP_Robe_C.OverrideFemaleMaterials
// 0x0040 (0x0040 - 0x0000)
struct BP_Generic_BDP_Robe_C_OverrideFemaleMaterials final
{
public:
	ECharacterSex                                 CharacterSex_0;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumMaterials_ReturnValue;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumMaterials_ReturnValue_1;            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstance*                      CallFunc_Array_Get_Item_1;                         // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue_1;              // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Generic_BDP_Robe_C_OverrideFemaleMaterials) == 0x000008, "Wrong alignment on BP_Generic_BDP_Robe_C_OverrideFemaleMaterials");
static_assert(sizeof(BP_Generic_BDP_Robe_C_OverrideFemaleMaterials) == 0x000040, "Wrong size on BP_Generic_BDP_Robe_C_OverrideFemaleMaterials");
static_assert(offsetof(BP_Generic_BDP_Robe_C_OverrideFemaleMaterials, CharacterSex_0) == 0x000000, "Member 'BP_Generic_BDP_Robe_C_OverrideFemaleMaterials::CharacterSex_0' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_OverrideFemaleMaterials, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'BP_Generic_BDP_Robe_C_OverrideFemaleMaterials::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_OverrideFemaleMaterials, Temp_int_Variable) == 0x000004, "Member 'BP_Generic_BDP_Robe_C_OverrideFemaleMaterials::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_OverrideFemaleMaterials, CallFunc_Array_IsEmpty_ReturnValue) == 0x000008, "Member 'BP_Generic_BDP_Robe_C_OverrideFemaleMaterials::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_OverrideFemaleMaterials, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_Generic_BDP_Robe_C_OverrideFemaleMaterials::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_OverrideFemaleMaterials, Temp_int_Variable_1) == 0x000010, "Member 'BP_Generic_BDP_Robe_C_OverrideFemaleMaterials::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Robe_C_OverrideFemaleMaterials, CallFunc_GetNumMaterials_ReturnValue) == 0x000014, "Member 'BP_Generic_BDP_Robe_C_OverrideFemaleMaterials::CallFunc_GetNumMaterials_ReturnValue' has a wrong offset!");
