#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Generic_NPC

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Altar_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Generic_NPC.BP_Generic_NPC_C
// 0x0040 (0x1020 - 0x0FE0)
class ABP_Generic_NPC_C : public AVPairedCharacter
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0FE0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBPC_SummonFade_C*                      BPC_SummonFade;                                    // 0x0FE8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Bubble;                                            // 0x0FF0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          PlayWaterVFX;                                      // 0x0FF8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSummon;                                          // 0x0FF9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FFA[0x6];                                      // 0x0FFA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        WaterVFXScale;                                     // 0x1000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      bubbles_NS;                                        // 0x1008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Swim_NS;                                           // 0x1010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void Activate_NS_Swim(bool Activate);
	void Create_NS_Bubbles_Comp();
	void Create_NS_Swim_Comp();
	void ExecuteUbergraph_BP_Generic_NPC(int32 EntryPoint);
	void IsSurfaceWater(bool* Result);
	void OnDeathVFX();
	void OnEnterUnderwater();
	void OnExitUnderwater();
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Generic_NPC_C">();
	}
	static class ABP_Generic_NPC_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Generic_NPC_C>();
	}
};
static_assert(alignof(ABP_Generic_NPC_C) == 0x000010, "Wrong alignment on ABP_Generic_NPC_C");
static_assert(sizeof(ABP_Generic_NPC_C) == 0x001020, "Wrong size on ABP_Generic_NPC_C");
static_assert(offsetof(ABP_Generic_NPC_C, UberGraphFrame) == 0x000FE0, "Member 'ABP_Generic_NPC_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Generic_NPC_C, BPC_SummonFade) == 0x000FE8, "Member 'ABP_Generic_NPC_C::BPC_SummonFade' has a wrong offset!");
static_assert(offsetof(ABP_Generic_NPC_C, Bubble) == 0x000FF0, "Member 'ABP_Generic_NPC_C::Bubble' has a wrong offset!");
static_assert(offsetof(ABP_Generic_NPC_C, PlayWaterVFX) == 0x000FF8, "Member 'ABP_Generic_NPC_C::PlayWaterVFX' has a wrong offset!");
static_assert(offsetof(ABP_Generic_NPC_C, IsSummon) == 0x000FF9, "Member 'ABP_Generic_NPC_C::IsSummon' has a wrong offset!");
static_assert(offsetof(ABP_Generic_NPC_C, WaterVFXScale) == 0x001000, "Member 'ABP_Generic_NPC_C::WaterVFXScale' has a wrong offset!");
static_assert(offsetof(ABP_Generic_NPC_C, bubbles_NS) == 0x001008, "Member 'ABP_Generic_NPC_C::bubbles_NS' has a wrong offset!");
static_assert(offsetof(ABP_Generic_NPC_C, Swim_NS) == 0x001010, "Member 'ABP_Generic_NPC_C::Swim_NS' has a wrong offset!");

}

