#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Generic_BDP_StaticHelmet

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Altar_structs.hpp"
#include "Altar_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Generic_BDP_StaticHelmet.BP_Generic_BDP_StaticHelmet_C
// 0x0020 (0x03A0 - 0x0380)
class ABP_Generic_BDP_StaticHelmet_C : public AVHelmetModularBodyPart
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0380(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMesh*>                    Static_Helmet_Versions;                            // 0x0390(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BP_Generic_BDP_StaticHelmet(int32 EntryPoint);
	void OnAttachedToPhenotype(class UVCharacterPhenotypeData* PhenotypeData, class UTESRace* CharacterRace, ECharacterSex CharacterSex);
	void SetGenderedStaticMeshes(ECharacterSex Selection, class UStaticMesh* MaleVersion, class UStaticMesh* FemaleVersion);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Generic_BDP_StaticHelmet_C">();
	}
	static class ABP_Generic_BDP_StaticHelmet_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Generic_BDP_StaticHelmet_C>();
	}
};
static_assert(alignof(ABP_Generic_BDP_StaticHelmet_C) == 0x000008, "Wrong alignment on ABP_Generic_BDP_StaticHelmet_C");
static_assert(sizeof(ABP_Generic_BDP_StaticHelmet_C) == 0x0003A0, "Wrong size on ABP_Generic_BDP_StaticHelmet_C");
static_assert(offsetof(ABP_Generic_BDP_StaticHelmet_C, UberGraphFrame) == 0x000380, "Member 'ABP_Generic_BDP_StaticHelmet_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Generic_BDP_StaticHelmet_C, StaticMesh) == 0x000388, "Member 'ABP_Generic_BDP_StaticHelmet_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_Generic_BDP_StaticHelmet_C, Static_Helmet_Versions) == 0x000390, "Member 'ABP_Generic_BDP_StaticHelmet_C::Static_Helmet_Versions' has a wrong offset!");

}

