#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Generic_BDP_Feet

#include "Basic.hpp"

#include "Altar_structs.hpp"


namespace SDK::Params
{

// Function BP_Generic_BDP_Feet.BP_Generic_BDP_Feet_C.ExecuteUbergraph_BP_Generic_BDP_Feet
// 0x0020 (0x0020 - 0x0000)
struct BP_Generic_BDP_Feet_C_ExecuteUbergraph_BP_Generic_BDP_Feet final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVCharacterPhenotypeData*               K2Node_Event_PhenotypeData;                        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTESRace*                               K2Node_Event_CharacterRace;                        // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECharacterSex                                 K2Node_Event_CharacterSex;                         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Generic_BDP_Feet_C_ExecuteUbergraph_BP_Generic_BDP_Feet) == 0x000008, "Wrong alignment on BP_Generic_BDP_Feet_C_ExecuteUbergraph_BP_Generic_BDP_Feet");
static_assert(sizeof(BP_Generic_BDP_Feet_C_ExecuteUbergraph_BP_Generic_BDP_Feet) == 0x000020, "Wrong size on BP_Generic_BDP_Feet_C_ExecuteUbergraph_BP_Generic_BDP_Feet");
static_assert(offsetof(BP_Generic_BDP_Feet_C_ExecuteUbergraph_BP_Generic_BDP_Feet, EntryPoint) == 0x000000, "Member 'BP_Generic_BDP_Feet_C_ExecuteUbergraph_BP_Generic_BDP_Feet::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Feet_C_ExecuteUbergraph_BP_Generic_BDP_Feet, K2Node_Event_PhenotypeData) == 0x000008, "Member 'BP_Generic_BDP_Feet_C_ExecuteUbergraph_BP_Generic_BDP_Feet::K2Node_Event_PhenotypeData' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Feet_C_ExecuteUbergraph_BP_Generic_BDP_Feet, K2Node_Event_CharacterRace) == 0x000010, "Member 'BP_Generic_BDP_Feet_C_ExecuteUbergraph_BP_Generic_BDP_Feet::K2Node_Event_CharacterRace' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Feet_C_ExecuteUbergraph_BP_Generic_BDP_Feet, K2Node_Event_CharacterSex) == 0x000018, "Member 'BP_Generic_BDP_Feet_C_ExecuteUbergraph_BP_Generic_BDP_Feet::K2Node_Event_CharacterSex' has a wrong offset!");

// Function BP_Generic_BDP_Feet.BP_Generic_BDP_Feet_C.OnAttachedToPhenotype
// 0x0018 (0x0018 - 0x0000)
struct BP_Generic_BDP_Feet_C_OnAttachedToPhenotype final
{
public:
	class UVCharacterPhenotypeData*               PhenotypeData;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTESRace*                               CharacterRace;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECharacterSex                                 CharacterSex;                                      // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Generic_BDP_Feet_C_OnAttachedToPhenotype) == 0x000008, "Wrong alignment on BP_Generic_BDP_Feet_C_OnAttachedToPhenotype");
static_assert(sizeof(BP_Generic_BDP_Feet_C_OnAttachedToPhenotype) == 0x000018, "Wrong size on BP_Generic_BDP_Feet_C_OnAttachedToPhenotype");
static_assert(offsetof(BP_Generic_BDP_Feet_C_OnAttachedToPhenotype, PhenotypeData) == 0x000000, "Member 'BP_Generic_BDP_Feet_C_OnAttachedToPhenotype::PhenotypeData' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Feet_C_OnAttachedToPhenotype, CharacterRace) == 0x000008, "Member 'BP_Generic_BDP_Feet_C_OnAttachedToPhenotype::CharacterRace' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Feet_C_OnAttachedToPhenotype, CharacterSex) == 0x000010, "Member 'BP_Generic_BDP_Feet_C_OnAttachedToPhenotype::CharacterSex' has a wrong offset!");

// Function BP_Generic_BDP_Feet.BP_Generic_BDP_Feet_C.OverrideFemaleMaterials
// 0x0038 (0x0038 - 0x0000)
struct BP_Generic_BDP_Feet_C_OverrideFemaleMaterials final
{
public:
	ECharacterSex                                 CharacterSex;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumMaterials_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumMaterials_ReturnValue_1;            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue_1;              // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstance*                      CallFunc_Array_Get_Item_1;                         // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Generic_BDP_Feet_C_OverrideFemaleMaterials) == 0x000008, "Wrong alignment on BP_Generic_BDP_Feet_C_OverrideFemaleMaterials");
static_assert(sizeof(BP_Generic_BDP_Feet_C_OverrideFemaleMaterials) == 0x000038, "Wrong size on BP_Generic_BDP_Feet_C_OverrideFemaleMaterials");
static_assert(offsetof(BP_Generic_BDP_Feet_C_OverrideFemaleMaterials, CharacterSex) == 0x000000, "Member 'BP_Generic_BDP_Feet_C_OverrideFemaleMaterials::CharacterSex' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Feet_C_OverrideFemaleMaterials, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'BP_Generic_BDP_Feet_C_OverrideFemaleMaterials::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Feet_C_OverrideFemaleMaterials, Temp_int_Variable) == 0x000004, "Member 'BP_Generic_BDP_Feet_C_OverrideFemaleMaterials::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Feet_C_OverrideFemaleMaterials, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_Generic_BDP_Feet_C_OverrideFemaleMaterials::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Feet_C_OverrideFemaleMaterials, CallFunc_Array_IsEmpty_ReturnValue) == 0x00000C, "Member 'BP_Generic_BDP_Feet_C_OverrideFemaleMaterials::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Feet_C_OverrideFemaleMaterials, CallFunc_GetNumMaterials_ReturnValue) == 0x000010, "Member 'BP_Generic_BDP_Feet_C_OverrideFemaleMaterials::CallFunc_GetNumMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Feet_C_OverrideFemaleMaterials, Temp_int_Variable_1) == 0x000014, "Member 'BP_Generic_BDP_Feet_C_OverrideFemaleMaterials::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Feet_C_OverrideFemaleMaterials, CallFunc_Array_Get_Item) == 0x000018, "Member 'BP_Generic_BDP_Feet_C_OverrideFemaleMaterials::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Feet_C_OverrideFemaleMaterials, CallFunc_GetNumMaterials_ReturnValue_1) == 0x000020, "Member 'BP_Generic_BDP_Feet_C_OverrideFemaleMaterials::CallFunc_GetNumMaterials_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Feet_C_OverrideFemaleMaterials, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000024, "Member 'BP_Generic_BDP_Feet_C_OverrideFemaleMaterials::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Feet_C_OverrideFemaleMaterials, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000025, "Member 'BP_Generic_BDP_Feet_C_OverrideFemaleMaterials::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Feet_C_OverrideFemaleMaterials, CallFunc_Add_IntInt_ReturnValue_1) == 0x000028, "Member 'BP_Generic_BDP_Feet_C_OverrideFemaleMaterials::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Feet_C_OverrideFemaleMaterials, CallFunc_Array_IsEmpty_ReturnValue_1) == 0x00002C, "Member 'BP_Generic_BDP_Feet_C_OverrideFemaleMaterials::CallFunc_Array_IsEmpty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Generic_BDP_Feet_C_OverrideFemaleMaterials, CallFunc_Array_Get_Item_1) == 0x000030, "Member 'BP_Generic_BDP_Feet_C_OverrideFemaleMaterials::CallFunc_Array_Get_Item_1' has a wrong offset!");

}

