#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_IDSecretWall01

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_IDSecretWall01.BP_IDSecretWall01_C.ExecuteUbergraph_BP_IDSecretWall01
// 0x0020 (0x0020 - 0x0000)
struct BP_IDSecretWall01_C_ExecuteUbergraph_BP_IDSecretWall01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVCinematicSubsystem*                   CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_Event_AnimationName;                        // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_IDSecretWall01_C_ExecuteUbergraph_BP_IDSecretWall01) == 0x000008, "Wrong alignment on BP_IDSecretWall01_C_ExecuteUbergraph_BP_IDSecretWall01");
static_assert(sizeof(BP_IDSecretWall01_C_ExecuteUbergraph_BP_IDSecretWall01) == 0x000020, "Wrong size on BP_IDSecretWall01_C_ExecuteUbergraph_BP_IDSecretWall01");
static_assert(offsetof(BP_IDSecretWall01_C_ExecuteUbergraph_BP_IDSecretWall01, EntryPoint) == 0x000000, "Member 'BP_IDSecretWall01_C_ExecuteUbergraph_BP_IDSecretWall01::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_IDSecretWall01_C_ExecuteUbergraph_BP_IDSecretWall01, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'BP_IDSecretWall01_C_ExecuteUbergraph_BP_IDSecretWall01::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IDSecretWall01_C_ExecuteUbergraph_BP_IDSecretWall01, K2Node_Event_AnimationName) == 0x000010, "Member 'BP_IDSecretWall01_C_ExecuteUbergraph_BP_IDSecretWall01::K2Node_Event_AnimationName' has a wrong offset!");

// Function BP_IDSecretWall01.BP_IDSecretWall01_C.OnActivateAnimation
// 0x0010 (0x0010 - 0x0000)
struct BP_IDSecretWall01_C_OnActivateAnimation final
{
public:
	class FString                                 AnimationName;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_IDSecretWall01_C_OnActivateAnimation) == 0x000008, "Wrong alignment on BP_IDSecretWall01_C_OnActivateAnimation");
static_assert(sizeof(BP_IDSecretWall01_C_OnActivateAnimation) == 0x000010, "Wrong size on BP_IDSecretWall01_C_OnActivateAnimation");
static_assert(offsetof(BP_IDSecretWall01_C_OnActivateAnimation, AnimationName) == 0x000000, "Member 'BP_IDSecretWall01_C_OnActivateAnimation::AnimationName' has a wrong offset!");

}

