#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LevelEntryDoor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Altar_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_LevelEntryDoor.BP_LevelEntryDoor_C
// 0x0040 (0x0320 - 0x02E0)
class ABP_LevelEntryDoor_C final : public AVLevelSelectDoor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ULocalMapComponent*                     LocalMap;                                          // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   BP_PrisonCellTorch01;                              // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   TextRender;                                        // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Plane;                                             // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FText                                   Text;                                              // 0x0308(0x0018)(Edit, BlueprintVisible)

public:
	void BndEvt__BP_LevelEntryDoor_BoxComponent_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void ExecuteUbergraph_BP_LevelEntryDoor(int32 EntryPoint);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_LevelEntryDoor_C">();
	}
	static class ABP_LevelEntryDoor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_LevelEntryDoor_C>();
	}
};
static_assert(alignof(ABP_LevelEntryDoor_C) == 0x000008, "Wrong alignment on ABP_LevelEntryDoor_C");
static_assert(sizeof(ABP_LevelEntryDoor_C) == 0x000320, "Wrong size on ABP_LevelEntryDoor_C");
static_assert(offsetof(ABP_LevelEntryDoor_C, UberGraphFrame) == 0x0002E0, "Member 'ABP_LevelEntryDoor_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_LevelEntryDoor_C, LocalMap) == 0x0002E8, "Member 'ABP_LevelEntryDoor_C::LocalMap' has a wrong offset!");
static_assert(offsetof(ABP_LevelEntryDoor_C, BP_PrisonCellTorch01) == 0x0002F0, "Member 'ABP_LevelEntryDoor_C::BP_PrisonCellTorch01' has a wrong offset!");
static_assert(offsetof(ABP_LevelEntryDoor_C, TextRender) == 0x0002F8, "Member 'ABP_LevelEntryDoor_C::TextRender' has a wrong offset!");
static_assert(offsetof(ABP_LevelEntryDoor_C, Plane) == 0x000300, "Member 'ABP_LevelEntryDoor_C::Plane' has a wrong offset!");
static_assert(offsetof(ABP_LevelEntryDoor_C, Text) == 0x000308, "Member 'ABP_LevelEntryDoor_C::Text' has a wrong offset!");

}

