#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Lettuce

#include "Basic.hpp"

#include "Altar_classes.hpp"


namespace SDK
{

// VModdableBlueprintGeneratedClass BP_Lettuce.BP_Lettuce_C
// 0x0020 (0x0380 - 0x0360)
class ABP_Lettuce_C final : public AVIngredient
{
public:
	class ULocalMapComponent*                     LocalMapComponent;                                 // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NiagaraComponent;                                  // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UVTESObjectRefComponent*                ObjectRefComponent;                                // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UVParticleEffectPairingComponent*       VParticleEffectPairingComponent;                   // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Lettuce_C">();
	}
	static class ABP_Lettuce_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Lettuce_C>();
	}
};
static_assert(alignof(ABP_Lettuce_C) == 0x000008, "Wrong alignment on ABP_Lettuce_C");
static_assert(sizeof(ABP_Lettuce_C) == 0x000380, "Wrong size on ABP_Lettuce_C");
static_assert(offsetof(ABP_Lettuce_C, LocalMapComponent) == 0x000360, "Member 'ABP_Lettuce_C::LocalMapComponent' has a wrong offset!");
static_assert(offsetof(ABP_Lettuce_C, NiagaraComponent) == 0x000368, "Member 'ABP_Lettuce_C::NiagaraComponent' has a wrong offset!");
static_assert(offsetof(ABP_Lettuce_C, ObjectRefComponent) == 0x000370, "Member 'ABP_Lettuce_C::ObjectRefComponent' has a wrong offset!");
static_assert(offsetof(ABP_Lettuce_C, VParticleEffectPairingComponent) == 0x000378, "Member 'ABP_Lettuce_C::VParticleEffectPairingComponent' has a wrong offset!");

}

