#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PairedPawnAIController

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Altar_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PairedPawnAIController.BP_PairedPawnAIController_C
// 0x0018 (0x05F8 - 0x05E0)
class ABP_PairedPawnAIController_C final : public AVPairedPawnAIController
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_PairedPawnDebugInfo_C*             LinkedDebugWidget;                                 // 0x05E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_PairedPawnProcedureDebugInfo_C*    LinkedProcedureDebugWidget;                        // 0x05F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_PairedPawnAIController(int32 EntryPoint);
	void GetProcedureInfos(class UWBP_PairedPawnProcedureDebugInfo_C* ProcedureDebugWidget, class UVerticalBox** ProcedureInfos);
	void OnDebugModeActivated();
	void OnDebugModeDeactivated();
	void UpdateCombatDebugDisplay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PairedPawnAIController_C">();
	}
	static class ABP_PairedPawnAIController_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PairedPawnAIController_C>();
	}
};
static_assert(alignof(ABP_PairedPawnAIController_C) == 0x000008, "Wrong alignment on ABP_PairedPawnAIController_C");
static_assert(sizeof(ABP_PairedPawnAIController_C) == 0x0005F8, "Wrong size on ABP_PairedPawnAIController_C");
static_assert(offsetof(ABP_PairedPawnAIController_C, UberGraphFrame) == 0x0005E0, "Member 'ABP_PairedPawnAIController_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_PairedPawnAIController_C, LinkedDebugWidget) == 0x0005E8, "Member 'ABP_PairedPawnAIController_C::LinkedDebugWidget' has a wrong offset!");
static_assert(offsetof(ABP_PairedPawnAIController_C, LinkedProcedureDebugWidget) == 0x0005F0, "Member 'ABP_PairedPawnAIController_C::LinkedProcedureDebugWidget' has a wrong offset!");

}

