#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Parent_Prefab_Act

#include "Basic.hpp"

#include "BPE_WeatherResponse_Rain_structs.hpp"
#include "BPE_WeatherResponse_Snow_structs.hpp"
#include "ENiagara_WeatherState_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Altar_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Parent_Prefab_Act.BP_Parent_Prefab_Act_C
// 0x0188 (0x0520 - 0x0398)
class ABP_Parent_Prefab_Act_C : public AVActivable
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0398(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPointLightComponent*                   One_PointLight;                                    // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Light;                                             // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh_Component;                              // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Niagara_System_Component;                          // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         VFX;                                               // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            StaticMesh;                                        // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Use_Light_Function;                                // 0x03D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D1[0x7];                                      // 0x03D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     M_LF;                                              // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID_LF;                                            // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        Randomizer;                                        // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Intensity;                                         // 0x03F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Attenuation_Radius;                                // 0x03F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Source_Radius;                                     // 0x0400(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color;                                             // 0x0404(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Cast_Shadows;                                      // 0x0414(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OFF;                                               // 0x0415(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_416[0x2];                                      // 0x0416(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Indirect_Intensity;                                // 0x0418(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Volumetric_Intensity;                              // 0x041C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Specular_Scale;                                    // 0x0420(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_424[0x4];                                      // 0x0424(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Color_Saturation;                                  // 0x0428(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Is_Interior_Level;                                 // 0x0430(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	bool                                          Turn_OFF_Day;                                      // 0x0431(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_432[0xE];                                      // 0x0432(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Custom_Transform;                                  // 0x0440(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OFF_0;                                             // 0x04A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A1[0x7];                                      // 0x04A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Emissive_Intensity;                                // 0x04A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Is_Night;                                          // 0x04B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Is_Day;                                            // 0x04B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B2[0x2];                                      // 0x04B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Sunrise;                                           // 0x04B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Sunset;                                            // 0x04B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBPE_WeatherResponse_Rain                     Rain_Response;                                     // 0x04BC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBPE_WeatherResponse_Snow                     Snow_Response;                                     // 0x04BD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4BE[0x2];                                      // 0x04BE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Adapted_Light_Intensity;                           // 0x04C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Adapted_VFX_Intensity;                             // 0x04C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Weather_Update_Value;                              // 0x04D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	double                                        Light_Transition_Start;                            // 0x04D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	bool                                          Light_Transition_Done;                             // 0x04E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	uint8                                         Pad_4E1[0x7];                                      // 0x04E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        VFX_Intensity;                                     // 0x04E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Current_VFX_Intensity;                             // 0x04F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	double                                        VFX_Intensity_Transition_Start;                    // 0x04F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	double                                        Current_VFX_Spawnrate;                             // 0x0500(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	class FName                                   Emissive_Param_Name;                               // 0x0508(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        VFX_Spawnrate_Transition_Start;                    // 0x0510(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	bool                                          VFX_Transition_Done;                               // 0x0518(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)

public:
	void Adapt_Light();
	void ExecuteUbergraph_BP_Parent_Prefab_Act(int32 EntryPoint);
	void ReceiveBeginPlay();
	void Reset_to_Default();
	void Set_Day();
	void Set_Night();
	void Turn_Light_Off();
	void Update_Weather(ENiagara_WeatherState Weather, double Value);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Parent_Prefab_Act_C">();
	}
	static class ABP_Parent_Prefab_Act_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Parent_Prefab_Act_C>();
	}
};
static_assert(alignof(ABP_Parent_Prefab_Act_C) == 0x000010, "Wrong alignment on ABP_Parent_Prefab_Act_C");
static_assert(sizeof(ABP_Parent_Prefab_Act_C) == 0x000520, "Wrong size on ABP_Parent_Prefab_Act_C");
static_assert(offsetof(ABP_Parent_Prefab_Act_C, UberGraphFrame) == 0x000398, "Member 'ABP_Parent_Prefab_Act_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Parent_Prefab_Act_C, One_PointLight) == 0x0003A0, "Member 'ABP_Parent_Prefab_Act_C::One_PointLight' has a wrong offset!");
static_assert(offsetof(ABP_Parent_Prefab_Act_C, Light) == 0x0003A8, "Member 'ABP_Parent_Prefab_Act_C::Light' has a wrong offset!");
static_assert(offsetof(ABP_Parent_Prefab_Act_C, StaticMesh_Component) == 0x0003B0, "Member 'ABP_Parent_Prefab_Act_C::StaticMesh_Component' has a wrong offset!");
static_assert(offsetof(ABP_Parent_Prefab_Act_C, Niagara_System_Component) == 0x0003B8, "Member 'ABP_Parent_Prefab_Act_C::Niagara_System_Component' has a wrong offset!");
static_assert(offsetof(ABP_Parent_Prefab_Act_C, VFX) == 0x0003C0, "Member 'ABP_Parent_Prefab_Act_C::VFX' has a wrong offset!");
static_assert(offsetof(ABP_Parent_Prefab_Act_C, StaticMesh) == 0x0003C8, "Member 'ABP_Parent_Prefab_Act_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_Parent_Prefab_Act_C, Use_Light_Function) == 0x0003D0, "Member 'ABP_Parent_Prefab_Act_C::Use_Light_Function' has a wrong offset!");
static_assert(offsetof(ABP_Parent_Prefab_Act_C, M_LF) == 0x0003D8, "Member 'ABP_Parent_Prefab_Act_C::M_LF' has a wrong offset!");
static_assert(offsetof(ABP_Parent_Prefab_Act_C, MID_LF) == 0x0003E0, "Member 'ABP_Parent_Prefab_Act_C::MID_LF' has a wrong offset!");
static_assert(offsetof(ABP_Parent_Prefab_Act_C, Randomizer) == 0x0003E8, "Member 'ABP_Parent_Prefab_Act_C::Randomizer' has a wrong offset!");
static_assert(offsetof(ABP_Parent_Prefab_Act_C, Intensity) == 0x0003F0, "Member 'ABP_Parent_Prefab_Act_C::Intensity' has a wrong offset!");
static_assert(offsetof(ABP_Parent_Prefab_Act_C, Attenuation_Radius) == 0x0003F8, "Member 'ABP_Parent_Prefab_Act_C::Attenuation_Radius' has a wrong offset!");
static_assert(offsetof(ABP_Parent_Prefab_Act_C, Source_Radius) == 0x000400, "Member 'ABP_Parent_Prefab_Act_C::Source_Radius' has a wrong offset!");
static_assert(offsetof(ABP_Parent_Prefab_Act_C, Color) == 0x000404, "Member 'ABP_Parent_Prefab_Act_C::Color' has a wrong offset!");
static_assert(offsetof(ABP_Parent_Prefab_Act_C, Cast_Shadows) == 0x000414, "Member 'ABP_Parent_Prefab_Act_C::Cast_Shadows' has a wrong offset!");
static_assert(offsetof(ABP_Parent_Prefab_Act_C, OFF) == 0x000415, "Member 'ABP_Parent_Prefab_Act_C::OFF' has a wrong offset!");
static_assert(offsetof(ABP_Parent_Prefab_Act_C, Indirect_Intensity) == 0x000418, "Member 'ABP_Parent_Prefab_Act_C::Indirect_Intensity' has a wrong offset!");
static_assert(offsetof(ABP_Parent_Prefab_Act_C, Volumetric_Intensity) == 0x00041C, "Member 'ABP_Parent_Prefab_Act_C::Volumetric_Intensity' has a wrong offset!");
static_assert(offsetof(ABP_Parent_Prefab_Act_C, Specular_Scale) == 0x000420, "Member 'ABP_Parent_Prefab_Act_C::Specular_Scale' has a wrong offset!");
static_assert(offsetof(ABP_Parent_Prefab_Act_C, Color_Saturation) == 0x000428, "Member 'ABP_Parent_Prefab_Act_C::Color_Saturation' has a wrong offset!");
static_assert(offsetof(ABP_Parent_Prefab_Act_C, Is_Interior_Level) == 0x000430, "Member 'ABP_Parent_Prefab_Act_C::Is_Interior_Level' has a wrong offset!");
static_assert(offsetof(ABP_Parent_Prefab_Act_C, Turn_OFF_Day) == 0x000431, "Member 'ABP_Parent_Prefab_Act_C::Turn_OFF_Day' has a wrong offset!");
static_assert(offsetof(ABP_Parent_Prefab_Act_C, Custom_Transform) == 0x000440, "Member 'ABP_Parent_Prefab_Act_C::Custom_Transform' has a wrong offset!");
static_assert(offsetof(ABP_Parent_Prefab_Act_C, OFF_0) == 0x0004A0, "Member 'ABP_Parent_Prefab_Act_C::OFF_0' has a wrong offset!");
static_assert(offsetof(ABP_Parent_Prefab_Act_C, Emissive_Intensity) == 0x0004A8, "Member 'ABP_Parent_Prefab_Act_C::Emissive_Intensity' has a wrong offset!");
static_assert(offsetof(ABP_Parent_Prefab_Act_C, Is_Night) == 0x0004B0, "Member 'ABP_Parent_Prefab_Act_C::Is_Night' has a wrong offset!");
static_assert(offsetof(ABP_Parent_Prefab_Act_C, Is_Day) == 0x0004B1, "Member 'ABP_Parent_Prefab_Act_C::Is_Day' has a wrong offset!");
static_assert(offsetof(ABP_Parent_Prefab_Act_C, Sunrise) == 0x0004B4, "Member 'ABP_Parent_Prefab_Act_C::Sunrise' has a wrong offset!");
static_assert(offsetof(ABP_Parent_Prefab_Act_C, Sunset) == 0x0004B8, "Member 'ABP_Parent_Prefab_Act_C::Sunset' has a wrong offset!");
static_assert(offsetof(ABP_Parent_Prefab_Act_C, Rain_Response) == 0x0004BC, "Member 'ABP_Parent_Prefab_Act_C::Rain_Response' has a wrong offset!");
static_assert(offsetof(ABP_Parent_Prefab_Act_C, Snow_Response) == 0x0004BD, "Member 'ABP_Parent_Prefab_Act_C::Snow_Response' has a wrong offset!");
static_assert(offsetof(ABP_Parent_Prefab_Act_C, Adapted_Light_Intensity) == 0x0004C0, "Member 'ABP_Parent_Prefab_Act_C::Adapted_Light_Intensity' has a wrong offset!");
static_assert(offsetof(ABP_Parent_Prefab_Act_C, Adapted_VFX_Intensity) == 0x0004C8, "Member 'ABP_Parent_Prefab_Act_C::Adapted_VFX_Intensity' has a wrong offset!");
static_assert(offsetof(ABP_Parent_Prefab_Act_C, Weather_Update_Value) == 0x0004D0, "Member 'ABP_Parent_Prefab_Act_C::Weather_Update_Value' has a wrong offset!");
static_assert(offsetof(ABP_Parent_Prefab_Act_C, Light_Transition_Start) == 0x0004D8, "Member 'ABP_Parent_Prefab_Act_C::Light_Transition_Start' has a wrong offset!");
static_assert(offsetof(ABP_Parent_Prefab_Act_C, Light_Transition_Done) == 0x0004E0, "Member 'ABP_Parent_Prefab_Act_C::Light_Transition_Done' has a wrong offset!");
static_assert(offsetof(ABP_Parent_Prefab_Act_C, VFX_Intensity) == 0x0004E8, "Member 'ABP_Parent_Prefab_Act_C::VFX_Intensity' has a wrong offset!");
static_assert(offsetof(ABP_Parent_Prefab_Act_C, Current_VFX_Intensity) == 0x0004F0, "Member 'ABP_Parent_Prefab_Act_C::Current_VFX_Intensity' has a wrong offset!");
static_assert(offsetof(ABP_Parent_Prefab_Act_C, VFX_Intensity_Transition_Start) == 0x0004F8, "Member 'ABP_Parent_Prefab_Act_C::VFX_Intensity_Transition_Start' has a wrong offset!");
static_assert(offsetof(ABP_Parent_Prefab_Act_C, Current_VFX_Spawnrate) == 0x000500, "Member 'ABP_Parent_Prefab_Act_C::Current_VFX_Spawnrate' has a wrong offset!");
static_assert(offsetof(ABP_Parent_Prefab_Act_C, Emissive_Param_Name) == 0x000508, "Member 'ABP_Parent_Prefab_Act_C::Emissive_Param_Name' has a wrong offset!");
static_assert(offsetof(ABP_Parent_Prefab_Act_C, VFX_Spawnrate_Transition_Start) == 0x000510, "Member 'ABP_Parent_Prefab_Act_C::VFX_Spawnrate_Transition_Start' has a wrong offset!");
static_assert(offsetof(ABP_Parent_Prefab_Act_C, VFX_Transition_Done) == 0x000518, "Member 'ABP_Parent_Prefab_Act_C::VFX_Transition_Done' has a wrong offset!");

}

