#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Prefab_Fires_Act

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ENiagara_WeatherState_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Prefab_Fires_Act.BP_Prefab_Fires_Act_C.Adapt Light (Brazier)
// 0x0058 (0x0058 - 0x0000)
struct BP_Prefab_Fires_Act_C_Adapt_Light__Brazier_ final
{
public:
	bool                                          VFX_Spawnrate_Done;                                // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          VFX_Intensity_Done;                                // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_2;          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_2;       // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_ReturnValue_1;                       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast;    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast_1;  // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast_2;  // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast_3;  // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Prefab_Fires_Act_C_Adapt_Light__Brazier_) == 0x000008, "Wrong alignment on BP_Prefab_Fires_Act_C_Adapt_Light__Brazier_");
static_assert(sizeof(BP_Prefab_Fires_Act_C_Adapt_Light__Brazier_) == 0x000058, "Wrong size on BP_Prefab_Fires_Act_C_Adapt_Light__Brazier_");
static_assert(offsetof(BP_Prefab_Fires_Act_C_Adapt_Light__Brazier_, VFX_Spawnrate_Done) == 0x000000, "Member 'BP_Prefab_Fires_Act_C_Adapt_Light__Brazier_::VFX_Spawnrate_Done' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_Adapt_Light__Brazier_, VFX_Intensity_Done) == 0x000001, "Member 'BP_Prefab_Fires_Act_C_Adapt_Light__Brazier_::VFX_Intensity_Done' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_Adapt_Light__Brazier_, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000008, "Member 'BP_Prefab_Fires_Act_C_Adapt_Light__Brazier_::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_Adapt_Light__Brazier_, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000010, "Member 'BP_Prefab_Fires_Act_C_Adapt_Light__Brazier_::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_Adapt_Light__Brazier_, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000011, "Member 'BP_Prefab_Fires_Act_C_Adapt_Light__Brazier_::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_Adapt_Light__Brazier_, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000018, "Member 'BP_Prefab_Fires_Act_C_Adapt_Light__Brazier_::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_Adapt_Light__Brazier_, CallFunc_Lerp_ReturnValue) == 0x000020, "Member 'BP_Prefab_Fires_Act_C_Adapt_Light__Brazier_::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_Adapt_Light__Brazier_, CallFunc_BooleanAND_ReturnValue) == 0x000028, "Member 'BP_Prefab_Fires_Act_C_Adapt_Light__Brazier_::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_Adapt_Light__Brazier_, CallFunc_Less_DoubleDouble_ReturnValue_1) == 0x000029, "Member 'BP_Prefab_Fires_Act_C_Adapt_Light__Brazier_::CallFunc_Less_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_Adapt_Light__Brazier_, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x00002A, "Member 'BP_Prefab_Fires_Act_C_Adapt_Light__Brazier_::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_Adapt_Light__Brazier_, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000030, "Member 'BP_Prefab_Fires_Act_C_Adapt_Light__Brazier_::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_Adapt_Light__Brazier_, CallFunc_Less_DoubleDouble_ReturnValue_2) == 0x000038, "Member 'BP_Prefab_Fires_Act_C_Adapt_Light__Brazier_::CallFunc_Less_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_Adapt_Light__Brazier_, CallFunc_Greater_DoubleDouble_ReturnValue_2) == 0x000039, "Member 'BP_Prefab_Fires_Act_C_Adapt_Light__Brazier_::CallFunc_Greater_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_Adapt_Light__Brazier_, CallFunc_Lerp_ReturnValue_1) == 0x000040, "Member 'BP_Prefab_Fires_Act_C_Adapt_Light__Brazier_::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_Adapt_Light__Brazier_, CallFunc_SetVariableFloat_InValue_ImplicitCast) == 0x000048, "Member 'BP_Prefab_Fires_Act_C_Adapt_Light__Brazier_::CallFunc_SetVariableFloat_InValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_Adapt_Light__Brazier_, CallFunc_SetVariableFloat_InValue_ImplicitCast_1) == 0x00004C, "Member 'BP_Prefab_Fires_Act_C_Adapt_Light__Brazier_::CallFunc_SetVariableFloat_InValue_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_Adapt_Light__Brazier_, CallFunc_SetVariableFloat_InValue_ImplicitCast_2) == 0x000050, "Member 'BP_Prefab_Fires_Act_C_Adapt_Light__Brazier_::CallFunc_SetVariableFloat_InValue_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_Adapt_Light__Brazier_, CallFunc_SetVariableFloat_InValue_ImplicitCast_3) == 0x000054, "Member 'BP_Prefab_Fires_Act_C_Adapt_Light__Brazier_::CallFunc_SetVariableFloat_InValue_ImplicitCast_3' has a wrong offset!");

// Function BP_Prefab_Fires_Act.BP_Prefab_Fires_Act_C.ExecuteUbergraph_BP_Prefab_Fires_Act
// 0x01D0 (0x01D0 - 0x0000)
struct BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_1;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_2;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_1;                       // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_3;         // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBool_ReturnValue;                   // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_4;      // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_2;                       // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x00A0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x018A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x018B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x018D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x018E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x018F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_5;                 // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0192(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_6;                 // 0x0193(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0194(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_7;                 // 0x0195(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0196(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0197(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_8;                 // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_9;                 // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENiagara_WeatherState                         K2Node_Event_Weather;                              // 0x019A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19B[0x5];                                      // 0x019B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Event_Value;                                // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AA[0x6];                                      // 0x01AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FClamp_Value_ImplicitCast;                // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_Value_ImplicitCast_1;              // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_Value_ImplicitCast_2;              // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetNewTime_NewTime_ImplicitCast;          // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act) == 0x000008, "Wrong alignment on BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act");
static_assert(sizeof(BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act) == 0x0001D0, "Wrong size on BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act");
static_assert(offsetof(BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act, EntryPoint) == 0x000000, "Member 'BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act, CallFunc_FClamp_ReturnValue) == 0x000008, "Member 'BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act, CallFunc_FClamp_ReturnValue_1) == 0x000010, "Member 'BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act, CallFunc_FClamp_ReturnValue_2) == 0x000018, "Member 'BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act::CallFunc_FClamp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act, CallFunc_RandomFloatInRange_ReturnValue) == 0x000020, "Member 'BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000028, "Member 'BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x000030, "Member 'BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000038, "Member 'BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000040, "Member 'BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000048, "Member 'BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act, CallFunc_Multiply_DoubleDouble_ReturnValue_3) == 0x000050, "Member 'BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act::CallFunc_Multiply_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act, CallFunc_Lerp_ReturnValue) == 0x000058, "Member 'BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act, CallFunc_Lerp_ReturnValue_1) == 0x000060, "Member 'BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act, CallFunc_RandomFloatInRange_ReturnValue_3) == 0x000068, "Member 'BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act::CallFunc_RandomFloatInRange_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act, CallFunc_RandomBool_ReturnValue) == 0x000070, "Member 'BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act::CallFunc_RandomBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act, CallFunc_Multiply_DoubleDouble_ReturnValue_4) == 0x000078, "Member 'BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act::CallFunc_Multiply_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act, CallFunc_Lerp_ReturnValue_2) == 0x000080, "Member 'BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act::CallFunc_Lerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act, CallFunc_MakeVector_ReturnValue) == 0x000088, "Member 'BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x0000A0, "Member 'BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act, CallFunc_Not_PreBool_ReturnValue) == 0x000188, "Member 'BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act, CallFunc_BooleanAND_ReturnValue) == 0x000189, "Member 'BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act, CallFunc_BooleanAND_ReturnValue_1) == 0x00018A, "Member 'BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act, CallFunc_Not_PreBool_ReturnValue_1) == 0x00018B, "Member 'BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act, CallFunc_BooleanAND_ReturnValue_2) == 0x00018C, "Member 'BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act, CallFunc_BooleanAND_ReturnValue_3) == 0x00018D, "Member 'BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act, CallFunc_BooleanAND_ReturnValue_4) == 0x00018E, "Member 'BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act::CallFunc_BooleanAND_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act, CallFunc_Not_PreBool_ReturnValue_2) == 0x00018F, "Member 'BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act, CallFunc_Not_PreBool_ReturnValue_3) == 0x000190, "Member 'BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act, CallFunc_BooleanAND_ReturnValue_5) == 0x000191, "Member 'BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act::CallFunc_BooleanAND_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act, K2Node_SwitchEnum_CmpSuccess) == 0x000192, "Member 'BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act, CallFunc_BooleanAND_ReturnValue_6) == 0x000193, "Member 'BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act::CallFunc_BooleanAND_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act, K2Node_SwitchEnum_CmpSuccess_1) == 0x000194, "Member 'BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act, CallFunc_BooleanAND_ReturnValue_7) == 0x000195, "Member 'BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act::CallFunc_BooleanAND_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000196, "Member 'BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000197, "Member 'BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act, CallFunc_BooleanAND_ReturnValue_8) == 0x000198, "Member 'BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act::CallFunc_BooleanAND_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act, CallFunc_BooleanAND_ReturnValue_9) == 0x000199, "Member 'BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act::CallFunc_BooleanAND_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act, K2Node_Event_Weather) == 0x00019A, "Member 'BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act::K2Node_Event_Weather' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act, K2Node_Event_Value) == 0x0001A0, "Member 'BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act::K2Node_Event_Value' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act, K2Node_SwitchEnum_CmpSuccess_2) == 0x0001A8, "Member 'BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act, CallFunc_IsVisible_ReturnValue) == 0x0001A9, "Member 'BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act, CallFunc_FClamp_Value_ImplicitCast) == 0x0001B0, "Member 'BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act::CallFunc_FClamp_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act, CallFunc_FClamp_Value_ImplicitCast_1) == 0x0001B8, "Member 'BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act::CallFunc_FClamp_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act, CallFunc_FClamp_Value_ImplicitCast_2) == 0x0001C0, "Member 'BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act::CallFunc_FClamp_Value_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act, CallFunc_SetNewTime_NewTime_ImplicitCast) == 0x0001C8, "Member 'BP_Prefab_Fires_Act_C_ExecuteUbergraph_BP_Prefab_Fires_Act::CallFunc_SetNewTime_NewTime_ImplicitCast' has a wrong offset!");

// Function BP_Prefab_Fires_Act.BP_Prefab_Fires_Act_C.Reset To Defaul (Brazier)
// 0x0038 (0x0038 - 0x0000)
struct BP_Prefab_Fires_Act_C_Reset_To_Defaul__Brazier_ final
{
public:
	bool                                          VFX_Spawnrate_Done;                                // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          VFX_Intensity_Done;                                // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_ReturnValue_1;                       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_2;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_2;       // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast;    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast_1;  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast_2;  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast_3;  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Prefab_Fires_Act_C_Reset_To_Defaul__Brazier_) == 0x000008, "Wrong alignment on BP_Prefab_Fires_Act_C_Reset_To_Defaul__Brazier_");
static_assert(sizeof(BP_Prefab_Fires_Act_C_Reset_To_Defaul__Brazier_) == 0x000038, "Wrong size on BP_Prefab_Fires_Act_C_Reset_To_Defaul__Brazier_");
static_assert(offsetof(BP_Prefab_Fires_Act_C_Reset_To_Defaul__Brazier_, VFX_Spawnrate_Done) == 0x000000, "Member 'BP_Prefab_Fires_Act_C_Reset_To_Defaul__Brazier_::VFX_Spawnrate_Done' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_Reset_To_Defaul__Brazier_, VFX_Intensity_Done) == 0x000001, "Member 'BP_Prefab_Fires_Act_C_Reset_To_Defaul__Brazier_::VFX_Intensity_Done' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_Reset_To_Defaul__Brazier_, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000002, "Member 'BP_Prefab_Fires_Act_C_Reset_To_Defaul__Brazier_::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_Reset_To_Defaul__Brazier_, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000003, "Member 'BP_Prefab_Fires_Act_C_Reset_To_Defaul__Brazier_::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_Reset_To_Defaul__Brazier_, CallFunc_BooleanAND_ReturnValue) == 0x000004, "Member 'BP_Prefab_Fires_Act_C_Reset_To_Defaul__Brazier_::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_Reset_To_Defaul__Brazier_, CallFunc_Lerp_ReturnValue) == 0x000008, "Member 'BP_Prefab_Fires_Act_C_Reset_To_Defaul__Brazier_::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_Reset_To_Defaul__Brazier_, CallFunc_Less_DoubleDouble_ReturnValue_1) == 0x000010, "Member 'BP_Prefab_Fires_Act_C_Reset_To_Defaul__Brazier_::CallFunc_Less_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_Reset_To_Defaul__Brazier_, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x000011, "Member 'BP_Prefab_Fires_Act_C_Reset_To_Defaul__Brazier_::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_Reset_To_Defaul__Brazier_, CallFunc_Lerp_ReturnValue_1) == 0x000018, "Member 'BP_Prefab_Fires_Act_C_Reset_To_Defaul__Brazier_::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_Reset_To_Defaul__Brazier_, CallFunc_Less_DoubleDouble_ReturnValue_2) == 0x000020, "Member 'BP_Prefab_Fires_Act_C_Reset_To_Defaul__Brazier_::CallFunc_Less_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_Reset_To_Defaul__Brazier_, CallFunc_Greater_DoubleDouble_ReturnValue_2) == 0x000021, "Member 'BP_Prefab_Fires_Act_C_Reset_To_Defaul__Brazier_::CallFunc_Greater_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_Reset_To_Defaul__Brazier_, CallFunc_SetVariableFloat_InValue_ImplicitCast) == 0x000024, "Member 'BP_Prefab_Fires_Act_C_Reset_To_Defaul__Brazier_::CallFunc_SetVariableFloat_InValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_Reset_To_Defaul__Brazier_, CallFunc_SetVariableFloat_InValue_ImplicitCast_1) == 0x000028, "Member 'BP_Prefab_Fires_Act_C_Reset_To_Defaul__Brazier_::CallFunc_SetVariableFloat_InValue_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_Reset_To_Defaul__Brazier_, CallFunc_SetVariableFloat_InValue_ImplicitCast_2) == 0x00002C, "Member 'BP_Prefab_Fires_Act_C_Reset_To_Defaul__Brazier_::CallFunc_SetVariableFloat_InValue_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_Reset_To_Defaul__Brazier_, CallFunc_SetVariableFloat_InValue_ImplicitCast_3) == 0x000030, "Member 'BP_Prefab_Fires_Act_C_Reset_To_Defaul__Brazier_::CallFunc_SetVariableFloat_InValue_ImplicitCast_3' has a wrong offset!");

// Function BP_Prefab_Fires_Act.BP_Prefab_Fires_Act_C.Turn Light Off (Brazier)
// 0x0020 (0x0020 - 0x0000)
struct BP_Prefab_Fires_Act_C_Turn_Light_Off__Brazier_ final
{
public:
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast;    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast_1;  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Prefab_Fires_Act_C_Turn_Light_Off__Brazier_) == 0x000008, "Wrong alignment on BP_Prefab_Fires_Act_C_Turn_Light_Off__Brazier_");
static_assert(sizeof(BP_Prefab_Fires_Act_C_Turn_Light_Off__Brazier_) == 0x000020, "Wrong size on BP_Prefab_Fires_Act_C_Turn_Light_Off__Brazier_");
static_assert(offsetof(BP_Prefab_Fires_Act_C_Turn_Light_Off__Brazier_, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000000, "Member 'BP_Prefab_Fires_Act_C_Turn_Light_Off__Brazier_::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_Turn_Light_Off__Brazier_, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000001, "Member 'BP_Prefab_Fires_Act_C_Turn_Light_Off__Brazier_::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_Turn_Light_Off__Brazier_, CallFunc_Lerp_ReturnValue) == 0x000008, "Member 'BP_Prefab_Fires_Act_C_Turn_Light_Off__Brazier_::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_Turn_Light_Off__Brazier_, CallFunc_Less_DoubleDouble_ReturnValue_1) == 0x000010, "Member 'BP_Prefab_Fires_Act_C_Turn_Light_Off__Brazier_::CallFunc_Less_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_Turn_Light_Off__Brazier_, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x000011, "Member 'BP_Prefab_Fires_Act_C_Turn_Light_Off__Brazier_::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_Turn_Light_Off__Brazier_, CallFunc_SetVariableFloat_InValue_ImplicitCast) == 0x000014, "Member 'BP_Prefab_Fires_Act_C_Turn_Light_Off__Brazier_::CallFunc_SetVariableFloat_InValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_Turn_Light_Off__Brazier_, CallFunc_SetVariableFloat_InValue_ImplicitCast_1) == 0x000018, "Member 'BP_Prefab_Fires_Act_C_Turn_Light_Off__Brazier_::CallFunc_SetVariableFloat_InValue_ImplicitCast_1' has a wrong offset!");

// Function BP_Prefab_Fires_Act.BP_Prefab_Fires_Act_C.Update Weather
// 0x0010 (0x0010 - 0x0000)
struct BP_Prefab_Fires_Act_C_Update_Weather final
{
public:
	ENiagara_WeatherState                         Weather;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Value;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Prefab_Fires_Act_C_Update_Weather) == 0x000008, "Wrong alignment on BP_Prefab_Fires_Act_C_Update_Weather");
static_assert(sizeof(BP_Prefab_Fires_Act_C_Update_Weather) == 0x000010, "Wrong size on BP_Prefab_Fires_Act_C_Update_Weather");
static_assert(offsetof(BP_Prefab_Fires_Act_C_Update_Weather, Weather) == 0x000000, "Member 'BP_Prefab_Fires_Act_C_Update_Weather::Weather' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_Update_Weather, Value) == 0x000008, "Member 'BP_Prefab_Fires_Act_C_Update_Weather::Value' has a wrong offset!");

// Function BP_Prefab_Fires_Act.BP_Prefab_Fires_Act_C.UserConstructionScript
// 0x000C (0x000C - 0x0000)
struct BP_Prefab_Fires_Act_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast;    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast_1;  // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Prefab_Fires_Act_C_UserConstructionScript) == 0x000004, "Wrong alignment on BP_Prefab_Fires_Act_C_UserConstructionScript");
static_assert(sizeof(BP_Prefab_Fires_Act_C_UserConstructionScript) == 0x00000C, "Wrong size on BP_Prefab_Fires_Act_C_UserConstructionScript");
static_assert(offsetof(BP_Prefab_Fires_Act_C_UserConstructionScript, CallFunc_Not_PreBool_ReturnValue) == 0x000000, "Member 'BP_Prefab_Fires_Act_C_UserConstructionScript::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Prefab_Fires_Act_C_UserConstructionScript, CallFunc_BooleanAND_ReturnValue) == 0x000001, "Member 'BP_Prefab_Fires_Act_C_UserConstructionScript::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
