#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Parent_Prefab_Act

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ENiagara_WeatherState_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Parent_Prefab_Act.BP_Parent_Prefab_Act_C.Adapt Light
// 0x0098 (0x0098 - 0x0000)
struct BP_Parent_Prefab_Act_C_Adapt_Light final
{
public:
	bool                                          VFX_Spawnrate_Done;                                // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          VFX_Intensity_Done;                                // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_2;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_2;       // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_ReturnValue_1;                       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_2;                       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_4;      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_3;          // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_3;       // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B[0x5];                                       // 0x005B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_5;      // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast; // 0x0068(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast;    // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast_1;  // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast_1; // 0x0074(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast_2;  // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetIntensity_NewIntensity_ImplicitCast;   // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast_3;  // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetIntensity_NewIntensity_ImplicitCast_1; // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Parent_Prefab_Act_C_Adapt_Light) == 0x000008, "Wrong alignment on BP_Parent_Prefab_Act_C_Adapt_Light");
static_assert(sizeof(BP_Parent_Prefab_Act_C_Adapt_Light) == 0x000098, "Wrong size on BP_Parent_Prefab_Act_C_Adapt_Light");
static_assert(offsetof(BP_Parent_Prefab_Act_C_Adapt_Light, VFX_Spawnrate_Done) == 0x000000, "Member 'BP_Parent_Prefab_Act_C_Adapt_Light::VFX_Spawnrate_Done' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_Adapt_Light, VFX_Intensity_Done) == 0x000001, "Member 'BP_Parent_Prefab_Act_C_Adapt_Light::VFX_Intensity_Done' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_Adapt_Light, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000002, "Member 'BP_Parent_Prefab_Act_C_Adapt_Light::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_Adapt_Light, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000003, "Member 'BP_Parent_Prefab_Act_C_Adapt_Light::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_Adapt_Light, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000008, "Member 'BP_Parent_Prefab_Act_C_Adapt_Light::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_Adapt_Light, CallFunc_Lerp_ReturnValue) == 0x000010, "Member 'BP_Parent_Prefab_Act_C_Adapt_Light::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_Adapt_Light, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000018, "Member 'BP_Parent_Prefab_Act_C_Adapt_Light::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_Adapt_Light, CallFunc_BooleanAND_ReturnValue) == 0x000020, "Member 'BP_Parent_Prefab_Act_C_Adapt_Light::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_Adapt_Light, CallFunc_Less_DoubleDouble_ReturnValue_1) == 0x000021, "Member 'BP_Parent_Prefab_Act_C_Adapt_Light::CallFunc_Less_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_Adapt_Light, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x000022, "Member 'BP_Parent_Prefab_Act_C_Adapt_Light::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_Adapt_Light, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000028, "Member 'BP_Parent_Prefab_Act_C_Adapt_Light::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_Adapt_Light, CallFunc_Less_DoubleDouble_ReturnValue_2) == 0x000030, "Member 'BP_Parent_Prefab_Act_C_Adapt_Light::CallFunc_Less_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_Adapt_Light, CallFunc_Greater_DoubleDouble_ReturnValue_2) == 0x000031, "Member 'BP_Parent_Prefab_Act_C_Adapt_Light::CallFunc_Greater_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_Adapt_Light, CallFunc_Lerp_ReturnValue_1) == 0x000038, "Member 'BP_Parent_Prefab_Act_C_Adapt_Light::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_Adapt_Light, CallFunc_Multiply_DoubleDouble_ReturnValue_3) == 0x000040, "Member 'BP_Parent_Prefab_Act_C_Adapt_Light::CallFunc_Multiply_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_Adapt_Light, CallFunc_Lerp_ReturnValue_2) == 0x000048, "Member 'BP_Parent_Prefab_Act_C_Adapt_Light::CallFunc_Lerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_Adapt_Light, CallFunc_Multiply_DoubleDouble_ReturnValue_4) == 0x000050, "Member 'BP_Parent_Prefab_Act_C_Adapt_Light::CallFunc_Multiply_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_Adapt_Light, CallFunc_Less_DoubleDouble_ReturnValue_3) == 0x000058, "Member 'BP_Parent_Prefab_Act_C_Adapt_Light::CallFunc_Less_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_Adapt_Light, CallFunc_Greater_DoubleDouble_ReturnValue_3) == 0x000059, "Member 'BP_Parent_Prefab_Act_C_Adapt_Light::CallFunc_Greater_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_Adapt_Light, CallFunc_IsVisible_ReturnValue) == 0x00005A, "Member 'BP_Parent_Prefab_Act_C_Adapt_Light::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_Adapt_Light, CallFunc_Multiply_DoubleDouble_ReturnValue_5) == 0x000060, "Member 'BP_Parent_Prefab_Act_C_Adapt_Light::CallFunc_Multiply_DoubleDouble_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_Adapt_Light, CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast) == 0x000068, "Member 'BP_Parent_Prefab_Act_C_Adapt_Light::CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_Adapt_Light, CallFunc_SetVariableFloat_InValue_ImplicitCast) == 0x00006C, "Member 'BP_Parent_Prefab_Act_C_Adapt_Light::CallFunc_SetVariableFloat_InValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_Adapt_Light, CallFunc_SetVariableFloat_InValue_ImplicitCast_1) == 0x000070, "Member 'BP_Parent_Prefab_Act_C_Adapt_Light::CallFunc_SetVariableFloat_InValue_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_Adapt_Light, CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast_1) == 0x000074, "Member 'BP_Parent_Prefab_Act_C_Adapt_Light::CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_Adapt_Light, CallFunc_SetVariableFloat_InValue_ImplicitCast_2) == 0x000078, "Member 'BP_Parent_Prefab_Act_C_Adapt_Light::CallFunc_SetVariableFloat_InValue_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_Adapt_Light, CallFunc_SetIntensity_NewIntensity_ImplicitCast) == 0x00007C, "Member 'BP_Parent_Prefab_Act_C_Adapt_Light::CallFunc_SetIntensity_NewIntensity_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_Adapt_Light, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000080, "Member 'BP_Parent_Prefab_Act_C_Adapt_Light::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_Adapt_Light, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x000088, "Member 'BP_Parent_Prefab_Act_C_Adapt_Light::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_Adapt_Light, CallFunc_SetVariableFloat_InValue_ImplicitCast_3) == 0x000090, "Member 'BP_Parent_Prefab_Act_C_Adapt_Light::CallFunc_SetVariableFloat_InValue_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_Adapt_Light, CallFunc_SetIntensity_NewIntensity_ImplicitCast_1) == 0x000094, "Member 'BP_Parent_Prefab_Act_C_Adapt_Light::CallFunc_SetIntensity_NewIntensity_ImplicitCast_1' has a wrong offset!");

// Function BP_Parent_Prefab_Act.BP_Parent_Prefab_Act_C.ExecuteUbergraph_BP_Parent_Prefab_Act
// 0x0068 (0x0068 - 0x0000)
struct BP_Parent_Prefab_Act_C_ExecuteUbergraph_BP_Parent_Prefab_Act final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue_1;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue_2;                  // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x1];                                        // 0x000B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ENiagara_WeatherState Weather, double Value)> K2Node_CreateDelegate_OutputDelegate; // 0x000C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ENiagara_WeatherState                         K2Node_CustomEvent_Weather;                        // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_Value;                          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue_3;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_5;                 // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_WeatherControl_C*                   CallFunc_GetActorOfClass_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43[0x5];                                       // 0x0043(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Skysphere_C*                        CallFunc_GetActorOfClass_ReturnValue_1;            // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Skysphere_C*                        CallFunc_GetActorOfClass_ReturnValue_2;            // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_5;                // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast; // 0x005C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_Light_Transition_Start_ImplicitCast; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Parent_Prefab_Act_C_ExecuteUbergraph_BP_Parent_Prefab_Act) == 0x000008, "Wrong alignment on BP_Parent_Prefab_Act_C_ExecuteUbergraph_BP_Parent_Prefab_Act");
static_assert(sizeof(BP_Parent_Prefab_Act_C_ExecuteUbergraph_BP_Parent_Prefab_Act) == 0x000068, "Wrong size on BP_Parent_Prefab_Act_C_ExecuteUbergraph_BP_Parent_Prefab_Act");
static_assert(offsetof(BP_Parent_Prefab_Act_C_ExecuteUbergraph_BP_Parent_Prefab_Act, EntryPoint) == 0x000000, "Member 'BP_Parent_Prefab_Act_C_ExecuteUbergraph_BP_Parent_Prefab_Act::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_ExecuteUbergraph_BP_Parent_Prefab_Act, CallFunc_IsVisible_ReturnValue) == 0x000004, "Member 'BP_Parent_Prefab_Act_C_ExecuteUbergraph_BP_Parent_Prefab_Act::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_ExecuteUbergraph_BP_Parent_Prefab_Act, CallFunc_IsVisible_ReturnValue_1) == 0x000005, "Member 'BP_Parent_Prefab_Act_C_ExecuteUbergraph_BP_Parent_Prefab_Act::CallFunc_IsVisible_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_ExecuteUbergraph_BP_Parent_Prefab_Act, CallFunc_Not_PreBool_ReturnValue) == 0x000006, "Member 'BP_Parent_Prefab_Act_C_ExecuteUbergraph_BP_Parent_Prefab_Act::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_ExecuteUbergraph_BP_Parent_Prefab_Act, CallFunc_BooleanAND_ReturnValue) == 0x000007, "Member 'BP_Parent_Prefab_Act_C_ExecuteUbergraph_BP_Parent_Prefab_Act::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_ExecuteUbergraph_BP_Parent_Prefab_Act, CallFunc_Not_PreBool_ReturnValue_1) == 0x000008, "Member 'BP_Parent_Prefab_Act_C_ExecuteUbergraph_BP_Parent_Prefab_Act::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_ExecuteUbergraph_BP_Parent_Prefab_Act, CallFunc_BooleanAND_ReturnValue_1) == 0x000009, "Member 'BP_Parent_Prefab_Act_C_ExecuteUbergraph_BP_Parent_Prefab_Act::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_ExecuteUbergraph_BP_Parent_Prefab_Act, CallFunc_IsVisible_ReturnValue_2) == 0x00000A, "Member 'BP_Parent_Prefab_Act_C_ExecuteUbergraph_BP_Parent_Prefab_Act::CallFunc_IsVisible_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_ExecuteUbergraph_BP_Parent_Prefab_Act, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'BP_Parent_Prefab_Act_C_ExecuteUbergraph_BP_Parent_Prefab_Act::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_ExecuteUbergraph_BP_Parent_Prefab_Act, K2Node_CustomEvent_Weather) == 0x00001C, "Member 'BP_Parent_Prefab_Act_C_ExecuteUbergraph_BP_Parent_Prefab_Act::K2Node_CustomEvent_Weather' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_ExecuteUbergraph_BP_Parent_Prefab_Act, K2Node_CustomEvent_Value) == 0x000020, "Member 'BP_Parent_Prefab_Act_C_ExecuteUbergraph_BP_Parent_Prefab_Act::K2Node_CustomEvent_Value' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_ExecuteUbergraph_BP_Parent_Prefab_Act, K2Node_SwitchEnum_CmpSuccess) == 0x000028, "Member 'BP_Parent_Prefab_Act_C_ExecuteUbergraph_BP_Parent_Prefab_Act::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_ExecuteUbergraph_BP_Parent_Prefab_Act, K2Node_SwitchEnum_CmpSuccess_1) == 0x000029, "Member 'BP_Parent_Prefab_Act_C_ExecuteUbergraph_BP_Parent_Prefab_Act::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_ExecuteUbergraph_BP_Parent_Prefab_Act, CallFunc_BooleanAND_ReturnValue_2) == 0x00002A, "Member 'BP_Parent_Prefab_Act_C_ExecuteUbergraph_BP_Parent_Prefab_Act::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_ExecuteUbergraph_BP_Parent_Prefab_Act, CallFunc_Not_PreBool_ReturnValue_2) == 0x00002B, "Member 'BP_Parent_Prefab_Act_C_ExecuteUbergraph_BP_Parent_Prefab_Act::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_ExecuteUbergraph_BP_Parent_Prefab_Act, CallFunc_Not_PreBool_ReturnValue_3) == 0x00002C, "Member 'BP_Parent_Prefab_Act_C_ExecuteUbergraph_BP_Parent_Prefab_Act::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_ExecuteUbergraph_BP_Parent_Prefab_Act, CallFunc_BooleanAND_ReturnValue_3) == 0x00002D, "Member 'BP_Parent_Prefab_Act_C_ExecuteUbergraph_BP_Parent_Prefab_Act::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_ExecuteUbergraph_BP_Parent_Prefab_Act, CallFunc_BooleanAND_ReturnValue_4) == 0x00002E, "Member 'BP_Parent_Prefab_Act_C_ExecuteUbergraph_BP_Parent_Prefab_Act::CallFunc_BooleanAND_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_ExecuteUbergraph_BP_Parent_Prefab_Act, K2Node_SwitchEnum_CmpSuccess_2) == 0x00002F, "Member 'BP_Parent_Prefab_Act_C_ExecuteUbergraph_BP_Parent_Prefab_Act::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_ExecuteUbergraph_BP_Parent_Prefab_Act, CallFunc_IsVisible_ReturnValue_3) == 0x000030, "Member 'BP_Parent_Prefab_Act_C_ExecuteUbergraph_BP_Parent_Prefab_Act::CallFunc_IsVisible_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_ExecuteUbergraph_BP_Parent_Prefab_Act, CallFunc_BooleanAND_ReturnValue_5) == 0x000031, "Member 'BP_Parent_Prefab_Act_C_ExecuteUbergraph_BP_Parent_Prefab_Act::CallFunc_BooleanAND_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_ExecuteUbergraph_BP_Parent_Prefab_Act, CallFunc_GetActorOfClass_ReturnValue) == 0x000038, "Member 'BP_Parent_Prefab_Act_C_ExecuteUbergraph_BP_Parent_Prefab_Act::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_ExecuteUbergraph_BP_Parent_Prefab_Act, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'BP_Parent_Prefab_Act_C_ExecuteUbergraph_BP_Parent_Prefab_Act::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_ExecuteUbergraph_BP_Parent_Prefab_Act, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000041, "Member 'BP_Parent_Prefab_Act_C_ExecuteUbergraph_BP_Parent_Prefab_Act::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_ExecuteUbergraph_BP_Parent_Prefab_Act, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000042, "Member 'BP_Parent_Prefab_Act_C_ExecuteUbergraph_BP_Parent_Prefab_Act::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_ExecuteUbergraph_BP_Parent_Prefab_Act, CallFunc_GetActorOfClass_ReturnValue_1) == 0x000048, "Member 'BP_Parent_Prefab_Act_C_ExecuteUbergraph_BP_Parent_Prefab_Act::CallFunc_GetActorOfClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_ExecuteUbergraph_BP_Parent_Prefab_Act, CallFunc_GetActorOfClass_ReturnValue_2) == 0x000050, "Member 'BP_Parent_Prefab_Act_C_ExecuteUbergraph_BP_Parent_Prefab_Act::CallFunc_GetActorOfClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_ExecuteUbergraph_BP_Parent_Prefab_Act, CallFunc_IsValid_ReturnValue_1) == 0x000058, "Member 'BP_Parent_Prefab_Act_C_ExecuteUbergraph_BP_Parent_Prefab_Act::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_ExecuteUbergraph_BP_Parent_Prefab_Act, CallFunc_IsValid_ReturnValue_2) == 0x000059, "Member 'BP_Parent_Prefab_Act_C_ExecuteUbergraph_BP_Parent_Prefab_Act::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_ExecuteUbergraph_BP_Parent_Prefab_Act, CallFunc_Not_PreBool_ReturnValue_4) == 0x00005A, "Member 'BP_Parent_Prefab_Act_C_ExecuteUbergraph_BP_Parent_Prefab_Act::CallFunc_Not_PreBool_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_ExecuteUbergraph_BP_Parent_Prefab_Act, CallFunc_Not_PreBool_ReturnValue_5) == 0x00005B, "Member 'BP_Parent_Prefab_Act_C_ExecuteUbergraph_BP_Parent_Prefab_Act::CallFunc_Not_PreBool_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_ExecuteUbergraph_BP_Parent_Prefab_Act, CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast) == 0x00005C, "Member 'BP_Parent_Prefab_Act_C_ExecuteUbergraph_BP_Parent_Prefab_Act::CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_ExecuteUbergraph_BP_Parent_Prefab_Act, K2Node_VariableSet_Light_Transition_Start_ImplicitCast) == 0x000060, "Member 'BP_Parent_Prefab_Act_C_ExecuteUbergraph_BP_Parent_Prefab_Act::K2Node_VariableSet_Light_Transition_Start_ImplicitCast' has a wrong offset!");

// Function BP_Parent_Prefab_Act.BP_Parent_Prefab_Act_C.Reset to Default
// 0x0070 (0x0070 - 0x0000)
struct BP_Parent_Prefab_Act_C_Reset_to_Default final
{
public:
	bool                                          VFX_Spawnrate_Done;                                // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          VFX_Intensity_Done;                                // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_ReturnValue_1;                       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_2;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_2;       // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_3;          // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_ReturnValue_2;                       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_3;       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast; // 0x0034(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetIntensity_NewIntensity_ImplicitCast;   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetIntensity_NewIntensity_ImplicitCast_1; // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast_1; // 0x0040(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetIntensity_NewIntensity_ImplicitCast_2; // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast;    // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast_1;  // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast_2;  // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast_3;  // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Parent_Prefab_Act_C_Reset_to_Default) == 0x000008, "Wrong alignment on BP_Parent_Prefab_Act_C_Reset_to_Default");
static_assert(sizeof(BP_Parent_Prefab_Act_C_Reset_to_Default) == 0x000070, "Wrong size on BP_Parent_Prefab_Act_C_Reset_to_Default");
static_assert(offsetof(BP_Parent_Prefab_Act_C_Reset_to_Default, VFX_Spawnrate_Done) == 0x000000, "Member 'BP_Parent_Prefab_Act_C_Reset_to_Default::VFX_Spawnrate_Done' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_Reset_to_Default, VFX_Intensity_Done) == 0x000001, "Member 'BP_Parent_Prefab_Act_C_Reset_to_Default::VFX_Intensity_Done' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_Reset_to_Default, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000002, "Member 'BP_Parent_Prefab_Act_C_Reset_to_Default::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_Reset_to_Default, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000003, "Member 'BP_Parent_Prefab_Act_C_Reset_to_Default::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_Reset_to_Default, CallFunc_BooleanAND_ReturnValue) == 0x000004, "Member 'BP_Parent_Prefab_Act_C_Reset_to_Default::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_Reset_to_Default, CallFunc_Lerp_ReturnValue) == 0x000008, "Member 'BP_Parent_Prefab_Act_C_Reset_to_Default::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_Reset_to_Default, CallFunc_Less_DoubleDouble_ReturnValue_1) == 0x000010, "Member 'BP_Parent_Prefab_Act_C_Reset_to_Default::CallFunc_Less_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_Reset_to_Default, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x000011, "Member 'BP_Parent_Prefab_Act_C_Reset_to_Default::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_Reset_to_Default, CallFunc_Lerp_ReturnValue_1) == 0x000018, "Member 'BP_Parent_Prefab_Act_C_Reset_to_Default::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_Reset_to_Default, CallFunc_Less_DoubleDouble_ReturnValue_2) == 0x000020, "Member 'BP_Parent_Prefab_Act_C_Reset_to_Default::CallFunc_Less_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_Reset_to_Default, CallFunc_Greater_DoubleDouble_ReturnValue_2) == 0x000021, "Member 'BP_Parent_Prefab_Act_C_Reset_to_Default::CallFunc_Greater_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_Reset_to_Default, CallFunc_Less_DoubleDouble_ReturnValue_3) == 0x000022, "Member 'BP_Parent_Prefab_Act_C_Reset_to_Default::CallFunc_Less_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_Reset_to_Default, CallFunc_Lerp_ReturnValue_2) == 0x000028, "Member 'BP_Parent_Prefab_Act_C_Reset_to_Default::CallFunc_Lerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_Reset_to_Default, CallFunc_Greater_DoubleDouble_ReturnValue_3) == 0x000030, "Member 'BP_Parent_Prefab_Act_C_Reset_to_Default::CallFunc_Greater_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_Reset_to_Default, CallFunc_IsVisible_ReturnValue) == 0x000031, "Member 'BP_Parent_Prefab_Act_C_Reset_to_Default::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_Reset_to_Default, CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast) == 0x000034, "Member 'BP_Parent_Prefab_Act_C_Reset_to_Default::CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_Reset_to_Default, CallFunc_SetIntensity_NewIntensity_ImplicitCast) == 0x000038, "Member 'BP_Parent_Prefab_Act_C_Reset_to_Default::CallFunc_SetIntensity_NewIntensity_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_Reset_to_Default, CallFunc_SetIntensity_NewIntensity_ImplicitCast_1) == 0x00003C, "Member 'BP_Parent_Prefab_Act_C_Reset_to_Default::CallFunc_SetIntensity_NewIntensity_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_Reset_to_Default, CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast_1) == 0x000040, "Member 'BP_Parent_Prefab_Act_C_Reset_to_Default::CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_Reset_to_Default, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000048, "Member 'BP_Parent_Prefab_Act_C_Reset_to_Default::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_Reset_to_Default, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x000050, "Member 'BP_Parent_Prefab_Act_C_Reset_to_Default::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_Reset_to_Default, CallFunc_SetIntensity_NewIntensity_ImplicitCast_2) == 0x000058, "Member 'BP_Parent_Prefab_Act_C_Reset_to_Default::CallFunc_SetIntensity_NewIntensity_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_Reset_to_Default, CallFunc_SetVariableFloat_InValue_ImplicitCast) == 0x00005C, "Member 'BP_Parent_Prefab_Act_C_Reset_to_Default::CallFunc_SetVariableFloat_InValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_Reset_to_Default, CallFunc_SetVariableFloat_InValue_ImplicitCast_1) == 0x000060, "Member 'BP_Parent_Prefab_Act_C_Reset_to_Default::CallFunc_SetVariableFloat_InValue_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_Reset_to_Default, CallFunc_SetVariableFloat_InValue_ImplicitCast_2) == 0x000064, "Member 'BP_Parent_Prefab_Act_C_Reset_to_Default::CallFunc_SetVariableFloat_InValue_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_Reset_to_Default, CallFunc_SetVariableFloat_InValue_ImplicitCast_3) == 0x000068, "Member 'BP_Parent_Prefab_Act_C_Reset_to_Default::CallFunc_SetVariableFloat_InValue_ImplicitCast_3' has a wrong offset!");

// Function BP_Parent_Prefab_Act.BP_Parent_Prefab_Act_C.Turn Light Off
// 0x0040 (0x0040 - 0x0000)
struct BP_Parent_Prefab_Act_C_Turn_Light_Off final
{
public:
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_ReturnValue_1;                       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_2;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_2;       // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue_1;                  // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetIntensity_NewIntensity_ImplicitCast;   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast;    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast_1;  // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Parent_Prefab_Act_C_Turn_Light_Off) == 0x000008, "Wrong alignment on BP_Parent_Prefab_Act_C_Turn_Light_Off");
static_assert(sizeof(BP_Parent_Prefab_Act_C_Turn_Light_Off) == 0x000040, "Wrong size on BP_Parent_Prefab_Act_C_Turn_Light_Off");
static_assert(offsetof(BP_Parent_Prefab_Act_C_Turn_Light_Off, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000000, "Member 'BP_Parent_Prefab_Act_C_Turn_Light_Off::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_Turn_Light_Off, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000001, "Member 'BP_Parent_Prefab_Act_C_Turn_Light_Off::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_Turn_Light_Off, CallFunc_Lerp_ReturnValue) == 0x000008, "Member 'BP_Parent_Prefab_Act_C_Turn_Light_Off::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_Turn_Light_Off, CallFunc_Less_DoubleDouble_ReturnValue_1) == 0x000010, "Member 'BP_Parent_Prefab_Act_C_Turn_Light_Off::CallFunc_Less_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_Turn_Light_Off, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x000011, "Member 'BP_Parent_Prefab_Act_C_Turn_Light_Off::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_Turn_Light_Off, CallFunc_Lerp_ReturnValue_1) == 0x000018, "Member 'BP_Parent_Prefab_Act_C_Turn_Light_Off::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_Turn_Light_Off, CallFunc_Less_DoubleDouble_ReturnValue_2) == 0x000020, "Member 'BP_Parent_Prefab_Act_C_Turn_Light_Off::CallFunc_Less_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_Turn_Light_Off, CallFunc_Greater_DoubleDouble_ReturnValue_2) == 0x000021, "Member 'BP_Parent_Prefab_Act_C_Turn_Light_Off::CallFunc_Greater_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_Turn_Light_Off, CallFunc_IsVisible_ReturnValue) == 0x000022, "Member 'BP_Parent_Prefab_Act_C_Turn_Light_Off::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_Turn_Light_Off, CallFunc_IsVisible_ReturnValue_1) == 0x000023, "Member 'BP_Parent_Prefab_Act_C_Turn_Light_Off::CallFunc_IsVisible_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_Turn_Light_Off, CallFunc_SetIntensity_NewIntensity_ImplicitCast) == 0x000024, "Member 'BP_Parent_Prefab_Act_C_Turn_Light_Off::CallFunc_SetIntensity_NewIntensity_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_Turn_Light_Off, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000028, "Member 'BP_Parent_Prefab_Act_C_Turn_Light_Off::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_Turn_Light_Off, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x000030, "Member 'BP_Parent_Prefab_Act_C_Turn_Light_Off::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_Turn_Light_Off, CallFunc_SetVariableFloat_InValue_ImplicitCast) == 0x000038, "Member 'BP_Parent_Prefab_Act_C_Turn_Light_Off::CallFunc_SetVariableFloat_InValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_Turn_Light_Off, CallFunc_SetVariableFloat_InValue_ImplicitCast_1) == 0x00003C, "Member 'BP_Parent_Prefab_Act_C_Turn_Light_Off::CallFunc_SetVariableFloat_InValue_ImplicitCast_1' has a wrong offset!");

// Function BP_Parent_Prefab_Act.BP_Parent_Prefab_Act_C.Update Weather
// 0x0010 (0x0010 - 0x0000)
struct BP_Parent_Prefab_Act_C_Update_Weather final
{
public:
	ENiagara_WeatherState                         Weather;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Value;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Parent_Prefab_Act_C_Update_Weather) == 0x000008, "Wrong alignment on BP_Parent_Prefab_Act_C_Update_Weather");
static_assert(sizeof(BP_Parent_Prefab_Act_C_Update_Weather) == 0x000010, "Wrong size on BP_Parent_Prefab_Act_C_Update_Weather");
static_assert(offsetof(BP_Parent_Prefab_Act_C_Update_Weather, Weather) == 0x000000, "Member 'BP_Parent_Prefab_Act_C_Update_Weather::Weather' has a wrong offset!");
static_assert(offsetof(BP_Parent_Prefab_Act_C_Update_Weather, Value) == 0x000008, "Member 'BP_Parent_Prefab_Act_C_Update_Weather::Value' has a wrong offset!");

// Function BP_Parent_Prefab_Act.BP_Parent_Prefab_Act_C.UserConstructionScript
// 0x0780 (0x0780 - 0x0000)
struct BP_Parent_Prefab_Act_C_UserConstructionScript final
{
public:
	struct FLinearColor                           CallFunc_LinearColor_Desaturated_ReturnValue;      // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBool_ReturnValue;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Skysphere_C*                        CallFunc_GetActorOfClass_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B[0x1];                                       // 0x003B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScalarParameterValue_ReturnValue;      // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScalarParameterValue_ReturnValue_1;    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0047(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScalarParameterValue_ReturnValue_2;    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetRelativeTransform_ReturnValue;         // 0x0050(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_ComposeTransforms_ReturnValue;            // 0x00B0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeTransform_SweepHitResult;   // 0x0110(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_1F8[0x8];                                      // 0x01F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetRelativeTransform_ReturnValue_1;       // 0x0200(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_ComposeTransforms_ReturnValue_1;          // 0x0260(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetRelativeTransform_ReturnValue_2;       // 0x02C0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeTransform_SweepHitResult_1; // 0x0320(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_408[0x8];                                      // 0x0408(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_ComposeTransforms_ReturnValue_2;          // 0x0410(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeTransform_SweepHitResult_2; // 0x0470(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_558[0x8];                                      // 0x0558(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetRelativeTransform_ReturnValue_3;       // 0x0560(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_ComposeTransforms_ReturnValue_3;          // 0x05C0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeTransform_SweepHitResult_3; // 0x0620(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0708(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0710(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0718(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_719[0x3];                                      // 0x0719(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetAttenuationRadius_NewRadius_ImplicitCast; // 0x071C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_LinearColor_Desaturated_InDesaturation_ImplicitCast; // 0x0720(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetIntensity_NewIntensity_ImplicitCast;   // 0x0724(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast; // 0x0728(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast;    // 0x072C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_B_ImplicitCast;      // 0x0730(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_B_ImplicitCast;         // 0x0738(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_B_ImplicitCast_1;    // 0x0740(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_B_ImplicitCast_1;       // 0x0748(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0750(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x0758(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
