#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Spell_Clairvoyance_Path

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Altar_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Spell_Clairvoyance_Path.BP_Spell_Clairvoyance_Path_C
// 0x00A0 (0x0358 - 0x02B8)
class ABP_Spell_Clairvoyance_Path_C final : public AVClairvoyanceVFXBlueprint
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVAltarAkComponent*                     Audio_SFX;                                         // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Path_Particles_VFX;                                // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         Niagara_System;                                    // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         SplinePointAmount;                                 // 0x02D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	uint8                                         Pad_2DC[0x4];                                      // 0x02DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Particle_Position;                                 // 0x02E0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Niagara_System_Is_Valid;                           // 0x02F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	bool                                          Niagara_System_is_Finished;                        // 0x02F9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	uint8                                         Pad_2FA[0x6];                                      // 0x02FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Spline_Offset;                                     // 0x0300(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Stop_Play_Called;                                  // 0x0318(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	uint8                                         Pad_319[0x7];                                      // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          Ak_Audio_Event_Start;                              // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Is_Debug;                                          // 0x0328(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_329[0x7];                                      // 0x0329(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          Ak_Audio_Event_Stop;                               // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         NewVar;                                            // 0x0338(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33C[0x4];                                      // 0x033C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        NewVar_0;                                          // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        Spline_Location_Array;                             // 0x0348(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BndEvt__BP_Spell_Clairvoyance_Path_Path_Particles_VFX_K2Node_ComponentBoundEvent_0_OnNiagaraSystemFinished__DelegateSignature(class UNiagaraComponent* PSystem);
	void Copy_Paste_Spline_Component(class USplineComponent* Source_Spline);
	void ExecuteUbergraph_BP_Spell_Clairvoyance_Path(int32 EntryPoint);
	void OnStartPlay(class USplineComponent* SplineComp);
	void OnStopPlay();
	void ReceiveBeginPlay();
	void ReceiveParticleData(const TArray<struct FBasicParticleData>& Data, class UNiagaraSystem* NiagaraSystem, const struct FVector& SimulationPositionOffset);
	void ReceiveTick(float DeltaSeconds);
	void Set_Guide_Particle_Speed();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Spell_Clairvoyance_Path_C">();
	}
	static class ABP_Spell_Clairvoyance_Path_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Spell_Clairvoyance_Path_C>();
	}
};
static_assert(alignof(ABP_Spell_Clairvoyance_Path_C) == 0x000008, "Wrong alignment on ABP_Spell_Clairvoyance_Path_C");
static_assert(sizeof(ABP_Spell_Clairvoyance_Path_C) == 0x000358, "Wrong size on ABP_Spell_Clairvoyance_Path_C");
static_assert(offsetof(ABP_Spell_Clairvoyance_Path_C, UberGraphFrame) == 0x0002B8, "Member 'ABP_Spell_Clairvoyance_Path_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Spell_Clairvoyance_Path_C, Audio_SFX) == 0x0002C0, "Member 'ABP_Spell_Clairvoyance_Path_C::Audio_SFX' has a wrong offset!");
static_assert(offsetof(ABP_Spell_Clairvoyance_Path_C, Path_Particles_VFX) == 0x0002C8, "Member 'ABP_Spell_Clairvoyance_Path_C::Path_Particles_VFX' has a wrong offset!");
static_assert(offsetof(ABP_Spell_Clairvoyance_Path_C, Niagara_System) == 0x0002D0, "Member 'ABP_Spell_Clairvoyance_Path_C::Niagara_System' has a wrong offset!");
static_assert(offsetof(ABP_Spell_Clairvoyance_Path_C, SplinePointAmount) == 0x0002D8, "Member 'ABP_Spell_Clairvoyance_Path_C::SplinePointAmount' has a wrong offset!");
static_assert(offsetof(ABP_Spell_Clairvoyance_Path_C, Particle_Position) == 0x0002E0, "Member 'ABP_Spell_Clairvoyance_Path_C::Particle_Position' has a wrong offset!");
static_assert(offsetof(ABP_Spell_Clairvoyance_Path_C, Niagara_System_Is_Valid) == 0x0002F8, "Member 'ABP_Spell_Clairvoyance_Path_C::Niagara_System_Is_Valid' has a wrong offset!");
static_assert(offsetof(ABP_Spell_Clairvoyance_Path_C, Niagara_System_is_Finished) == 0x0002F9, "Member 'ABP_Spell_Clairvoyance_Path_C::Niagara_System_is_Finished' has a wrong offset!");
static_assert(offsetof(ABP_Spell_Clairvoyance_Path_C, Spline_Offset) == 0x000300, "Member 'ABP_Spell_Clairvoyance_Path_C::Spline_Offset' has a wrong offset!");
static_assert(offsetof(ABP_Spell_Clairvoyance_Path_C, Stop_Play_Called) == 0x000318, "Member 'ABP_Spell_Clairvoyance_Path_C::Stop_Play_Called' has a wrong offset!");
static_assert(offsetof(ABP_Spell_Clairvoyance_Path_C, Ak_Audio_Event_Start) == 0x000320, "Member 'ABP_Spell_Clairvoyance_Path_C::Ak_Audio_Event_Start' has a wrong offset!");
static_assert(offsetof(ABP_Spell_Clairvoyance_Path_C, Is_Debug) == 0x000328, "Member 'ABP_Spell_Clairvoyance_Path_C::Is_Debug' has a wrong offset!");
static_assert(offsetof(ABP_Spell_Clairvoyance_Path_C, Ak_Audio_Event_Stop) == 0x000330, "Member 'ABP_Spell_Clairvoyance_Path_C::Ak_Audio_Event_Stop' has a wrong offset!");
static_assert(offsetof(ABP_Spell_Clairvoyance_Path_C, NewVar) == 0x000338, "Member 'ABP_Spell_Clairvoyance_Path_C::NewVar' has a wrong offset!");
static_assert(offsetof(ABP_Spell_Clairvoyance_Path_C, NewVar_0) == 0x000340, "Member 'ABP_Spell_Clairvoyance_Path_C::NewVar_0' has a wrong offset!");
static_assert(offsetof(ABP_Spell_Clairvoyance_Path_C, Spline_Location_Array) == 0x000348, "Member 'ABP_Spell_Clairvoyance_Path_C::Spline_Location_Array' has a wrong offset!");

}

