#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Skysphere

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Skysphere.BP_Skysphere_C.ExecuteUbergraph_BP_Skysphere
// 0x02B8 (0x02B8 - 0x0000)
struct BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScalarParameterValue_ReturnValue;      // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue;        // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScalarParameterValue_ReturnValue_1;    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetAllActorsWithInterface_OutActors;      // 0x0028(0x0010)(ReferenceParm)
	TArray<class AActor*>                         CallFunc_GetAllActorsWithInterface_OutActors_1;    // 0x0038(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_Day_Night_C>      K2Node_DynamicCast_AsBPI_Day_Night;                // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Day_Night_C>      K2Node_DynamicCast_AsBPI_Day_Night_1;              // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8E[0x2];                                       // 0x008E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UATMSubsystem*                          CallFunc_Get_ReturnValue;                          // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_AxisX;                                // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_AxisY;                                // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_AxisZ;                                // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Angle;                                // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTime_ReturnValue;                      // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RadiansToDegrees_ReturnValue;             // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_RotatorFromAxisAndAngle_ReturnValue;      // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_2;                // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0120(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0138(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_NotEqual_DoubleDouble_A_ImplicitCast;     // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_B_ImplicitCast;      // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_B_ImplicitCast;         // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_B_ImplicitCast_1;    // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_B_ImplicitCast_1;       // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast_1;    // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast_1;       // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector_X_ImplicitCast;                // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector_Y_ImplicitCast;                // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RadiansToDegrees_A_ImplicitCast;          // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RotatorFromAxisAndAngle_Angle_ImplicitCast; // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28C[0x4];                                      // 0x028C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_B_ImplicitCast;               // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_B_ImplicitCast_1;             // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_B_ImplicitCast_2;             // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Pitch_ImplicitCast;           // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Roll_ImplicitCast;            // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere) == 0x000008, "Wrong alignment on BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere");
static_assert(sizeof(BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere) == 0x0002B8, "Wrong size on BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere");
static_assert(offsetof(BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere, EntryPoint) == 0x000000, "Member 'BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere, CallFunc_GetScalarParameterValue_ReturnValue) == 0x000004, "Member 'BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere::CallFunc_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere, Temp_int_Variable) == 0x000008, "Member 'BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere, CallFunc_NotEqual_DoubleDouble_ReturnValue) == 0x00000C, "Member 'BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere::CallFunc_NotEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere, Temp_int_Variable_1) == 0x000014, "Member 'BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere, CallFunc_Add_IntInt_ReturnValue_1) == 0x000018, "Member 'BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere, CallFunc_GetScalarParameterValue_ReturnValue_1) == 0x00001C, "Member 'BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere::CallFunc_GetScalarParameterValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000020, "Member 'BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000021, "Member 'BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere, CallFunc_Less_DoubleDouble_ReturnValue_1) == 0x000022, "Member 'BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere::CallFunc_Less_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x000023, "Member 'BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere, CallFunc_GetAllActorsWithInterface_OutActors) == 0x000028, "Member 'BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere::CallFunc_GetAllActorsWithInterface_OutActors' has a wrong offset!");
static_assert(offsetof(BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere, CallFunc_GetAllActorsWithInterface_OutActors_1) == 0x000038, "Member 'BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere::CallFunc_GetAllActorsWithInterface_OutActors_1' has a wrong offset!");
static_assert(offsetof(BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere, CallFunc_Array_Get_Item) == 0x000048, "Member 'BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere, CallFunc_Array_Get_Item_1) == 0x000050, "Member 'BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere, K2Node_DynamicCast_AsBPI_Day_Night) == 0x000058, "Member 'BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere::K2Node_DynamicCast_AsBPI_Day_Night' has a wrong offset!");
static_assert(offsetof(BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere, K2Node_DynamicCast_AsBPI_Day_Night_1) == 0x000070, "Member 'BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere::K2Node_DynamicCast_AsBPI_Day_Night_1' has a wrong offset!");
static_assert(offsetof(BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere, K2Node_DynamicCast_bSuccess_1) == 0x000080, "Member 'BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere, CallFunc_Array_Length_ReturnValue) == 0x000084, "Member 'BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere, CallFunc_Array_Length_ReturnValue_1) == 0x000088, "Member 'BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere, CallFunc_Less_IntInt_ReturnValue) == 0x00008C, "Member 'BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere, CallFunc_Less_IntInt_ReturnValue_1) == 0x00008D, "Member 'BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere, CallFunc_Get_ReturnValue) == 0x000090, "Member 'BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere, K2Node_Event_AxisX) == 0x000098, "Member 'BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere::K2Node_Event_AxisX' has a wrong offset!");
static_assert(offsetof(BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere, K2Node_Event_AxisY) == 0x00009C, "Member 'BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere::K2Node_Event_AxisY' has a wrong offset!");
static_assert(offsetof(BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere, K2Node_Event_AxisZ) == 0x0000A0, "Member 'BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere::K2Node_Event_AxisZ' has a wrong offset!");
static_assert(offsetof(BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere, K2Node_Event_Angle) == 0x0000A4, "Member 'BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere::K2Node_Event_Angle' has a wrong offset!");
static_assert(offsetof(BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere, CallFunc_GetTime_ReturnValue) == 0x0000A8, "Member 'BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere::CallFunc_GetTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere, CallFunc_RadiansToDegrees_ReturnValue) == 0x0000B0, "Member 'BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere::CallFunc_RadiansToDegrees_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0000B8, "Member 'BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere, K2Node_Event_DeltaSeconds) == 0x0000C0, "Member 'BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere, CallFunc_MakeVector_ReturnValue) == 0x0000C8, "Member 'BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere, CallFunc_RotatorFromAxisAndAngle_ReturnValue) == 0x0000E0, "Member 'BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere::CallFunc_RotatorFromAxisAndAngle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere, CallFunc_BreakRotator_Roll) == 0x0000F8, "Member 'BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere, CallFunc_BreakRotator_Pitch) == 0x0000FC, "Member 'BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere, CallFunc_BreakRotator_Yaw) == 0x000100, "Member 'BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere, CallFunc_SelectFloat_ReturnValue) == 0x000108, "Member 'BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere, CallFunc_SelectFloat_ReturnValue_1) == 0x000110, "Member 'BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere, CallFunc_SelectFloat_ReturnValue_2) == 0x000118, "Member 'BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere::CallFunc_SelectFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere, CallFunc_MakeRotator_ReturnValue) == 0x000120, "Member 'BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000138, "Member 'BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere, CallFunc_NotEqual_DoubleDouble_A_ImplicitCast) == 0x000220, "Member 'BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere::CallFunc_NotEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere, CallFunc_Greater_DoubleDouble_B_ImplicitCast) == 0x000228, "Member 'BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere::CallFunc_Greater_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere, CallFunc_Less_DoubleDouble_B_ImplicitCast) == 0x000230, "Member 'BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere::CallFunc_Less_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere, CallFunc_Greater_DoubleDouble_B_ImplicitCast_1) == 0x000238, "Member 'BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere::CallFunc_Greater_DoubleDouble_B_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere, CallFunc_Less_DoubleDouble_B_ImplicitCast_1) == 0x000240, "Member 'BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere::CallFunc_Less_DoubleDouble_B_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000248, "Member 'BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x000250, "Member 'BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere, CallFunc_Greater_DoubleDouble_A_ImplicitCast_1) == 0x000258, "Member 'BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere::CallFunc_Greater_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere, CallFunc_Less_DoubleDouble_A_ImplicitCast_1) == 0x000260, "Member 'BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere::CallFunc_Less_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere, CallFunc_MakeVector_X_ImplicitCast) == 0x000268, "Member 'BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere::CallFunc_MakeVector_X_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere, CallFunc_MakeVector_Y_ImplicitCast) == 0x000270, "Member 'BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere::CallFunc_MakeVector_Y_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000278, "Member 'BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere, CallFunc_RadiansToDegrees_A_ImplicitCast) == 0x000280, "Member 'BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere::CallFunc_RadiansToDegrees_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere, CallFunc_RotatorFromAxisAndAngle_Angle_ImplicitCast) == 0x000288, "Member 'BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere::CallFunc_RotatorFromAxisAndAngle_Angle_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere, CallFunc_SelectFloat_B_ImplicitCast) == 0x000290, "Member 'BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere::CallFunc_SelectFloat_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere, CallFunc_SelectFloat_B_ImplicitCast_1) == 0x000298, "Member 'BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere::CallFunc_SelectFloat_B_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere, CallFunc_SelectFloat_B_ImplicitCast_2) == 0x0002A0, "Member 'BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere::CallFunc_SelectFloat_B_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere, CallFunc_MakeRotator_Yaw_ImplicitCast) == 0x0002A8, "Member 'BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere::CallFunc_MakeRotator_Yaw_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere, CallFunc_MakeRotator_Pitch_ImplicitCast) == 0x0002AC, "Member 'BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere::CallFunc_MakeRotator_Pitch_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere, CallFunc_MakeRotator_Roll_ImplicitCast) == 0x0002B0, "Member 'BP_Skysphere_C_ExecuteUbergraph_BP_Skysphere::CallFunc_MakeRotator_Roll_ImplicitCast' has a wrong offset!");

// Function BP_Skysphere.BP_Skysphere_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Skysphere_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Skysphere_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Skysphere_C_ReceiveTick");
static_assert(sizeof(BP_Skysphere_C_ReceiveTick) == 0x000004, "Wrong size on BP_Skysphere_C_ReceiveTick");
static_assert(offsetof(BP_Skysphere_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Skysphere_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_Skysphere.BP_Skysphere_C.SetStarsState
// 0x0010 (0x0010 - 0x0000)
struct BP_Skysphere_C_SetStarsState final
{
public:
	float                                         AxisX;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AxisY;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AxisZ;                                             // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Angle;                                             // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Skysphere_C_SetStarsState) == 0x000004, "Wrong alignment on BP_Skysphere_C_SetStarsState");
static_assert(sizeof(BP_Skysphere_C_SetStarsState) == 0x000010, "Wrong size on BP_Skysphere_C_SetStarsState");
static_assert(offsetof(BP_Skysphere_C_SetStarsState, AxisX) == 0x000000, "Member 'BP_Skysphere_C_SetStarsState::AxisX' has a wrong offset!");
static_assert(offsetof(BP_Skysphere_C_SetStarsState, AxisY) == 0x000004, "Member 'BP_Skysphere_C_SetStarsState::AxisY' has a wrong offset!");
static_assert(offsetof(BP_Skysphere_C_SetStarsState, AxisZ) == 0x000008, "Member 'BP_Skysphere_C_SetStarsState::AxisZ' has a wrong offset!");
static_assert(offsetof(BP_Skysphere_C_SetStarsState, Angle) == 0x00000C, "Member 'BP_Skysphere_C_SetStarsState::Angle' has a wrong offset!");

// Function BP_Skysphere.BP_Skysphere_C.UserConstructionScript
// 0x0050 (0x0050 - 0x0000)
struct BP_Skysphere_C_UserConstructionScript final
{
public:
	float                                         CallFunc_GetScalarParameterValue_ReturnValue;      // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScalarParameterValue_ReturnValue_1;    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScalarParameterValue_ReturnValue_2;    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_B_ImplicitCast;      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_B_ImplicitCast;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_B_ImplicitCast_1;    // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_B_ImplicitCast_1;       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast_1;    // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast_1;       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Skysphere_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_Skysphere_C_UserConstructionScript");
static_assert(sizeof(BP_Skysphere_C_UserConstructionScript) == 0x000050, "Wrong size on BP_Skysphere_C_UserConstructionScript");
static_assert(offsetof(BP_Skysphere_C_UserConstructionScript, CallFunc_GetScalarParameterValue_ReturnValue) == 0x000000, "Member 'BP_Skysphere_C_UserConstructionScript::CallFunc_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skysphere_C_UserConstructionScript, CallFunc_GetScalarParameterValue_ReturnValue_1) == 0x000004, "Member 'BP_Skysphere_C_UserConstructionScript::CallFunc_GetScalarParameterValue_ReturnValue_1' has a wrong offset!");
