#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Spell_Clairvoyance_Path

#include "Basic.hpp"

#include "Niagara_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Spell_Clairvoyance_Path.BP_Spell_Clairvoyance_Path_C.BndEvt__BP_Spell_Clairvoyance_Path_Path Particles VFX_K2Node_ComponentBoundEvent_0_OnNiagaraSystemFinished__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_Spell_Clairvoyance_Path_C_BndEvt__BP_Spell_Clairvoyance_Path_Path_Particles_VFX_K2Node_ComponentBoundEvent_0_OnNiagaraSystemFinished__DelegateSignature final
{
public:
	class UNiagaraComponent*                      PSystem;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Spell_Clairvoyance_Path_C_BndEvt__BP_Spell_Clairvoyance_Path_Path_Particles_VFX_K2Node_ComponentBoundEvent_0_OnNiagaraSystemFinished__DelegateSignature) == 0x000008, "Wrong alignment on BP_Spell_Clairvoyance_Path_C_BndEvt__BP_Spell_Clairvoyance_Path_Path_Particles_VFX_K2Node_ComponentBoundEvent_0_OnNiagaraSystemFinished__DelegateSignature");
static_assert(sizeof(BP_Spell_Clairvoyance_Path_C_BndEvt__BP_Spell_Clairvoyance_Path_Path_Particles_VFX_K2Node_ComponentBoundEvent_0_OnNiagaraSystemFinished__DelegateSignature) == 0x000008, "Wrong size on BP_Spell_Clairvoyance_Path_C_BndEvt__BP_Spell_Clairvoyance_Path_Path_Particles_VFX_K2Node_ComponentBoundEvent_0_OnNiagaraSystemFinished__DelegateSignature");
static_assert(offsetof(BP_Spell_Clairvoyance_Path_C_BndEvt__BP_Spell_Clairvoyance_Path_Path_Particles_VFX_K2Node_ComponentBoundEvent_0_OnNiagaraSystemFinished__DelegateSignature, PSystem) == 0x000000, "Member 'BP_Spell_Clairvoyance_Path_C_BndEvt__BP_Spell_Clairvoyance_Path_Path_Particles_VFX_K2Node_ComponentBoundEvent_0_OnNiagaraSystemFinished__DelegateSignature::PSystem' has a wrong offset!");

// Function BP_Spell_Clairvoyance_Path.BP_Spell_Clairvoyance_Path_C.Copy Paste Spline Component
// 0x0150 (0x0150 - 0x0000)
struct BP_Spell_Clairvoyance_Path_C_Copy_Paste_Spline_Component final
{
public:
	class USplineComponent*                       Source_Spline;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESplinePointType                              CallFunc_GetSplinePointType_ReturnValue;           // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetLeaveTangentAtSplinePoint_ReturnValue; // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetArriveTangentAtSplinePoint_ReturnValue; // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_78[0x8];                                       // 0x0078(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransformAtSplinePoint_ReturnValue;    // 0x0080(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue;      // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x00E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue_1;    // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Spell_Clairvoyance_Path_C_Copy_Paste_Spline_Component) == 0x000010, "Wrong alignment on BP_Spell_Clairvoyance_Path_C_Copy_Paste_Spline_Component");
static_assert(sizeof(BP_Spell_Clairvoyance_Path_C_Copy_Paste_Spline_Component) == 0x000150, "Wrong size on BP_Spell_Clairvoyance_Path_C_Copy_Paste_Spline_Component");
static_assert(offsetof(BP_Spell_Clairvoyance_Path_C_Copy_Paste_Spline_Component, Source_Spline) == 0x000000, "Member 'BP_Spell_Clairvoyance_Path_C_Copy_Paste_Spline_Component::Source_Spline' has a wrong offset!");
static_assert(offsetof(BP_Spell_Clairvoyance_Path_C_Copy_Paste_Spline_Component, Index_0) == 0x000008, "Member 'BP_Spell_Clairvoyance_Path_C_Copy_Paste_Spline_Component::Index_0' has a wrong offset!");
static_assert(offsetof(BP_Spell_Clairvoyance_Path_C_Copy_Paste_Spline_Component, Temp_int_Variable) == 0x00000C, "Member 'BP_Spell_Clairvoyance_Path_C_Copy_Paste_Spline_Component::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_Spell_Clairvoyance_Path_C_Copy_Paste_Spline_Component, CallFunc_Multiply_IntInt_ReturnValue) == 0x000010, "Member 'BP_Spell_Clairvoyance_Path_C_Copy_Paste_Spline_Component::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spell_Clairvoyance_Path_C_Copy_Paste_Spline_Component, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000018, "Member 'BP_Spell_Clairvoyance_Path_C_Copy_Paste_Spline_Component::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spell_Clairvoyance_Path_C_Copy_Paste_Spline_Component, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'BP_Spell_Clairvoyance_Path_C_Copy_Paste_Spline_Component::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spell_Clairvoyance_Path_C_Copy_Paste_Spline_Component, CallFunc_MakeVector_ReturnValue) == 0x000028, "Member 'BP_Spell_Clairvoyance_Path_C_Copy_Paste_Spline_Component::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spell_Clairvoyance_Path_C_Copy_Paste_Spline_Component, CallFunc_GetSplinePointType_ReturnValue) == 0x000040, "Member 'BP_Spell_Clairvoyance_Path_C_Copy_Paste_Spline_Component::CallFunc_GetSplinePointType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spell_Clairvoyance_Path_C_Copy_Paste_Spline_Component, CallFunc_GetLeaveTangentAtSplinePoint_ReturnValue) == 0x000048, "Member 'BP_Spell_Clairvoyance_Path_C_Copy_Paste_Spline_Component::CallFunc_GetLeaveTangentAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spell_Clairvoyance_Path_C_Copy_Paste_Spline_Component, CallFunc_GetArriveTangentAtSplinePoint_ReturnValue) == 0x000060, "Member 'BP_Spell_Clairvoyance_Path_C_Copy_Paste_Spline_Component::CallFunc_GetArriveTangentAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spell_Clairvoyance_Path_C_Copy_Paste_Spline_Component, CallFunc_GetTransformAtSplinePoint_ReturnValue) == 0x000080, "Member 'BP_Spell_Clairvoyance_Path_C_Copy_Paste_Spline_Component::CallFunc_GetTransformAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spell_Clairvoyance_Path_C_Copy_Paste_Spline_Component, CallFunc_GetNumberOfSplinePoints_ReturnValue) == 0x0000E0, "Member 'BP_Spell_Clairvoyance_Path_C_Copy_Paste_Spline_Component::CallFunc_GetNumberOfSplinePoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spell_Clairvoyance_Path_C_Copy_Paste_Spline_Component, CallFunc_BreakTransform_Location) == 0x0000E8, "Member 'BP_Spell_Clairvoyance_Path_C_Copy_Paste_Spline_Component::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_Spell_Clairvoyance_Path_C_Copy_Paste_Spline_Component, CallFunc_BreakTransform_Rotation) == 0x000100, "Member 'BP_Spell_Clairvoyance_Path_C_Copy_Paste_Spline_Component::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_Spell_Clairvoyance_Path_C_Copy_Paste_Spline_Component, CallFunc_BreakTransform_Scale) == 0x000118, "Member 'BP_Spell_Clairvoyance_Path_C_Copy_Paste_Spline_Component::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_Spell_Clairvoyance_Path_C_Copy_Paste_Spline_Component, CallFunc_Subtract_IntInt_ReturnValue) == 0x000130, "Member 'BP_Spell_Clairvoyance_Path_C_Copy_Paste_Spline_Component::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spell_Clairvoyance_Path_C_Copy_Paste_Spline_Component, Temp_int_Variable_1) == 0x000134, "Member 'BP_Spell_Clairvoyance_Path_C_Copy_Paste_Spline_Component::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Spell_Clairvoyance_Path_C_Copy_Paste_Spline_Component, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000138, "Member 'BP_Spell_Clairvoyance_Path_C_Copy_Paste_Spline_Component::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spell_Clairvoyance_Path_C_Copy_Paste_Spline_Component, CallFunc_Add_IntInt_ReturnValue_1) == 0x00013C, "Member 'BP_Spell_Clairvoyance_Path_C_Copy_Paste_Spline_Component::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Spell_Clairvoyance_Path_C_Copy_Paste_Spline_Component, CallFunc_GetNumberOfSplinePoints_ReturnValue_1) == 0x000140, "Member 'BP_Spell_Clairvoyance_Path_C_Copy_Paste_Spline_Component::CallFunc_GetNumberOfSplinePoints_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Spell_Clairvoyance_Path_C_Copy_Paste_Spline_Component, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000144, "Member 'BP_Spell_Clairvoyance_Path_C_Copy_Paste_Spline_Component::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");

// Function BP_Spell_Clairvoyance_Path.BP_Spell_Clairvoyance_Path_C.ExecuteUbergraph_BP_Spell_Clairvoyance_Path
// 0x0380 (0x0380 - 0x0000)
struct BP_Spell_Clairvoyance_Path_C_ExecuteUbergraph_BP_Spell_Clairvoyance_Path final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USplineComponent*                       K2Node_Event_SplineComp;                           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0020(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetLocationAtSplinePoint_ReturnValue;     // 0x00D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x00F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      K2Node_ComponentBoundEvent_PSystem;                // 0x0108(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0110(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UVOblivionInitialSettings*        CallFunc_GetOblivionInitialSettings_ReturnValue;   // 0x0128(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_135[0x3];                                      // 0x0135(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FBasicParticleData>             K2Node_Event_Data;                                 // 0x0138(0x0010)(ConstParm, ReferenceParm)
	class UNiagaraSystem*                         K2Node_Event_NiagaraSystem;                        // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_SimulationPositionOffset;             // 0x0150(0x0018)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBasicParticleData                     CallFunc_Array_Get_Item;                           // 0x0168(0x0038)(NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x01A0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_1;              // 0x0288(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue_1;               // 0x0290(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x02F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x0308(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x0320(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UVOblivionInitialSettings*        CallFunc_GetOblivionInitialSettings_ReturnValue_1; // 0x0338(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue;      // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0344(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_349[0x7];                                      // 0x0349(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetLocationAtSplinePoint_ReturnValue_1;   // 0x0350(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast;    // 0x036C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast_1;  // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Spell_Clairvoyance_Path_C_ExecuteUbergraph_BP_Spell_Clairvoyance_Path) == 0x000010, "Wrong alignment on BP_Spell_Clairvoyance_Path_C_ExecuteUbergraph_BP_Spell_Clairvoyance_Path");
static_assert(sizeof(BP_Spell_Clairvoyance_Path_C_ExecuteUbergraph_BP_Spell_Clairvoyance_Path) == 0x000380, "Wrong size on BP_Spell_Clairvoyance_Path_C_ExecuteUbergraph_BP_Spell_Clairvoyance_Path");
static_assert(offsetof(BP_Spell_Clairvoyance_Path_C_ExecuteUbergraph_BP_Spell_Clairvoyance_Path, EntryPoint) == 0x000000, "Member 'BP_Spell_Clairvoyance_Path_C_ExecuteUbergraph_BP_Spell_Clairvoyance_Path::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Spell_Clairvoyance_Path_C_ExecuteUbergraph_BP_Spell_Clairvoyance_Path, K2Node_Event_SplineComp) == 0x000008, "Member 'BP_Spell_Clairvoyance_Path_C_ExecuteUbergraph_BP_Spell_Clairvoyance_Path::K2Node_Event_SplineComp' has a wrong offset!");
static_assert(offsetof(BP_Spell_Clairvoyance_Path_C_ExecuteUbergraph_BP_Spell_Clairvoyance_Path, CallFunc_GetPlayerPawn_ReturnValue) == 0x000010, "Member 'BP_Spell_Clairvoyance_Path_C_ExecuteUbergraph_BP_Spell_Clairvoyance_Path::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spell_Clairvoyance_Path_C_ExecuteUbergraph_BP_Spell_Clairvoyance_Path, CallFunc_GetTransform_ReturnValue) == 0x000020, "Member 'BP_Spell_Clairvoyance_Path_C_ExecuteUbergraph_BP_Spell_Clairvoyance_Path::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spell_Clairvoyance_Path_C_ExecuteUbergraph_BP_Spell_Clairvoyance_Path, CallFunc_BreakTransform_Location) == 0x000080, "Member 'BP_Spell_Clairvoyance_Path_C_ExecuteUbergraph_BP_Spell_Clairvoyance_Path::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_Spell_Clairvoyance_Path_C_ExecuteUbergraph_BP_Spell_Clairvoyance_Path, CallFunc_BreakTransform_Rotation) == 0x000098, "Member 'BP_Spell_Clairvoyance_Path_C_ExecuteUbergraph_BP_Spell_Clairvoyance_Path::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_Spell_Clairvoyance_Path_C_ExecuteUbergraph_BP_Spell_Clairvoyance_Path, CallFunc_BreakTransform_Scale) == 0x0000B0, "Member 'BP_Spell_Clairvoyance_Path_C_ExecuteUbergraph_BP_Spell_Clairvoyance_Path::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_Spell_Clairvoyance_Path_C_ExecuteUbergraph_BP_Spell_Clairvoyance_Path, Temp_int_Variable) == 0x0000C8, "Member 'BP_Spell_Clairvoyance_Path_C_ExecuteUbergraph_BP_Spell_Clairvoyance_Path::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_Spell_Clairvoyance_Path_C_ExecuteUbergraph_BP_Spell_Clairvoyance_Path, CallFunc_NotEqual_IntInt_ReturnValue) == 0x0000CC, "Member 'BP_Spell_Clairvoyance_Path_C_ExecuteUbergraph_BP_Spell_Clairvoyance_Path::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spell_Clairvoyance_Path_C_ExecuteUbergraph_BP_Spell_Clairvoyance_Path, CallFunc_Add_IntInt_ReturnValue) == 0x0000D0, "Member 'BP_Spell_Clairvoyance_Path_C_ExecuteUbergraph_BP_Spell_Clairvoyance_Path::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spell_Clairvoyance_Path_C_ExecuteUbergraph_BP_Spell_Clairvoyance_Path, CallFunc_GetLocationAtSplinePoint_ReturnValue) == 0x0000D8, "Member 'BP_Spell_Clairvoyance_Path_C_ExecuteUbergraph_BP_Spell_Clairvoyance_Path::CallFunc_GetLocationAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spell_Clairvoyance_Path_C_ExecuteUbergraph_BP_Spell_Clairvoyance_Path, CallFunc_SelectVector_ReturnValue) == 0x0000F0, "Member 'BP_Spell_Clairvoyance_Path_C_ExecuteUbergraph_BP_Spell_Clairvoyance_Path::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spell_Clairvoyance_Path_C_ExecuteUbergraph_BP_Spell_Clairvoyance_Path, K2Node_ComponentBoundEvent_PSystem) == 0x000108, "Member 'BP_Spell_Clairvoyance_Path_C_ExecuteUbergraph_BP_Spell_Clairvoyance_Path::K2Node_ComponentBoundEvent_PSystem' has a wrong offset!");
static_assert(offsetof(BP_Spell_Clairvoyance_Path_C_ExecuteUbergraph_BP_Spell_Clairvoyance_Path, CallFunc_Add_VectorVector_ReturnValue) == 0x000110, "Member 'BP_Spell_Clairvoyance_Path_C_ExecuteUbergraph_BP_Spell_Clairvoyance_Path::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spell_Clairvoyance_Path_C_ExecuteUbergraph_BP_Spell_Clairvoyance_Path, CallFunc_GetOblivionInitialSettings_ReturnValue) == 0x000128, "Member 'BP_Spell_Clairvoyance_Path_C_ExecuteUbergraph_BP_Spell_Clairvoyance_Path::CallFunc_GetOblivionInitialSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spell_Clairvoyance_Path_C_ExecuteUbergraph_BP_Spell_Clairvoyance_Path, K2Node_Event_DeltaSeconds) == 0x000130, "Member 'BP_Spell_Clairvoyance_Path_C_ExecuteUbergraph_BP_Spell_Clairvoyance_Path::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Spell_Clairvoyance_Path_C_ExecuteUbergraph_BP_Spell_Clairvoyance_Path, CallFunc_BooleanAND_ReturnValue) == 0x000134, "Member 'BP_Spell_Clairvoyance_Path_C_ExecuteUbergraph_BP_Spell_Clairvoyance_Path::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spell_Clairvoyance_Path_C_ExecuteUbergraph_BP_Spell_Clairvoyance_Path, K2Node_Event_Data) == 0x000138, "Member 'BP_Spell_Clairvoyance_Path_C_ExecuteUbergraph_BP_Spell_Clairvoyance_Path::K2Node_Event_Data' has a wrong offset!");
static_assert(offsetof(BP_Spell_Clairvoyance_Path_C_ExecuteUbergraph_BP_Spell_Clairvoyance_Path, K2Node_Event_NiagaraSystem) == 0x000148, "Member 'BP_Spell_Clairvoyance_Path_C_ExecuteUbergraph_BP_Spell_Clairvoyance_Path::K2Node_Event_NiagaraSystem' has a wrong offset!");
static_assert(offsetof(BP_Spell_Clairvoyance_Path_C_ExecuteUbergraph_BP_Spell_Clairvoyance_Path, K2Node_Event_SimulationPositionOffset) == 0x000150, "Member 'BP_Spell_Clairvoyance_Path_C_ExecuteUbergraph_BP_Spell_Clairvoyance_Path::K2Node_Event_SimulationPositionOffset' has a wrong offset!");
static_assert(offsetof(BP_Spell_Clairvoyance_Path_C_ExecuteUbergraph_BP_Spell_Clairvoyance_Path, CallFunc_Array_Get_Item) == 0x000168, "Member 'BP_Spell_Clairvoyance_Path_C_ExecuteUbergraph_BP_Spell_Clairvoyance_Path::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Spell_Clairvoyance_Path_C_ExecuteUbergraph_BP_Spell_Clairvoyance_Path, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x0001A0, "Member 'BP_Spell_Clairvoyance_Path_C_ExecuteUbergraph_BP_Spell_Clairvoyance_Path::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Spell_Clairvoyance_Path_C_ExecuteUbergraph_BP_Spell_Clairvoyance_Path, CallFunc_GetPlayerPawn_ReturnValue_1) == 0x000288, "Member 'BP_Spell_Clairvoyance_Path_C_ExecuteUbergraph_BP_Spell_Clairvoyance_Path::CallFunc_GetPlayerPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Spell_Clairvoyance_Path_C_ExecuteUbergraph_BP_Spell_Clairvoyance_Path, CallFunc_GetTransform_ReturnValue_1) == 0x000290, "Member 'BP_Spell_Clairvoyance_Path_C_ExecuteUbergraph_BP_Spell_Clairvoyance_Path::CallFunc_GetTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Spell_Clairvoyance_Path_C_ExecuteUbergraph_BP_Spell_Clairvoyance_Path, CallFunc_BreakTransform_Location_1) == 0x0002F0, "Member 'BP_Spell_Clairvoyance_Path_C_ExecuteUbergraph_BP_Spell_Clairvoyance_Path::CallFunc_BreakTransform_Location_1' has a wrong offset!");
static_assert(offsetof(BP_Spell_Clairvoyance_Path_C_ExecuteUbergraph_BP_Spell_Clairvoyance_Path, CallFunc_BreakTransform_Rotation_1) == 0x000308, "Member 'BP_Spell_Clairvoyance_Path_C_ExecuteUbergraph_BP_Spell_Clairvoyance_Path::CallFunc_BreakTransform_Rotation_1' has a wrong offset!");
static_assert(offsetof(BP_Spell_Clairvoyance_Path_C_ExecuteUbergraph_BP_Spell_Clairvoyance_Path, CallFunc_BreakTransform_Scale_1) == 0x000320, "Member 'BP_Spell_Clairvoyance_Path_C_ExecuteUbergraph_BP_Spell_Clairvoyance_Path::CallFunc_BreakTransform_Scale_1' has a wrong offset!");
static_assert(offsetof(BP_Spell_Clairvoyance_Path_C_ExecuteUbergraph_BP_Spell_Clairvoyance_Path, CallFunc_GetOblivionInitialSettings_ReturnValue_1) == 0x000338, "Member 'BP_Spell_Clairvoyance_Path_C_ExecuteUbergraph_BP_Spell_Clairvoyance_Path::CallFunc_GetOblivionInitialSettings_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Spell_Clairvoyance_Path_C_ExecuteUbergraph_BP_Spell_Clairvoyance_Path, CallFunc_GetNumberOfSplinePoints_ReturnValue) == 0x000340, "Member 'BP_Spell_Clairvoyance_Path_C_ExecuteUbergraph_BP_Spell_Clairvoyance_Path::CallFunc_GetNumberOfSplinePoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spell_Clairvoyance_Path_C_ExecuteUbergraph_BP_Spell_Clairvoyance_Path, CallFunc_Subtract_IntInt_ReturnValue) == 0x000344, "Member 'BP_Spell_Clairvoyance_Path_C_ExecuteUbergraph_BP_Spell_Clairvoyance_Path::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spell_Clairvoyance_Path_C_ExecuteUbergraph_BP_Spell_Clairvoyance_Path, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000348, "Member 'BP_Spell_Clairvoyance_Path_C_ExecuteUbergraph_BP_Spell_Clairvoyance_Path::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spell_Clairvoyance_Path_C_ExecuteUbergraph_BP_Spell_Clairvoyance_Path, CallFunc_GetLocationAtSplinePoint_ReturnValue_1) == 0x000350, "Member 'BP_Spell_Clairvoyance_Path_C_ExecuteUbergraph_BP_Spell_Clairvoyance_Path::CallFunc_GetLocationAtSplinePoint_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Spell_Clairvoyance_Path_C_ExecuteUbergraph_BP_Spell_Clairvoyance_Path, CallFunc_Array_Add_ReturnValue) == 0x000368, "Member 'BP_Spell_Clairvoyance_Path_C_ExecuteUbergraph_BP_Spell_Clairvoyance_Path::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spell_Clairvoyance_Path_C_ExecuteUbergraph_BP_Spell_Clairvoyance_Path, CallFunc_SetVariableFloat_InValue_ImplicitCast) == 0x00036C, "Member 'BP_Spell_Clairvoyance_Path_C_ExecuteUbergraph_BP_Spell_Clairvoyance_Path::CallFunc_SetVariableFloat_InValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Spell_Clairvoyance_Path_C_ExecuteUbergraph_BP_Spell_Clairvoyance_Path, CallFunc_SetVariableFloat_InValue_ImplicitCast_1) == 0x000370, "Member 'BP_Spell_Clairvoyance_Path_C_ExecuteUbergraph_BP_Spell_Clairvoyance_Path::CallFunc_SetVariableFloat_InValue_ImplicitCast_1' has a wrong offset!");

// Function BP_Spell_Clairvoyance_Path.BP_Spell_Clairvoyance_Path_C.OnStartPlay
// 0x0008 (0x0008 - 0x0000)
struct BP_Spell_Clairvoyance_Path_C_OnStartPlay final
{
public:
	class USplineComponent*                       SplineComp;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Spell_Clairvoyance_Path_C_OnStartPlay) == 0x000008, "Wrong alignment on BP_Spell_Clairvoyance_Path_C_OnStartPlay");
static_assert(sizeof(BP_Spell_Clairvoyance_Path_C_OnStartPlay) == 0x000008, "Wrong size on BP_Spell_Clairvoyance_Path_C_OnStartPlay");
static_assert(offsetof(BP_Spell_Clairvoyance_Path_C_OnStartPlay, SplineComp) == 0x000000, "Member 'BP_Spell_Clairvoyance_Path_C_OnStartPlay::SplineComp' has a wrong offset!");

// Function BP_Spell_Clairvoyance_Path.BP_Spell_Clairvoyance_Path_C.ReceiveParticleData
// 0x0030 (0x0030 - 0x0000)
struct BP_Spell_Clairvoyance_Path_C_ReceiveParticleData final
{
public:
	TArray<struct FBasicParticleData>             Data;                                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UNiagaraSystem*                         NiagaraSystem;                                     // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SimulationPositionOffset;                          // 0x0018(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Spell_Clairvoyance_Path_C_ReceiveParticleData) == 0x000008, "Wrong alignment on BP_Spell_Clairvoyance_Path_C_ReceiveParticleData");
static_assert(sizeof(BP_Spell_Clairvoyance_Path_C_ReceiveParticleData) == 0x000030, "Wrong size on BP_Spell_Clairvoyance_Path_C_ReceiveParticleData");
static_assert(offsetof(BP_Spell_Clairvoyance_Path_C_ReceiveParticleData, Data) == 0x000000, "Member 'BP_Spell_Clairvoyance_Path_C_ReceiveParticleData::Data' has a wrong offset!");
static_assert(offsetof(BP_Spell_Clairvoyance_Path_C_ReceiveParticleData, NiagaraSystem) == 0x000010, "Member 'BP_Spell_Clairvoyance_Path_C_ReceiveParticleData::NiagaraSystem' has a wrong offset!");
static_assert(offsetof(BP_Spell_Clairvoyance_Path_C_ReceiveParticleData, SimulationPositionOffset) == 0x000018, "Member 'BP_Spell_Clairvoyance_Path_C_ReceiveParticleData::SimulationPositionOffset' has a wrong offset!");

// Function BP_Spell_Clairvoyance_Path.BP_Spell_Clairvoyance_Path_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Spell_Clairvoyance_Path_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Spell_Clairvoyance_Path_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Spell_Clairvoyance_Path_C_ReceiveTick");
static_assert(sizeof(BP_Spell_Clairvoyance_Path_C_ReceiveTick) == 0x000004, "Wrong size on BP_Spell_Clairvoyance_Path_C_ReceiveTick");
static_assert(offsetof(BP_Spell_Clairvoyance_Path_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Spell_Clairvoyance_Path_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_Spell_Clairvoyance_Path.BP_Spell_Clairvoyance_Path_C.Set Guide Particle Speed
// 0x0058 (0x0058 - 0x0000)
struct BP_Spell_Clairvoyance_Path_C_Set_Guide_Particle_Speed final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AVAltarPlayerController*                K2Node_DynamicCast_AsVAltar_Player_Controller;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHorseRiding_ReturnValue;                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AVPairedPawn*                           K2Node_DynamicCast_AsVPaired_Pawn;                 // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetMaxGroundSprintSpeed_ReturnValue;      // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaxGroundRunSpeed_ReturnValue;         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeUnclamped_ReturnValue;            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeUnclamped_Value_ImplicitCast;     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast;    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Spell_Clairvoyance_Path_C_Set_Guide_Particle_Speed) == 0x000008, "Wrong alignment on BP_Spell_Clairvoyance_Path_C_Set_Guide_Particle_Speed");
static_assert(sizeof(BP_Spell_Clairvoyance_Path_C_Set_Guide_Particle_Speed) == 0x000058, "Wrong size on BP_Spell_Clairvoyance_Path_C_Set_Guide_Particle_Speed");
static_assert(offsetof(BP_Spell_Clairvoyance_Path_C_Set_Guide_Particle_Speed, Temp_bool_Variable) == 0x000000, "Member 'BP_Spell_Clairvoyance_Path_C_Set_Guide_Particle_Speed::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_Spell_Clairvoyance_Path_C_Set_Guide_Particle_Speed, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'BP_Spell_Clairvoyance_Path_C_Set_Guide_Particle_Speed::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spell_Clairvoyance_Path_C_Set_Guide_Particle_Speed, K2Node_DynamicCast_AsVAltar_Player_Controller) == 0x000010, "Member 'BP_Spell_Clairvoyance_Path_C_Set_Guide_Particle_Speed::K2Node_DynamicCast_AsVAltar_Player_Controller' has a wrong offset!");
static_assert(offsetof(BP_Spell_Clairvoyance_Path_C_Set_Guide_Particle_Speed, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_Spell_Clairvoyance_Path_C_Set_Guide_Particle_Speed::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Spell_Clairvoyance_Path_C_Set_Guide_Particle_Speed, CallFunc_IsHorseRiding_ReturnValue) == 0x000019, "Member 'BP_Spell_Clairvoyance_Path_C_Set_Guide_Particle_Speed::CallFunc_IsHorseRiding_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spell_Clairvoyance_Path_C_Set_Guide_Particle_Speed, CallFunc_K2_GetPawn_ReturnValue) == 0x000020, "Member 'BP_Spell_Clairvoyance_Path_C_Set_Guide_Particle_Speed::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spell_Clairvoyance_Path_C_Set_Guide_Particle_Speed, K2Node_DynamicCast_AsVPaired_Pawn) == 0x000028, "Member 'BP_Spell_Clairvoyance_Path_C_Set_Guide_Particle_Speed::K2Node_DynamicCast_AsVPaired_Pawn' has a wrong offset!");
static_assert(offsetof(BP_Spell_Clairvoyance_Path_C_Set_Guide_Particle_Speed, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'BP_Spell_Clairvoyance_Path_C_Set_Guide_Particle_Speed::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Spell_Clairvoyance_Path_C_Set_Guide_Particle_Speed, CallFunc_GetMaxGroundSprintSpeed_ReturnValue) == 0x000034, "Member 'BP_Spell_Clairvoyance_Path_C_Set_Guide_Particle_Speed::CallFunc_GetMaxGroundSprintSpeed_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spell_Clairvoyance_Path_C_Set_Guide_Particle_Speed, CallFunc_GetMaxGroundRunSpeed_ReturnValue) == 0x000038, "Member 'BP_Spell_Clairvoyance_Path_C_Set_Guide_Particle_Speed::CallFunc_GetMaxGroundRunSpeed_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spell_Clairvoyance_Path_C_Set_Guide_Particle_Speed, K2Node_Select_Default) == 0x00003C, "Member 'BP_Spell_Clairvoyance_Path_C_Set_Guide_Particle_Speed::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_Spell_Clairvoyance_Path_C_Set_Guide_Particle_Speed, CallFunc_MapRangeUnclamped_ReturnValue) == 0x000040, "Member 'BP_Spell_Clairvoyance_Path_C_Set_Guide_Particle_Speed::CallFunc_MapRangeUnclamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spell_Clairvoyance_Path_C_Set_Guide_Particle_Speed, CallFunc_MapRangeUnclamped_Value_ImplicitCast) == 0x000048, "Member 'BP_Spell_Clairvoyance_Path_C_Set_Guide_Particle_Speed::CallFunc_MapRangeUnclamped_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Spell_Clairvoyance_Path_C_Set_Guide_Particle_Speed, CallFunc_SetVariableFloat_InValue_ImplicitCast) == 0x000050, "Member 'BP_Spell_Clairvoyance_Path_C_Set_Guide_Particle_Speed::CallFunc_SetVariableFloat_InValue_ImplicitCast' has a wrong offset!");

// Function BP_Spell_Clairvoyance_Path.BP_Spell_Clairvoyance_Path_C.UserConstructionScript
// 0x0001 (0x0001 - 0x0000)
struct BP_Spell_Clairvoyance_Path_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Spell_Clairvoyance_Path_C_UserConstructionScript) == 0x000001, "Wrong alignment on BP_Spell_Clairvoyance_Path_C_UserConstructionScript");
static_assert(sizeof(BP_Spell_Clairvoyance_Path_C_UserConstructionScript) == 0x000001, "Wrong size on BP_Spell_Clairvoyance_Path_C_UserConstructionScript");
static_assert(offsetof(BP_Spell_Clairvoyance_Path_C_UserConstructionScript, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_Spell_Clairvoyance_Path_C_UserConstructionScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

