#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Torch02

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_PF_TorchPlayer_PL_classes.hpp"


namespace SDK
{

// VModdableBlueprintGeneratedClass BP_Torch02.BP_Torch02_C
// 0x0020 (0x0570 - 0x0550)
class ABP_Torch02_C final : public ABP_PF_TorchPlayer_PL_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Torch02_C;                       // 0x0550(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        Amplitude_Location;                                // 0x0558(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Intensity_Min;                                     // 0x0560(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Intensity_Max;                                     // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Torch02(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Torch02_C">();
	}
	static class ABP_Torch02_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Torch02_C>();
	}
};
static_assert(alignof(ABP_Torch02_C) == 0x000010, "Wrong alignment on ABP_Torch02_C");
static_assert(sizeof(ABP_Torch02_C) == 0x000570, "Wrong size on ABP_Torch02_C");
static_assert(offsetof(ABP_Torch02_C, UberGraphFrame_BP_Torch02_C) == 0x000550, "Member 'ABP_Torch02_C::UberGraphFrame_BP_Torch02_C' has a wrong offset!");
static_assert(offsetof(ABP_Torch02_C, Amplitude_Location) == 0x000558, "Member 'ABP_Torch02_C::Amplitude_Location' has a wrong offset!");
static_assert(offsetof(ABP_Torch02_C, Intensity_Min) == 0x000560, "Member 'ABP_Torch02_C::Intensity_Min' has a wrong offset!");
static_assert(offsetof(ABP_Torch02_C, Intensity_Max) == 0x000568, "Member 'ABP_Torch02_C::Intensity_Max' has a wrong offset!");

}

