#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Volumetric_LightFog

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ENiagaraLinearColor_Channels_structs.hpp"


namespace SDK::Params
{

// Function BP_Volumetric_LightFog.BP_Volumetric_LightFog_C.Setup Shared Light Fog Parameters
// 0x0190 (0x0190 - 0x0000)
struct BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENiagaraLinearColor_Channels                  Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_3;                            // 0x0034(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_VectorVector_ReturnValue;      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X_1;                          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue;                    // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_2;                          // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_2;                          // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_2;                          // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue_1;                  // 0x00A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x00B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue_2;                  // 0x00C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_3;                          // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_3;                          // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_3;                          // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue_3;                  // 0x00F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue_4;                  // 0x0100(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_1;                           // 0x0110(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x0120(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeColor_R_ImplicitCast;                 // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeColor_G_ImplicitCast;                 // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeColor_B_ImplicitCast;                 // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_2; // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_3; // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeColor_R_ImplicitCast_1;               // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeColor_G_ImplicitCast_1;               // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeColor_B_ImplicitCast_1;               // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeColor_A_ImplicitCast;                 // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeColor_A_ImplicitCast_1;               // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeColor_R_ImplicitCast_2;               // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeColor_G_ImplicitCast_2;               // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeColor_B_ImplicitCast_2;               // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeColor_A_ImplicitCast_2;               // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_4; // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeColor_R_ImplicitCast_3;               // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeColor_G_ImplicitCast_3;               // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeColor_B_ImplicitCast_3;               // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeColor_A_ImplicitCast_3;               // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeColor_A_ImplicitCast_4;               // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_5; // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters) == 0x000008, "Wrong alignment on BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters");
static_assert(sizeof(BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters) == 0x000190, "Wrong size on BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters");
static_assert(offsetof(BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters, Temp_bool_Variable) == 0x000000, "Member 'BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters, Temp_byte_Variable) == 0x000001, "Member 'BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters, Temp_struct_Variable) == 0x000004, "Member 'BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters, Temp_struct_Variable_1) == 0x000014, "Member 'BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters, Temp_struct_Variable_2) == 0x000024, "Member 'BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters, Temp_struct_Variable_3) == 0x000034, "Member 'BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters, CallFunc_BreakVector_X) == 0x000048, "Member 'BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters, CallFunc_BreakVector_Y) == 0x000050, "Member 'BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters, CallFunc_BreakVector_Z) == 0x000058, "Member 'BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters, CallFunc_EqualEqual_VectorVector_ReturnValue) == 0x000060, "Member 'BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters::CallFunc_EqualEqual_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters, CallFunc_BreakVector_X_1) == 0x000068, "Member 'BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters, CallFunc_BreakVector_Y_1) == 0x000070, "Member 'BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters, CallFunc_BreakVector_Z_1) == 0x000078, "Member 'BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters, CallFunc_MakeColor_ReturnValue) == 0x000080, "Member 'BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters::CallFunc_MakeColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters, CallFunc_BreakVector_X_2) == 0x000090, "Member 'BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters, CallFunc_BreakVector_Y_2) == 0x000098, "Member 'BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters, CallFunc_BreakVector_Z_2) == 0x0000A0, "Member 'BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters, CallFunc_MakeColor_ReturnValue_1) == 0x0000A8, "Member 'BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters::CallFunc_MakeColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters, K2Node_Select_Default) == 0x0000B8, "Member 'BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters, CallFunc_MakeColor_ReturnValue_2) == 0x0000C8, "Member 'BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters::CallFunc_MakeColor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters, CallFunc_BreakVector_X_3) == 0x0000D8, "Member 'BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters::CallFunc_BreakVector_X_3' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters, CallFunc_BreakVector_Y_3) == 0x0000E0, "Member 'BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters::CallFunc_BreakVector_Y_3' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters, CallFunc_BreakVector_Z_3) == 0x0000E8, "Member 'BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters::CallFunc_BreakVector_Z_3' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters, CallFunc_MakeColor_ReturnValue_3) == 0x0000F0, "Member 'BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters::CallFunc_MakeColor_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters, CallFunc_MakeColor_ReturnValue_4) == 0x000100, "Member 'BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters::CallFunc_MakeColor_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters, K2Node_Select_Default_1) == 0x000110, "Member 'BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x000120, "Member 'BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000130, "Member 'BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters, CallFunc_MakeColor_R_ImplicitCast) == 0x000134, "Member 'BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters::CallFunc_MakeColor_R_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters, CallFunc_MakeColor_G_ImplicitCast) == 0x000138, "Member 'BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters::CallFunc_MakeColor_G_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters, CallFunc_MakeColor_B_ImplicitCast) == 0x00013C, "Member 'BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters::CallFunc_MakeColor_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x000140, "Member 'BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters, CallFunc_SetScalarParameterValue_Value_ImplicitCast_2) == 0x000144, "Member 'BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters::CallFunc_SetScalarParameterValue_Value_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters, CallFunc_SetScalarParameterValue_Value_ImplicitCast_3) == 0x000148, "Member 'BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters::CallFunc_SetScalarParameterValue_Value_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters, CallFunc_MakeColor_R_ImplicitCast_1) == 0x00014C, "Member 'BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters::CallFunc_MakeColor_R_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters, CallFunc_MakeColor_G_ImplicitCast_1) == 0x000150, "Member 'BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters::CallFunc_MakeColor_G_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters, CallFunc_MakeColor_B_ImplicitCast_1) == 0x000154, "Member 'BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters::CallFunc_MakeColor_B_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters, CallFunc_MakeColor_A_ImplicitCast) == 0x000158, "Member 'BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters::CallFunc_MakeColor_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters, CallFunc_MakeColor_A_ImplicitCast_1) == 0x00015C, "Member 'BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters::CallFunc_MakeColor_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters, CallFunc_MakeColor_R_ImplicitCast_2) == 0x000160, "Member 'BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters::CallFunc_MakeColor_R_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters, CallFunc_MakeColor_G_ImplicitCast_2) == 0x000164, "Member 'BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters::CallFunc_MakeColor_G_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters, CallFunc_MakeColor_B_ImplicitCast_2) == 0x000168, "Member 'BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters::CallFunc_MakeColor_B_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters, CallFunc_MakeColor_A_ImplicitCast_2) == 0x00016C, "Member 'BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters::CallFunc_MakeColor_A_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters, CallFunc_SetScalarParameterValue_Value_ImplicitCast_4) == 0x000170, "Member 'BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters::CallFunc_SetScalarParameterValue_Value_ImplicitCast_4' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters, CallFunc_MakeColor_R_ImplicitCast_3) == 0x000174, "Member 'BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters::CallFunc_MakeColor_R_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters, CallFunc_MakeColor_G_ImplicitCast_3) == 0x000178, "Member 'BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters::CallFunc_MakeColor_G_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters, CallFunc_MakeColor_B_ImplicitCast_3) == 0x00017C, "Member 'BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters::CallFunc_MakeColor_B_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters, CallFunc_MakeColor_A_ImplicitCast_3) == 0x000180, "Member 'BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters::CallFunc_MakeColor_A_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters, CallFunc_MakeColor_A_ImplicitCast_4) == 0x000184, "Member 'BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters::CallFunc_MakeColor_A_ImplicitCast_4' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters, CallFunc_SetScalarParameterValue_Value_ImplicitCast_5) == 0x000188, "Member 'BP_Volumetric_LightFog_C_Setup_Shared_Light_Fog_Parameters::CallFunc_SetScalarParameterValue_Value_ImplicitCast_5' has a wrong offset!");

}

