#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VDoor_1Rotation

#include "Basic.hpp"

#include "BP_VDoor_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_VDoor_1Rotation.BP_VDoor_1Rotation_C
// 0x0038 (0x0498 - 0x0460)
class ABP_VDoor_1Rotation_C : public ABP_VDoor_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_VDoor_1Rotation_C;               // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FRotator                               Original_Rotation;                                 // 0x0468(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               Target_Rotation;                                   // 0x0480(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_VDoor_1Rotation(int32 EntryPoint);
	void ReceiveBeginPlay();
	void Timeline1End();
	void Update_Timeline(double Two_sec, double Two_sec_0);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_VDoor_1Rotation_C">();
	}
	static class ABP_VDoor_1Rotation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_VDoor_1Rotation_C>();
	}
};
static_assert(alignof(ABP_VDoor_1Rotation_C) == 0x000008, "Wrong alignment on ABP_VDoor_1Rotation_C");
static_assert(sizeof(ABP_VDoor_1Rotation_C) == 0x000498, "Wrong size on ABP_VDoor_1Rotation_C");
static_assert(offsetof(ABP_VDoor_1Rotation_C, UberGraphFrame_BP_VDoor_1Rotation_C) == 0x000460, "Member 'ABP_VDoor_1Rotation_C::UberGraphFrame_BP_VDoor_1Rotation_C' has a wrong offset!");
static_assert(offsetof(ABP_VDoor_1Rotation_C, Original_Rotation) == 0x000468, "Member 'ABP_VDoor_1Rotation_C::Original_Rotation' has a wrong offset!");
static_assert(offsetof(ABP_VDoor_1Rotation_C, Target_Rotation) == 0x000480, "Member 'ABP_VDoor_1Rotation_C::Target_Rotation' has a wrong offset!");

}

