#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Volumetric_GroundFog

#include "Basic.hpp"

#include "ENiagaraLinearColor_Channels_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Volumetric_GroundFog.BP_Volumetric_GroundFog_C.Setup Ground Fog Mask Paarameters
// 0x0048 (0x0048 - 0x0000)
struct BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Mask_Paarameters final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_LinearColorLinearColor_ReturnValue; // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMin_ReturnValue;                         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_1;                           // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Mask_Paarameters) == 0x000008, "Wrong alignment on BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Mask_Paarameters");
static_assert(sizeof(BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Mask_Paarameters) == 0x000048, "Wrong size on BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Mask_Paarameters");
static_assert(offsetof(BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Mask_Paarameters, Temp_bool_Variable) == 0x000000, "Member 'BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Mask_Paarameters::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Mask_Paarameters, Temp_real_Variable) == 0x000004, "Member 'BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Mask_Paarameters::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Mask_Paarameters, Temp_real_Variable_1) == 0x000008, "Member 'BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Mask_Paarameters::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Mask_Paarameters, CallFunc_EqualEqual_LinearColorLinearColor_ReturnValue) == 0x00000C, "Member 'BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Mask_Paarameters::CallFunc_EqualEqual_LinearColorLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Mask_Paarameters, Temp_bool_Variable_1) == 0x00000D, "Member 'BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Mask_Paarameters::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Mask_Paarameters, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000010, "Member 'BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Mask_Paarameters::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Mask_Paarameters, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000018, "Member 'BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Mask_Paarameters::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Mask_Paarameters, K2Node_Select_Default) == 0x000020, "Member 'BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Mask_Paarameters::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Mask_Paarameters, CallFunc_FMin_ReturnValue) == 0x000030, "Member 'BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Mask_Paarameters::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Mask_Paarameters, K2Node_Select_Default_1) == 0x000038, "Member 'BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Mask_Paarameters::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Mask_Paarameters, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x00003C, "Member 'BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Mask_Paarameters::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Mask_Paarameters, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x000040, "Member 'BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Mask_Paarameters::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");

// Function BP_Volumetric_GroundFog.BP_Volumetric_GroundFog_C.Setup Ground Fog Material Parameters
// 0x01A8 (0x01A8 - 0x0000)
struct BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENiagaraLinearColor_Channels                  Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_3;                            // 0x0034(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_2;                          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_2;                          // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_2;                          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_3;                          // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_3;                          // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_3;                          // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue;                    // 0x00A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_VectorVector_ReturnValue;      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue_1;                  // 0x00BC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x00CC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue_2;                  // 0x00DC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X_4;                          // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_4;                          // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_4;                          // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue_3;                  // 0x0108(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue_4;                  // 0x0118(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_1;                           // 0x0128(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x0138(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeColor_R_ImplicitCast;                 // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeColor_G_ImplicitCast;                 // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeColor_B_ImplicitCast;                 // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeColor_R_ImplicitCast_1;               // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeColor_G_ImplicitCast_1;               // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeColor_B_ImplicitCast_1;               // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeColor_R_ImplicitCast_2;               // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeColor_G_ImplicitCast_2;               // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeColor_B_ImplicitCast_2;               // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeColor_R_ImplicitCast_3;               // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeColor_G_ImplicitCast_3;               // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeColor_B_ImplicitCast_3;               // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeColor_A_ImplicitCast;                 // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeColor_A_ImplicitCast_1;               // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeColor_A_ImplicitCast_2;               // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_2; // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeColor_R_ImplicitCast_4;               // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeColor_G_ImplicitCast_4;               // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeColor_B_ImplicitCast_4;               // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeColor_A_ImplicitCast_3;               // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeColor_A_ImplicitCast_4;               // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_3; // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters) == 0x000008, "Wrong alignment on BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters");
static_assert(sizeof(BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters) == 0x0001A8, "Wrong size on BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters");
static_assert(offsetof(BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters, Temp_bool_Variable) == 0x000000, "Member 'BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters, Temp_byte_Variable) == 0x000001, "Member 'BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters, Temp_struct_Variable) == 0x000004, "Member 'BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters, Temp_struct_Variable_1) == 0x000014, "Member 'BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters, Temp_struct_Variable_2) == 0x000024, "Member 'BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters, Temp_struct_Variable_3) == 0x000034, "Member 'BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters, CallFunc_BreakVector_X) == 0x000048, "Member 'BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters, CallFunc_BreakVector_Y) == 0x000050, "Member 'BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters, CallFunc_BreakVector_Z) == 0x000058, "Member 'BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters, CallFunc_BreakVector_X_1) == 0x000060, "Member 'BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters, CallFunc_BreakVector_Y_1) == 0x000068, "Member 'BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters, CallFunc_BreakVector_Z_1) == 0x000070, "Member 'BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters, CallFunc_BreakVector_X_2) == 0x000078, "Member 'BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters, CallFunc_BreakVector_Y_2) == 0x000080, "Member 'BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters, CallFunc_BreakVector_Z_2) == 0x000088, "Member 'BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters, CallFunc_BreakVector_X_3) == 0x000090, "Member 'BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters::CallFunc_BreakVector_X_3' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters, CallFunc_BreakVector_Y_3) == 0x000098, "Member 'BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters::CallFunc_BreakVector_Y_3' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters, CallFunc_BreakVector_Z_3) == 0x0000A0, "Member 'BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters::CallFunc_BreakVector_Z_3' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters, CallFunc_MakeColor_ReturnValue) == 0x0000A8, "Member 'BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters::CallFunc_MakeColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters, CallFunc_EqualEqual_VectorVector_ReturnValue) == 0x0000B8, "Member 'BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters::CallFunc_EqualEqual_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters, CallFunc_MakeColor_ReturnValue_1) == 0x0000BC, "Member 'BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters::CallFunc_MakeColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters, K2Node_Select_Default) == 0x0000CC, "Member 'BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters, CallFunc_MakeColor_ReturnValue_2) == 0x0000DC, "Member 'BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters::CallFunc_MakeColor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters, CallFunc_BreakVector_X_4) == 0x0000F0, "Member 'BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters::CallFunc_BreakVector_X_4' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters, CallFunc_BreakVector_Y_4) == 0x0000F8, "Member 'BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters::CallFunc_BreakVector_Y_4' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters, CallFunc_BreakVector_Z_4) == 0x000100, "Member 'BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters::CallFunc_BreakVector_Z_4' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters, CallFunc_MakeColor_ReturnValue_3) == 0x000108, "Member 'BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters::CallFunc_MakeColor_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters, CallFunc_MakeColor_ReturnValue_4) == 0x000118, "Member 'BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters::CallFunc_MakeColor_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters, K2Node_Select_Default_1) == 0x000128, "Member 'BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x000138, "Member 'BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000148, "Member 'BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x00014C, "Member 'BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters, CallFunc_MakeColor_R_ImplicitCast) == 0x000150, "Member 'BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters::CallFunc_MakeColor_R_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters, CallFunc_MakeColor_G_ImplicitCast) == 0x000154, "Member 'BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters::CallFunc_MakeColor_G_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters, CallFunc_MakeColor_B_ImplicitCast) == 0x000158, "Member 'BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters::CallFunc_MakeColor_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters, CallFunc_MakeColor_R_ImplicitCast_1) == 0x00015C, "Member 'BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters::CallFunc_MakeColor_R_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters, CallFunc_MakeColor_G_ImplicitCast_1) == 0x000160, "Member 'BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters::CallFunc_MakeColor_G_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters, CallFunc_MakeColor_B_ImplicitCast_1) == 0x000164, "Member 'BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters::CallFunc_MakeColor_B_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters, CallFunc_MakeColor_R_ImplicitCast_2) == 0x000168, "Member 'BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters::CallFunc_MakeColor_R_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters, CallFunc_MakeColor_G_ImplicitCast_2) == 0x00016C, "Member 'BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters::CallFunc_MakeColor_G_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters, CallFunc_MakeColor_B_ImplicitCast_2) == 0x000170, "Member 'BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters::CallFunc_MakeColor_B_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters, CallFunc_MakeColor_R_ImplicitCast_3) == 0x000174, "Member 'BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters::CallFunc_MakeColor_R_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters, CallFunc_MakeColor_G_ImplicitCast_3) == 0x000178, "Member 'BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters::CallFunc_MakeColor_G_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters, CallFunc_MakeColor_B_ImplicitCast_3) == 0x00017C, "Member 'BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters::CallFunc_MakeColor_B_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters, CallFunc_MakeColor_A_ImplicitCast) == 0x000180, "Member 'BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters::CallFunc_MakeColor_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters, CallFunc_MakeColor_A_ImplicitCast_1) == 0x000184, "Member 'BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters::CallFunc_MakeColor_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters, CallFunc_MakeColor_A_ImplicitCast_2) == 0x000188, "Member 'BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters::CallFunc_MakeColor_A_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters, CallFunc_SetScalarParameterValue_Value_ImplicitCast_2) == 0x00018C, "Member 'BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters::CallFunc_SetScalarParameterValue_Value_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters, CallFunc_MakeColor_R_ImplicitCast_4) == 0x000190, "Member 'BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters::CallFunc_MakeColor_R_ImplicitCast_4' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters, CallFunc_MakeColor_G_ImplicitCast_4) == 0x000194, "Member 'BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters::CallFunc_MakeColor_G_ImplicitCast_4' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters, CallFunc_MakeColor_B_ImplicitCast_4) == 0x000198, "Member 'BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters::CallFunc_MakeColor_B_ImplicitCast_4' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters, CallFunc_MakeColor_A_ImplicitCast_3) == 0x00019C, "Member 'BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters::CallFunc_MakeColor_A_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters, CallFunc_MakeColor_A_ImplicitCast_4) == 0x0001A0, "Member 'BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters::CallFunc_MakeColor_A_ImplicitCast_4' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters, CallFunc_SetScalarParameterValue_Value_ImplicitCast_3) == 0x0001A4, "Member 'BP_Volumetric_GroundFog_C_Setup_Ground_Fog_Material_Parameters::CallFunc_SetScalarParameterValue_Value_ImplicitCast_3' has a wrong offset!");

// Function BP_Volumetric_GroundFog.BP_Volumetric_GroundFog_C.UserConstructionScript
// 0x0060 (0x0060 - 0x0000)
struct BP_Volumetric_GroundFog_C_UserConstructionScript final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable_2;                            // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_3;                            // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable_4;                            // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_Select_Default;                             // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_Select_Default_1;                           // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_Select_Default_2;                           // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_Select_Default_3;                           // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Volumetric_GroundFog_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_Volumetric_GroundFog_C_UserConstructionScript");
static_assert(sizeof(BP_Volumetric_GroundFog_C_UserConstructionScript) == 0x000060, "Wrong size on BP_Volumetric_GroundFog_C_UserConstructionScript");
static_assert(offsetof(BP_Volumetric_GroundFog_C_UserConstructionScript, Temp_bool_Variable) == 0x000000, "Member 'BP_Volumetric_GroundFog_C_UserConstructionScript::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_Volumetric_GroundFog_C_UserConstructionScript, Temp_object_Variable) == 0x000008, "Member 'BP_Volumetric_GroundFog_C_UserConstructionScript::Temp_object_Variable' has a wrong offset!");
