#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VDoor_2Rotation

#include "Basic.hpp"

#include "BP_VDoor_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_VDoor_2Rotation.BP_VDoor_2Rotation_C
// 0x0078 (0x04D8 - 0x0460)
class ABP_VDoor_2Rotation_C : public ABP_VDoor_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_VDoor_2Rotation_C;               // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SM_Door2;                                          // 0x0468(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Original_Rotation_1;                               // 0x0470(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               Original_Rotation_2;                               // 0x0488(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               Target_Rotation_1;                                 // 0x04A0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               Target_Rotation_2;                                 // 0x04B8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   Socket_Name_Door_2;                                // 0x04D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_VDoor_2Rotation(int32 EntryPoint);
	void ReceiveBeginPlay();
	void Update_Timeline(double Two_sec, double Two_sec_0);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_VDoor_2Rotation_C">();
	}
	static class ABP_VDoor_2Rotation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_VDoor_2Rotation_C>();
	}
};
static_assert(alignof(ABP_VDoor_2Rotation_C) == 0x000008, "Wrong alignment on ABP_VDoor_2Rotation_C");
static_assert(sizeof(ABP_VDoor_2Rotation_C) == 0x0004D8, "Wrong size on ABP_VDoor_2Rotation_C");
static_assert(offsetof(ABP_VDoor_2Rotation_C, UberGraphFrame_BP_VDoor_2Rotation_C) == 0x000460, "Member 'ABP_VDoor_2Rotation_C::UberGraphFrame_BP_VDoor_2Rotation_C' has a wrong offset!");
static_assert(offsetof(ABP_VDoor_2Rotation_C, SM_Door2) == 0x000468, "Member 'ABP_VDoor_2Rotation_C::SM_Door2' has a wrong offset!");
static_assert(offsetof(ABP_VDoor_2Rotation_C, Original_Rotation_1) == 0x000470, "Member 'ABP_VDoor_2Rotation_C::Original_Rotation_1' has a wrong offset!");
static_assert(offsetof(ABP_VDoor_2Rotation_C, Original_Rotation_2) == 0x000488, "Member 'ABP_VDoor_2Rotation_C::Original_Rotation_2' has a wrong offset!");
static_assert(offsetof(ABP_VDoor_2Rotation_C, Target_Rotation_1) == 0x0004A0, "Member 'ABP_VDoor_2Rotation_C::Target_Rotation_1' has a wrong offset!");
static_assert(offsetof(ABP_VDoor_2Rotation_C, Target_Rotation_2) == 0x0004B8, "Member 'ABP_VDoor_2Rotation_C::Target_Rotation_2' has a wrong offset!");
static_assert(offsetof(ABP_VDoor_2Rotation_C, Socket_Name_Door_2) == 0x0004D0, "Member 'ABP_VDoor_2Rotation_C::Socket_Name_Door_2' has a wrong offset!");

}

