#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VChest_1RotationInclude1Rotation

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_VChest_1RotationInclude1Rotation.BP_VChest_1RotationInclude1Rotation_C.ExecuteUbergraph_BP_VChest_1RotationInclude1Rotation
// 0x01F0 (0x01F0 - 0x0000)
struct BP_VChest_1RotationInclude1Rotation_C_ExecuteUbergraph_BP_VChest_1RotationInclude1Rotation final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Event_HalfSecBefore;                        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Event_HalfSecAfter;                         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Event_3rd;                                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0020(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_1;  // 0x0108(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_VChest_1RotationInclude1Rotation_C_ExecuteUbergraph_BP_VChest_1RotationInclude1Rotation) == 0x000008, "Wrong alignment on BP_VChest_1RotationInclude1Rotation_C_ExecuteUbergraph_BP_VChest_1RotationInclude1Rotation");
static_assert(sizeof(BP_VChest_1RotationInclude1Rotation_C_ExecuteUbergraph_BP_VChest_1RotationInclude1Rotation) == 0x0001F0, "Wrong size on BP_VChest_1RotationInclude1Rotation_C_ExecuteUbergraph_BP_VChest_1RotationInclude1Rotation");
static_assert(offsetof(BP_VChest_1RotationInclude1Rotation_C_ExecuteUbergraph_BP_VChest_1RotationInclude1Rotation, EntryPoint) == 0x000000, "Member 'BP_VChest_1RotationInclude1Rotation_C_ExecuteUbergraph_BP_VChest_1RotationInclude1Rotation::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_VChest_1RotationInclude1Rotation_C_ExecuteUbergraph_BP_VChest_1RotationInclude1Rotation, K2Node_Event_HalfSecBefore) == 0x000008, "Member 'BP_VChest_1RotationInclude1Rotation_C_ExecuteUbergraph_BP_VChest_1RotationInclude1Rotation::K2Node_Event_HalfSecBefore' has a wrong offset!");
static_assert(offsetof(BP_VChest_1RotationInclude1Rotation_C_ExecuteUbergraph_BP_VChest_1RotationInclude1Rotation, K2Node_Event_HalfSecAfter) == 0x000010, "Member 'BP_VChest_1RotationInclude1Rotation_C_ExecuteUbergraph_BP_VChest_1RotationInclude1Rotation::K2Node_Event_HalfSecAfter' has a wrong offset!");
static_assert(offsetof(BP_VChest_1RotationInclude1Rotation_C_ExecuteUbergraph_BP_VChest_1RotationInclude1Rotation, K2Node_Event_3rd) == 0x000018, "Member 'BP_VChest_1RotationInclude1Rotation_C_ExecuteUbergraph_BP_VChest_1RotationInclude1Rotation::K2Node_Event_3rd' has a wrong offset!");
static_assert(offsetof(BP_VChest_1RotationInclude1Rotation_C_ExecuteUbergraph_BP_VChest_1RotationInclude1Rotation, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000020, "Member 'BP_VChest_1RotationInclude1Rotation_C_ExecuteUbergraph_BP_VChest_1RotationInclude1Rotation::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_VChest_1RotationInclude1Rotation_C_ExecuteUbergraph_BP_VChest_1RotationInclude1Rotation, CallFunc_K2_SetRelativeRotation_SweepHitResult_1) == 0x000108, "Member 'BP_VChest_1RotationInclude1Rotation_C_ExecuteUbergraph_BP_VChest_1RotationInclude1Rotation::CallFunc_K2_SetRelativeRotation_SweepHitResult_1' has a wrong offset!");

// Function BP_VChest_1RotationInclude1Rotation.BP_VChest_1RotationInclude1Rotation_C.Update Timeline
// 0x0018 (0x0018 - 0x0000)
struct BP_VChest_1RotationInclude1Rotation_C_Update_Timeline final
{
public:
	double                                        HalfSecBefore;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        HalfSecAfter;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Threerd;                                           // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VChest_1RotationInclude1Rotation_C_Update_Timeline) == 0x000008, "Wrong alignment on BP_VChest_1RotationInclude1Rotation_C_Update_Timeline");
static_assert(sizeof(BP_VChest_1RotationInclude1Rotation_C_Update_Timeline) == 0x000018, "Wrong size on BP_VChest_1RotationInclude1Rotation_C_Update_Timeline");
static_assert(offsetof(BP_VChest_1RotationInclude1Rotation_C_Update_Timeline, HalfSecBefore) == 0x000000, "Member 'BP_VChest_1RotationInclude1Rotation_C_Update_Timeline::HalfSecBefore' has a wrong offset!");
static_assert(offsetof(BP_VChest_1RotationInclude1Rotation_C_Update_Timeline, HalfSecAfter) == 0x000008, "Member 'BP_VChest_1RotationInclude1Rotation_C_Update_Timeline::HalfSecAfter' has a wrong offset!");
static_assert(offsetof(BP_VChest_1RotationInclude1Rotation_C_Update_Timeline, Threerd) == 0x000010, "Member 'BP_VChest_1RotationInclude1Rotation_C_Update_Timeline::Threerd' has a wrong offset!");

}

