#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VDoor_1Translation

#include "Basic.hpp"

#include "BP_VDoor_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_VDoor_1Translation.BP_VDoor_1Translation_C
// 0x0040 (0x04A0 - 0x0460)
class ABP_VDoor_1Translation_C : public ABP_VDoor_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_VDoor_1Translation_C;            // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FVector                                Original_Location_1;                               // 0x0468(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Target_Location_1;                                 // 0x0480(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Socket_Name_Door_2;                                // 0x0498(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_VDoor_1Translation(int32 EntryPoint);
	void ReceiveBeginPlay();
	void Update_Timeline(double Two_sec, double Two_sec_0);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_VDoor_1Translation_C">();
	}
	static class ABP_VDoor_1Translation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_VDoor_1Translation_C>();
	}
};
static_assert(alignof(ABP_VDoor_1Translation_C) == 0x000008, "Wrong alignment on ABP_VDoor_1Translation_C");
static_assert(sizeof(ABP_VDoor_1Translation_C) == 0x0004A0, "Wrong size on ABP_VDoor_1Translation_C");
static_assert(offsetof(ABP_VDoor_1Translation_C, UberGraphFrame_BP_VDoor_1Translation_C) == 0x000460, "Member 'ABP_VDoor_1Translation_C::UberGraphFrame_BP_VDoor_1Translation_C' has a wrong offset!");
static_assert(offsetof(ABP_VDoor_1Translation_C, Original_Location_1) == 0x000468, "Member 'ABP_VDoor_1Translation_C::Original_Location_1' has a wrong offset!");
static_assert(offsetof(ABP_VDoor_1Translation_C, Target_Location_1) == 0x000480, "Member 'ABP_VDoor_1Translation_C::Target_Location_1' has a wrong offset!");
static_assert(offsetof(ABP_VDoor_1Translation_C, Socket_Name_Door_2) == 0x000498, "Member 'ABP_VDoor_1Translation_C::Socket_Name_Door_2' has a wrong offset!");

}

