#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Weap_GenericShield

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Weap_GenericShield.BP_Weap_GenericShield_C.ExecuteUbergraph_BP_Weap_GenericShield
// 0x0038 (0x0038 - 0x0000)
struct BP_Weap_GenericShield_C_ExecuteUbergraph_BP_Weap_GenericShield final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 K2Node_Event_TargetSkeletalMeshComponent;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsDrawn;                             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AVOblivionPlayerCharacter*              K2Node_DynamicCast_AsVOblivion_Player_Character;   // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Weap_GenericShield_C_ExecuteUbergraph_BP_Weap_GenericShield) == 0x000008, "Wrong alignment on BP_Weap_GenericShield_C_ExecuteUbergraph_BP_Weap_GenericShield");
static_assert(sizeof(BP_Weap_GenericShield_C_ExecuteUbergraph_BP_Weap_GenericShield) == 0x000038, "Wrong size on BP_Weap_GenericShield_C_ExecuteUbergraph_BP_Weap_GenericShield");
static_assert(offsetof(BP_Weap_GenericShield_C_ExecuteUbergraph_BP_Weap_GenericShield, EntryPoint) == 0x000000, "Member 'BP_Weap_GenericShield_C_ExecuteUbergraph_BP_Weap_GenericShield::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Weap_GenericShield_C_ExecuteUbergraph_BP_Weap_GenericShield, K2Node_Event_TargetSkeletalMeshComponent) == 0x000008, "Member 'BP_Weap_GenericShield_C_ExecuteUbergraph_BP_Weap_GenericShield::K2Node_Event_TargetSkeletalMeshComponent' has a wrong offset!");
static_assert(offsetof(BP_Weap_GenericShield_C_ExecuteUbergraph_BP_Weap_GenericShield, K2Node_Event_bIsDrawn) == 0x000010, "Member 'BP_Weap_GenericShield_C_ExecuteUbergraph_BP_Weap_GenericShield::K2Node_Event_bIsDrawn' has a wrong offset!");
static_assert(offsetof(BP_Weap_GenericShield_C_ExecuteUbergraph_BP_Weap_GenericShield, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'BP_Weap_GenericShield_C_ExecuteUbergraph_BP_Weap_GenericShield::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Weap_GenericShield_C_ExecuteUbergraph_BP_Weap_GenericShield, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_Weap_GenericShield_C_ExecuteUbergraph_BP_Weap_GenericShield::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Weap_GenericShield_C_ExecuteUbergraph_BP_Weap_GenericShield, K2Node_DynamicCast_AsVOblivion_Player_Character) == 0x000028, "Member 'BP_Weap_GenericShield_C_ExecuteUbergraph_BP_Weap_GenericShield::K2Node_DynamicCast_AsVOblivion_Player_Character' has a wrong offset!");
static_assert(offsetof(BP_Weap_GenericShield_C_ExecuteUbergraph_BP_Weap_GenericShield, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_Weap_GenericShield_C_ExecuteUbergraph_BP_Weap_GenericShield::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Weap_GenericShield_C_ExecuteUbergraph_BP_Weap_GenericShield, CallFunc_Not_PreBool_ReturnValue) == 0x000031, "Member 'BP_Weap_GenericShield_C_ExecuteUbergraph_BP_Weap_GenericShield::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BP_Weap_GenericShield.BP_Weap_GenericShield_C.OnAttachmentUpdate
// 0x0010 (0x0010 - 0x0000)
struct BP_Weap_GenericShield_C_OnAttachmentUpdate final
{
public:
	class USkeletalMeshComponent*                 TargetSkeletalMeshComponent;                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsDrawn;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Weap_GenericShield_C_OnAttachmentUpdate) == 0x000008, "Wrong alignment on BP_Weap_GenericShield_C_OnAttachmentUpdate");
static_assert(sizeof(BP_Weap_GenericShield_C_OnAttachmentUpdate) == 0x000010, "Wrong size on BP_Weap_GenericShield_C_OnAttachmentUpdate");
static_assert(offsetof(BP_Weap_GenericShield_C_OnAttachmentUpdate, TargetSkeletalMeshComponent) == 0x000000, "Member 'BP_Weap_GenericShield_C_OnAttachmentUpdate::TargetSkeletalMeshComponent' has a wrong offset!");
static_assert(offsetof(BP_Weap_GenericShield_C_OnAttachmentUpdate, bIsDrawn) == 0x000008, "Member 'BP_Weap_GenericShield_C_OnAttachmentUpdate::bIsDrawn' has a wrong offset!");

}

