#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Weap_GenericBlade_Scabbard

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Altar_classes.hpp"


namespace SDK
{

// VModdableBlueprintGeneratedClass BP_Weap_GenericBlade_Scabbard.BP_Weap_GenericBlade_Scabbard_C
// 0x0018 (0x03C0 - 0x03A8)
class ABP_Weap_GenericBlade_Scabbard_C : public AVWeapon_BladeWithScabbard
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBPC_WeapBloodSplatter_C*               BPC_WeapBloodSplatter;                             // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UVHitBoxComponent*                      VHitBox;                                           // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Weap_GenericBlade_Scabbard(int32 EntryPoint);
	void OnAttachmentUpdate(class USkeletalMeshComponent* TargetSkeletalMeshComponent, bool bIsDrawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Weap_GenericBlade_Scabbard_C">();
	}
	static class ABP_Weap_GenericBlade_Scabbard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Weap_GenericBlade_Scabbard_C>();
	}
};
static_assert(alignof(ABP_Weap_GenericBlade_Scabbard_C) == 0x000008, "Wrong alignment on ABP_Weap_GenericBlade_Scabbard_C");
static_assert(sizeof(ABP_Weap_GenericBlade_Scabbard_C) == 0x0003C0, "Wrong size on ABP_Weap_GenericBlade_Scabbard_C");
static_assert(offsetof(ABP_Weap_GenericBlade_Scabbard_C, UberGraphFrame) == 0x0003A8, "Member 'ABP_Weap_GenericBlade_Scabbard_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Weap_GenericBlade_Scabbard_C, BPC_WeapBloodSplatter) == 0x0003B0, "Member 'ABP_Weap_GenericBlade_Scabbard_C::BPC_WeapBloodSplatter' has a wrong offset!");
static_assert(offsetof(ABP_Weap_GenericBlade_Scabbard_C, VHitBox) == 0x0003B8, "Member 'ABP_Weap_GenericBlade_Scabbard_C::VHitBox' has a wrong offset!");

}

