#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WeatherInterior

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_WeatherInterior.BP_WeatherInterior_C.ExecuteUbergraph_BP_WeatherInterior
// 0x0018 (0x0018 - 0x0000)
struct BP_WeatherInterior_C_ExecuteUbergraph_BP_WeatherInterior final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_WeatherControl_C*                   CallFunc_GetActorOfClass_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WeatherInterior_C_ExecuteUbergraph_BP_WeatherInterior) == 0x000008, "Wrong alignment on BP_WeatherInterior_C_ExecuteUbergraph_BP_WeatherInterior");
static_assert(sizeof(BP_WeatherInterior_C_ExecuteUbergraph_BP_WeatherInterior) == 0x000018, "Wrong size on BP_WeatherInterior_C_ExecuteUbergraph_BP_WeatherInterior");
static_assert(offsetof(BP_WeatherInterior_C_ExecuteUbergraph_BP_WeatherInterior, EntryPoint) == 0x000000, "Member 'BP_WeatherInterior_C_ExecuteUbergraph_BP_WeatherInterior::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_WeatherInterior_C_ExecuteUbergraph_BP_WeatherInterior, CallFunc_GetActorOfClass_ReturnValue) == 0x000008, "Member 'BP_WeatherInterior_C_ExecuteUbergraph_BP_WeatherInterior::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WeatherInterior_C_ExecuteUbergraph_BP_WeatherInterior, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_WeatherInterior_C_ExecuteUbergraph_BP_WeatherInterior::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

