#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_SummonFade

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BPC_SummonFade.BPC_SummonFade_C.CollectActorComponents
// 0x0048 (0x0048 - 0x0000)
struct BPC_SummonFade_C_CollectActorComponents final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMeshComponent*>           Static_Components;                                 // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class USkinnedMeshComponent*>          Skinned_Components;                                // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UStaticMeshComponent*>           CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0028(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class USkinnedMeshComponent*>          CallFunc_K2_GetComponentsByClass_ReturnValue_1;    // 0x0038(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(BPC_SummonFade_C_CollectActorComponents) == 0x000008, "Wrong alignment on BPC_SummonFade_C_CollectActorComponents");
static_assert(sizeof(BPC_SummonFade_C_CollectActorComponents) == 0x000048, "Wrong size on BPC_SummonFade_C_CollectActorComponents");
static_assert(offsetof(BPC_SummonFade_C_CollectActorComponents, Actor) == 0x000000, "Member 'BPC_SummonFade_C_CollectActorComponents::Actor' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_CollectActorComponents, Static_Components) == 0x000008, "Member 'BPC_SummonFade_C_CollectActorComponents::Static_Components' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_CollectActorComponents, Skinned_Components) == 0x000018, "Member 'BPC_SummonFade_C_CollectActorComponents::Skinned_Components' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_CollectActorComponents, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000028, "Member 'BPC_SummonFade_C_CollectActorComponents::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_CollectActorComponents, CallFunc_K2_GetComponentsByClass_ReturnValue_1) == 0x000038, "Member 'BPC_SummonFade_C_CollectActorComponents::CallFunc_K2_GetComponentsByClass_ReturnValue_1' has a wrong offset!");

// Function BPC_SummonFade.BPC_SummonFade_C.Create Fade Materials
// 0x02A8 (0x02A8 - 0x0000)
struct BPC_SummonFade_C_Create_Fade_Materials final
{
public:
	TArray<class FString>                         SM_MaterialArray_Fade_Names;                       // 0x0000(0x0010)(Edit, BlueprintVisible)
	TArray<class FString>                         SK_MaterialArray_Fade_Names;                       // 0x0010(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_5;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_5;                  // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_Array_Get_Item;                           // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_Array_Get_Item_1;                         // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_Array_Get_Item_2;                         // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_2; // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_Array_Get_Item_3;                         // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item_4;                         // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_ObjectToString_ReturnValue;          // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_3;                  // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInterface*>             CallFunc_GetMaterials_ReturnValue;                 // 0x00D0(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_Array_Get_Item_5;                         // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               K2Node_DynamicCast_AsMaterial_Instance_Dynamic;    // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_Array_Get_Item_6;                         // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_3; // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_4;                  // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue_1;             // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x3];                                      // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x3];                                      // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue_1;                 // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_Array_Get_Item_7;                         // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_ObjectToString_ReturnValue_1;        // 0x0190(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_5;                  // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_5;                // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_Array_Get_Item_8;                         // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_4; // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_Array_Get_Item_9;                         // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_6;                  // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CC[0x4];                                      // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_5; // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_7;                  // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DC[0x4];                                      // 0x01DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkinnedMeshComponent*                  CallFunc_Array_Get_Item_10;                        // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInterface*>             CallFunc_GetMaterials_ReturnValue_1;               // 0x01F0(0x0010)(ReferenceParm)
	class UMaterialInterface*                     CallFunc_Array_Get_Item_11;                        // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20C[0x4];                                      // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue_2;             // 0x0210(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_6;                // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_221[0x7];                                      // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0228(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue_2;                 // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23C[0x4];                                      // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               K2Node_DynamicCast_AsMaterial_Instance_Dynamic_1;  // 0x0240(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_7;                // 0x0249(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24A[0x6];                                      // 0x024A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_Array_Get_Item_12;                        // 0x0250(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue_3;             // 0x0258(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_6; // 0x0268(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0270(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_8;                  // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue_3;                 // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_8;                // 0x028C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_9;                // 0x028D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28E[0x2];                                      // 0x028E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_Array_Get_Item_13;                        // 0x0290(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_7; // 0x0298(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_9;                  // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_SummonFade_C_Create_Fade_Materials) == 0x000008, "Wrong alignment on BPC_SummonFade_C_Create_Fade_Materials");
static_assert(sizeof(BPC_SummonFade_C_Create_Fade_Materials) == 0x0002A8, "Wrong size on BPC_SummonFade_C_Create_Fade_Materials");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, SM_MaterialArray_Fade_Names) == 0x000000, "Member 'BPC_SummonFade_C_Create_Fade_Materials::SM_MaterialArray_Fade_Names' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, SK_MaterialArray_Fade_Names) == 0x000010, "Member 'BPC_SummonFade_C_Create_Fade_Materials::SK_MaterialArray_Fade_Names' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, Temp_int_Array_Index_Variable) == 0x000020, "Member 'BPC_SummonFade_C_Create_Fade_Materials::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, Temp_int_Array_Index_Variable_1) == 0x000024, "Member 'BPC_SummonFade_C_Create_Fade_Materials::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'BPC_SummonFade_C_Create_Fade_Materials::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'BPC_SummonFade_C_Create_Fade_Materials::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, Temp_int_Array_Index_Variable_2) == 0x000030, "Member 'BPC_SummonFade_C_Create_Fade_Materials::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, Temp_int_Loop_Counter_Variable_1) == 0x000034, "Member 'BPC_SummonFade_C_Create_Fade_Materials::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, CallFunc_Add_IntInt_ReturnValue_1) == 0x000038, "Member 'BPC_SummonFade_C_Create_Fade_Materials::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, Temp_int_Loop_Counter_Variable_2) == 0x00003C, "Member 'BPC_SummonFade_C_Create_Fade_Materials::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, Temp_int_Loop_Counter_Variable_3) == 0x000040, "Member 'BPC_SummonFade_C_Create_Fade_Materials::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, CallFunc_Add_IntInt_ReturnValue_2) == 0x000044, "Member 'BPC_SummonFade_C_Create_Fade_Materials::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, CallFunc_Add_IntInt_ReturnValue_3) == 0x000048, "Member 'BPC_SummonFade_C_Create_Fade_Materials::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, Temp_int_Array_Index_Variable_3) == 0x00004C, "Member 'BPC_SummonFade_C_Create_Fade_Materials::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, Temp_int_Array_Index_Variable_4) == 0x000050, "Member 'BPC_SummonFade_C_Create_Fade_Materials::Temp_int_Array_Index_Variable_4' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, Temp_int_Loop_Counter_Variable_4) == 0x000054, "Member 'BPC_SummonFade_C_Create_Fade_Materials::Temp_int_Loop_Counter_Variable_4' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, CallFunc_Add_IntInt_ReturnValue_4) == 0x000058, "Member 'BPC_SummonFade_C_Create_Fade_Materials::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, Temp_int_Array_Index_Variable_5) == 0x00005C, "Member 'BPC_SummonFade_C_Create_Fade_Materials::Temp_int_Array_Index_Variable_5' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, Temp_int_Loop_Counter_Variable_5) == 0x000060, "Member 'BPC_SummonFade_C_Create_Fade_Materials::Temp_int_Loop_Counter_Variable_5' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, CallFunc_Add_IntInt_ReturnValue_5) == 0x000064, "Member 'BPC_SummonFade_C_Create_Fade_Materials::CallFunc_Add_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, CallFunc_Array_Get_Item) == 0x000068, "Member 'BPC_SummonFade_C_Create_Fade_Materials::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, CallFunc_Array_Get_Item_1) == 0x000070, "Member 'BPC_SummonFade_C_Create_Fade_Materials::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000078, "Member 'BPC_SummonFade_C_Create_Fade_Materials::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000080, "Member 'BPC_SummonFade_C_Create_Fade_Materials::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, CallFunc_Array_Add_ReturnValue) == 0x000088, "Member 'BPC_SummonFade_C_Create_Fade_Materials::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, CallFunc_Array_Get_Item_2) == 0x000090, "Member 'BPC_SummonFade_C_Create_Fade_Materials::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, CallFunc_CreateDynamicMaterialInstance_ReturnValue_2) == 0x000098, "Member 'BPC_SummonFade_C_Create_Fade_Materials::CallFunc_CreateDynamicMaterialInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, CallFunc_Array_Add_ReturnValue_1) == 0x0000A0, "Member 'BPC_SummonFade_C_Create_Fade_Materials::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, CallFunc_Array_Add_ReturnValue_2) == 0x0000A4, "Member 'BPC_SummonFade_C_Create_Fade_Materials::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, CallFunc_Array_Get_Item_3) == 0x0000A8, "Member 'BPC_SummonFade_C_Create_Fade_Materials::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, CallFunc_Array_Get_Item_4) == 0x0000B0, "Member 'BPC_SummonFade_C_Create_Fade_Materials::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, CallFunc_Conv_ObjectToString_ReturnValue) == 0x0000B8, "Member 'BPC_SummonFade_C_Create_Fade_Materials::CallFunc_Conv_ObjectToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, CallFunc_IsValid_ReturnValue) == 0x0000C8, "Member 'BPC_SummonFade_C_Create_Fade_Materials::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, CallFunc_Array_Add_ReturnValue_3) == 0x0000CC, "Member 'BPC_SummonFade_C_Create_Fade_Materials::CallFunc_Array_Add_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, CallFunc_GetMaterials_ReturnValue) == 0x0000D0, "Member 'BPC_SummonFade_C_Create_Fade_Materials::CallFunc_GetMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, CallFunc_Array_Length_ReturnValue) == 0x0000E0, "Member 'BPC_SummonFade_C_Create_Fade_Materials::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, CallFunc_Array_Get_Item_5) == 0x0000E8, "Member 'BPC_SummonFade_C_Create_Fade_Materials::CallFunc_Array_Get_Item_5' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, CallFunc_Less_IntInt_ReturnValue) == 0x0000F0, "Member 'BPC_SummonFade_C_Create_Fade_Materials::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, CallFunc_GetDisplayName_ReturnValue) == 0x0000F8, "Member 'BPC_SummonFade_C_Create_Fade_Materials::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, CallFunc_Concat_StrStr_ReturnValue) == 0x000108, "Member 'BPC_SummonFade_C_Create_Fade_Materials::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, K2Node_DynamicCast_AsMaterial_Instance_Dynamic) == 0x000118, "Member 'BPC_SummonFade_C_Create_Fade_Materials::K2Node_DynamicCast_AsMaterial_Instance_Dynamic' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, K2Node_DynamicCast_bSuccess) == 0x000120, "Member 'BPC_SummonFade_C_Create_Fade_Materials::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, CallFunc_Array_Find_ReturnValue) == 0x000124, "Member 'BPC_SummonFade_C_Create_Fade_Materials::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, CallFunc_Less_IntInt_ReturnValue_1) == 0x000128, "Member 'BPC_SummonFade_C_Create_Fade_Materials::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, CallFunc_Array_Get_Item_6) == 0x000130, "Member 'BPC_SummonFade_C_Create_Fade_Materials::CallFunc_Array_Get_Item_6' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, CallFunc_CreateDynamicMaterialInstance_ReturnValue_3) == 0x000138, "Member 'BPC_SummonFade_C_Create_Fade_Materials::CallFunc_CreateDynamicMaterialInstance_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, CallFunc_Array_Add_ReturnValue_4) == 0x000140, "Member 'BPC_SummonFade_C_Create_Fade_Materials::CallFunc_Array_Add_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, CallFunc_GetDisplayName_ReturnValue_1) == 0x000148, "Member 'BPC_SummonFade_C_Create_Fade_Materials::CallFunc_GetDisplayName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, CallFunc_Array_Length_ReturnValue_1) == 0x000158, "Member 'BPC_SummonFade_C_Create_Fade_Materials::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000160, "Member 'BPC_SummonFade_C_Create_Fade_Materials::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, CallFunc_Less_IntInt_ReturnValue_2) == 0x000170, "Member 'BPC_SummonFade_C_Create_Fade_Materials::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, CallFunc_Array_Length_ReturnValue_2) == 0x000174, "Member 'BPC_SummonFade_C_Create_Fade_Materials::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, CallFunc_Less_IntInt_ReturnValue_3) == 0x000178, "Member 'BPC_SummonFade_C_Create_Fade_Materials::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, CallFunc_Array_Find_ReturnValue_1) == 0x00017C, "Member 'BPC_SummonFade_C_Create_Fade_Materials::CallFunc_Array_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, CallFunc_Less_IntInt_ReturnValue_4) == 0x000180, "Member 'BPC_SummonFade_C_Create_Fade_Materials::CallFunc_Less_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, CallFunc_Array_Get_Item_7) == 0x000188, "Member 'BPC_SummonFade_C_Create_Fade_Materials::CallFunc_Array_Get_Item_7' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, CallFunc_Conv_ObjectToString_ReturnValue_1) == 0x000190, "Member 'BPC_SummonFade_C_Create_Fade_Materials::CallFunc_Conv_ObjectToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, CallFunc_Array_Length_ReturnValue_3) == 0x0001A0, "Member 'BPC_SummonFade_C_Create_Fade_Materials::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, CallFunc_Array_Add_ReturnValue_5) == 0x0001A4, "Member 'BPC_SummonFade_C_Create_Fade_Materials::CallFunc_Array_Add_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, CallFunc_Less_IntInt_ReturnValue_5) == 0x0001A8, "Member 'BPC_SummonFade_C_Create_Fade_Materials::CallFunc_Less_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, CallFunc_Array_Get_Item_8) == 0x0001B0, "Member 'BPC_SummonFade_C_Create_Fade_Materials::CallFunc_Array_Get_Item_8' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, CallFunc_CreateDynamicMaterialInstance_ReturnValue_4) == 0x0001B8, "Member 'BPC_SummonFade_C_Create_Fade_Materials::CallFunc_CreateDynamicMaterialInstance_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, CallFunc_Array_Get_Item_9) == 0x0001C0, "Member 'BPC_SummonFade_C_Create_Fade_Materials::CallFunc_Array_Get_Item_9' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, CallFunc_Array_Add_ReturnValue_6) == 0x0001C8, "Member 'BPC_SummonFade_C_Create_Fade_Materials::CallFunc_Array_Add_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, CallFunc_CreateDynamicMaterialInstance_ReturnValue_5) == 0x0001D0, "Member 'BPC_SummonFade_C_Create_Fade_Materials::CallFunc_CreateDynamicMaterialInstance_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, CallFunc_Array_Add_ReturnValue_7) == 0x0001D8, "Member 'BPC_SummonFade_C_Create_Fade_Materials::CallFunc_Array_Add_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, CallFunc_Array_Get_Item_10) == 0x0001E0, "Member 'BPC_SummonFade_C_Create_Fade_Materials::CallFunc_Array_Get_Item_10' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, CallFunc_IsValid_ReturnValue_1) == 0x0001E8, "Member 'BPC_SummonFade_C_Create_Fade_Materials::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, CallFunc_GetMaterials_ReturnValue_1) == 0x0001F0, "Member 'BPC_SummonFade_C_Create_Fade_Materials::CallFunc_GetMaterials_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, CallFunc_Array_Get_Item_11) == 0x000200, "Member 'BPC_SummonFade_C_Create_Fade_Materials::CallFunc_Array_Get_Item_11' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, CallFunc_Array_Length_ReturnValue_4) == 0x000208, "Member 'BPC_SummonFade_C_Create_Fade_Materials::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, CallFunc_GetDisplayName_ReturnValue_2) == 0x000210, "Member 'BPC_SummonFade_C_Create_Fade_Materials::CallFunc_GetDisplayName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, CallFunc_Less_IntInt_ReturnValue_6) == 0x000220, "Member 'BPC_SummonFade_C_Create_Fade_Materials::CallFunc_Less_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000228, "Member 'BPC_SummonFade_C_Create_Fade_Materials::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, CallFunc_Array_Find_ReturnValue_2) == 0x000238, "Member 'BPC_SummonFade_C_Create_Fade_Materials::CallFunc_Array_Find_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, K2Node_DynamicCast_AsMaterial_Instance_Dynamic_1) == 0x000240, "Member 'BPC_SummonFade_C_Create_Fade_Materials::K2Node_DynamicCast_AsMaterial_Instance_Dynamic_1' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, K2Node_DynamicCast_bSuccess_1) == 0x000248, "Member 'BPC_SummonFade_C_Create_Fade_Materials::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, CallFunc_Less_IntInt_ReturnValue_7) == 0x000249, "Member 'BPC_SummonFade_C_Create_Fade_Materials::CallFunc_Less_IntInt_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, CallFunc_Array_Get_Item_12) == 0x000250, "Member 'BPC_SummonFade_C_Create_Fade_Materials::CallFunc_Array_Get_Item_12' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, CallFunc_GetDisplayName_ReturnValue_3) == 0x000258, "Member 'BPC_SummonFade_C_Create_Fade_Materials::CallFunc_GetDisplayName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, CallFunc_CreateDynamicMaterialInstance_ReturnValue_6) == 0x000268, "Member 'BPC_SummonFade_C_Create_Fade_Materials::CallFunc_CreateDynamicMaterialInstance_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000270, "Member 'BPC_SummonFade_C_Create_Fade_Materials::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, CallFunc_Array_Add_ReturnValue_8) == 0x000280, "Member 'BPC_SummonFade_C_Create_Fade_Materials::CallFunc_Array_Add_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, CallFunc_Array_Find_ReturnValue_3) == 0x000284, "Member 'BPC_SummonFade_C_Create_Fade_Materials::CallFunc_Array_Find_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, CallFunc_Array_Length_ReturnValue_5) == 0x000288, "Member 'BPC_SummonFade_C_Create_Fade_Materials::CallFunc_Array_Length_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, CallFunc_Less_IntInt_ReturnValue_8) == 0x00028C, "Member 'BPC_SummonFade_C_Create_Fade_Materials::CallFunc_Less_IntInt_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, CallFunc_Less_IntInt_ReturnValue_9) == 0x00028D, "Member 'BPC_SummonFade_C_Create_Fade_Materials::CallFunc_Less_IntInt_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, CallFunc_Array_Get_Item_13) == 0x000290, "Member 'BPC_SummonFade_C_Create_Fade_Materials::CallFunc_Array_Get_Item_13' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, CallFunc_CreateDynamicMaterialInstance_ReturnValue_7) == 0x000298, "Member 'BPC_SummonFade_C_Create_Fade_Materials::CallFunc_CreateDynamicMaterialInstance_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_Create_Fade_Materials, CallFunc_Array_Add_ReturnValue_9) == 0x0002A0, "Member 'BPC_SummonFade_C_Create_Fade_Materials::CallFunc_Array_Add_ReturnValue_9' has a wrong offset!");

// Function BPC_SummonFade.BPC_SummonFade_C.ExecuteUbergraph_BPC_SummonFade
// 0x01A0 (0x01A0 - 0x0000)
struct BPC_SummonFade_C_ExecuteUbergraph_BPC_SummonFade final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AVPairedPawn*                           K2Node_DynamicCast_AsVPaired_Pawn;                 // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetTimerElapsedTimeHandle_ReturnValue; // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0034(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0050(0x0008)(NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetTimerElapsedTimeHandle_ReturnValue_1; // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ANiagaraActor*                          K2Node_DynamicCast_AsNiagara_Actor;                // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0xF];                                       // 0x00B1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00C0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ANiagaraActor*                          CallFunc_FinishSpawningActor_ReturnValue;          // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0130(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0140(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToActor_ReturnValue;             // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0150(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetAttachedActors_OutActors;              // 0x0168(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x3];                                      // 0x0181(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast_1;     // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_1;  // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast;    // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_SummonFade_C_ExecuteUbergraph_BPC_SummonFade) == 0x000010, "Wrong alignment on BPC_SummonFade_C_ExecuteUbergraph_BPC_SummonFade");
static_assert(sizeof(BPC_SummonFade_C_ExecuteUbergraph_BPC_SummonFade) == 0x0001A0, "Wrong size on BPC_SummonFade_C_ExecuteUbergraph_BPC_SummonFade");
static_assert(offsetof(BPC_SummonFade_C_ExecuteUbergraph_BPC_SummonFade, EntryPoint) == 0x000000, "Member 'BPC_SummonFade_C_ExecuteUbergraph_BPC_SummonFade::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_ExecuteUbergraph_BPC_SummonFade, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BPC_SummonFade_C_ExecuteUbergraph_BPC_SummonFade::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_ExecuteUbergraph_BPC_SummonFade, K2Node_DynamicCast_AsVPaired_Pawn) == 0x000010, "Member 'BPC_SummonFade_C_ExecuteUbergraph_BPC_SummonFade::K2Node_DynamicCast_AsVPaired_Pawn' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_ExecuteUbergraph_BPC_SummonFade, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BPC_SummonFade_C_ExecuteUbergraph_BPC_SummonFade::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_ExecuteUbergraph_BPC_SummonFade, K2Node_Event_DeltaSeconds) == 0x00001C, "Member 'BPC_SummonFade_C_ExecuteUbergraph_BPC_SummonFade::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_ExecuteUbergraph_BPC_SummonFade, CallFunc_K2_GetTimerElapsedTimeHandle_ReturnValue) == 0x000020, "Member 'BPC_SummonFade_C_ExecuteUbergraph_BPC_SummonFade::CallFunc_K2_GetTimerElapsedTimeHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_ExecuteUbergraph_BPC_SummonFade, Temp_int_Variable) == 0x000024, "Member 'BPC_SummonFade_C_ExecuteUbergraph_BPC_SummonFade::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_ExecuteUbergraph_BPC_SummonFade, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000028, "Member 'BPC_SummonFade_C_ExecuteUbergraph_BPC_SummonFade::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_ExecuteUbergraph_BPC_SummonFade, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000030, "Member 'BPC_SummonFade_C_ExecuteUbergraph_BPC_SummonFade::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_ExecuteUbergraph_BPC_SummonFade, K2Node_CreateDelegate_OutputDelegate) == 0x000034, "Member 'BPC_SummonFade_C_ExecuteUbergraph_BPC_SummonFade::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_ExecuteUbergraph_BPC_SummonFade, CallFunc_SelectFloat_ReturnValue) == 0x000048, "Member 'BPC_SummonFade_C_ExecuteUbergraph_BPC_SummonFade::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_ExecuteUbergraph_BPC_SummonFade, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000050, "Member 'BPC_SummonFade_C_ExecuteUbergraph_BPC_SummonFade::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_ExecuteUbergraph_BPC_SummonFade, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000058, "Member 'BPC_SummonFade_C_ExecuteUbergraph_BPC_SummonFade::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_ExecuteUbergraph_BPC_SummonFade, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000060, "Member 'BPC_SummonFade_C_ExecuteUbergraph_BPC_SummonFade::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_ExecuteUbergraph_BPC_SummonFade, CallFunc_K2_GetTimerElapsedTimeHandle_ReturnValue_1) == 0x000068, "Member 'BPC_SummonFade_C_ExecuteUbergraph_BPC_SummonFade::CallFunc_K2_GetTimerElapsedTimeHandle_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_ExecuteUbergraph_BPC_SummonFade, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000070, "Member 'BPC_SummonFade_C_ExecuteUbergraph_BPC_SummonFade::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_ExecuteUbergraph_BPC_SummonFade, CallFunc_Less_DoubleDouble_ReturnValue_1) == 0x000078, "Member 'BPC_SummonFade_C_ExecuteUbergraph_BPC_SummonFade::CallFunc_Less_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_ExecuteUbergraph_BPC_SummonFade, CallFunc_SelectFloat_ReturnValue_1) == 0x000080, "Member 'BPC_SummonFade_C_ExecuteUbergraph_BPC_SummonFade::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_ExecuteUbergraph_BPC_SummonFade, Temp_int_Array_Index_Variable) == 0x000088, "Member 'BPC_SummonFade_C_ExecuteUbergraph_BPC_SummonFade::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_ExecuteUbergraph_BPC_SummonFade, Temp_int_Loop_Counter_Variable) == 0x00008C, "Member 'BPC_SummonFade_C_ExecuteUbergraph_BPC_SummonFade::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_ExecuteUbergraph_BPC_SummonFade, CallFunc_Add_IntInt_ReturnValue) == 0x000090, "Member 'BPC_SummonFade_C_ExecuteUbergraph_BPC_SummonFade::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_ExecuteUbergraph_BPC_SummonFade, CallFunc_Array_Get_Item) == 0x000098, "Member 'BPC_SummonFade_C_ExecuteUbergraph_BPC_SummonFade::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_ExecuteUbergraph_BPC_SummonFade, CallFunc_Array_Length_ReturnValue) == 0x0000A0, "Member 'BPC_SummonFade_C_ExecuteUbergraph_BPC_SummonFade::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_ExecuteUbergraph_BPC_SummonFade, CallFunc_Less_IntInt_ReturnValue) == 0x0000A4, "Member 'BPC_SummonFade_C_ExecuteUbergraph_BPC_SummonFade::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_ExecuteUbergraph_BPC_SummonFade, K2Node_DynamicCast_AsNiagara_Actor) == 0x0000A8, "Member 'BPC_SummonFade_C_ExecuteUbergraph_BPC_SummonFade::K2Node_DynamicCast_AsNiagara_Actor' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_ExecuteUbergraph_BPC_SummonFade, K2Node_DynamicCast_bSuccess_1) == 0x0000B0, "Member 'BPC_SummonFade_C_ExecuteUbergraph_BPC_SummonFade::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_ExecuteUbergraph_BPC_SummonFade, CallFunc_MakeTransform_ReturnValue) == 0x0000C0, "Member 'BPC_SummonFade_C_ExecuteUbergraph_BPC_SummonFade::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_ExecuteUbergraph_BPC_SummonFade, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000120, "Member 'BPC_SummonFade_C_ExecuteUbergraph_BPC_SummonFade::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_ExecuteUbergraph_BPC_SummonFade, CallFunc_FinishSpawningActor_ReturnValue) == 0x000128, "Member 'BPC_SummonFade_C_ExecuteUbergraph_BPC_SummonFade::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_ExecuteUbergraph_BPC_SummonFade, K2Node_CreateDelegate_OutputDelegate_1) == 0x000130, "Member 'BPC_SummonFade_C_ExecuteUbergraph_BPC_SummonFade::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_ExecuteUbergraph_BPC_SummonFade, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000140, "Member 'BPC_SummonFade_C_ExecuteUbergraph_BPC_SummonFade::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_ExecuteUbergraph_BPC_SummonFade, CallFunc_K2_AttachToActor_ReturnValue) == 0x000148, "Member 'BPC_SummonFade_C_ExecuteUbergraph_BPC_SummonFade::CallFunc_K2_AttachToActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_ExecuteUbergraph_BPC_SummonFade, CallFunc_Add_VectorVector_ReturnValue) == 0x000150, "Member 'BPC_SummonFade_C_ExecuteUbergraph_BPC_SummonFade::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_SummonFade_C_ExecuteUbergraph_BPC_SummonFade, CallFunc_GetAttachedActors_OutActors) == 0x000168, "Member 'BPC_SummonFade_C_ExecuteUbergraph_BPC_SummonFade::CallFunc_GetAttachedActors_OutActors' has a wrong offset!");
