#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_Cloth_Scalabilty

#include "Basic.hpp"

#include "BPS_ClothAssetAndMaterialSections_structs.hpp"
#include "Altar_structs.hpp"
#include "BPE_ClothingInstanceType_structs.hpp"
#include "BPE_ClothAssetPriority_structs.hpp"


namespace SDK::Params
{

// Function BPC_Cloth_Scalabilty.BPC_Cloth_Scalabilty_C.GetClothingInstanceType
// 0x0028 (0x0028 - 0x0000)
struct BPC_Cloth_Scalabilty_C_GetClothingInstanceType final
{
public:
	class FString                                 ParentActorName;                                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ParentComponentName;                               // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	EBPE_ClothingInstanceType                     Type;                                              // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_Cloth_Scalabilty_C_GetClothingInstanceType) == 0x000008, "Wrong alignment on BPC_Cloth_Scalabilty_C_GetClothingInstanceType");
static_assert(sizeof(BPC_Cloth_Scalabilty_C_GetClothingInstanceType) == 0x000028, "Wrong size on BPC_Cloth_Scalabilty_C_GetClothingInstanceType");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_GetClothingInstanceType, ParentActorName) == 0x000000, "Member 'BPC_Cloth_Scalabilty_C_GetClothingInstanceType::ParentActorName' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_GetClothingInstanceType, ParentComponentName) == 0x000010, "Member 'BPC_Cloth_Scalabilty_C_GetClothingInstanceType::ParentComponentName' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_GetClothingInstanceType, Type) == 0x000020, "Member 'BPC_Cloth_Scalabilty_C_GetClothingInstanceType::Type' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_GetClothingInstanceType, CallFunc_Contains_ReturnValue) == 0x000021, "Member 'BPC_Cloth_Scalabilty_C_GetClothingInstanceType::CallFunc_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_GetClothingInstanceType, K2Node_SwitchString_CmpSuccess) == 0x000022, "Member 'BPC_Cloth_Scalabilty_C_GetClothingInstanceType::K2Node_SwitchString_CmpSuccess' has a wrong offset!");

// Function BPC_Cloth_Scalabilty.BPC_Cloth_Scalabilty_C.GetClothQuality
// 0x0048 (0x0048 - 0x0000)
struct BPC_Cloth_Scalabilty_C_GetClothQuality final
{
public:
	TDelegate<void(int32 NewValue)>               ClothQualityDelegate;                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 NewValue)>               ViewDistanceDelegate;                              // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	int32                                         ClothQuality;                                      // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ViewDistanceQuality;                               // 0x0024(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetConsoleVariableIntValue_ReturnValue;   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetConsoleVariableIntValue_ReturnValue_1; // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAltarGameModeBase*                     K2Node_DynamicCast_AsAltar_Game_Mode_Base;         // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_Cloth_Scalabilty_C_GetClothQuality) == 0x000008, "Wrong alignment on BPC_Cloth_Scalabilty_C_GetClothQuality");
static_assert(sizeof(BPC_Cloth_Scalabilty_C_GetClothQuality) == 0x000048, "Wrong size on BPC_Cloth_Scalabilty_C_GetClothQuality");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_GetClothQuality, ClothQualityDelegate) == 0x000000, "Member 'BPC_Cloth_Scalabilty_C_GetClothQuality::ClothQualityDelegate' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_GetClothQuality, ViewDistanceDelegate) == 0x000010, "Member 'BPC_Cloth_Scalabilty_C_GetClothQuality::ViewDistanceDelegate' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_GetClothQuality, ClothQuality) == 0x000020, "Member 'BPC_Cloth_Scalabilty_C_GetClothQuality::ClothQuality' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_GetClothQuality, ViewDistanceQuality) == 0x000024, "Member 'BPC_Cloth_Scalabilty_C_GetClothQuality::ViewDistanceQuality' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_GetClothQuality, CallFunc_GetConsoleVariableIntValue_ReturnValue) == 0x000028, "Member 'BPC_Cloth_Scalabilty_C_GetClothQuality::CallFunc_GetConsoleVariableIntValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_GetClothQuality, CallFunc_GetConsoleVariableIntValue_ReturnValue_1) == 0x00002C, "Member 'BPC_Cloth_Scalabilty_C_GetClothQuality::CallFunc_GetConsoleVariableIntValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_GetClothQuality, CallFunc_GetGameMode_ReturnValue) == 0x000030, "Member 'BPC_Cloth_Scalabilty_C_GetClothQuality::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_GetClothQuality, K2Node_DynamicCast_AsAltar_Game_Mode_Base) == 0x000038, "Member 'BPC_Cloth_Scalabilty_C_GetClothQuality::K2Node_DynamicCast_AsAltar_Game_Mode_Base' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_GetClothQuality, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BPC_Cloth_Scalabilty_C_GetClothQuality::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BPC_Cloth_Scalabilty.BPC_Cloth_Scalabilty_C.HideClothMaterialSlots
// 0x0108 (0x0108 - 0x0000)
struct BPC_Cloth_Scalabilty_C_HideClothMaterialSlots final
{
public:
	TArray<class UChaosClothComponent*>           ClothComponents;                                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class USkeletalMeshComponent*                 SkeletalMeshComponent;                             // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ECharacterSex                                 CharacterSex;                                      // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FBPS_ClothAssetAndMaterialSections> MaleClothAssets;                               // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FBPS_ClothAssetAndMaterialSections> FemaleClothAssets;                             // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         MinLOD;                                            // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ClothCullingLOD;                                   // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 SlotsToHide;                                       // 0x0048(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Variable;                                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue_1;           // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8B[0x5];                                       // 0x008B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 CallFunc_Set_ToArray_Result;                       // 0x0090(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Get_Item;                           // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 CallFunc_Set_ToArray_Result_1;                     // 0x00A8(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item_1;                         // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumLODs_ReturnValue;                   // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UChaosClothComponent*                   CallFunc_Array_Get_Item_2;                         // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UChaosClothAsset*                       CallFunc_GetClothAsset_ReturnValue;                // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E6[0x2];                                       // 0x00E6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item_3;                         // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue_1;            // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_Cloth_Scalabilty_C_HideClothMaterialSlots) == 0x000008, "Wrong alignment on BPC_Cloth_Scalabilty_C_HideClothMaterialSlots");
static_assert(sizeof(BPC_Cloth_Scalabilty_C_HideClothMaterialSlots) == 0x000108, "Wrong size on BPC_Cloth_Scalabilty_C_HideClothMaterialSlots");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_HideClothMaterialSlots, ClothComponents) == 0x000000, "Member 'BPC_Cloth_Scalabilty_C_HideClothMaterialSlots::ClothComponents' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_HideClothMaterialSlots, SkeletalMeshComponent) == 0x000010, "Member 'BPC_Cloth_Scalabilty_C_HideClothMaterialSlots::SkeletalMeshComponent' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_HideClothMaterialSlots, CharacterSex) == 0x000018, "Member 'BPC_Cloth_Scalabilty_C_HideClothMaterialSlots::CharacterSex' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_HideClothMaterialSlots, MaleClothAssets) == 0x000020, "Member 'BPC_Cloth_Scalabilty_C_HideClothMaterialSlots::MaleClothAssets' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_HideClothMaterialSlots, FemaleClothAssets) == 0x000030, "Member 'BPC_Cloth_Scalabilty_C_HideClothMaterialSlots::FemaleClothAssets' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_HideClothMaterialSlots, MinLOD) == 0x000040, "Member 'BPC_Cloth_Scalabilty_C_HideClothMaterialSlots::MinLOD' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_HideClothMaterialSlots, ClothCullingLOD) == 0x000044, "Member 'BPC_Cloth_Scalabilty_C_HideClothMaterialSlots::ClothCullingLOD' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_HideClothMaterialSlots, SlotsToHide) == 0x000048, "Member 'BPC_Cloth_Scalabilty_C_HideClothMaterialSlots::SlotsToHide' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_HideClothMaterialSlots, Temp_int_Variable) == 0x000058, "Member 'BPC_Cloth_Scalabilty_C_HideClothMaterialSlots::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_HideClothMaterialSlots, Temp_int_Loop_Counter_Variable) == 0x00005C, "Member 'BPC_Cloth_Scalabilty_C_HideClothMaterialSlots::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_HideClothMaterialSlots, CallFunc_Add_IntInt_ReturnValue) == 0x000060, "Member 'BPC_Cloth_Scalabilty_C_HideClothMaterialSlots::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_HideClothMaterialSlots, CallFunc_Add_IntInt_ReturnValue_1) == 0x000064, "Member 'BPC_Cloth_Scalabilty_C_HideClothMaterialSlots::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_HideClothMaterialSlots, Temp_int_Array_Index_Variable) == 0x000068, "Member 'BPC_Cloth_Scalabilty_C_HideClothMaterialSlots::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_HideClothMaterialSlots, Temp_int_Loop_Counter_Variable_1) == 0x00006C, "Member 'BPC_Cloth_Scalabilty_C_HideClothMaterialSlots::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_HideClothMaterialSlots, CallFunc_Add_IntInt_ReturnValue_2) == 0x000070, "Member 'BPC_Cloth_Scalabilty_C_HideClothMaterialSlots::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_HideClothMaterialSlots, Temp_int_Array_Index_Variable_1) == 0x000074, "Member 'BPC_Cloth_Scalabilty_C_HideClothMaterialSlots::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_HideClothMaterialSlots, Temp_int_Array_Index_Variable_2) == 0x000078, "Member 'BPC_Cloth_Scalabilty_C_HideClothMaterialSlots::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_HideClothMaterialSlots, Temp_int_Loop_Counter_Variable_2) == 0x00007C, "Member 'BPC_Cloth_Scalabilty_C_HideClothMaterialSlots::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_HideClothMaterialSlots, CallFunc_Add_IntInt_ReturnValue_3) == 0x000080, "Member 'BPC_Cloth_Scalabilty_C_HideClothMaterialSlots::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_HideClothMaterialSlots, Temp_int_Array_Index_Variable_3) == 0x000084, "Member 'BPC_Cloth_Scalabilty_C_HideClothMaterialSlots::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_HideClothMaterialSlots, K2Node_SwitchEnum_CmpSuccess) == 0x000088, "Member 'BPC_Cloth_Scalabilty_C_HideClothMaterialSlots::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_HideClothMaterialSlots, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x000089, "Member 'BPC_Cloth_Scalabilty_C_HideClothMaterialSlots::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_HideClothMaterialSlots, CallFunc_Array_IsNotEmpty_ReturnValue_1) == 0x00008A, "Member 'BPC_Cloth_Scalabilty_C_HideClothMaterialSlots::CallFunc_Array_IsNotEmpty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_HideClothMaterialSlots, CallFunc_Set_ToArray_Result) == 0x000090, "Member 'BPC_Cloth_Scalabilty_C_HideClothMaterialSlots::CallFunc_Set_ToArray_Result' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_HideClothMaterialSlots, CallFunc_Array_Get_Item) == 0x0000A0, "Member 'BPC_Cloth_Scalabilty_C_HideClothMaterialSlots::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_HideClothMaterialSlots, CallFunc_Set_ToArray_Result_1) == 0x0000A8, "Member 'BPC_Cloth_Scalabilty_C_HideClothMaterialSlots::CallFunc_Set_ToArray_Result_1' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_HideClothMaterialSlots, CallFunc_Array_Length_ReturnValue) == 0x0000B8, "Member 'BPC_Cloth_Scalabilty_C_HideClothMaterialSlots::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_HideClothMaterialSlots, CallFunc_Array_Get_Item_1) == 0x0000BC, "Member 'BPC_Cloth_Scalabilty_C_HideClothMaterialSlots::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_HideClothMaterialSlots, CallFunc_Array_Length_ReturnValue_1) == 0x0000C0, "Member 'BPC_Cloth_Scalabilty_C_HideClothMaterialSlots::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_HideClothMaterialSlots, CallFunc_Less_IntInt_ReturnValue) == 0x0000C4, "Member 'BPC_Cloth_Scalabilty_C_HideClothMaterialSlots::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_HideClothMaterialSlots, CallFunc_GetNumLODs_ReturnValue) == 0x0000C8, "Member 'BPC_Cloth_Scalabilty_C_HideClothMaterialSlots::CallFunc_GetNumLODs_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_HideClothMaterialSlots, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000CC, "Member 'BPC_Cloth_Scalabilty_C_HideClothMaterialSlots::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_HideClothMaterialSlots, CallFunc_Array_Get_Item_2) == 0x0000D0, "Member 'BPC_Cloth_Scalabilty_C_HideClothMaterialSlots::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_HideClothMaterialSlots, CallFunc_GetClothAsset_ReturnValue) == 0x0000D8, "Member 'BPC_Cloth_Scalabilty_C_HideClothMaterialSlots::CallFunc_GetClothAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_HideClothMaterialSlots, CallFunc_Array_Length_ReturnValue_2) == 0x0000E0, "Member 'BPC_Cloth_Scalabilty_C_HideClothMaterialSlots::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_HideClothMaterialSlots, CallFunc_IsValid_ReturnValue) == 0x0000E4, "Member 'BPC_Cloth_Scalabilty_C_HideClothMaterialSlots::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_HideClothMaterialSlots, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000E5, "Member 'BPC_Cloth_Scalabilty_C_HideClothMaterialSlots::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_HideClothMaterialSlots, Temp_int_Loop_Counter_Variable_3) == 0x0000E8, "Member 'BPC_Cloth_Scalabilty_C_HideClothMaterialSlots::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_HideClothMaterialSlots, CallFunc_Less_IntInt_ReturnValue_2) == 0x0000EC, "Member 'BPC_Cloth_Scalabilty_C_HideClothMaterialSlots::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_HideClothMaterialSlots, CallFunc_Add_IntInt_ReturnValue_4) == 0x0000F0, "Member 'BPC_Cloth_Scalabilty_C_HideClothMaterialSlots::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_HideClothMaterialSlots, CallFunc_Array_Get_Item_3) == 0x0000F4, "Member 'BPC_Cloth_Scalabilty_C_HideClothMaterialSlots::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_HideClothMaterialSlots, CallFunc_Array_AddUnique_ReturnValue) == 0x0000F8, "Member 'BPC_Cloth_Scalabilty_C_HideClothMaterialSlots::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_HideClothMaterialSlots, CallFunc_Array_Length_ReturnValue_3) == 0x0000FC, "Member 'BPC_Cloth_Scalabilty_C_HideClothMaterialSlots::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_HideClothMaterialSlots, CallFunc_Less_IntInt_ReturnValue_3) == 0x000100, "Member 'BPC_Cloth_Scalabilty_C_HideClothMaterialSlots::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_HideClothMaterialSlots, CallFunc_Array_AddUnique_ReturnValue_1) == 0x000104, "Member 'BPC_Cloth_Scalabilty_C_HideClothMaterialSlots::CallFunc_Array_AddUnique_ReturnValue_1' has a wrong offset!");

// Function BPC_Cloth_Scalabilty.BPC_Cloth_Scalabilty_C.MakeClothComponentsArray
// 0x00A8 (0x00A8 - 0x0000)
struct BPC_Cloth_Scalabilty_C_MakeClothComponentsArray final
{
public:
	TArray<class UChaosClothComponent*>           ClothComponents;                                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class USceneComponent*>                CallFunc_GetChildrenComponents_Children;           // 0x0030(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_ParseIntoArray_ReturnValue;               // 0x0068(0x0010)(ReferenceParm)
	class UChaosClothComponent*                   K2Node_DynamicCast_AsChaos_cloth_component;        // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item_1;                         // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_StringToInt_ReturnValue;             // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_Cloth_Scalabilty_C_MakeClothComponentsArray) == 0x000008, "Wrong alignment on BPC_Cloth_Scalabilty_C_MakeClothComponentsArray");
static_assert(sizeof(BPC_Cloth_Scalabilty_C_MakeClothComponentsArray) == 0x0000A8, "Wrong size on BPC_Cloth_Scalabilty_C_MakeClothComponentsArray");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_MakeClothComponentsArray, ClothComponents) == 0x000000, "Member 'BPC_Cloth_Scalabilty_C_MakeClothComponentsArray::ClothComponents' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_MakeClothComponentsArray, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'BPC_Cloth_Scalabilty_C_MakeClothComponentsArray::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_MakeClothComponentsArray, Temp_int_Array_Index_Variable) == 0x000014, "Member 'BPC_Cloth_Scalabilty_C_MakeClothComponentsArray::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_MakeClothComponentsArray, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'BPC_Cloth_Scalabilty_C_MakeClothComponentsArray::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_MakeClothComponentsArray, CallFunc_GetOwner_ReturnValue) == 0x000020, "Member 'BPC_Cloth_Scalabilty_C_MakeClothComponentsArray::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_MakeClothComponentsArray, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000028, "Member 'BPC_Cloth_Scalabilty_C_MakeClothComponentsArray::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_MakeClothComponentsArray, CallFunc_GetChildrenComponents_Children) == 0x000030, "Member 'BPC_Cloth_Scalabilty_C_MakeClothComponentsArray::CallFunc_GetChildrenComponents_Children' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_MakeClothComponentsArray, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'BPC_Cloth_Scalabilty_C_MakeClothComponentsArray::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_MakeClothComponentsArray, CallFunc_Array_Get_Item) == 0x000048, "Member 'BPC_Cloth_Scalabilty_C_MakeClothComponentsArray::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_MakeClothComponentsArray, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'BPC_Cloth_Scalabilty_C_MakeClothComponentsArray::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_MakeClothComponentsArray, CallFunc_GetObjectName_ReturnValue) == 0x000058, "Member 'BPC_Cloth_Scalabilty_C_MakeClothComponentsArray::CallFunc_GetObjectName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_MakeClothComponentsArray, CallFunc_ParseIntoArray_ReturnValue) == 0x000068, "Member 'BPC_Cloth_Scalabilty_C_MakeClothComponentsArray::CallFunc_ParseIntoArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_MakeClothComponentsArray, K2Node_DynamicCast_AsChaos_cloth_component) == 0x000078, "Member 'BPC_Cloth_Scalabilty_C_MakeClothComponentsArray::K2Node_DynamicCast_AsChaos_cloth_component' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_MakeClothComponentsArray, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'BPC_Cloth_Scalabilty_C_MakeClothComponentsArray::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_MakeClothComponentsArray, CallFunc_Array_LastIndex_ReturnValue) == 0x000084, "Member 'BPC_Cloth_Scalabilty_C_MakeClothComponentsArray::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_MakeClothComponentsArray, CallFunc_Array_Get_Item_1) == 0x000088, "Member 'BPC_Cloth_Scalabilty_C_MakeClothComponentsArray::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_MakeClothComponentsArray, CallFunc_Array_AddUnique_ReturnValue) == 0x000098, "Member 'BPC_Cloth_Scalabilty_C_MakeClothComponentsArray::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_MakeClothComponentsArray, CallFunc_Conv_StringToInt_ReturnValue) == 0x00009C, "Member 'BPC_Cloth_Scalabilty_C_MakeClothComponentsArray::CallFunc_Conv_StringToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_MakeClothComponentsArray, CallFunc_NotEqual_IntInt_ReturnValue) == 0x0000A0, "Member 'BPC_Cloth_Scalabilty_C_MakeClothComponentsArray::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BPC_Cloth_Scalabilty.BPC_Cloth_Scalabilty_C.Set Cloth Asset
// 0x0320 (0x0320 - 0x0000)
struct BPC_Cloth_Scalabilty_C_Set_Cloth_Asset final
{
public:
	TArray<class UChaosClothComponent*>           ClothComponents;                                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	ECharacterSex                                 CharacterSex;                                      // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTESRace*                               CharacterRace;                                     // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FBPS_ClothAssetAndMaterialSections> MaleClothAssets;                               // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FBPS_ClothAssetAndMaterialSections> FemaleClothAssets;                             // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UChaosClothComponent*                   ClothComponent;                                    // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, class UPhysicsAsset*>     PhysicsAssets;                                     // 0x0050(0x0050)(Edit, BlueprintVisible)
	bool                                          Temp_bool_Variable;                                // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class FString, class UPhysicsAsset*>     K2Node_MakeVariable_MakeVariableOutput;            // 0x00A8(0x0050)()
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable;                              // 0x0100(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	class UChaosClothComponent*                   CallFunc_Array_Get_Item;                           // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_1;                            // 0x0118(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x012A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12B[0x5];                                      // 0x012B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0140(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FBPS_ClothAssetAndMaterialSections     CallFunc_Array_Get_Item_1;                         // 0x0160(0x0058)(HasGetValueTypeHash)
	struct FBPS_ClothAssetAndMaterialSections     CallFunc_Array_Get_Item_2;                         // 0x01B8(0x0058)(HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_1;         // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharacterSex                                 Temp_byte_Variable;                                // 0x0212(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_213[0x5];                                      // 0x0213(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UChaosClothAsset*                       Temp_object_Variable;                              // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_221[0x7];                                      // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UChaosClothAsset*                       Temp_object_Variable_1;                            // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UChaosClothAsset*                       K2Node_Select_Default;                             // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x023C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23D[0x3];                                      // 0x023D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0244(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_245[0x3];                                      // 0x0245(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UChaosClothAsset*                       K2Node_Select_Default_1;                           // 0x0248(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPhysicsAsset*                          CallFunc_Map_Find_Value;                           // 0x0250(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UChaosClothAsset*                       K2Node_Select_Default_2;                           // 0x0260(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicsAsset*                          CallFunc_Map_Find_Value_1;                         // 0x0270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_279[0x7];                                      // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicsAsset*                          CallFunc_Map_Find_Value_2;                         // 0x0280(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_2;                   // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_289[0x7];                                      // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicsAsset*                          K2Node_Select_Default_3;                           // 0x0290(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_MakeLiteralString_ReturnValue;            // 0x0298(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_MakeLiteralString_ReturnValue_1;          // 0x02A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_1;          // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue_1;             // 0x02C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CA[0x6];                                      // 0x02CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x02D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E1[0x3];                                      // 0x02E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_2;          // 0x02E4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x02EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue_2;             // 0x02ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EE[0x2];                                      // 0x02EE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x02F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_301[0x3];                                      // 0x0301(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_3;          // 0x0304(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x030C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue_3;             // 0x030D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x030E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30F[0x1];                                      // 0x030F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicsAsset*                          K2Node_Select_Default_4;                           // 0x0310(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue_1;      // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_Cloth_Scalabilty_C_Set_Cloth_Asset) == 0x000008, "Wrong alignment on BPC_Cloth_Scalabilty_C_Set_Cloth_Asset");
static_assert(sizeof(BPC_Cloth_Scalabilty_C_Set_Cloth_Asset) == 0x000320, "Wrong size on BPC_Cloth_Scalabilty_C_Set_Cloth_Asset");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_Set_Cloth_Asset, ClothComponents) == 0x000000, "Member 'BPC_Cloth_Scalabilty_C_Set_Cloth_Asset::ClothComponents' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_Set_Cloth_Asset, CharacterSex) == 0x000010, "Member 'BPC_Cloth_Scalabilty_C_Set_Cloth_Asset::CharacterSex' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_Set_Cloth_Asset, CharacterRace) == 0x000018, "Member 'BPC_Cloth_Scalabilty_C_Set_Cloth_Asset::CharacterRace' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_Set_Cloth_Asset, MaleClothAssets) == 0x000020, "Member 'BPC_Cloth_Scalabilty_C_Set_Cloth_Asset::MaleClothAssets' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_Set_Cloth_Asset, FemaleClothAssets) == 0x000030, "Member 'BPC_Cloth_Scalabilty_C_Set_Cloth_Asset::FemaleClothAssets' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_Set_Cloth_Asset, ClothComponent) == 0x000040, "Member 'BPC_Cloth_Scalabilty_C_Set_Cloth_Asset::ClothComponent' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_Set_Cloth_Asset, Index_0) == 0x000048, "Member 'BPC_Cloth_Scalabilty_C_Set_Cloth_Asset::Index_0' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_Set_Cloth_Asset, PhysicsAssets) == 0x000050, "Member 'BPC_Cloth_Scalabilty_C_Set_Cloth_Asset::PhysicsAssets' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_Set_Cloth_Asset, Temp_bool_Variable) == 0x0000A0, "Member 'BPC_Cloth_Scalabilty_C_Set_Cloth_Asset::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_Set_Cloth_Asset, CallFunc_Array_Length_ReturnValue) == 0x0000A4, "Member 'BPC_Cloth_Scalabilty_C_Set_Cloth_Asset::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_Set_Cloth_Asset, K2Node_MakeVariable_MakeVariableOutput) == 0x0000A8, "Member 'BPC_Cloth_Scalabilty_C_Set_Cloth_Asset::K2Node_MakeVariable_MakeVariableOutput' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_Set_Cloth_Asset, Temp_int_Array_Index_Variable) == 0x0000F8, "Member 'BPC_Cloth_Scalabilty_C_Set_Cloth_Asset::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_Set_Cloth_Asset, Temp_string_Variable) == 0x000100, "Member 'BPC_Cloth_Scalabilty_C_Set_Cloth_Asset::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_Set_Cloth_Asset, CallFunc_Array_Get_Item) == 0x000110, "Member 'BPC_Cloth_Scalabilty_C_Set_Cloth_Asset::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_Set_Cloth_Asset, Temp_string_Variable_1) == 0x000118, "Member 'BPC_Cloth_Scalabilty_C_Set_Cloth_Asset::Temp_string_Variable_1' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_Set_Cloth_Asset, Temp_bool_Variable_1) == 0x000128, "Member 'BPC_Cloth_Scalabilty_C_Set_Cloth_Asset::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_Set_Cloth_Asset, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000129, "Member 'BPC_Cloth_Scalabilty_C_Set_Cloth_Asset::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_Set_Cloth_Asset, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00012A, "Member 'BPC_Cloth_Scalabilty_C_Set_Cloth_Asset::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_Set_Cloth_Asset, CallFunc_SelectString_ReturnValue) == 0x000130, "Member 'BPC_Cloth_Scalabilty_C_Set_Cloth_Asset::CallFunc_SelectString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_Set_Cloth_Asset, CallFunc_GetDisplayName_ReturnValue) == 0x000140, "Member 'BPC_Cloth_Scalabilty_C_Set_Cloth_Asset::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_Set_Cloth_Asset, CallFunc_Concat_StrStr_ReturnValue) == 0x000150, "Member 'BPC_Cloth_Scalabilty_C_Set_Cloth_Asset::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_Set_Cloth_Asset, CallFunc_Array_Get_Item_1) == 0x000160, "Member 'BPC_Cloth_Scalabilty_C_Set_Cloth_Asset::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_Set_Cloth_Asset, CallFunc_Array_Get_Item_2) == 0x0001B8, "Member 'BPC_Cloth_Scalabilty_C_Set_Cloth_Asset::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_Set_Cloth_Asset, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000210, "Member 'BPC_Cloth_Scalabilty_C_Set_Cloth_Asset::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_Set_Cloth_Asset, CallFunc_Array_IsValidIndex_ReturnValue_1) == 0x000211, "Member 'BPC_Cloth_Scalabilty_C_Set_Cloth_Asset::CallFunc_Array_IsValidIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_Set_Cloth_Asset, Temp_byte_Variable) == 0x000212, "Member 'BPC_Cloth_Scalabilty_C_Set_Cloth_Asset::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_Set_Cloth_Asset, Temp_object_Variable) == 0x000218, "Member 'BPC_Cloth_Scalabilty_C_Set_Cloth_Asset::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_Set_Cloth_Asset, Temp_bool_Variable_2) == 0x000220, "Member 'BPC_Cloth_Scalabilty_C_Set_Cloth_Asset::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_Set_Cloth_Asset, Temp_object_Variable_1) == 0x000228, "Member 'BPC_Cloth_Scalabilty_C_Set_Cloth_Asset::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_Set_Cloth_Asset, K2Node_Select_Default) == 0x000230, "Member 'BPC_Cloth_Scalabilty_C_Set_Cloth_Asset::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_Set_Cloth_Asset, Temp_int_Loop_Counter_Variable) == 0x000238, "Member 'BPC_Cloth_Scalabilty_C_Set_Cloth_Asset::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_Set_Cloth_Asset, CallFunc_Less_IntInt_ReturnValue) == 0x00023C, "Member 'BPC_Cloth_Scalabilty_C_Set_Cloth_Asset::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_Set_Cloth_Asset, CallFunc_Add_IntInt_ReturnValue) == 0x000240, "Member 'BPC_Cloth_Scalabilty_C_Set_Cloth_Asset::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_Set_Cloth_Asset, Temp_bool_Variable_3) == 0x000244, "Member 'BPC_Cloth_Scalabilty_C_Set_Cloth_Asset::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_Set_Cloth_Asset, K2Node_Select_Default_1) == 0x000248, "Member 'BPC_Cloth_Scalabilty_C_Set_Cloth_Asset::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_Set_Cloth_Asset, CallFunc_Map_Find_Value) == 0x000250, "Member 'BPC_Cloth_Scalabilty_C_Set_Cloth_Asset::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_Set_Cloth_Asset, CallFunc_Map_Find_ReturnValue) == 0x000258, "Member 'BPC_Cloth_Scalabilty_C_Set_Cloth_Asset::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_Set_Cloth_Asset, K2Node_Select_Default_2) == 0x000260, "Member 'BPC_Cloth_Scalabilty_C_Set_Cloth_Asset::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_Set_Cloth_Asset, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000268, "Member 'BPC_Cloth_Scalabilty_C_Set_Cloth_Asset::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_Set_Cloth_Asset, CallFunc_Map_Find_Value_1) == 0x000270, "Member 'BPC_Cloth_Scalabilty_C_Set_Cloth_Asset::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_Set_Cloth_Asset, CallFunc_Map_Find_ReturnValue_1) == 0x000278, "Member 'BPC_Cloth_Scalabilty_C_Set_Cloth_Asset::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_Set_Cloth_Asset, CallFunc_Map_Find_Value_2) == 0x000280, "Member 'BPC_Cloth_Scalabilty_C_Set_Cloth_Asset::CallFunc_Map_Find_Value_2' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_Set_Cloth_Asset, CallFunc_Map_Find_ReturnValue_2) == 0x000288, "Member 'BPC_Cloth_Scalabilty_C_Set_Cloth_Asset::CallFunc_Map_Find_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_Set_Cloth_Asset, K2Node_Select_Default_3) == 0x000290, "Member 'BPC_Cloth_Scalabilty_C_Set_Cloth_Asset::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_Set_Cloth_Asset, CallFunc_MakeLiteralString_ReturnValue) == 0x000298, "Member 'BPC_Cloth_Scalabilty_C_Set_Cloth_Asset::CallFunc_MakeLiteralString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_Cloth_Scalabilty_C_Set_Cloth_Asset, CallFunc_MakeLiteralString_ReturnValue_1) == 0x0002A8, "Member 'BPC_Cloth_Scalabilty_C_Set_Cloth_Asset::CallFunc_MakeLiteralString_ReturnValue_1' has a wrong offset!");
