#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPCI_StatusEffect_Light

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BPCI_StatusEffect_Light.BPCI_StatusEffect_Light_C.ExecuteUbergraph_BPCI_StatusEffect_Light
// 0x0088 (0x0088 - 0x0000)
struct BPCI_StatusEffect_Light_C_ExecuteUbergraph_BPCI_StatusEffect_Light final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_SpellMagnitude;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   K2Node_Event_StaticMeshComponent;                  // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bDoesBeginInFirstPerson;              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Value;                                // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FLinearColor>                   K2Node_Event_VFXColors;                            // 0x0030(0x0010)(ConstParm, ReferenceParm)
	bool                                          K2Node_Event_bDoesBeginAsTheOnlyVFX;               // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsEnchant;                           // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsMainEffect;                        // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsInInventory;                       // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 K2Node_Event_SkeletalMeshComponent;                // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bDoesBeginInFirstPerson_1;            // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Value_1;                              // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FLinearColor>                   K2Node_Event_VFXColors_1;                          // 0x0058(0x0010)(ConstParm, ReferenceParm)
	bool                                          K2Node_Event_bDoesBeginAsTheOnlyVFX_1;             // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsEnchant_1;                         // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsMainEffect_1;                      // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsInInventory_1;                     // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetIntensity_NewIntensity_ImplicitCast;   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetAttenuationRadius_NewRadius_ImplicitCast; // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SetupFakeLightValues_SpellMagnitude_ImplicitCast; // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SetupFakeLightValues_SpellMagnitude_ImplicitCast_1; // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPCI_StatusEffect_Light_C_ExecuteUbergraph_BPCI_StatusEffect_Light) == 0x000008, "Wrong alignment on BPCI_StatusEffect_Light_C_ExecuteUbergraph_BPCI_StatusEffect_Light");
static_assert(sizeof(BPCI_StatusEffect_Light_C_ExecuteUbergraph_BPCI_StatusEffect_Light) == 0x000088, "Wrong size on BPCI_StatusEffect_Light_C_ExecuteUbergraph_BPCI_StatusEffect_Light");
static_assert(offsetof(BPCI_StatusEffect_Light_C_ExecuteUbergraph_BPCI_StatusEffect_Light, EntryPoint) == 0x000000, "Member 'BPCI_StatusEffect_Light_C_ExecuteUbergraph_BPCI_StatusEffect_Light::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPCI_StatusEffect_Light_C_ExecuteUbergraph_BPCI_StatusEffect_Light, K2Node_CustomEvent_SpellMagnitude) == 0x000008, "Member 'BPCI_StatusEffect_Light_C_ExecuteUbergraph_BPCI_StatusEffect_Light::K2Node_CustomEvent_SpellMagnitude' has a wrong offset!");
static_assert(offsetof(BPCI_StatusEffect_Light_C_ExecuteUbergraph_BPCI_StatusEffect_Light, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000010, "Member 'BPCI_StatusEffect_Light_C_ExecuteUbergraph_BPCI_StatusEffect_Light::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPCI_StatusEffect_Light_C_ExecuteUbergraph_BPCI_StatusEffect_Light, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000018, "Member 'BPCI_StatusEffect_Light_C_ExecuteUbergraph_BPCI_StatusEffect_Light::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPCI_StatusEffect_Light_C_ExecuteUbergraph_BPCI_StatusEffect_Light, K2Node_Event_StaticMeshComponent) == 0x000020, "Member 'BPCI_StatusEffect_Light_C_ExecuteUbergraph_BPCI_StatusEffect_Light::K2Node_Event_StaticMeshComponent' has a wrong offset!");
static_assert(offsetof(BPCI_StatusEffect_Light_C_ExecuteUbergraph_BPCI_StatusEffect_Light, K2Node_Event_bDoesBeginInFirstPerson) == 0x000028, "Member 'BPCI_StatusEffect_Light_C_ExecuteUbergraph_BPCI_StatusEffect_Light::K2Node_Event_bDoesBeginInFirstPerson' has a wrong offset!");
static_assert(offsetof(BPCI_StatusEffect_Light_C_ExecuteUbergraph_BPCI_StatusEffect_Light, K2Node_Event_Value) == 0x00002C, "Member 'BPCI_StatusEffect_Light_C_ExecuteUbergraph_BPCI_StatusEffect_Light::K2Node_Event_Value' has a wrong offset!");
static_assert(offsetof(BPCI_StatusEffect_Light_C_ExecuteUbergraph_BPCI_StatusEffect_Light, K2Node_Event_VFXColors) == 0x000030, "Member 'BPCI_StatusEffect_Light_C_ExecuteUbergraph_BPCI_StatusEffect_Light::K2Node_Event_VFXColors' has a wrong offset!");
static_assert(offsetof(BPCI_StatusEffect_Light_C_ExecuteUbergraph_BPCI_StatusEffect_Light, K2Node_Event_bDoesBeginAsTheOnlyVFX) == 0x000040, "Member 'BPCI_StatusEffect_Light_C_ExecuteUbergraph_BPCI_StatusEffect_Light::K2Node_Event_bDoesBeginAsTheOnlyVFX' has a wrong offset!");
static_assert(offsetof(BPCI_StatusEffect_Light_C_ExecuteUbergraph_BPCI_StatusEffect_Light, K2Node_Event_bIsEnchant) == 0x000041, "Member 'BPCI_StatusEffect_Light_C_ExecuteUbergraph_BPCI_StatusEffect_Light::K2Node_Event_bIsEnchant' has a wrong offset!");
static_assert(offsetof(BPCI_StatusEffect_Light_C_ExecuteUbergraph_BPCI_StatusEffect_Light, K2Node_Event_bIsMainEffect) == 0x000042, "Member 'BPCI_StatusEffect_Light_C_ExecuteUbergraph_BPCI_StatusEffect_Light::K2Node_Event_bIsMainEffect' has a wrong offset!");
static_assert(offsetof(BPCI_StatusEffect_Light_C_ExecuteUbergraph_BPCI_StatusEffect_Light, K2Node_Event_bIsInInventory) == 0x000043, "Member 'BPCI_StatusEffect_Light_C_ExecuteUbergraph_BPCI_StatusEffect_Light::K2Node_Event_bIsInInventory' has a wrong offset!");
static_assert(offsetof(BPCI_StatusEffect_Light_C_ExecuteUbergraph_BPCI_StatusEffect_Light, K2Node_Event_SkeletalMeshComponent) == 0x000048, "Member 'BPCI_StatusEffect_Light_C_ExecuteUbergraph_BPCI_StatusEffect_Light::K2Node_Event_SkeletalMeshComponent' has a wrong offset!");
static_assert(offsetof(BPCI_StatusEffect_Light_C_ExecuteUbergraph_BPCI_StatusEffect_Light, K2Node_Event_bDoesBeginInFirstPerson_1) == 0x000050, "Member 'BPCI_StatusEffect_Light_C_ExecuteUbergraph_BPCI_StatusEffect_Light::K2Node_Event_bDoesBeginInFirstPerson_1' has a wrong offset!");
static_assert(offsetof(BPCI_StatusEffect_Light_C_ExecuteUbergraph_BPCI_StatusEffect_Light, K2Node_Event_Value_1) == 0x000054, "Member 'BPCI_StatusEffect_Light_C_ExecuteUbergraph_BPCI_StatusEffect_Light::K2Node_Event_Value_1' has a wrong offset!");
static_assert(offsetof(BPCI_StatusEffect_Light_C_ExecuteUbergraph_BPCI_StatusEffect_Light, K2Node_Event_VFXColors_1) == 0x000058, "Member 'BPCI_StatusEffect_Light_C_ExecuteUbergraph_BPCI_StatusEffect_Light::K2Node_Event_VFXColors_1' has a wrong offset!");
static_assert(offsetof(BPCI_StatusEffect_Light_C_ExecuteUbergraph_BPCI_StatusEffect_Light, K2Node_Event_bDoesBeginAsTheOnlyVFX_1) == 0x000068, "Member 'BPCI_StatusEffect_Light_C_ExecuteUbergraph_BPCI_StatusEffect_Light::K2Node_Event_bDoesBeginAsTheOnlyVFX_1' has a wrong offset!");
static_assert(offsetof(BPCI_StatusEffect_Light_C_ExecuteUbergraph_BPCI_StatusEffect_Light, K2Node_Event_bIsEnchant_1) == 0x000069, "Member 'BPCI_StatusEffect_Light_C_ExecuteUbergraph_BPCI_StatusEffect_Light::K2Node_Event_bIsEnchant_1' has a wrong offset!");
static_assert(offsetof(BPCI_StatusEffect_Light_C_ExecuteUbergraph_BPCI_StatusEffect_Light, K2Node_Event_bIsMainEffect_1) == 0x00006A, "Member 'BPCI_StatusEffect_Light_C_ExecuteUbergraph_BPCI_StatusEffect_Light::K2Node_Event_bIsMainEffect_1' has a wrong offset!");
static_assert(offsetof(BPCI_StatusEffect_Light_C_ExecuteUbergraph_BPCI_StatusEffect_Light, K2Node_Event_bIsInInventory_1) == 0x00006B, "Member 'BPCI_StatusEffect_Light_C_ExecuteUbergraph_BPCI_StatusEffect_Light::K2Node_Event_bIsInInventory_1' has a wrong offset!");
static_assert(offsetof(BPCI_StatusEffect_Light_C_ExecuteUbergraph_BPCI_StatusEffect_Light, CallFunc_SetIntensity_NewIntensity_ImplicitCast) == 0x00006C, "Member 'BPCI_StatusEffect_Light_C_ExecuteUbergraph_BPCI_StatusEffect_Light::CallFunc_SetIntensity_NewIntensity_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BPCI_StatusEffect_Light_C_ExecuteUbergraph_BPCI_StatusEffect_Light, CallFunc_SetAttenuationRadius_NewRadius_ImplicitCast) == 0x000070, "Member 'BPCI_StatusEffect_Light_C_ExecuteUbergraph_BPCI_StatusEffect_Light::CallFunc_SetAttenuationRadius_NewRadius_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BPCI_StatusEffect_Light_C_ExecuteUbergraph_BPCI_StatusEffect_Light, CallFunc_SetupFakeLightValues_SpellMagnitude_ImplicitCast) == 0x000078, "Member 'BPCI_StatusEffect_Light_C_ExecuteUbergraph_BPCI_StatusEffect_Light::CallFunc_SetupFakeLightValues_SpellMagnitude_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BPCI_StatusEffect_Light_C_ExecuteUbergraph_BPCI_StatusEffect_Light, CallFunc_SetupFakeLightValues_SpellMagnitude_ImplicitCast_1) == 0x000080, "Member 'BPCI_StatusEffect_Light_C_ExecuteUbergraph_BPCI_StatusEffect_Light::CallFunc_SetupFakeLightValues_SpellMagnitude_ImplicitCast_1' has a wrong offset!");

// Function BPCI_StatusEffect_Light.BPCI_StatusEffect_Light_C.OnStartPlaySkeletal
// 0x0028 (0x0028 - 0x0000)
struct BPCI_StatusEffect_Light_C_OnStartPlaySkeletal final
{
public:
	class USkeletalMeshComponent*                 SkeletalMeshComponent;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bDoesBeginInFirstPerson;                           // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Value;                                             // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FLinearColor>                   VFXColors;                                         // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          bDoesBeginAsTheOnlyVFX;                            // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsEnchant;                                        // 0x0021(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsMainEffect;                                     // 0x0022(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsInInventory;                                    // 0x0023(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPCI_StatusEffect_Light_C_OnStartPlaySkeletal) == 0x000008, "Wrong alignment on BPCI_StatusEffect_Light_C_OnStartPlaySkeletal");
static_assert(sizeof(BPCI_StatusEffect_Light_C_OnStartPlaySkeletal) == 0x000028, "Wrong size on BPCI_StatusEffect_Light_C_OnStartPlaySkeletal");
static_assert(offsetof(BPCI_StatusEffect_Light_C_OnStartPlaySkeletal, SkeletalMeshComponent) == 0x000000, "Member 'BPCI_StatusEffect_Light_C_OnStartPlaySkeletal::SkeletalMeshComponent' has a wrong offset!");
static_assert(offsetof(BPCI_StatusEffect_Light_C_OnStartPlaySkeletal, bDoesBeginInFirstPerson) == 0x000008, "Member 'BPCI_StatusEffect_Light_C_OnStartPlaySkeletal::bDoesBeginInFirstPerson' has a wrong offset!");
static_assert(offsetof(BPCI_StatusEffect_Light_C_OnStartPlaySkeletal, Value) == 0x00000C, "Member 'BPCI_StatusEffect_Light_C_OnStartPlaySkeletal::Value' has a wrong offset!");
static_assert(offsetof(BPCI_StatusEffect_Light_C_OnStartPlaySkeletal, VFXColors) == 0x000010, "Member 'BPCI_StatusEffect_Light_C_OnStartPlaySkeletal::VFXColors' has a wrong offset!");
static_assert(offsetof(BPCI_StatusEffect_Light_C_OnStartPlaySkeletal, bDoesBeginAsTheOnlyVFX) == 0x000020, "Member 'BPCI_StatusEffect_Light_C_OnStartPlaySkeletal::bDoesBeginAsTheOnlyVFX' has a wrong offset!");
static_assert(offsetof(BPCI_StatusEffect_Light_C_OnStartPlaySkeletal, bIsEnchant) == 0x000021, "Member 'BPCI_StatusEffect_Light_C_OnStartPlaySkeletal::bIsEnchant' has a wrong offset!");
static_assert(offsetof(BPCI_StatusEffect_Light_C_OnStartPlaySkeletal, bIsMainEffect) == 0x000022, "Member 'BPCI_StatusEffect_Light_C_OnStartPlaySkeletal::bIsMainEffect' has a wrong offset!");
static_assert(offsetof(BPCI_StatusEffect_Light_C_OnStartPlaySkeletal, bIsInInventory) == 0x000023, "Member 'BPCI_StatusEffect_Light_C_OnStartPlaySkeletal::bIsInInventory' has a wrong offset!");

// Function BPCI_StatusEffect_Light.BPCI_StatusEffect_Light_C.OnStartPlayStatic
// 0x0028 (0x0028 - 0x0000)
struct BPCI_StatusEffect_Light_C_OnStartPlayStatic final
{
public:
	class UStaticMeshComponent*                   StaticMeshComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bDoesBeginInFirstPerson;                           // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Value;                                             // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FLinearColor>                   VFXColors;                                         // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          bDoesBeginAsTheOnlyVFX;                            // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsEnchant;                                        // 0x0021(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsMainEffect;                                     // 0x0022(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsInInventory;                                    // 0x0023(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPCI_StatusEffect_Light_C_OnStartPlayStatic) == 0x000008, "Wrong alignment on BPCI_StatusEffect_Light_C_OnStartPlayStatic");
static_assert(sizeof(BPCI_StatusEffect_Light_C_OnStartPlayStatic) == 0x000028, "Wrong size on BPCI_StatusEffect_Light_C_OnStartPlayStatic");
static_assert(offsetof(BPCI_StatusEffect_Light_C_OnStartPlayStatic, StaticMeshComponent) == 0x000000, "Member 'BPCI_StatusEffect_Light_C_OnStartPlayStatic::StaticMeshComponent' has a wrong offset!");
static_assert(offsetof(BPCI_StatusEffect_Light_C_OnStartPlayStatic, bDoesBeginInFirstPerson) == 0x000008, "Member 'BPCI_StatusEffect_Light_C_OnStartPlayStatic::bDoesBeginInFirstPerson' has a wrong offset!");
static_assert(offsetof(BPCI_StatusEffect_Light_C_OnStartPlayStatic, Value) == 0x00000C, "Member 'BPCI_StatusEffect_Light_C_OnStartPlayStatic::Value' has a wrong offset!");
static_assert(offsetof(BPCI_StatusEffect_Light_C_OnStartPlayStatic, VFXColors) == 0x000010, "Member 'BPCI_StatusEffect_Light_C_OnStartPlayStatic::VFXColors' has a wrong offset!");
static_assert(offsetof(BPCI_StatusEffect_Light_C_OnStartPlayStatic, bDoesBeginAsTheOnlyVFX) == 0x000020, "Member 'BPCI_StatusEffect_Light_C_OnStartPlayStatic::bDoesBeginAsTheOnlyVFX' has a wrong offset!");
static_assert(offsetof(BPCI_StatusEffect_Light_C_OnStartPlayStatic, bIsEnchant) == 0x000021, "Member 'BPCI_StatusEffect_Light_C_OnStartPlayStatic::bIsEnchant' has a wrong offset!");
static_assert(offsetof(BPCI_StatusEffect_Light_C_OnStartPlayStatic, bIsMainEffect) == 0x000022, "Member 'BPCI_StatusEffect_Light_C_OnStartPlayStatic::bIsMainEffect' has a wrong offset!");
static_assert(offsetof(BPCI_StatusEffect_Light_C_OnStartPlayStatic, bIsInInventory) == 0x000023, "Member 'BPCI_StatusEffect_Light_C_OnStartPlayStatic::bIsInInventory' has a wrong offset!");

// Function BPCI_StatusEffect_Light.BPCI_StatusEffect_Light_C.SetupFakeLightValues
// 0x0008 (0x0008 - 0x0000)
struct BPCI_StatusEffect_Light_C_SetupFakeLightValues final
{
public:
	double                                        SpellMagnitude;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPCI_StatusEffect_Light_C_SetupFakeLightValues) == 0x000008, "Wrong alignment on BPCI_StatusEffect_Light_C_SetupFakeLightValues");
static_assert(sizeof(BPCI_StatusEffect_Light_C_SetupFakeLightValues) == 0x000008, "Wrong size on BPCI_StatusEffect_Light_C_SetupFakeLightValues");
static_assert(offsetof(BPCI_StatusEffect_Light_C_SetupFakeLightValues, SpellMagnitude) == 0x000000, "Member 'BPCI_StatusEffect_Light_C_SetupFakeLightValues::SpellMagnitude' has a wrong offset!");

}

