#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPCI_StatusEffect_NightEyes

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_StatusEffect_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPCI_StatusEffect_NightEyes.BPCI_StatusEffect_NightEyes_C
// 0x0040 (0x0468 - 0x0428)
class ABPCI_StatusEffect_NightEyes_C final : public ABP_StatusEffect_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BPCI_StatusEffect_NightEyes_C;      // 0x0428(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPostProcessComponent*                  PostProcess;                                       // 0x0430(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         PP_Value_1A95508B4DA597B8CE21B98FB50D9FDD;         // 0x0438(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            PP__Direction_1A95508B4DA597B8CE21B98FB50D9FDD;    // 0x043C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43D[0x3];                                      // 0x043D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     PP;                                                // 0x0440(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMaterial*                              PP_mat;                                            // 0x0448(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               PP_Mat_MID;                                        // 0x0450(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFinished;                                        // 0x0458(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_459[0x7];                                      // 0x0459(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        PP_Weight;                                         // 0x0460(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BindControllerMappingSwitch();
	void ExecuteUbergraph_BPCI_StatusEffect_NightEyes(int32 EntryPoint);
	void OnStopPlay();
	void OnSwitchToGameMappings();
	void OnSwitchToUIMappings();
	void PP__FinishedFunc();
	void PP__UpdateFunc();
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPCI_StatusEffect_NightEyes_C">();
	}
	static class ABPCI_StatusEffect_NightEyes_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABPCI_StatusEffect_NightEyes_C>();
	}
};
static_assert(alignof(ABPCI_StatusEffect_NightEyes_C) == 0x000008, "Wrong alignment on ABPCI_StatusEffect_NightEyes_C");
static_assert(sizeof(ABPCI_StatusEffect_NightEyes_C) == 0x000468, "Wrong size on ABPCI_StatusEffect_NightEyes_C");
static_assert(offsetof(ABPCI_StatusEffect_NightEyes_C, UberGraphFrame_BPCI_StatusEffect_NightEyes_C) == 0x000428, "Member 'ABPCI_StatusEffect_NightEyes_C::UberGraphFrame_BPCI_StatusEffect_NightEyes_C' has a wrong offset!");
static_assert(offsetof(ABPCI_StatusEffect_NightEyes_C, PostProcess) == 0x000430, "Member 'ABPCI_StatusEffect_NightEyes_C::PostProcess' has a wrong offset!");
static_assert(offsetof(ABPCI_StatusEffect_NightEyes_C, PP_Value_1A95508B4DA597B8CE21B98FB50D9FDD) == 0x000438, "Member 'ABPCI_StatusEffect_NightEyes_C::PP_Value_1A95508B4DA597B8CE21B98FB50D9FDD' has a wrong offset!");
static_assert(offsetof(ABPCI_StatusEffect_NightEyes_C, PP__Direction_1A95508B4DA597B8CE21B98FB50D9FDD) == 0x00043C, "Member 'ABPCI_StatusEffect_NightEyes_C::PP__Direction_1A95508B4DA597B8CE21B98FB50D9FDD' has a wrong offset!");
static_assert(offsetof(ABPCI_StatusEffect_NightEyes_C, PP) == 0x000440, "Member 'ABPCI_StatusEffect_NightEyes_C::PP' has a wrong offset!");
static_assert(offsetof(ABPCI_StatusEffect_NightEyes_C, PP_mat) == 0x000448, "Member 'ABPCI_StatusEffect_NightEyes_C::PP_mat' has a wrong offset!");
static_assert(offsetof(ABPCI_StatusEffect_NightEyes_C, PP_Mat_MID) == 0x000450, "Member 'ABPCI_StatusEffect_NightEyes_C::PP_Mat_MID' has a wrong offset!");
static_assert(offsetof(ABPCI_StatusEffect_NightEyes_C, IsFinished) == 0x000458, "Member 'ABPCI_StatusEffect_NightEyes_C::IsFinished' has a wrong offset!");
static_assert(offsetof(ABPCI_StatusEffect_NightEyes_C, PP_Weight) == 0x000460, "Member 'ABPCI_StatusEffect_NightEyes_C::PP_Weight' has a wrong offset!");

}

