#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPCI_StatusEffect_Light

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_StatusEffect_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPCI_StatusEffect_Light.BPCI_StatusEffect_Light_C
// 0x0040 (0x0468 - 0x0428)
class ABPCI_StatusEffect_Light_C final : public ABP_StatusEffect_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BPCI_StatusEffect_Light_C;          // 0x0428(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVDetectionLightingProfileComponent*    VDetectionLightingProfile;                         // 0x0430(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UVDetectionLightingFakePointLightComponent* VDetectionLightingFakePointLight;              // 0x0438(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USplineComponent*                       Spline;                                            // 0x0440(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Niagara_VFX;                                       // 0x0448(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        LightMagnitudeIntensityMultiplier;                 // 0x0450(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LightMagnitudeDistanceAttenuationMult;             // 0x0458(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          MagnitudeAffectsLightIntensity;                    // 0x0460(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BPCI_StatusEffect_Light(int32 EntryPoint);
	void OnStartPlaySkeletal(class USkeletalMeshComponent* SkeletalMeshComponent, bool bDoesBeginInFirstPerson, float Value, const TArray<struct FLinearColor>& VFXColors, bool bDoesBeginAsTheOnlyVFX, bool bIsEnchant, bool bIsMainEffect, bool bIsInInventory);
	void OnStartPlayStatic(class UStaticMeshComponent* StaticMeshComponent, bool bDoesBeginInFirstPerson, float Value, const TArray<struct FLinearColor>& VFXColors, bool bDoesBeginAsTheOnlyVFX, bool bIsEnchant, bool bIsMainEffect, bool bIsInInventory);
	void SetupFakeLightValues(double SpellMagnitude);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPCI_StatusEffect_Light_C">();
	}
	static class ABPCI_StatusEffect_Light_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABPCI_StatusEffect_Light_C>();
	}
};
static_assert(alignof(ABPCI_StatusEffect_Light_C) == 0x000008, "Wrong alignment on ABPCI_StatusEffect_Light_C");
static_assert(sizeof(ABPCI_StatusEffect_Light_C) == 0x000468, "Wrong size on ABPCI_StatusEffect_Light_C");
static_assert(offsetof(ABPCI_StatusEffect_Light_C, UberGraphFrame_BPCI_StatusEffect_Light_C) == 0x000428, "Member 'ABPCI_StatusEffect_Light_C::UberGraphFrame_BPCI_StatusEffect_Light_C' has a wrong offset!");
static_assert(offsetof(ABPCI_StatusEffect_Light_C, VDetectionLightingProfile) == 0x000430, "Member 'ABPCI_StatusEffect_Light_C::VDetectionLightingProfile' has a wrong offset!");
static_assert(offsetof(ABPCI_StatusEffect_Light_C, VDetectionLightingFakePointLight) == 0x000438, "Member 'ABPCI_StatusEffect_Light_C::VDetectionLightingFakePointLight' has a wrong offset!");
static_assert(offsetof(ABPCI_StatusEffect_Light_C, Spline) == 0x000440, "Member 'ABPCI_StatusEffect_Light_C::Spline' has a wrong offset!");
static_assert(offsetof(ABPCI_StatusEffect_Light_C, Niagara_VFX) == 0x000448, "Member 'ABPCI_StatusEffect_Light_C::Niagara_VFX' has a wrong offset!");
static_assert(offsetof(ABPCI_StatusEffect_Light_C, LightMagnitudeIntensityMultiplier) == 0x000450, "Member 'ABPCI_StatusEffect_Light_C::LightMagnitudeIntensityMultiplier' has a wrong offset!");
static_assert(offsetof(ABPCI_StatusEffect_Light_C, LightMagnitudeDistanceAttenuationMult) == 0x000458, "Member 'ABPCI_StatusEffect_Light_C::LightMagnitudeDistanceAttenuationMult' has a wrong offset!");
static_assert(offsetof(ABPCI_StatusEffect_Light_C, MagnitudeAffectsLightIntensity) == 0x000460, "Member 'ABPCI_StatusEffect_Light_C::MagnitudeAffectsLightIntensity' has a wrong offset!");

}

