#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPFL_VFXFunctionLibrary

#include "Basic.hpp"

#include "ENiagara_FadingMode_structs.hpp"
#include "ENiagara_CharacterSockets_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BPFL_VFXFunctionLibrary.BPFL_VFXFunctionLibrary_C.Activate Actor Component
// 0x0018 (0x0018 - 0x0000)
struct BPFL_VFXFunctionLibrary_C_Activate_Actor_Component final
{
public:
	class UActorComponent*                        Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Reset;                                             // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Condition;                                         // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_VFXFunctionLibrary_C_Activate_Actor_Component) == 0x000008, "Wrong alignment on BPFL_VFXFunctionLibrary_C_Activate_Actor_Component");
static_assert(sizeof(BPFL_VFXFunctionLibrary_C_Activate_Actor_Component) == 0x000018, "Wrong size on BPFL_VFXFunctionLibrary_C_Activate_Actor_Component");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Activate_Actor_Component, Target) == 0x000000, "Member 'BPFL_VFXFunctionLibrary_C_Activate_Actor_Component::Target' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Activate_Actor_Component, Reset) == 0x000008, "Member 'BPFL_VFXFunctionLibrary_C_Activate_Actor_Component::Reset' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Activate_Actor_Component, Condition) == 0x000009, "Member 'BPFL_VFXFunctionLibrary_C_Activate_Actor_Component::Condition' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Activate_Actor_Component, __WorldContext) == 0x000010, "Member 'BPFL_VFXFunctionLibrary_C_Activate_Actor_Component::__WorldContext' has a wrong offset!");

// Function BPFL_VFXFunctionLibrary.BPFL_VFXFunctionLibrary_C.Activate Niagara System
// 0x0018 (0x0018 - 0x0000)
struct BPFL_VFXFunctionLibrary_C_Activate_Niagara_System final
{
public:
	class UNiagaraComponent*                      System;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Condition;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_VFXFunctionLibrary_C_Activate_Niagara_System) == 0x000008, "Wrong alignment on BPFL_VFXFunctionLibrary_C_Activate_Niagara_System");
static_assert(sizeof(BPFL_VFXFunctionLibrary_C_Activate_Niagara_System) == 0x000018, "Wrong size on BPFL_VFXFunctionLibrary_C_Activate_Niagara_System");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Activate_Niagara_System, System) == 0x000000, "Member 'BPFL_VFXFunctionLibrary_C_Activate_Niagara_System::System' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Activate_Niagara_System, Condition) == 0x000008, "Member 'BPFL_VFXFunctionLibrary_C_Activate_Niagara_System::Condition' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Activate_Niagara_System, __WorldContext) == 0x000010, "Member 'BPFL_VFXFunctionLibrary_C_Activate_Niagara_System::__WorldContext' has a wrong offset!");

// Function BPFL_VFXFunctionLibrary.BPFL_VFXFunctionLibrary_C.Activate Niagara System Array
// 0x0050 (0x0050 - 0x0000)
struct BPFL_VFXFunctionLibrary_C_Activate_Niagara_System_Array final
{
public:
	TArray<class UNiagaraComponent*>              System_Array;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<bool>                                  Condition;                                         // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Get_Item_1;                         // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_VFXFunctionLibrary_C_Activate_Niagara_System_Array) == 0x000008, "Wrong alignment on BPFL_VFXFunctionLibrary_C_Activate_Niagara_System_Array");
static_assert(sizeof(BPFL_VFXFunctionLibrary_C_Activate_Niagara_System_Array) == 0x000050, "Wrong size on BPFL_VFXFunctionLibrary_C_Activate_Niagara_System_Array");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Activate_Niagara_System_Array, System_Array) == 0x000000, "Member 'BPFL_VFXFunctionLibrary_C_Activate_Niagara_System_Array::System_Array' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Activate_Niagara_System_Array, Condition) == 0x000010, "Member 'BPFL_VFXFunctionLibrary_C_Activate_Niagara_System_Array::Condition' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Activate_Niagara_System_Array, __WorldContext) == 0x000020, "Member 'BPFL_VFXFunctionLibrary_C_Activate_Niagara_System_Array::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Activate_Niagara_System_Array, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BPFL_VFXFunctionLibrary_C_Activate_Niagara_System_Array::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Activate_Niagara_System_Array, Temp_int_Array_Index_Variable) == 0x00002C, "Member 'BPFL_VFXFunctionLibrary_C_Activate_Niagara_System_Array::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Activate_Niagara_System_Array, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'BPFL_VFXFunctionLibrary_C_Activate_Niagara_System_Array::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Activate_Niagara_System_Array, CallFunc_Array_Get_Item) == 0x000038, "Member 'BPFL_VFXFunctionLibrary_C_Activate_Niagara_System_Array::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Activate_Niagara_System_Array, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'BPFL_VFXFunctionLibrary_C_Activate_Niagara_System_Array::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Activate_Niagara_System_Array, CallFunc_Add_IntInt_ReturnValue) == 0x000044, "Member 'BPFL_VFXFunctionLibrary_C_Activate_Niagara_System_Array::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Activate_Niagara_System_Array, CallFunc_Array_Get_Item_1) == 0x000048, "Member 'BPFL_VFXFunctionLibrary_C_Activate_Niagara_System_Array::CallFunc_Array_Get_Item_1' has a wrong offset!");

// Function BPFL_VFXFunctionLibrary.BPFL_VFXFunctionLibrary_C.Deactivate Actor Component
// 0x0018 (0x0018 - 0x0000)
struct BPFL_VFXFunctionLibrary_C_Deactivate_Actor_Component final
{
public:
	class UActorComponent*                        Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Condition;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_VFXFunctionLibrary_C_Deactivate_Actor_Component) == 0x000008, "Wrong alignment on BPFL_VFXFunctionLibrary_C_Deactivate_Actor_Component");
static_assert(sizeof(BPFL_VFXFunctionLibrary_C_Deactivate_Actor_Component) == 0x000018, "Wrong size on BPFL_VFXFunctionLibrary_C_Deactivate_Actor_Component");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Deactivate_Actor_Component, Target) == 0x000000, "Member 'BPFL_VFXFunctionLibrary_C_Deactivate_Actor_Component::Target' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Deactivate_Actor_Component, Condition) == 0x000008, "Member 'BPFL_VFXFunctionLibrary_C_Deactivate_Actor_Component::Condition' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Deactivate_Actor_Component, __WorldContext) == 0x000010, "Member 'BPFL_VFXFunctionLibrary_C_Deactivate_Actor_Component::__WorldContext' has a wrong offset!");

// Function BPFL_VFXFunctionLibrary.BPFL_VFXFunctionLibrary_C.Debug_NiagaraBoxLocation
// 0x0050 (0x0050 - 0x0000)
struct BPFL_VFXFunctionLibrary_C_Debug_NiagaraBoxLocation final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      Debug_System;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Parent_BoxLocation;                                // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Parent_BoxOffset;                                  // 0x0028(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEditor_ReturnValue;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_VFXFunctionLibrary_C_Debug_NiagaraBoxLocation) == 0x000008, "Wrong alignment on BPFL_VFXFunctionLibrary_C_Debug_NiagaraBoxLocation");
static_assert(sizeof(BPFL_VFXFunctionLibrary_C_Debug_NiagaraBoxLocation) == 0x000050, "Wrong size on BPFL_VFXFunctionLibrary_C_Debug_NiagaraBoxLocation");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Debug_NiagaraBoxLocation, Enable) == 0x000000, "Member 'BPFL_VFXFunctionLibrary_C_Debug_NiagaraBoxLocation::Enable' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Debug_NiagaraBoxLocation, Debug_System) == 0x000008, "Member 'BPFL_VFXFunctionLibrary_C_Debug_NiagaraBoxLocation::Debug_System' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Debug_NiagaraBoxLocation, Parent_BoxLocation) == 0x000010, "Member 'BPFL_VFXFunctionLibrary_C_Debug_NiagaraBoxLocation::Parent_BoxLocation' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Debug_NiagaraBoxLocation, Parent_BoxOffset) == 0x000028, "Member 'BPFL_VFXFunctionLibrary_C_Debug_NiagaraBoxLocation::Parent_BoxOffset' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Debug_NiagaraBoxLocation, __WorldContext) == 0x000040, "Member 'BPFL_VFXFunctionLibrary_C_Debug_NiagaraBoxLocation::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Debug_NiagaraBoxLocation, CallFunc_IsEditor_ReturnValue) == 0x000048, "Member 'BPFL_VFXFunctionLibrary_C_Debug_NiagaraBoxLocation::CallFunc_IsEditor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Debug_NiagaraBoxLocation, CallFunc_BooleanAND_ReturnValue) == 0x000049, "Member 'BPFL_VFXFunctionLibrary_C_Debug_NiagaraBoxLocation::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BPFL_VFXFunctionLibrary.BPFL_VFXFunctionLibrary_C.Debug_NiagaraCylinderLocation
// 0x0068 (0x0068 - 0x0000)
struct BPFL_VFXFunctionLibrary_C_Debug_NiagaraCylinderLocation final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      Debug_System;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        Parent_Cylinder_Radius;                            // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Parent_Cylinder_Height;                            // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Parent_Cylinder_Scale;                             // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Parent_Cylinder_Offset;                            // 0x0038(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0050(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEditor_ReturnValue;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x2];                                       // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast;    // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast_1;  // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_VFXFunctionLibrary_C_Debug_NiagaraCylinderLocation) == 0x000008, "Wrong alignment on BPFL_VFXFunctionLibrary_C_Debug_NiagaraCylinderLocation");
static_assert(sizeof(BPFL_VFXFunctionLibrary_C_Debug_NiagaraCylinderLocation) == 0x000068, "Wrong size on BPFL_VFXFunctionLibrary_C_Debug_NiagaraCylinderLocation");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Debug_NiagaraCylinderLocation, Enable) == 0x000000, "Member 'BPFL_VFXFunctionLibrary_C_Debug_NiagaraCylinderLocation::Enable' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Debug_NiagaraCylinderLocation, Debug_System) == 0x000008, "Member 'BPFL_VFXFunctionLibrary_C_Debug_NiagaraCylinderLocation::Debug_System' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Debug_NiagaraCylinderLocation, Parent_Cylinder_Radius) == 0x000010, "Member 'BPFL_VFXFunctionLibrary_C_Debug_NiagaraCylinderLocation::Parent_Cylinder_Radius' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Debug_NiagaraCylinderLocation, Parent_Cylinder_Height) == 0x000018, "Member 'BPFL_VFXFunctionLibrary_C_Debug_NiagaraCylinderLocation::Parent_Cylinder_Height' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Debug_NiagaraCylinderLocation, Parent_Cylinder_Scale) == 0x000020, "Member 'BPFL_VFXFunctionLibrary_C_Debug_NiagaraCylinderLocation::Parent_Cylinder_Scale' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Debug_NiagaraCylinderLocation, Parent_Cylinder_Offset) == 0x000038, "Member 'BPFL_VFXFunctionLibrary_C_Debug_NiagaraCylinderLocation::Parent_Cylinder_Offset' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Debug_NiagaraCylinderLocation, __WorldContext) == 0x000050, "Member 'BPFL_VFXFunctionLibrary_C_Debug_NiagaraCylinderLocation::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Debug_NiagaraCylinderLocation, CallFunc_IsEditor_ReturnValue) == 0x000058, "Member 'BPFL_VFXFunctionLibrary_C_Debug_NiagaraCylinderLocation::CallFunc_IsEditor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Debug_NiagaraCylinderLocation, CallFunc_BooleanAND_ReturnValue) == 0x000059, "Member 'BPFL_VFXFunctionLibrary_C_Debug_NiagaraCylinderLocation::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Debug_NiagaraCylinderLocation, CallFunc_SetVariableFloat_InValue_ImplicitCast) == 0x00005C, "Member 'BPFL_VFXFunctionLibrary_C_Debug_NiagaraCylinderLocation::CallFunc_SetVariableFloat_InValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Debug_NiagaraCylinderLocation, CallFunc_SetVariableFloat_InValue_ImplicitCast_1) == 0x000060, "Member 'BPFL_VFXFunctionLibrary_C_Debug_NiagaraCylinderLocation::CallFunc_SetVariableFloat_InValue_ImplicitCast_1' has a wrong offset!");

// Function BPFL_VFXFunctionLibrary.BPFL_VFXFunctionLibrary_C.Debug_NiagaraSphereLocation
// 0x0058 (0x0058 - 0x0000)
struct BPFL_VFXFunctionLibrary_C_Debug_NiagaraSphereLocation final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      Debug_System;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        Parent_Sphere_Radius;                              // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Parent_Sphere_Scale;                               // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Parent_Sphere_Offset;                              // 0x0030(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0048(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEditor_ReturnValue;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x2];                                       // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast;    // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_VFXFunctionLibrary_C_Debug_NiagaraSphereLocation) == 0x000008, "Wrong alignment on BPFL_VFXFunctionLibrary_C_Debug_NiagaraSphereLocation");
static_assert(sizeof(BPFL_VFXFunctionLibrary_C_Debug_NiagaraSphereLocation) == 0x000058, "Wrong size on BPFL_VFXFunctionLibrary_C_Debug_NiagaraSphereLocation");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Debug_NiagaraSphereLocation, Enable) == 0x000000, "Member 'BPFL_VFXFunctionLibrary_C_Debug_NiagaraSphereLocation::Enable' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Debug_NiagaraSphereLocation, Debug_System) == 0x000008, "Member 'BPFL_VFXFunctionLibrary_C_Debug_NiagaraSphereLocation::Debug_System' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Debug_NiagaraSphereLocation, Parent_Sphere_Radius) == 0x000010, "Member 'BPFL_VFXFunctionLibrary_C_Debug_NiagaraSphereLocation::Parent_Sphere_Radius' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Debug_NiagaraSphereLocation, Parent_Sphere_Scale) == 0x000018, "Member 'BPFL_VFXFunctionLibrary_C_Debug_NiagaraSphereLocation::Parent_Sphere_Scale' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Debug_NiagaraSphereLocation, Parent_Sphere_Offset) == 0x000030, "Member 'BPFL_VFXFunctionLibrary_C_Debug_NiagaraSphereLocation::Parent_Sphere_Offset' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Debug_NiagaraSphereLocation, __WorldContext) == 0x000048, "Member 'BPFL_VFXFunctionLibrary_C_Debug_NiagaraSphereLocation::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Debug_NiagaraSphereLocation, CallFunc_IsEditor_ReturnValue) == 0x000050, "Member 'BPFL_VFXFunctionLibrary_C_Debug_NiagaraSphereLocation::CallFunc_IsEditor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Debug_NiagaraSphereLocation, CallFunc_BooleanAND_ReturnValue) == 0x000051, "Member 'BPFL_VFXFunctionLibrary_C_Debug_NiagaraSphereLocation::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Debug_NiagaraSphereLocation, CallFunc_SetVariableFloat_InValue_ImplicitCast) == 0x000054, "Member 'BPFL_VFXFunctionLibrary_C_Debug_NiagaraSphereLocation::CallFunc_SetVariableFloat_InValue_ImplicitCast' has a wrong offset!");

// Function BPFL_VFXFunctionLibrary.BPFL_VFXFunctionLibrary_C.Get Actor Component Location Data
// 0x0188 (0x0188 - 0x0000)
struct BPFL_VFXFunctionLibrary_C_Get_Actor_Component_Location_Data final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Component_Class;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Is_Player;                                         // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Root_Location;                                     // 0x0020(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MidPoint_Location;                                 // 0x0038(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Height;                                            // 0x0050(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Width;                                             // 0x0058(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Depth;                                             // 0x0060(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Actor_Root_Location;                               // 0x0068(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Actor_MidPoint_Location;                           // 0x0080(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Actor_Depth;                                       // 0x0098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Actor_Width;                                       // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Actor_Height;                                      // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Is_Player_Actor;                                   // 0x00B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Target_Actor;                                      // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Is_Player_Actor_Is_Player;                // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C2[0x6];                                       // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AVOblivionPlayerCharacter*              CallFunc_Is_Player_Actor_AsVOblivion_Player_Character; // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_GetComponentByClass_ReturnValue;          // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_Origin;                // 0x00F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent;             // 0x0108(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius;          // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0148(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0160(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_VFXFunctionLibrary_C_Get_Actor_Component_Location_Data) == 0x000008, "Wrong alignment on BPFL_VFXFunctionLibrary_C_Get_Actor_Component_Location_Data");
static_assert(sizeof(BPFL_VFXFunctionLibrary_C_Get_Actor_Component_Location_Data) == 0x000188, "Wrong size on BPFL_VFXFunctionLibrary_C_Get_Actor_Component_Location_Data");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Get_Actor_Component_Location_Data, Target) == 0x000000, "Member 'BPFL_VFXFunctionLibrary_C_Get_Actor_Component_Location_Data::Target' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Get_Actor_Component_Location_Data, Component_Class) == 0x000008, "Member 'BPFL_VFXFunctionLibrary_C_Get_Actor_Component_Location_Data::Component_Class' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Get_Actor_Component_Location_Data, __WorldContext) == 0x000010, "Member 'BPFL_VFXFunctionLibrary_C_Get_Actor_Component_Location_Data::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Get_Actor_Component_Location_Data, Is_Player) == 0x000018, "Member 'BPFL_VFXFunctionLibrary_C_Get_Actor_Component_Location_Data::Is_Player' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Get_Actor_Component_Location_Data, Root_Location) == 0x000020, "Member 'BPFL_VFXFunctionLibrary_C_Get_Actor_Component_Location_Data::Root_Location' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Get_Actor_Component_Location_Data, MidPoint_Location) == 0x000038, "Member 'BPFL_VFXFunctionLibrary_C_Get_Actor_Component_Location_Data::MidPoint_Location' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Get_Actor_Component_Location_Data, Height) == 0x000050, "Member 'BPFL_VFXFunctionLibrary_C_Get_Actor_Component_Location_Data::Height' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Get_Actor_Component_Location_Data, Width) == 0x000058, "Member 'BPFL_VFXFunctionLibrary_C_Get_Actor_Component_Location_Data::Width' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Get_Actor_Component_Location_Data, Depth) == 0x000060, "Member 'BPFL_VFXFunctionLibrary_C_Get_Actor_Component_Location_Data::Depth' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Get_Actor_Component_Location_Data, Actor_Root_Location) == 0x000068, "Member 'BPFL_VFXFunctionLibrary_C_Get_Actor_Component_Location_Data::Actor_Root_Location' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Get_Actor_Component_Location_Data, Actor_MidPoint_Location) == 0x000080, "Member 'BPFL_VFXFunctionLibrary_C_Get_Actor_Component_Location_Data::Actor_MidPoint_Location' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Get_Actor_Component_Location_Data, Actor_Depth) == 0x000098, "Member 'BPFL_VFXFunctionLibrary_C_Get_Actor_Component_Location_Data::Actor_Depth' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Get_Actor_Component_Location_Data, Actor_Width) == 0x0000A0, "Member 'BPFL_VFXFunctionLibrary_C_Get_Actor_Component_Location_Data::Actor_Width' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Get_Actor_Component_Location_Data, Actor_Height) == 0x0000A8, "Member 'BPFL_VFXFunctionLibrary_C_Get_Actor_Component_Location_Data::Actor_Height' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Get_Actor_Component_Location_Data, Is_Player_Actor) == 0x0000B0, "Member 'BPFL_VFXFunctionLibrary_C_Get_Actor_Component_Location_Data::Is_Player_Actor' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Get_Actor_Component_Location_Data, Target_Actor) == 0x0000B8, "Member 'BPFL_VFXFunctionLibrary_C_Get_Actor_Component_Location_Data::Target_Actor' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Get_Actor_Component_Location_Data, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x0000C0, "Member 'BPFL_VFXFunctionLibrary_C_Get_Actor_Component_Location_Data::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Get_Actor_Component_Location_Data, CallFunc_Is_Player_Actor_Is_Player) == 0x0000C1, "Member 'BPFL_VFXFunctionLibrary_C_Get_Actor_Component_Location_Data::CallFunc_Is_Player_Actor_Is_Player' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Get_Actor_Component_Location_Data, CallFunc_Is_Player_Actor_AsVOblivion_Player_Character) == 0x0000C8, "Member 'BPFL_VFXFunctionLibrary_C_Get_Actor_Component_Location_Data::CallFunc_Is_Player_Actor_AsVOblivion_Player_Character' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Get_Actor_Component_Location_Data, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000D0, "Member 'BPFL_VFXFunctionLibrary_C_Get_Actor_Component_Location_Data::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Get_Actor_Component_Location_Data, CallFunc_GetComponentByClass_ReturnValue) == 0x0000E8, "Member 'BPFL_VFXFunctionLibrary_C_Get_Actor_Component_Location_Data::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Get_Actor_Component_Location_Data, CallFunc_GetComponentBounds_Origin) == 0x0000F0, "Member 'BPFL_VFXFunctionLibrary_C_Get_Actor_Component_Location_Data::CallFunc_GetComponentBounds_Origin' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Get_Actor_Component_Location_Data, CallFunc_GetComponentBounds_BoxExtent) == 0x000108, "Member 'BPFL_VFXFunctionLibrary_C_Get_Actor_Component_Location_Data::CallFunc_GetComponentBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Get_Actor_Component_Location_Data, CallFunc_GetComponentBounds_SphereRadius) == 0x000120, "Member 'BPFL_VFXFunctionLibrary_C_Get_Actor_Component_Location_Data::CallFunc_GetComponentBounds_SphereRadius' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Get_Actor_Component_Location_Data, CallFunc_BreakVector_X) == 0x000128, "Member 'BPFL_VFXFunctionLibrary_C_Get_Actor_Component_Location_Data::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Get_Actor_Component_Location_Data, CallFunc_BreakVector_Y) == 0x000130, "Member 'BPFL_VFXFunctionLibrary_C_Get_Actor_Component_Location_Data::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Get_Actor_Component_Location_Data, CallFunc_BreakVector_Z) == 0x000138, "Member 'BPFL_VFXFunctionLibrary_C_Get_Actor_Component_Location_Data::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Get_Actor_Component_Location_Data, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000140, "Member 'BPFL_VFXFunctionLibrary_C_Get_Actor_Component_Location_Data::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Get_Actor_Component_Location_Data, CallFunc_MakeVector_ReturnValue) == 0x000148, "Member 'BPFL_VFXFunctionLibrary_C_Get_Actor_Component_Location_Data::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Get_Actor_Component_Location_Data, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000160, "Member 'BPFL_VFXFunctionLibrary_C_Get_Actor_Component_Location_Data::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Get_Actor_Component_Location_Data, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000178, "Member 'BPFL_VFXFunctionLibrary_C_Get_Actor_Component_Location_Data::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Get_Actor_Component_Location_Data, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000180, "Member 'BPFL_VFXFunctionLibrary_C_Get_Actor_Component_Location_Data::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");

// Function BPFL_VFXFunctionLibrary.BPFL_VFXFunctionLibrary_C.Get Actor Skeletal Component Location Data
// 0x0170 (0x0170 - 0x0000)
struct BPFL_VFXFunctionLibrary_C_Get_Actor_Skeletal_Component_Location_Data final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Is_Player;                                         // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Root_Location;                                     // 0x0018(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MidPoint_Location;                                 // 0x0030(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Height;                                            // 0x0048(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Width;                                             // 0x0050(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Depth;                                             // 0x0058(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Actor_Root_Location;                               // 0x0060(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Actor_MidPoint_Location;                           // 0x0078(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Actor_Depth;                                       // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Actor_Width;                                       // 0x0098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Actor_Height;                                      // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Is_Player_Actor;                                   // 0x00A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Is_Player_Actor_Is_Player;                // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AA[0x6];                                       // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AVOblivionPlayerCharacter*              CallFunc_Is_Player_Actor_AsVOblivion_Player_Character; // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetComponentByClass_ReturnValue;          // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_Origin;                // 0x00D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent;             // 0x00F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius;          // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0128(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0148(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_VFXFunctionLibrary_C_Get_Actor_Skeletal_Component_Location_Data) == 0x000008, "Wrong alignment on BPFL_VFXFunctionLibrary_C_Get_Actor_Skeletal_Component_Location_Data");
static_assert(sizeof(BPFL_VFXFunctionLibrary_C_Get_Actor_Skeletal_Component_Location_Data) == 0x000170, "Wrong size on BPFL_VFXFunctionLibrary_C_Get_Actor_Skeletal_Component_Location_Data");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Get_Actor_Skeletal_Component_Location_Data, Target) == 0x000000, "Member 'BPFL_VFXFunctionLibrary_C_Get_Actor_Skeletal_Component_Location_Data::Target' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Get_Actor_Skeletal_Component_Location_Data, __WorldContext) == 0x000008, "Member 'BPFL_VFXFunctionLibrary_C_Get_Actor_Skeletal_Component_Location_Data::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Get_Actor_Skeletal_Component_Location_Data, Is_Player) == 0x000010, "Member 'BPFL_VFXFunctionLibrary_C_Get_Actor_Skeletal_Component_Location_Data::Is_Player' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Get_Actor_Skeletal_Component_Location_Data, Root_Location) == 0x000018, "Member 'BPFL_VFXFunctionLibrary_C_Get_Actor_Skeletal_Component_Location_Data::Root_Location' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Get_Actor_Skeletal_Component_Location_Data, MidPoint_Location) == 0x000030, "Member 'BPFL_VFXFunctionLibrary_C_Get_Actor_Skeletal_Component_Location_Data::MidPoint_Location' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Get_Actor_Skeletal_Component_Location_Data, Height) == 0x000048, "Member 'BPFL_VFXFunctionLibrary_C_Get_Actor_Skeletal_Component_Location_Data::Height' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Get_Actor_Skeletal_Component_Location_Data, Width) == 0x000050, "Member 'BPFL_VFXFunctionLibrary_C_Get_Actor_Skeletal_Component_Location_Data::Width' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Get_Actor_Skeletal_Component_Location_Data, Depth) == 0x000058, "Member 'BPFL_VFXFunctionLibrary_C_Get_Actor_Skeletal_Component_Location_Data::Depth' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Get_Actor_Skeletal_Component_Location_Data, Actor_Root_Location) == 0x000060, "Member 'BPFL_VFXFunctionLibrary_C_Get_Actor_Skeletal_Component_Location_Data::Actor_Root_Location' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Get_Actor_Skeletal_Component_Location_Data, Actor_MidPoint_Location) == 0x000078, "Member 'BPFL_VFXFunctionLibrary_C_Get_Actor_Skeletal_Component_Location_Data::Actor_MidPoint_Location' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Get_Actor_Skeletal_Component_Location_Data, Actor_Depth) == 0x000090, "Member 'BPFL_VFXFunctionLibrary_C_Get_Actor_Skeletal_Component_Location_Data::Actor_Depth' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Get_Actor_Skeletal_Component_Location_Data, Actor_Width) == 0x000098, "Member 'BPFL_VFXFunctionLibrary_C_Get_Actor_Skeletal_Component_Location_Data::Actor_Width' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Get_Actor_Skeletal_Component_Location_Data, Actor_Height) == 0x0000A0, "Member 'BPFL_VFXFunctionLibrary_C_Get_Actor_Skeletal_Component_Location_Data::Actor_Height' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Get_Actor_Skeletal_Component_Location_Data, Is_Player_Actor) == 0x0000A8, "Member 'BPFL_VFXFunctionLibrary_C_Get_Actor_Skeletal_Component_Location_Data::Is_Player_Actor' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Get_Actor_Skeletal_Component_Location_Data, CallFunc_Is_Player_Actor_Is_Player) == 0x0000A9, "Member 'BPFL_VFXFunctionLibrary_C_Get_Actor_Skeletal_Component_Location_Data::CallFunc_Is_Player_Actor_Is_Player' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Get_Actor_Skeletal_Component_Location_Data, CallFunc_Is_Player_Actor_AsVOblivion_Player_Character) == 0x0000B0, "Member 'BPFL_VFXFunctionLibrary_C_Get_Actor_Skeletal_Component_Location_Data::CallFunc_Is_Player_Actor_AsVOblivion_Player_Character' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Get_Actor_Skeletal_Component_Location_Data, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000B8, "Member 'BPFL_VFXFunctionLibrary_C_Get_Actor_Skeletal_Component_Location_Data::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Get_Actor_Skeletal_Component_Location_Data, CallFunc_GetComponentByClass_ReturnValue) == 0x0000D0, "Member 'BPFL_VFXFunctionLibrary_C_Get_Actor_Skeletal_Component_Location_Data::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Get_Actor_Skeletal_Component_Location_Data, CallFunc_GetComponentBounds_Origin) == 0x0000D8, "Member 'BPFL_VFXFunctionLibrary_C_Get_Actor_Skeletal_Component_Location_Data::CallFunc_GetComponentBounds_Origin' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Get_Actor_Skeletal_Component_Location_Data, CallFunc_GetComponentBounds_BoxExtent) == 0x0000F0, "Member 'BPFL_VFXFunctionLibrary_C_Get_Actor_Skeletal_Component_Location_Data::CallFunc_GetComponentBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Get_Actor_Skeletal_Component_Location_Data, CallFunc_GetComponentBounds_SphereRadius) == 0x000108, "Member 'BPFL_VFXFunctionLibrary_C_Get_Actor_Skeletal_Component_Location_Data::CallFunc_GetComponentBounds_SphereRadius' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Get_Actor_Skeletal_Component_Location_Data, CallFunc_BreakVector_X) == 0x000110, "Member 'BPFL_VFXFunctionLibrary_C_Get_Actor_Skeletal_Component_Location_Data::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Get_Actor_Skeletal_Component_Location_Data, CallFunc_BreakVector_Y) == 0x000118, "Member 'BPFL_VFXFunctionLibrary_C_Get_Actor_Skeletal_Component_Location_Data::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Get_Actor_Skeletal_Component_Location_Data, CallFunc_BreakVector_Z) == 0x000120, "Member 'BPFL_VFXFunctionLibrary_C_Get_Actor_Skeletal_Component_Location_Data::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Get_Actor_Skeletal_Component_Location_Data, CallFunc_MakeVector_ReturnValue) == 0x000128, "Member 'BPFL_VFXFunctionLibrary_C_Get_Actor_Skeletal_Component_Location_Data::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Get_Actor_Skeletal_Component_Location_Data, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000140, "Member 'BPFL_VFXFunctionLibrary_C_Get_Actor_Skeletal_Component_Location_Data::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Get_Actor_Skeletal_Component_Location_Data, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000148, "Member 'BPFL_VFXFunctionLibrary_C_Get_Actor_Skeletal_Component_Location_Data::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Get_Actor_Skeletal_Component_Location_Data, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000160, "Member 'BPFL_VFXFunctionLibrary_C_Get_Actor_Skeletal_Component_Location_Data::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_VFXFunctionLibrary_C_Get_Actor_Skeletal_Component_Location_Data, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000168, "Member 'BPFL_VFXFunctionLibrary_C_Get_Actor_Skeletal_Component_Location_Data::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");

// Function BPFL_VFXFunctionLibrary.BPFL_VFXFunctionLibrary_C.Get Character VFX Socket Location
// 0x0138 (0x0138 - 0x0000)
struct BPFL_VFXFunctionLibrary_C_Get_Character_VFX_Socket_Location final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ENiagara_CharacterSockets                     Socket_Selection;                                  // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0018(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetComponentByClass_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_1;                              // 0x0064(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_2;                              // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_3;                              // 0x007C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENiagara_CharacterSockets                     Temp_byte_Variable;                                // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
