#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPL_UI_Utility

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BPL_UI_Utility.BPL_UI_Utility_C.Get Value Text
// 0x0108 (0x0108 - 0x0000)
struct BPL_UI_Utility_C_Get_Value_Text final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ValueLimit;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   FinalText;                                         // 0x0018(0x0018)(Parm, OutParm)
	bool                                          Temp_bool_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_2;                               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x0050(0x0018)()
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0070(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00C0(0x0010)(ReferenceParm)
	int32                                         K2Node_Select_Default_1;                           // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00D8(0x0018)()
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue_1;          // 0x00F0(0x0018)()
};
static_assert(alignof(BPL_UI_Utility_C_Get_Value_Text) == 0x000008, "Wrong alignment on BPL_UI_Utility_C_Get_Value_Text");
static_assert(sizeof(BPL_UI_Utility_C_Get_Value_Text) == 0x000108, "Wrong size on BPL_UI_Utility_C_Get_Value_Text");
static_assert(offsetof(BPL_UI_Utility_C_Get_Value_Text, Value) == 0x000000, "Member 'BPL_UI_Utility_C_Get_Value_Text::Value' has a wrong offset!");
static_assert(offsetof(BPL_UI_Utility_C_Get_Value_Text, ValueLimit) == 0x000008, "Member 'BPL_UI_Utility_C_Get_Value_Text::ValueLimit' has a wrong offset!");
static_assert(offsetof(BPL_UI_Utility_C_Get_Value_Text, __WorldContext) == 0x000010, "Member 'BPL_UI_Utility_C_Get_Value_Text::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPL_UI_Utility_C_Get_Value_Text, FinalText) == 0x000018, "Member 'BPL_UI_Utility_C_Get_Value_Text::FinalText' has a wrong offset!");
static_assert(offsetof(BPL_UI_Utility_C_Get_Value_Text, Temp_bool_Variable) == 0x000030, "Member 'BPL_UI_Utility_C_Get_Value_Text::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BPL_UI_Utility_C_Get_Value_Text, Temp_int_Variable) == 0x000034, "Member 'BPL_UI_Utility_C_Get_Value_Text::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BPL_UI_Utility_C_Get_Value_Text, Temp_int_Variable_1) == 0x000038, "Member 'BPL_UI_Utility_C_Get_Value_Text::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BPL_UI_Utility_C_Get_Value_Text, Temp_bool_Variable_1) == 0x00003C, "Member 'BPL_UI_Utility_C_Get_Value_Text::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BPL_UI_Utility_C_Get_Value_Text, Temp_int_Variable_2) == 0x000040, "Member 'BPL_UI_Utility_C_Get_Value_Text::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(BPL_UI_Utility_C_Get_Value_Text, Temp_int_Variable_3) == 0x000044, "Member 'BPL_UI_Utility_C_Get_Value_Text::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(BPL_UI_Utility_C_Get_Value_Text, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000048, "Member 'BPL_UI_Utility_C_Get_Value_Text::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_UI_Utility_C_Get_Value_Text, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000049, "Member 'BPL_UI_Utility_C_Get_Value_Text::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_UI_Utility_C_Get_Value_Text, K2Node_Select_Default) == 0x00004C, "Member 'BPL_UI_Utility_C_Get_Value_Text::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BPL_UI_Utility_C_Get_Value_Text, CallFunc_Conv_DoubleToText_ReturnValue) == 0x000050, "Member 'BPL_UI_Utility_C_Get_Value_Text::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_UI_Utility_C_Get_Value_Text, CallFunc_Less_DoubleDouble_ReturnValue_1) == 0x000068, "Member 'BPL_UI_Utility_C_Get_Value_Text::CallFunc_Less_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPL_UI_Utility_C_Get_Value_Text, K2Node_MakeStruct_FormatArgumentData) == 0x000070, "Member 'BPL_UI_Utility_C_Get_Value_Text::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BPL_UI_Utility_C_Get_Value_Text, K2Node_MakeArray_Array) == 0x0000C0, "Member 'BPL_UI_Utility_C_Get_Value_Text::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BPL_UI_Utility_C_Get_Value_Text, K2Node_Select_Default_1) == 0x0000D0, "Member 'BPL_UI_Utility_C_Get_Value_Text::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BPL_UI_Utility_C_Get_Value_Text, CallFunc_Format_ReturnValue) == 0x0000D8, "Member 'BPL_UI_Utility_C_Get_Value_Text::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_UI_Utility_C_Get_Value_Text, CallFunc_Conv_DoubleToText_ReturnValue_1) == 0x0000F0, "Member 'BPL_UI_Utility_C_Get_Value_Text::CallFunc_Conv_DoubleToText_ReturnValue_1' has a wrong offset!");

}

