#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPS_StringArray

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct BPS_StringArray.BPS_StringArray
// 0x0030 (0x0030 - 0x0000)
struct FBPS_StringArray final
{
public:
	class FString                                 LevelName_20_A72F782C4A8435849253709EBF2C6BA0;     // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          ChangeWeatheroverride_21_97B3AF6246848E8A9510E0B1376952A7; // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ChangeWindRotation_29_1DE7870A430847C9041C9997364D4775; // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        WindRotation_26_4D51B1E1488D05532384DCA0762EEFBA;  // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ChangeWindIntensity_30_1BABA61C4679882D54D471B2BF91C19B; // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        WindIntensity_24_525A71EC429A8EFBCC7D2A86FC808B5E; // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FBPS_StringArray) == 0x000008, "Wrong alignment on FBPS_StringArray");
static_assert(sizeof(FBPS_StringArray) == 0x000030, "Wrong size on FBPS_StringArray");
static_assert(offsetof(FBPS_StringArray, LevelName_20_A72F782C4A8435849253709EBF2C6BA0) == 0x000000, "Member 'FBPS_StringArray::LevelName_20_A72F782C4A8435849253709EBF2C6BA0' has a wrong offset!");
static_assert(offsetof(FBPS_StringArray, ChangeWeatheroverride_21_97B3AF6246848E8A9510E0B1376952A7) == 0x000010, "Member 'FBPS_StringArray::ChangeWeatheroverride_21_97B3AF6246848E8A9510E0B1376952A7' has a wrong offset!");
static_assert(offsetof(FBPS_StringArray, ChangeWindRotation_29_1DE7870A430847C9041C9997364D4775) == 0x000011, "Member 'FBPS_StringArray::ChangeWindRotation_29_1DE7870A430847C9041C9997364D4775' has a wrong offset!");
static_assert(offsetof(FBPS_StringArray, WindRotation_26_4D51B1E1488D05532384DCA0762EEFBA) == 0x000018, "Member 'FBPS_StringArray::WindRotation_26_4D51B1E1488D05532384DCA0762EEFBA' has a wrong offset!");
static_assert(offsetof(FBPS_StringArray, ChangeWindIntensity_30_1BABA61C4679882D54D471B2BF91C19B) == 0x000020, "Member 'FBPS_StringArray::ChangeWindIntensity_30_1BABA61C4679882D54D471B2BF91C19B' has a wrong offset!");
static_assert(offsetof(FBPS_StringArray, WindIntensity_24_525A71EC429A8EFBCC7D2A86FC808B5E) == 0x000028, "Member 'FBPS_StringArray::WindIntensity_24_525A71EC429A8EFBCC7D2A86FC808B5E' has a wrong offset!");

}

