#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPS_InvisibilityCompData

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct BPS_InvisibilityCompData.BPS_InvisibilityCompData
// 0x0028 (0x0028 - 0x0000)
struct FBPS_InvisibilityCompData final
{
public:
	TArray<class UMaterialInstanceDynamic*>       InvisibilityMID_26_5C082F41464FA354245263A3F8E9BF2D; // 0x0000(0x0010)(Edit, BlueprintVisible)
	bool                                          DoDitherSavedState_15_9B5B2C014B2DC5F30FFBFE8866133C6F; // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CustomDepthSavedValue_18_434BFC144B78F2051DCAC7B330E5E329; // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInterface*>             SavedMaterialInterface_24_FDE583B44997A6594DC4F48B6C28DD33; // 0x0018(0x0010)(Edit, BlueprintVisible)
};
static_assert(alignof(FBPS_InvisibilityCompData) == 0x000008, "Wrong alignment on FBPS_InvisibilityCompData");
static_assert(sizeof(FBPS_InvisibilityCompData) == 0x000028, "Wrong size on FBPS_InvisibilityCompData");
static_assert(offsetof(FBPS_InvisibilityCompData, InvisibilityMID_26_5C082F41464FA354245263A3F8E9BF2D) == 0x000000, "Member 'FBPS_InvisibilityCompData::InvisibilityMID_26_5C082F41464FA354245263A3F8E9BF2D' has a wrong offset!");
static_assert(offsetof(FBPS_InvisibilityCompData, DoDitherSavedState_15_9B5B2C014B2DC5F30FFBFE8866133C6F) == 0x000010, "Member 'FBPS_InvisibilityCompData::DoDitherSavedState_15_9B5B2C014B2DC5F30FFBFE8866133C6F' has a wrong offset!");
static_assert(offsetof(FBPS_InvisibilityCompData, CustomDepthSavedValue_18_434BFC144B78F2051DCAC7B330E5E329) == 0x000011, "Member 'FBPS_InvisibilityCompData::CustomDepthSavedValue_18_434BFC144B78F2051DCAC7B330E5E329' has a wrong offset!");
static_assert(offsetof(FBPS_InvisibilityCompData, SavedMaterialInterface_24_FDE583B44997A6594DC4F48B6C28DD33) == 0x000018, "Member 'FBPS_InvisibilityCompData::SavedMaterialInterface_24_FDE583B44997A6594DC4F48B6C28DD33' has a wrong offset!");

}

