#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChaosClothAssetEngine

#include "Basic.hpp"


namespace SDK::Params
{

// Function ChaosClothAssetEngine.ChaosClothComponent.SetClothAsset
// 0x0008 (0x0008 - 0x0000)
struct ChaosClothComponent_SetClothAsset final
{
public:
	class UChaosClothAsset*                       InClothAsset;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChaosClothComponent_SetClothAsset) == 0x000008, "Wrong alignment on ChaosClothComponent_SetClothAsset");
static_assert(sizeof(ChaosClothComponent_SetClothAsset) == 0x000008, "Wrong size on ChaosClothComponent_SetClothAsset");
static_assert(offsetof(ChaosClothComponent_SetClothAsset, InClothAsset) == 0x000000, "Member 'ChaosClothComponent_SetClothAsset::InClothAsset' has a wrong offset!");

// Function ChaosClothAssetEngine.ChaosClothComponent.SetEnableSimulation
// 0x0001 (0x0001 - 0x0000)
struct ChaosClothComponent_SetEnableSimulation final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChaosClothComponent_SetEnableSimulation) == 0x000001, "Wrong alignment on ChaosClothComponent_SetEnableSimulation");
static_assert(sizeof(ChaosClothComponent_SetEnableSimulation) == 0x000001, "Wrong size on ChaosClothComponent_SetEnableSimulation");
static_assert(offsetof(ChaosClothComponent_SetEnableSimulation, bEnable) == 0x000000, "Member 'ChaosClothComponent_SetEnableSimulation::bEnable' has a wrong offset!");

// Function ChaosClothAssetEngine.ChaosClothComponent.GetClothAsset
// 0x0008 (0x0008 - 0x0000)
struct ChaosClothComponent_GetClothAsset final
{
public:
	class UChaosClothAsset*                       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChaosClothComponent_GetClothAsset) == 0x000008, "Wrong alignment on ChaosClothComponent_GetClothAsset");
static_assert(sizeof(ChaosClothComponent_GetClothAsset) == 0x000008, "Wrong size on ChaosClothComponent_GetClothAsset");
static_assert(offsetof(ChaosClothComponent_GetClothAsset, ReturnValue) == 0x000000, "Member 'ChaosClothComponent_GetClothAsset::ReturnValue' has a wrong offset!");

// Function ChaosClothAssetEngine.ChaosClothComponent.IsSimulationEnabled
// 0x0001 (0x0001 - 0x0000)
struct ChaosClothComponent_IsSimulationEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChaosClothComponent_IsSimulationEnabled) == 0x000001, "Wrong alignment on ChaosClothComponent_IsSimulationEnabled");
static_assert(sizeof(ChaosClothComponent_IsSimulationEnabled) == 0x000001, "Wrong size on ChaosClothComponent_IsSimulationEnabled");
static_assert(offsetof(ChaosClothComponent_IsSimulationEnabled, ReturnValue) == 0x000000, "Member 'ChaosClothComponent_IsSimulationEnabled::ReturnValue' has a wrong offset!");

// Function ChaosClothAssetEngine.ChaosClothComponent.IsSimulationSuspended
// 0x0001 (0x0001 - 0x0000)
struct ChaosClothComponent_IsSimulationSuspended final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChaosClothComponent_IsSimulationSuspended) == 0x000001, "Wrong alignment on ChaosClothComponent_IsSimulationSuspended");
static_assert(sizeof(ChaosClothComponent_IsSimulationSuspended) == 0x000001, "Wrong size on ChaosClothComponent_IsSimulationSuspended");
static_assert(offsetof(ChaosClothComponent_IsSimulationSuspended, ReturnValue) == 0x000000, "Member 'ChaosClothComponent_IsSimulationSuspended::ReturnValue' has a wrong offset!");

// Function ChaosClothAssetEngine.ChaosClothAsset.GetShadowPhysicsAsset
// 0x0008 (0x0008 - 0x0000)
struct ChaosClothAsset_GetShadowPhysicsAsset final
{
public:
	class UPhysicsAsset*                          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChaosClothAsset_GetShadowPhysicsAsset) == 0x000008, "Wrong alignment on ChaosClothAsset_GetShadowPhysicsAsset");
static_assert(sizeof(ChaosClothAsset_GetShadowPhysicsAsset) == 0x000008, "Wrong size on ChaosClothAsset_GetShadowPhysicsAsset");
static_assert(offsetof(ChaosClothAsset_GetShadowPhysicsAsset, ReturnValue) == 0x000000, "Member 'ChaosClothAsset_GetShadowPhysicsAsset::ReturnValue' has a wrong offset!");

}

