#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: COND_ImmersionDepth

#include "Basic.hpp"


namespace SDK::Params
{

// Function COND_ImmersionDepth.COND_ImmersionDepth_C.CheckCondition
// 0x0040 (0x0040 - 0x0000)
struct COND_ImmersionDepth_C_CheckCondition final
{
public:
	class UVStateBase*                            CurrentState;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVStateMachineComponent*                CallFunc_GetOwningStateMachineComponent_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AVPairedPawn*                           K2Node_DynamicCast_AsVPaired_Pawn;                 // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetImmersionDepth_ReturnValue;            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InRange_FloatFloat_ReturnValue;           // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_InRange_FloatFloat_Value_ImplicitCast;    // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(COND_ImmersionDepth_C_CheckCondition) == 0x000008, "Wrong alignment on COND_ImmersionDepth_C_CheckCondition");
static_assert(sizeof(COND_ImmersionDepth_C_CheckCondition) == 0x000040, "Wrong size on COND_ImmersionDepth_C_CheckCondition");
static_assert(offsetof(COND_ImmersionDepth_C_CheckCondition, CurrentState) == 0x000000, "Member 'COND_ImmersionDepth_C_CheckCondition::CurrentState' has a wrong offset!");
static_assert(offsetof(COND_ImmersionDepth_C_CheckCondition, ReturnValue) == 0x000008, "Member 'COND_ImmersionDepth_C_CheckCondition::ReturnValue' has a wrong offset!");
static_assert(offsetof(COND_ImmersionDepth_C_CheckCondition, CallFunc_GetOwningStateMachineComponent_ReturnValue) == 0x000010, "Member 'COND_ImmersionDepth_C_CheckCondition::CallFunc_GetOwningStateMachineComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(COND_ImmersionDepth_C_CheckCondition, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'COND_ImmersionDepth_C_CheckCondition::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(COND_ImmersionDepth_C_CheckCondition, K2Node_DynamicCast_AsVPaired_Pawn) == 0x000020, "Member 'COND_ImmersionDepth_C_CheckCondition::K2Node_DynamicCast_AsVPaired_Pawn' has a wrong offset!");
static_assert(offsetof(COND_ImmersionDepth_C_CheckCondition, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'COND_ImmersionDepth_C_CheckCondition::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(COND_ImmersionDepth_C_CheckCondition, CallFunc_GetImmersionDepth_ReturnValue) == 0x00002C, "Member 'COND_ImmersionDepth_C_CheckCondition::CallFunc_GetImmersionDepth_ReturnValue' has a wrong offset!");
static_assert(offsetof(COND_ImmersionDepth_C_CheckCondition, CallFunc_InRange_FloatFloat_ReturnValue) == 0x000030, "Member 'COND_ImmersionDepth_C_CheckCondition::CallFunc_InRange_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(COND_ImmersionDepth_C_CheckCondition, CallFunc_InRange_FloatFloat_Value_ImplicitCast) == 0x000038, "Member 'COND_ImmersionDepth_C_CheckCondition::CallFunc_InRange_FloatFloat_Value_ImplicitCast' has a wrong offset!");

}

