#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: COND_CanWaterJump

#include "Basic.hpp"


namespace SDK::Params
{

// Function COND_CanWaterJump.COND_CanWaterJump_C.CheckCondition
// 0x0030 (0x0030 - 0x0000)
struct COND_CanWaterJump_C_CheckCondition final
{
public:
	class UVStateBase*                            CurrentState;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVStateMachineComponent*                CallFunc_GetOwningStateMachineComponent_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AVPairedPawn*                           K2Node_DynamicCast_AsVPaired_Pawn;                 // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanAcrobaticWaterJump_ReturnValue;        // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(COND_CanWaterJump_C_CheckCondition) == 0x000008, "Wrong alignment on COND_CanWaterJump_C_CheckCondition");
static_assert(sizeof(COND_CanWaterJump_C_CheckCondition) == 0x000030, "Wrong size on COND_CanWaterJump_C_CheckCondition");
static_assert(offsetof(COND_CanWaterJump_C_CheckCondition, CurrentState) == 0x000000, "Member 'COND_CanWaterJump_C_CheckCondition::CurrentState' has a wrong offset!");
static_assert(offsetof(COND_CanWaterJump_C_CheckCondition, ReturnValue) == 0x000008, "Member 'COND_CanWaterJump_C_CheckCondition::ReturnValue' has a wrong offset!");
static_assert(offsetof(COND_CanWaterJump_C_CheckCondition, CallFunc_GetOwningStateMachineComponent_ReturnValue) == 0x000010, "Member 'COND_CanWaterJump_C_CheckCondition::CallFunc_GetOwningStateMachineComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(COND_CanWaterJump_C_CheckCondition, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'COND_CanWaterJump_C_CheckCondition::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(COND_CanWaterJump_C_CheckCondition, K2Node_DynamicCast_AsVPaired_Pawn) == 0x000020, "Member 'COND_CanWaterJump_C_CheckCondition::K2Node_DynamicCast_AsVPaired_Pawn' has a wrong offset!");
static_assert(offsetof(COND_CanWaterJump_C_CheckCondition, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'COND_CanWaterJump_C_CheckCondition::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(COND_CanWaterJump_C_CheckCondition, CallFunc_CanAcrobaticWaterJump_ReturnValue) == 0x000029, "Member 'COND_CanWaterJump_C_CheckCondition::CallFunc_CanAcrobaticWaterJump_ReturnValue' has a wrong offset!");

}

