#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: COND_CameraCheckGameplayTags

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "COND_Parent_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass COND_CameraCheckGameplayTags.COND_CameraCheckGameplayTags_C
// 0x0030 (0x0070 - 0x0040)
class UCOND_CameraCheckGameplayTags_C final : public UCOND_Parent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_COND_CameraCheckGameplayTags_C;     // 0x0040(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTagContainer                  AnimationTags;                                     // 0x0048(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class ABP_AltarPlayerCameraManager_C*         PlayerCameraManager;                               // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_COND_CameraCheckGameplayTags(int32 EntryPoint);
	void PostInit(class UVStateBase* OwnerState);
	bool CheckCondition(class UVStateBase* CurrentState);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"COND_CameraCheckGameplayTags_C">();
	}
	static class UCOND_CameraCheckGameplayTags_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCOND_CameraCheckGameplayTags_C>();
	}
};
static_assert(alignof(UCOND_CameraCheckGameplayTags_C) == 0x000008, "Wrong alignment on UCOND_CameraCheckGameplayTags_C");
static_assert(sizeof(UCOND_CameraCheckGameplayTags_C) == 0x000070, "Wrong size on UCOND_CameraCheckGameplayTags_C");
static_assert(offsetof(UCOND_CameraCheckGameplayTags_C, UberGraphFrame_COND_CameraCheckGameplayTags_C) == 0x000040, "Member 'UCOND_CameraCheckGameplayTags_C::UberGraphFrame_COND_CameraCheckGameplayTags_C' has a wrong offset!");
static_assert(offsetof(UCOND_CameraCheckGameplayTags_C, AnimationTags) == 0x000048, "Member 'UCOND_CameraCheckGameplayTags_C::AnimationTags' has a wrong offset!");
static_assert(offsetof(UCOND_CameraCheckGameplayTags_C, PlayerCameraManager) == 0x000068, "Member 'UCOND_CameraCheckGameplayTags_C::PlayerCameraManager' has a wrong offset!");

}

