#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: COND_IsAliveFromUnconscious

#include "Basic.hpp"


namespace SDK::Params
{

// Function COND_IsAliveFromUnconscious.COND_IsAliveFromUnconscious_C.CheckCondition
// 0x0010 (0x0010 - 0x0000)
struct COND_IsAliveFromUnconscious_C_CheckCondition final
{
public:
	class UVStateBase*                            CurrentState;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAliveFromUnconscious_ReturnValue;       // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAliveFromResurrection_ReturnValue;      // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(COND_IsAliveFromUnconscious_C_CheckCondition) == 0x000008, "Wrong alignment on COND_IsAliveFromUnconscious_C_CheckCondition");
static_assert(sizeof(COND_IsAliveFromUnconscious_C_CheckCondition) == 0x000010, "Wrong size on COND_IsAliveFromUnconscious_C_CheckCondition");
static_assert(offsetof(COND_IsAliveFromUnconscious_C_CheckCondition, CurrentState) == 0x000000, "Member 'COND_IsAliveFromUnconscious_C_CheckCondition::CurrentState' has a wrong offset!");
static_assert(offsetof(COND_IsAliveFromUnconscious_C_CheckCondition, ReturnValue) == 0x000008, "Member 'COND_IsAliveFromUnconscious_C_CheckCondition::ReturnValue' has a wrong offset!");
static_assert(offsetof(COND_IsAliveFromUnconscious_C_CheckCondition, CallFunc_IsAliveFromUnconscious_ReturnValue) == 0x000009, "Member 'COND_IsAliveFromUnconscious_C_CheckCondition::CallFunc_IsAliveFromUnconscious_ReturnValue' has a wrong offset!");
static_assert(offsetof(COND_IsAliveFromUnconscious_C_CheckCondition, CallFunc_IsAliveFromResurrection_ReturnValue) == 0x00000A, "Member 'COND_IsAliveFromUnconscious_C_CheckCondition::CallFunc_IsAliveFromResurrection_ReturnValue' has a wrong offset!");
static_assert(offsetof(COND_IsAliveFromUnconscious_C_CheckCondition, CallFunc_BooleanOR_ReturnValue) == 0x00000B, "Member 'COND_IsAliveFromUnconscious_C_CheckCondition::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

}

