#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: COND_CameraCheckBaseSkillLevel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Altar_structs.hpp"
#include "COND_Parent_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass COND_CameraCheckBaseSkillLevel.COND_CameraCheckBaseSkillLevel_C
// 0x0010 (0x0050 - 0x0040)
class UCOND_CameraCheckBaseSkillLevel_C final : public UCOND_Parent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_COND_CameraCheckBaseSkillLevel_C;   // 0x0040(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	EVSkill                                       Skill;                                             // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVSkillLevel                                  SkillLevel;                                        // 0x0049(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_COND_CameraCheckBaseSkillLevel(int32 EntryPoint);
	void PostInit(class UVStateBase* OwnerState);
	bool CheckCondition(class UVStateBase* CurrentState);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"COND_CameraCheckBaseSkillLevel_C">();
	}
	static class UCOND_CameraCheckBaseSkillLevel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCOND_CameraCheckBaseSkillLevel_C>();
	}
};
static_assert(alignof(UCOND_CameraCheckBaseSkillLevel_C) == 0x000008, "Wrong alignment on UCOND_CameraCheckBaseSkillLevel_C");
static_assert(sizeof(UCOND_CameraCheckBaseSkillLevel_C) == 0x000050, "Wrong size on UCOND_CameraCheckBaseSkillLevel_C");
static_assert(offsetof(UCOND_CameraCheckBaseSkillLevel_C, UberGraphFrame_COND_CameraCheckBaseSkillLevel_C) == 0x000040, "Member 'UCOND_CameraCheckBaseSkillLevel_C::UberGraphFrame_COND_CameraCheckBaseSkillLevel_C' has a wrong offset!");
static_assert(offsetof(UCOND_CameraCheckBaseSkillLevel_C, Skill) == 0x000048, "Member 'UCOND_CameraCheckBaseSkillLevel_C::Skill' has a wrong offset!");
static_assert(offsetof(UCOND_CameraCheckBaseSkillLevel_C, SkillLevel) == 0x000049, "Member 'UCOND_CameraCheckBaseSkillLevel_C::SkillLevel' has a wrong offset!");

}

