#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: COND_IsSwimming

#include "Basic.hpp"


namespace SDK::Params
{

// Function COND_IsSwimming.COND_IsSwimming_C.CheckCondition
// 0x0010 (0x0010 - 0x0000)
struct COND_IsSwimming_C_CheckCondition final
{
public:
	class UVStateBase*                            CurrentState;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSwimming_ReturnValue;                   // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(COND_IsSwimming_C_CheckCondition) == 0x000008, "Wrong alignment on COND_IsSwimming_C_CheckCondition");
static_assert(sizeof(COND_IsSwimming_C_CheckCondition) == 0x000010, "Wrong size on COND_IsSwimming_C_CheckCondition");
static_assert(offsetof(COND_IsSwimming_C_CheckCondition, CurrentState) == 0x000000, "Member 'COND_IsSwimming_C_CheckCondition::CurrentState' has a wrong offset!");
static_assert(offsetof(COND_IsSwimming_C_CheckCondition, ReturnValue) == 0x000008, "Member 'COND_IsSwimming_C_CheckCondition::ReturnValue' has a wrong offset!");
static_assert(offsetof(COND_IsSwimming_C_CheckCondition, CallFunc_IsValid_ReturnValue) == 0x000009, "Member 'COND_IsSwimming_C_CheckCondition::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(COND_IsSwimming_C_CheckCondition, CallFunc_IsSwimming_ReturnValue) == 0x00000A, "Member 'COND_IsSwimming_C_CheckCondition::CallFunc_IsSwimming_ReturnValue' has a wrong offset!");

}

