#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EmissiveLightCore

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function EmissiveLightCore.EmissiveLightComponent.SetColor
// 0x0010 (0x0010 - 0x0000)
struct EmissiveLightComponent_SetColor final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EmissiveLightComponent_SetColor) == 0x000004, "Wrong alignment on EmissiveLightComponent_SetColor");
static_assert(sizeof(EmissiveLightComponent_SetColor) == 0x000010, "Wrong size on EmissiveLightComponent_SetColor");
static_assert(offsetof(EmissiveLightComponent_SetColor, Color) == 0x000000, "Member 'EmissiveLightComponent_SetColor::Color' has a wrong offset!");

// Function EmissiveLightCore.EmissiveLightComponent.SetIntensity
// 0x0004 (0x0004 - 0x0000)
struct EmissiveLightComponent_SetIntensity final
{
public:
	float                                         Intensity;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EmissiveLightComponent_SetIntensity) == 0x000004, "Wrong alignment on EmissiveLightComponent_SetIntensity");
static_assert(sizeof(EmissiveLightComponent_SetIntensity) == 0x000004, "Wrong size on EmissiveLightComponent_SetIntensity");
static_assert(offsetof(EmissiveLightComponent_SetIntensity, Intensity) == 0x000000, "Member 'EmissiveLightComponent_SetIntensity::Intensity' has a wrong offset!");

}

