#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EmperorKill_Seq

#include "Basic.hpp"

#include "MovieScene_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function EmperorKill_Seq.EmperorKill_Seq_DirectorBP_C.DisableCollision
// 0x0008 (0x0008 - 0x0000)
struct EmperorKill_Seq_DirectorBP_C_DisableCollision final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EmperorKill_Seq_DirectorBP_C_DisableCollision) == 0x000008, "Wrong alignment on EmperorKill_Seq_DirectorBP_C_DisableCollision");
static_assert(sizeof(EmperorKill_Seq_DirectorBP_C_DisableCollision) == 0x000008, "Wrong size on EmperorKill_Seq_DirectorBP_C_DisableCollision");
static_assert(offsetof(EmperorKill_Seq_DirectorBP_C_DisableCollision, Actor) == 0x000000, "Member 'EmperorKill_Seq_DirectorBP_C_DisableCollision::Actor' has a wrong offset!");

// Function EmperorKill_Seq.EmperorKill_Seq_DirectorBP_C.DrawWeapon
// 0x0008 (0x0008 - 0x0000)
struct EmperorKill_Seq_DirectorBP_C_DrawWeapon final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EmperorKill_Seq_DirectorBP_C_DrawWeapon) == 0x000008, "Wrong alignment on EmperorKill_Seq_DirectorBP_C_DrawWeapon");
static_assert(sizeof(EmperorKill_Seq_DirectorBP_C_DrawWeapon) == 0x000008, "Wrong size on EmperorKill_Seq_DirectorBP_C_DrawWeapon");
static_assert(offsetof(EmperorKill_Seq_DirectorBP_C_DrawWeapon, Actor) == 0x000000, "Member 'EmperorKill_Seq_DirectorBP_C_DrawWeapon::Actor' has a wrong offset!");

// Function EmperorKill_Seq.EmperorKill_Seq_DirectorBP_C.EnableCollision
// 0x0008 (0x0008 - 0x0000)
struct EmperorKill_Seq_DirectorBP_C_EnableCollision final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EmperorKill_Seq_DirectorBP_C_EnableCollision) == 0x000008, "Wrong alignment on EmperorKill_Seq_DirectorBP_C_EnableCollision");
static_assert(sizeof(EmperorKill_Seq_DirectorBP_C_EnableCollision) == 0x000008, "Wrong size on EmperorKill_Seq_DirectorBP_C_EnableCollision");
static_assert(offsetof(EmperorKill_Seq_DirectorBP_C_EnableCollision, Actor) == 0x000000, "Member 'EmperorKill_Seq_DirectorBP_C_EnableCollision::Actor' has a wrong offset!");

// Function EmperorKill_Seq.EmperorKill_Seq_DirectorBP_C.ExecuteUbergraph_EmperorKill_Seq_DirectorBP
// 0x0470 (0x0470 - 0x0000)
struct EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_ActorToTeleport;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_TeleportLocation;               // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_CustomEvent_TeleportRotation;               // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_CustomEvent_Actor_1;                        // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocationAndRotation_SweepHitResult; // 0x0048(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocationAndRotation_ReturnValue; // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AVPairedPawn*                           K2Node_DynamicCast_AsVPaired_Pawn;                 // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_DynamicCast_AsPawn;                         // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_Actor_2;                        // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_Uriel_Septim_1;                 // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_TargetLocation;                 // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_CustomEvent_TargteRotation;                 // 0x0188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AVPairedPawn*                           K2Node_DynamicCast_AsVPaired_Pawn_1;               // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x01B0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0210(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQualifiedFrameTime                    CallFunc_GetCurrentTime_ReturnValue;               // 0x0270(0x0010)(NoDestructor, HasGetValueTypeHash)
	struct FFrameNumber                           CallFunc_BreakQualifiedFrameTime_Frame;            // 0x0280(0x0004)(NoDestructor, HasGetValueTypeHash)
	struct FFrameRate                             CallFunc_BreakQualifiedFrameTime_FrameRate;        // 0x0284(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakQualifiedFrameTime_SubFrame;         // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FetchObjectBindingEventTrackSectionRange_EventTrackStartFrame; // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FetchObjectBindingEventTrackSectionRange_EventTrackEndFrame; // 0x0294(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_Actor;                          // 0x02B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_2;           // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AVPairedPawn*                           K2Node_DynamicCast_AsVPaired_Pawn_2;               // 0x02C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D8[0x8];                                      // 0x02D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_TLerp_ReturnValue;                        // 0x02E0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_Uriel_Septim;                   // 0x0340(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult;      // 0x0348(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue;         // 0x0430(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_431[0x7];                                      // 0x0431(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AVPairedPawn*                           K2Node_DynamicCast_AsVPaired_Pawn_3;               // 0x0438(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_441[0x7];                                      // 0x0441(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          CallFunc_GetAIController_ReturnValue;              // 0x0448(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AVPairedPawnAIController*               K2Node_DynamicCast_AsVPaired_Pawn_AIController;    // 0x0450(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0458(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_459[0x7];                                      // 0x0459(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast;          // 0x0460(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_TLerp_Alpha_ImplicitCast;                 // 0x0468(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP) == 0x000010, "Wrong alignment on EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP");
static_assert(sizeof(EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP) == 0x000470, "Wrong size on EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP");
static_assert(offsetof(EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP, EntryPoint) == 0x000000, "Member 'EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP, K2Node_CustomEvent_ActorToTeleport) == 0x000008, "Member 'EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP::K2Node_CustomEvent_ActorToTeleport' has a wrong offset!");
static_assert(offsetof(EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP, K2Node_CustomEvent_TeleportLocation) == 0x000010, "Member 'EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP::K2Node_CustomEvent_TeleportLocation' has a wrong offset!");
static_assert(offsetof(EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP, K2Node_CustomEvent_TeleportRotation) == 0x000028, "Member 'EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP::K2Node_CustomEvent_TeleportRotation' has a wrong offset!");
static_assert(offsetof(EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP, K2Node_CustomEvent_Actor_1) == 0x000040, "Member 'EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP::K2Node_CustomEvent_Actor_1' has a wrong offset!");
static_assert(offsetof(EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP, CallFunc_K2_SetActorLocationAndRotation_SweepHitResult) == 0x000048, "Member 'EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP::CallFunc_K2_SetActorLocationAndRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP, CallFunc_K2_SetActorLocationAndRotation_ReturnValue) == 0x000130, "Member 'EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP::CallFunc_K2_SetActorLocationAndRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP, K2Node_DynamicCast_AsVPaired_Pawn) == 0x000138, "Member 'EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP::K2Node_DynamicCast_AsVPaired_Pawn' has a wrong offset!");
static_assert(offsetof(EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP, K2Node_DynamicCast_bSuccess) == 0x000140, "Member 'EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP, K2Node_DynamicCast_AsPawn) == 0x000148, "Member 'EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP::K2Node_DynamicCast_AsPawn' has a wrong offset!");
static_assert(offsetof(EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP, K2Node_DynamicCast_bSuccess_1) == 0x000150, "Member 'EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP, CallFunc_GetController_ReturnValue) == 0x000158, "Member 'EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP, K2Node_CustomEvent_Actor_2) == 0x000160, "Member 'EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP::K2Node_CustomEvent_Actor_2' has a wrong offset!");
static_assert(offsetof(EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP, K2Node_CustomEvent_Uriel_Septim_1) == 0x000168, "Member 'EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP::K2Node_CustomEvent_Uriel_Septim_1' has a wrong offset!");
static_assert(offsetof(EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP, K2Node_CustomEvent_TargetLocation) == 0x000170, "Member 'EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP::K2Node_CustomEvent_TargetLocation' has a wrong offset!");
static_assert(offsetof(EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP, K2Node_CustomEvent_TargteRotation) == 0x000188, "Member 'EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP::K2Node_CustomEvent_TargteRotation' has a wrong offset!");
static_assert(offsetof(EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP, K2Node_DynamicCast_AsVPaired_Pawn_1) == 0x0001A0, "Member 'EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP::K2Node_DynamicCast_AsVPaired_Pawn_1' has a wrong offset!");
static_assert(offsetof(EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP, K2Node_DynamicCast_bSuccess_2) == 0x0001A8, "Member 'EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP, CallFunc_MakeTransform_ReturnValue) == 0x0001B0, "Member 'EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP, CallFunc_GetTransform_ReturnValue) == 0x000210, "Member 'EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP, CallFunc_GetCurrentTime_ReturnValue) == 0x000270, "Member 'EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP::CallFunc_GetCurrentTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP, CallFunc_BreakQualifiedFrameTime_Frame) == 0x000280, "Member 'EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP::CallFunc_BreakQualifiedFrameTime_Frame' has a wrong offset!");
static_assert(offsetof(EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP, CallFunc_BreakQualifiedFrameTime_FrameRate) == 0x000284, "Member 'EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP::CallFunc_BreakQualifiedFrameTime_FrameRate' has a wrong offset!");
static_assert(offsetof(EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP, CallFunc_BreakQualifiedFrameTime_SubFrame) == 0x00028C, "Member 'EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP::CallFunc_BreakQualifiedFrameTime_SubFrame' has a wrong offset!");
static_assert(offsetof(EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP, CallFunc_FetchObjectBindingEventTrackSectionRange_EventTrackStartFrame) == 0x000290, "Member 'EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP::CallFunc_FetchObjectBindingEventTrackSectionRange_EventTrackStartFrame' has a wrong offset!");
static_assert(offsetof(EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP, CallFunc_FetchObjectBindingEventTrackSectionRange_EventTrackEndFrame) == 0x000294, "Member 'EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP::CallFunc_FetchObjectBindingEventTrackSectionRange_EventTrackEndFrame' has a wrong offset!");
static_assert(offsetof(EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000298, "Member 'EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x0002A0, "Member 'EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0002A8, "Member 'EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP, K2Node_CustomEvent_Actor) == 0x0002B0, "Member 'EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP::K2Node_CustomEvent_Actor' has a wrong offset!");
static_assert(offsetof(EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP, CallFunc_Conv_IntToDouble_ReturnValue_2) == 0x0002B8, "Member 'EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP::CallFunc_Conv_IntToDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP, K2Node_DynamicCast_AsVPaired_Pawn_2) == 0x0002C0, "Member 'EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP::K2Node_DynamicCast_AsVPaired_Pawn_2' has a wrong offset!");
static_assert(offsetof(EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP, K2Node_DynamicCast_bSuccess_3) == 0x0002C8, "Member 'EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP, CallFunc_MapRangeClamped_ReturnValue) == 0x0002D0, "Member 'EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP, CallFunc_TLerp_ReturnValue) == 0x0002E0, "Member 'EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP::CallFunc_TLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP, K2Node_CustomEvent_Uriel_Septim) == 0x000340, "Member 'EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP::K2Node_CustomEvent_Uriel_Septim' has a wrong offset!");
static_assert(offsetof(EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP, CallFunc_K2_SetActorTransform_SweepHitResult) == 0x000348, "Member 'EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP::CallFunc_K2_SetActorTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP, CallFunc_K2_SetActorTransform_ReturnValue) == 0x000430, "Member 'EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP::CallFunc_K2_SetActorTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP, K2Node_DynamicCast_AsVPaired_Pawn_3) == 0x000438, "Member 'EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP::K2Node_DynamicCast_AsVPaired_Pawn_3' has a wrong offset!");
static_assert(offsetof(EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP, K2Node_DynamicCast_bSuccess_4) == 0x000440, "Member 'EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP, CallFunc_GetAIController_ReturnValue) == 0x000448, "Member 'EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP::CallFunc_GetAIController_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP, K2Node_DynamicCast_AsVPaired_Pawn_AIController) == 0x000450, "Member 'EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP::K2Node_DynamicCast_AsVPaired_Pawn_AIController' has a wrong offset!");
static_assert(offsetof(EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP, K2Node_DynamicCast_bSuccess_5) == 0x000458, "Member 'EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP, CallFunc_Add_DoubleDouble_B_ImplicitCast) == 0x000460, "Member 'EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP::CallFunc_Add_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP, CallFunc_TLerp_Alpha_ImplicitCast) == 0x000468, "Member 'EmperorKill_Seq_DirectorBP_C_ExecuteUbergraph_EmperorKill_Seq_DirectorBP::CallFunc_TLerp_Alpha_ImplicitCast' has a wrong offset!");

// Function EmperorKill_Seq.EmperorKill_Seq_DirectorBP_C.FetchObjectBindingEventTrackSectionRange
// 0x0098 (0x0098 - 0x0000)
struct EmperorKill_Seq_DirectorBP_C_FetchObjectBindingEventTrackSectionRange final
{
public:
	struct FMovieSceneObjectBindingID             ObjectBindingID;                                   // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	int32                                         EventTrackStartFrame_0;                            // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         EventTrackEndFrame_0;                              // 0x001C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMovieSceneTrack*                       EventTrack;                                        // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UMovieSceneSection*>             CallFunc_GetSections_ReturnValue;                  // 0x0028(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UMovieSceneSection*                     CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetEndFrame_ReturnValue;                  // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetStartFrame_ReturnValue;                // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMovieSceneSequence*                    CallFunc_GetSequence_ReturnValue;                  // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMovieSceneBindingProxy                CallFunc_ResolveBindingID_ReturnValue;             // 0x0060(0x0018)(NoDestructor, HasGetValueTypeHash)
	TArray<class UMovieSceneEventTrack*>          CallFunc_FindTracksByType_ReturnValue;             // 0x0078(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMovieSceneEventTrack*                  CallFunc_Array_Get_Item_1;                         // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EmperorKill_Seq_DirectorBP_C_FetchObjectBindingEventTrackSectionRange) == 0x000008, "Wrong alignment on EmperorKill_Seq_DirectorBP_C_FetchObjectBindingEventTrackSectionRange");
static_assert(sizeof(EmperorKill_Seq_DirectorBP_C_FetchObjectBindingEventTrackSectionRange) == 0x000098, "Wrong size on EmperorKill_Seq_DirectorBP_C_FetchObjectBindingEventTrackSectionRange");
static_assert(offsetof(EmperorKill_Seq_DirectorBP_C_FetchObjectBindingEventTrackSectionRange, ObjectBindingID) == 0x000000, "Member 'EmperorKill_Seq_DirectorBP_C_FetchObjectBindingEventTrackSectionRange::ObjectBindingID' has a wrong offset!");
static_assert(offsetof(EmperorKill_Seq_DirectorBP_C_FetchObjectBindingEventTrackSectionRange, EventTrackStartFrame_0) == 0x000018, "Member 'EmperorKill_Seq_DirectorBP_C_FetchObjectBindingEventTrackSectionRange::EventTrackStartFrame_0' has a wrong offset!");
static_assert(offsetof(EmperorKill_Seq_DirectorBP_C_FetchObjectBindingEventTrackSectionRange, EventTrackEndFrame_0) == 0x00001C, "Member 'EmperorKill_Seq_DirectorBP_C_FetchObjectBindingEventTrackSectionRange::EventTrackEndFrame_0' has a wrong offset!");
static_assert(offsetof(EmperorKill_Seq_DirectorBP_C_FetchObjectBindingEventTrackSectionRange, EventTrack) == 0x000020, "Member 'EmperorKill_Seq_DirectorBP_C_FetchObjectBindingEventTrackSectionRange::EventTrack' has a wrong offset!");
static_assert(offsetof(EmperorKill_Seq_DirectorBP_C_FetchObjectBindingEventTrackSectionRange, CallFunc_GetSections_ReturnValue) == 0x000028, "Member 'EmperorKill_Seq_DirectorBP_C_FetchObjectBindingEventTrackSectionRange::CallFunc_GetSections_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmperorKill_Seq_DirectorBP_C_FetchObjectBindingEventTrackSectionRange, CallFunc_Array_Get_Item) == 0x000038, "Member 'EmperorKill_Seq_DirectorBP_C_FetchObjectBindingEventTrackSectionRange::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(EmperorKill_Seq_DirectorBP_C_FetchObjectBindingEventTrackSectionRange, CallFunc_GetEndFrame_ReturnValue) == 0x000040, "Member 'EmperorKill_Seq_DirectorBP_C_FetchObjectBindingEventTrackSectionRange::CallFunc_GetEndFrame_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmperorKill_Seq_DirectorBP_C_FetchObjectBindingEventTrackSectionRange, CallFunc_GetStartFrame_ReturnValue) == 0x000044, "Member 'EmperorKill_Seq_DirectorBP_C_FetchObjectBindingEventTrackSectionRange::CallFunc_GetStartFrame_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmperorKill_Seq_DirectorBP_C_FetchObjectBindingEventTrackSectionRange, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000048, "Member 'EmperorKill_Seq_DirectorBP_C_FetchObjectBindingEventTrackSectionRange::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmperorKill_Seq_DirectorBP_C_FetchObjectBindingEventTrackSectionRange, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x000049, "Member 'EmperorKill_Seq_DirectorBP_C_FetchObjectBindingEventTrackSectionRange::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EmperorKill_Seq_DirectorBP_C_FetchObjectBindingEventTrackSectionRange, CallFunc_GetSequence_ReturnValue) == 0x000050, "Member 'EmperorKill_Seq_DirectorBP_C_FetchObjectBindingEventTrackSectionRange::CallFunc_GetSequence_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmperorKill_Seq_DirectorBP_C_FetchObjectBindingEventTrackSectionRange, CallFunc_BooleanAND_ReturnValue) == 0x000058, "Member 'EmperorKill_Seq_DirectorBP_C_FetchObjectBindingEventTrackSectionRange::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmperorKill_Seq_DirectorBP_C_FetchObjectBindingEventTrackSectionRange, CallFunc_ResolveBindingID_ReturnValue) == 0x000060, "Member 'EmperorKill_Seq_DirectorBP_C_FetchObjectBindingEventTrackSectionRange::CallFunc_ResolveBindingID_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmperorKill_Seq_DirectorBP_C_FetchObjectBindingEventTrackSectionRange, CallFunc_FindTracksByType_ReturnValue) == 0x000078, "Member 'EmperorKill_Seq_DirectorBP_C_FetchObjectBindingEventTrackSectionRange::CallFunc_FindTracksByType_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmperorKill_Seq_DirectorBP_C_FetchObjectBindingEventTrackSectionRange, CallFunc_Array_IsEmpty_ReturnValue) == 0x000088, "Member 'EmperorKill_Seq_DirectorBP_C_FetchObjectBindingEventTrackSectionRange::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(EmperorKill_Seq_DirectorBP_C_FetchObjectBindingEventTrackSectionRange, CallFunc_Array_Get_Item_1) == 0x000090, "Member 'EmperorKill_Seq_DirectorBP_C_FetchObjectBindingEventTrackSectionRange::CallFunc_Array_Get_Item_1' has a wrong offset!");

// Function EmperorKill_Seq.EmperorKill_Seq_DirectorBP_C.LerpMoveUriel
// 0x0038 (0x0038 - 0x0000)
struct EmperorKill_Seq_DirectorBP_C_LerpMoveUriel final
{
public:
	class AActor*                                 Uriel_Septim;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TargetLocation;                                    // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               TargteRotation;                                    // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EmperorKill_Seq_DirectorBP_C_LerpMoveUriel) == 0x000008, "Wrong alignment on EmperorKill_Seq_DirectorBP_C_LerpMoveUriel");
static_assert(sizeof(EmperorKill_Seq_DirectorBP_C_LerpMoveUriel) == 0x000038, "Wrong size on EmperorKill_Seq_DirectorBP_C_LerpMoveUriel");
static_assert(offsetof(EmperorKill_Seq_DirectorBP_C_LerpMoveUriel, Uriel_Septim) == 0x000000, "Member 'EmperorKill_Seq_DirectorBP_C_LerpMoveUriel::Uriel_Septim' has a wrong offset!");
static_assert(offsetof(EmperorKill_Seq_DirectorBP_C_LerpMoveUriel, TargetLocation) == 0x000008, "Member 'EmperorKill_Seq_DirectorBP_C_LerpMoveUriel::TargetLocation' has a wrong offset!");
static_assert(offsetof(EmperorKill_Seq_DirectorBP_C_LerpMoveUriel, TargteRotation) == 0x000020, "Member 'EmperorKill_Seq_DirectorBP_C_LerpMoveUriel::TargteRotation' has a wrong offset!");

// Function EmperorKill_Seq.EmperorKill_Seq_DirectorBP_C.ReallowActorToBePushedByPawns
// 0x0008 (0x0008 - 0x0000)
struct EmperorKill_Seq_DirectorBP_C_ReallowActorToBePushedByPawns final
{
public:
	class AActor*                                 Uriel_Septim;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EmperorKill_Seq_DirectorBP_C_ReallowActorToBePushedByPawns) == 0x000008, "Wrong alignment on EmperorKill_Seq_DirectorBP_C_ReallowActorToBePushedByPawns");
static_assert(sizeof(EmperorKill_Seq_DirectorBP_C_ReallowActorToBePushedByPawns) == 0x000008, "Wrong size on EmperorKill_Seq_DirectorBP_C_ReallowActorToBePushedByPawns");
static_assert(offsetof(EmperorKill_Seq_DirectorBP_C_ReallowActorToBePushedByPawns, Uriel_Septim) == 0x000000, "Member 'EmperorKill_Seq_DirectorBP_C_ReallowActorToBePushedByPawns::Uriel_Septim' has a wrong offset!");

// Function EmperorKill_Seq.EmperorKill_Seq_DirectorBP_C.SequenceEvent__ENTRYPOINTEmperorKill_Seq_DirectorBP
// 0x0008 (0x0008 - 0x0000)
struct EmperorKill_Seq_DirectorBP_C_SequenceEvent__ENTRYPOINTEmperorKill_Seq_DirectorBP final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EmperorKill_Seq_DirectorBP_C_SequenceEvent__ENTRYPOINTEmperorKill_Seq_DirectorBP) == 0x000008, "Wrong alignment on EmperorKill_Seq_DirectorBP_C_SequenceEvent__ENTRYPOINTEmperorKill_Seq_DirectorBP");
static_assert(sizeof(EmperorKill_Seq_DirectorBP_C_SequenceEvent__ENTRYPOINTEmperorKill_Seq_DirectorBP) == 0x000008, "Wrong size on EmperorKill_Seq_DirectorBP_C_SequenceEvent__ENTRYPOINTEmperorKill_Seq_DirectorBP");
static_assert(offsetof(EmperorKill_Seq_DirectorBP_C_SequenceEvent__ENTRYPOINTEmperorKill_Seq_DirectorBP, Actor) == 0x000000, "Member 'EmperorKill_Seq_DirectorBP_C_SequenceEvent__ENTRYPOINTEmperorKill_Seq_DirectorBP::Actor' has a wrong offset!");

// Function EmperorKill_Seq.EmperorKill_Seq_DirectorBP_C.SequenceEvent__ENTRYPOINTEmperorKill_Seq_DirectorBP_0
// 0x0008 (0x0008 - 0x0000)
struct EmperorKill_Seq_DirectorBP_C_SequenceEvent__ENTRYPOINTEmperorKill_Seq_DirectorBP_0 final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EmperorKill_Seq_DirectorBP_C_SequenceEvent__ENTRYPOINTEmperorKill_Seq_DirectorBP_0) == 0x000008, "Wrong alignment on EmperorKill_Seq_DirectorBP_C_SequenceEvent__ENTRYPOINTEmperorKill_Seq_DirectorBP_0");
static_assert(sizeof(EmperorKill_Seq_DirectorBP_C_SequenceEvent__ENTRYPOINTEmperorKill_Seq_DirectorBP_0) == 0x000008, "Wrong size on EmperorKill_Seq_DirectorBP_C_SequenceEvent__ENTRYPOINTEmperorKill_Seq_DirectorBP_0");
static_assert(offsetof(EmperorKill_Seq_DirectorBP_C_SequenceEvent__ENTRYPOINTEmperorKill_Seq_DirectorBP_0, Actor) == 0x000000, "Member 'EmperorKill_Seq_DirectorBP_C_SequenceEvent__ENTRYPOINTEmperorKill_Seq_DirectorBP_0::Actor' has a wrong offset!");

// Function EmperorKill_Seq.EmperorKill_Seq_DirectorBP_C.SequenceEvent__ENTRYPOINTEmperorKill_Seq_DirectorBP_1
// 0x0008 (0x0008 - 0x0000)
struct EmperorKill_Seq_DirectorBP_C_SequenceEvent__ENTRYPOINTEmperorKill_Seq_DirectorBP_1 final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EmperorKill_Seq_DirectorBP_C_SequenceEvent__ENTRYPOINTEmperorKill_Seq_DirectorBP_1) == 0x000008, "Wrong alignment on EmperorKill_Seq_DirectorBP_C_SequenceEvent__ENTRYPOINTEmperorKill_Seq_DirectorBP_1");
static_assert(sizeof(EmperorKill_Seq_DirectorBP_C_SequenceEvent__ENTRYPOINTEmperorKill_Seq_DirectorBP_1) == 0x000008, "Wrong size on EmperorKill_Seq_DirectorBP_C_SequenceEvent__ENTRYPOINTEmperorKill_Seq_DirectorBP_1");
static_assert(offsetof(EmperorKill_Seq_DirectorBP_C_SequenceEvent__ENTRYPOINTEmperorKill_Seq_DirectorBP_1, Actor) == 0x000000, "Member 'EmperorKill_Seq_DirectorBP_C_SequenceEvent__ENTRYPOINTEmperorKill_Seq_DirectorBP_1::Actor' has a wrong offset!");

// Function EmperorKill_Seq.EmperorKill_Seq_DirectorBP_C.SequenceEvent__ENTRYPOINTEmperorKill_Seq_DirectorBP_2
// 0x0008 (0x0008 - 0x0000)
struct EmperorKill_Seq_DirectorBP_C_SequenceEvent__ENTRYPOINTEmperorKill_Seq_DirectorBP_2 final
{
public:
	class AActor*                                 Uriel_Septim;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EmperorKill_Seq_DirectorBP_C_SequenceEvent__ENTRYPOINTEmperorKill_Seq_DirectorBP_2) == 0x000008, "Wrong alignment on EmperorKill_Seq_DirectorBP_C_SequenceEvent__ENTRYPOINTEmperorKill_Seq_DirectorBP_2");
static_assert(sizeof(EmperorKill_Seq_DirectorBP_C_SequenceEvent__ENTRYPOINTEmperorKill_Seq_DirectorBP_2) == 0x000008, "Wrong size on EmperorKill_Seq_DirectorBP_C_SequenceEvent__ENTRYPOINTEmperorKill_Seq_DirectorBP_2");
static_assert(offsetof(EmperorKill_Seq_DirectorBP_C_SequenceEvent__ENTRYPOINTEmperorKill_Seq_DirectorBP_2, Uriel_Septim) == 0x000000, "Member 'EmperorKill_Seq_DirectorBP_C_SequenceEvent__ENTRYPOINTEmperorKill_Seq_DirectorBP_2::Uriel_Septim' has a wrong offset!");

// Function EmperorKill_Seq.EmperorKill_Seq_DirectorBP_C.TeleportBoundActor
// 0x0038 (0x0038 - 0x0000)
struct EmperorKill_Seq_DirectorBP_C_TeleportBoundActor final
{
public:
	class AActor*                                 ActorToTeleport;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TeleportLocation;                                  // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               TeleportRotation;                                  // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EmperorKill_Seq_DirectorBP_C_TeleportBoundActor) == 0x000008, "Wrong alignment on EmperorKill_Seq_DirectorBP_C_TeleportBoundActor");
static_assert(sizeof(EmperorKill_Seq_DirectorBP_C_TeleportBoundActor) == 0x000038, "Wrong size on EmperorKill_Seq_DirectorBP_C_TeleportBoundActor");
static_assert(offsetof(EmperorKill_Seq_DirectorBP_C_TeleportBoundActor, ActorToTeleport) == 0x000000, "Member 'EmperorKill_Seq_DirectorBP_C_TeleportBoundActor::ActorToTeleport' has a wrong offset!");
static_assert(offsetof(EmperorKill_Seq_DirectorBP_C_TeleportBoundActor, TeleportLocation) == 0x000008, "Member 'EmperorKill_Seq_DirectorBP_C_TeleportBoundActor::TeleportLocation' has a wrong offset!");
