#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EmperorKill_Seq

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "LevelSequence_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass EmperorKill_Seq.EmperorKill_Seq_DirectorBP_C
// 0x0018 (0x0050 - 0x0038)
class UEmperorKill_Seq_DirectorBP_C final : public ULevelSequenceDirector
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0038(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         FrameTime;                                         // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         EventTrackStartFrame;                              // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         EventTrackEndFrame;                                // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void DisableCollision(class AActor* Actor);
	void DrawWeapon(class AActor* Actor);
	void EnableCollision(class AActor* Actor);
	void ExecuteUbergraph_EmperorKill_Seq_DirectorBP(int32 EntryPoint);
	void FetchObjectBindingEventTrackSectionRange(const struct FMovieSceneObjectBindingID& ObjectBindingID, int32* EventTrackStartFrame_0, int32* EventTrackEndFrame_0);
	void LerpMoveUriel(class AActor* Uriel_Septim, const struct FVector& TargetLocation, const struct FRotator& TargteRotation);
	void ReallowActorToBePushedByPawns(class AActor* Uriel_Septim);
	void SequenceEvent__ENTRYPOINTEmperorKill_Seq_DirectorBP(class AActor* Actor);
	void SequenceEvent__ENTRYPOINTEmperorKill_Seq_DirectorBP_0(class AActor* Actor);
	void SequenceEvent__ENTRYPOINTEmperorKill_Seq_DirectorBP_1(class AActor* Actor);
	void SequenceEvent__ENTRYPOINTEmperorKill_Seq_DirectorBP_2(class AActor* Uriel_Septim);
	void TeleportBoundActor(class AActor* ActorToTeleport, const struct FVector& TeleportLocation, const struct FRotator& TeleportRotation);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"EmperorKill_Seq_DirectorBP_C">();
	}
	static class UEmperorKill_Seq_DirectorBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEmperorKill_Seq_DirectorBP_C>();
	}
};
static_assert(alignof(UEmperorKill_Seq_DirectorBP_C) == 0x000008, "Wrong alignment on UEmperorKill_Seq_DirectorBP_C");
static_assert(sizeof(UEmperorKill_Seq_DirectorBP_C) == 0x000050, "Wrong size on UEmperorKill_Seq_DirectorBP_C");
static_assert(offsetof(UEmperorKill_Seq_DirectorBP_C, UberGraphFrame) == 0x000038, "Member 'UEmperorKill_Seq_DirectorBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UEmperorKill_Seq_DirectorBP_C, FrameTime) == 0x000040, "Member 'UEmperorKill_Seq_DirectorBP_C::FrameTime' has a wrong offset!");
static_assert(offsetof(UEmperorKill_Seq_DirectorBP_C, EventTrackStartFrame) == 0x000044, "Member 'UEmperorKill_Seq_DirectorBP_C::EventTrackStartFrame' has a wrong offset!");
static_assert(offsetof(UEmperorKill_Seq_DirectorBP_C, EventTrackEndFrame) == 0x000048, "Member 'UEmperorKill_Seq_DirectorBP_C::EventTrackEndFrame' has a wrong offset!");

}

