#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ProceduralInteriorDressingToolRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ProceduralInteriorDressingToolRuntime.BFL_ProceduralInteriorDressingToolRuntime.AddLandscapeGrassExclusionBox
// 0x0040 (0x0040 - 0x0000)
struct BFL_ProceduralInteriorDressingToolRuntime_AddLandscapeGrassExclusionBox final
{
public:
	class AActor*                                 Owner;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBox                                   BoxToRemove;                                       // 0x0008(0x0038)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(BFL_ProceduralInteriorDressingToolRuntime_AddLandscapeGrassExclusionBox) == 0x000008, "Wrong alignment on BFL_ProceduralInteriorDressingToolRuntime_AddLandscapeGrassExclusionBox");
static_assert(sizeof(BFL_ProceduralInteriorDressingToolRuntime_AddLandscapeGrassExclusionBox) == 0x000040, "Wrong size on BFL_ProceduralInteriorDressingToolRuntime_AddLandscapeGrassExclusionBox");
static_assert(offsetof(BFL_ProceduralInteriorDressingToolRuntime_AddLandscapeGrassExclusionBox, Owner) == 0x000000, "Member 'BFL_ProceduralInteriorDressingToolRuntime_AddLandscapeGrassExclusionBox::Owner' has a wrong offset!");
static_assert(offsetof(BFL_ProceduralInteriorDressingToolRuntime_AddLandscapeGrassExclusionBox, BoxToRemove) == 0x000008, "Member 'BFL_ProceduralInteriorDressingToolRuntime_AddLandscapeGrassExclusionBox::BoxToRemove' has a wrong offset!");

// Function ProceduralInteriorDressingToolRuntime.BFL_ProceduralInteriorDressingToolRuntime.RemoveLandscapeGrassExclusionBox
// 0x0008 (0x0008 - 0x0000)
struct BFL_ProceduralInteriorDressingToolRuntime_RemoveLandscapeGrassExclusionBox final
{
public:
	class AActor*                                 Owner;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BFL_ProceduralInteriorDressingToolRuntime_RemoveLandscapeGrassExclusionBox) == 0x000008, "Wrong alignment on BFL_ProceduralInteriorDressingToolRuntime_RemoveLandscapeGrassExclusionBox");
static_assert(sizeof(BFL_ProceduralInteriorDressingToolRuntime_RemoveLandscapeGrassExclusionBox) == 0x000008, "Wrong size on BFL_ProceduralInteriorDressingToolRuntime_RemoveLandscapeGrassExclusionBox");
static_assert(offsetof(BFL_ProceduralInteriorDressingToolRuntime_RemoveLandscapeGrassExclusionBox, Owner) == 0x000000, "Member 'BFL_ProceduralInteriorDressingToolRuntime_RemoveLandscapeGrassExclusionBox::Owner' has a wrong offset!");

}

