#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PSM_CharacterMain

#include "Basic.hpp"


namespace SDK::Params
{

// Function PSM_CharacterMain.PSM_CharacterMain_C.ExecuteUbergraph_PSM_CharacterMain
// 0x0020 (0x0020 - 0x0000)
struct PSM_CharacterMain_C_ExecuteUbergraph_PSM_CharacterMain final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AVPairedPawn*                           K2Node_DynamicCast_AsVPaired_Pawn;                 // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PSM_CharacterMain_C_ExecuteUbergraph_PSM_CharacterMain) == 0x000008, "Wrong alignment on PSM_CharacterMain_C_ExecuteUbergraph_PSM_CharacterMain");
static_assert(sizeof(PSM_CharacterMain_C_ExecuteUbergraph_PSM_CharacterMain) == 0x000020, "Wrong size on PSM_CharacterMain_C_ExecuteUbergraph_PSM_CharacterMain");
static_assert(offsetof(PSM_CharacterMain_C_ExecuteUbergraph_PSM_CharacterMain, EntryPoint) == 0x000000, "Member 'PSM_CharacterMain_C_ExecuteUbergraph_PSM_CharacterMain::EntryPoint' has a wrong offset!");
static_assert(offsetof(PSM_CharacterMain_C_ExecuteUbergraph_PSM_CharacterMain, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'PSM_CharacterMain_C_ExecuteUbergraph_PSM_CharacterMain::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(PSM_CharacterMain_C_ExecuteUbergraph_PSM_CharacterMain, K2Node_DynamicCast_AsVPaired_Pawn) == 0x000010, "Member 'PSM_CharacterMain_C_ExecuteUbergraph_PSM_CharacterMain::K2Node_DynamicCast_AsVPaired_Pawn' has a wrong offset!");
static_assert(offsetof(PSM_CharacterMain_C_ExecuteUbergraph_PSM_CharacterMain, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'PSM_CharacterMain_C_ExecuteUbergraph_PSM_CharacterMain::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

