#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SG_OblivionDebugToolPreferences

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass SG_OblivionDebugToolPreferences.SG_OblivionDebugToolPreferences_C
// 0x0018 (0x0040 - 0x0028)
class USG_OblivionDebugToolPreferences_C final : public USaveGame
{
public:
	double                                        CanvasSizeValue;                                   // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        OpacityValue;                                      // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HiddenStatus;                                      // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         AnchorModeIndex;                                   // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SG_OblivionDebugToolPreferences_C">();
	}
	static class USG_OblivionDebugToolPreferences_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USG_OblivionDebugToolPreferences_C>();
	}
};
static_assert(alignof(USG_OblivionDebugToolPreferences_C) == 0x000008, "Wrong alignment on USG_OblivionDebugToolPreferences_C");
static_assert(sizeof(USG_OblivionDebugToolPreferences_C) == 0x000040, "Wrong size on USG_OblivionDebugToolPreferences_C");
static_assert(offsetof(USG_OblivionDebugToolPreferences_C, CanvasSizeValue) == 0x000028, "Member 'USG_OblivionDebugToolPreferences_C::CanvasSizeValue' has a wrong offset!");
static_assert(offsetof(USG_OblivionDebugToolPreferences_C, OpacityValue) == 0x000030, "Member 'USG_OblivionDebugToolPreferences_C::OpacityValue' has a wrong offset!");
static_assert(offsetof(USG_OblivionDebugToolPreferences_C, HiddenStatus) == 0x000038, "Member 'USG_OblivionDebugToolPreferences_C::HiddenStatus' has a wrong offset!");
static_assert(offsetof(USG_OblivionDebugToolPreferences_C, AnchorModeIndex) == 0x00003C, "Member 'USG_OblivionDebugToolPreferences_C::AnchorModeIndex' has a wrong offset!");

}

