#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_EquipUnequip_StandSneak_Single

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Struct_EquipUnequip_StandSneak_Single.Struct_EquipUnequip_StandSneak_Single
// 0x0020 (0x0020 - 0x0000)
struct FStruct_EquipUnequip_StandSneak_Single final
{
public:
	class UAnimSequenceBase*                      EquipAnim_2_23C0E7FC4F6749912E8926B63A799BEA;      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      UnequipAnim_4_68AFFDD241209AF4997241A528788317;    // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      SneakEquipAnim_8_A9BD52B84CB6726850CF2499D903B870; // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      SneakUnequipAnim_10_D693AECA429B436DA22B6C97E5B2D2E2; // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FStruct_EquipUnequip_StandSneak_Single) == 0x000008, "Wrong alignment on FStruct_EquipUnequip_StandSneak_Single");
static_assert(sizeof(FStruct_EquipUnequip_StandSneak_Single) == 0x000020, "Wrong size on FStruct_EquipUnequip_StandSneak_Single");
static_assert(offsetof(FStruct_EquipUnequip_StandSneak_Single, EquipAnim_2_23C0E7FC4F6749912E8926B63A799BEA) == 0x000000, "Member 'FStruct_EquipUnequip_StandSneak_Single::EquipAnim_2_23C0E7FC4F6749912E8926B63A799BEA' has a wrong offset!");
static_assert(offsetof(FStruct_EquipUnequip_StandSneak_Single, UnequipAnim_4_68AFFDD241209AF4997241A528788317) == 0x000008, "Member 'FStruct_EquipUnequip_StandSneak_Single::UnequipAnim_4_68AFFDD241209AF4997241A528788317' has a wrong offset!");
static_assert(offsetof(FStruct_EquipUnequip_StandSneak_Single, SneakEquipAnim_8_A9BD52B84CB6726850CF2499D903B870) == 0x000010, "Member 'FStruct_EquipUnequip_StandSneak_Single::SneakEquipAnim_8_A9BD52B84CB6726850CF2499D903B870' has a wrong offset!");
static_assert(offsetof(FStruct_EquipUnequip_StandSneak_Single, SneakUnequipAnim_10_D693AECA429B436DA22B6C97E5B2D2E2) == 0x000018, "Member 'FStruct_EquipUnequip_StandSneak_Single::SneakUnequipAnim_10_D693AECA429B436DA22B6C97E5B2D2E2' has a wrong offset!");

}

