#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_Torch

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Struct_Torch.Struct_Torch
// 0x0048 (0x0048 - 0x0000)
struct FStruct_Torch final
{
public:
	class UAnimSequenceBase*                      TorchPose_62_82536AAC49BF13EE6C948EA5EBBD678E;     // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      TorchPoseSneak_63_87907D764C79A613795ED8AD45AFEAF7; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace*                            TorchBlendSpace_53_15E4585C4C7D0C1A90B5F3A0AAAC5980; // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace*                            TorchSneakBlendSpace_55_84F7908D4B508BA0D965209F2E457AAF; // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   TorchArmBlendBone_40_85A2BB4E49802AE979A061A15C127794; // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   TorchHandBlendBone_41_1D05D9C8427A7142F93EE9A810FE36F8; // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TorchBlendDepth_35_E610B3014047B45A6A7330933340B632; // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        TorchEquipBlendTime_42_80625F9B4C28F923E30CE2A98B1B2AA2; // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TorchCrouchBlendTime_45_16E58DAB4BBD95C1FCD5F4880E3C29D1; // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FStruct_Torch) == 0x000008, "Wrong alignment on FStruct_Torch");
static_assert(sizeof(FStruct_Torch) == 0x000048, "Wrong size on FStruct_Torch");
static_assert(offsetof(FStruct_Torch, TorchPose_62_82536AAC49BF13EE6C948EA5EBBD678E) == 0x000000, "Member 'FStruct_Torch::TorchPose_62_82536AAC49BF13EE6C948EA5EBBD678E' has a wrong offset!");
static_assert(offsetof(FStruct_Torch, TorchPoseSneak_63_87907D764C79A613795ED8AD45AFEAF7) == 0x000008, "Member 'FStruct_Torch::TorchPoseSneak_63_87907D764C79A613795ED8AD45AFEAF7' has a wrong offset!");
static_assert(offsetof(FStruct_Torch, TorchBlendSpace_53_15E4585C4C7D0C1A90B5F3A0AAAC5980) == 0x000010, "Member 'FStruct_Torch::TorchBlendSpace_53_15E4585C4C7D0C1A90B5F3A0AAAC5980' has a wrong offset!");
static_assert(offsetof(FStruct_Torch, TorchSneakBlendSpace_55_84F7908D4B508BA0D965209F2E457AAF) == 0x000018, "Member 'FStruct_Torch::TorchSneakBlendSpace_55_84F7908D4B508BA0D965209F2E457AAF' has a wrong offset!");
static_assert(offsetof(FStruct_Torch, TorchArmBlendBone_40_85A2BB4E49802AE979A061A15C127794) == 0x000020, "Member 'FStruct_Torch::TorchArmBlendBone_40_85A2BB4E49802AE979A061A15C127794' has a wrong offset!");
static_assert(offsetof(FStruct_Torch, TorchHandBlendBone_41_1D05D9C8427A7142F93EE9A810FE36F8) == 0x000028, "Member 'FStruct_Torch::TorchHandBlendBone_41_1D05D9C8427A7142F93EE9A810FE36F8' has a wrong offset!");
static_assert(offsetof(FStruct_Torch, TorchBlendDepth_35_E610B3014047B45A6A7330933340B632) == 0x000030, "Member 'FStruct_Torch::TorchBlendDepth_35_E610B3014047B45A6A7330933340B632' has a wrong offset!");
static_assert(offsetof(FStruct_Torch, TorchEquipBlendTime_42_80625F9B4C28F923E30CE2A98B1B2AA2) == 0x000038, "Member 'FStruct_Torch::TorchEquipBlendTime_42_80625F9B4C28F923E30CE2A98B1B2AA2' has a wrong offset!");
static_assert(offsetof(FStruct_Torch, TorchCrouchBlendTime_45_16E58DAB4BBD95C1FCD5F4880E3C29D1) == 0x000040, "Member 'FStruct_Torch::TorchCrouchBlendTime_45_16E58DAB4BBD95C1FCD5F4880E3C29D1' has a wrong offset!");

}

