#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_HandPoseSetup

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Struct_HandPoseSetup.Struct_HandPoseSetup
// 0x0020 (0x0020 - 0x0000)
struct FStruct_HandPoseSetup final
{
public:
	class UAnimSequenceBase*                      HandPoseShield_23_8CC54CF943E310F9EB143692F7C1AC28; // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   HandBoneName_5_85A2BB4E49802AE979A061A15C127794;   // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         HandBlendDepth_6_E610B3014047B45A6A7330933340B632; // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        HandBlendTime_31_80625F9B4C28F923E30CE2A98B1B2AA2; // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FStruct_HandPoseSetup) == 0x000008, "Wrong alignment on FStruct_HandPoseSetup");
static_assert(sizeof(FStruct_HandPoseSetup) == 0x000020, "Wrong size on FStruct_HandPoseSetup");
static_assert(offsetof(FStruct_HandPoseSetup, HandPoseShield_23_8CC54CF943E310F9EB143692F7C1AC28) == 0x000000, "Member 'FStruct_HandPoseSetup::HandPoseShield_23_8CC54CF943E310F9EB143692F7C1AC28' has a wrong offset!");
static_assert(offsetof(FStruct_HandPoseSetup, HandBoneName_5_85A2BB4E49802AE979A061A15C127794) == 0x000008, "Member 'FStruct_HandPoseSetup::HandBoneName_5_85A2BB4E49802AE979A061A15C127794' has a wrong offset!");
static_assert(offsetof(FStruct_HandPoseSetup, HandBlendDepth_6_E610B3014047B45A6A7330933340B632) == 0x000010, "Member 'FStruct_HandPoseSetup::HandBlendDepth_6_E610B3014047B45A6A7330933340B632' has a wrong offset!");
static_assert(offsetof(FStruct_HandPoseSetup, HandBlendTime_31_80625F9B4C28F923E30CE2A98B1B2AA2) == 0x000018, "Member 'FStruct_HandPoseSetup::HandBlendTime_31_80625F9B4C28F923E30CE2A98B1B2AA2' has a wrong offset!");

}

