#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_HumanoidLowerAndUpperBodySetup

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Struct_HumanoidLowerAndUpperBodySetup.Struct_HumanoidLowerAndUpperBodySetup
// 0x002C (0x002C - 0x0000)
struct FStruct_HumanoidLowerAndUpperBodySetup final
{
public:
	class FName                                   PelvisBoneName_2_9EE7B7FE4B2769D5E67E5B80B9D13038; // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PelvisBlendDepth_5_CCFACDDA420FA2FBE99F6DBFAFE382BF; // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   LeftLegBoneName_8_4182DA8440659573A8C179BDA73EA3CB; // 0x000C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   RightLegBoneName_10_7CF505AE45201C0EE3165AA3FBB60113; // 0x0014(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LegsBlendDepth_13_A1D5A17B4DCD06C3AD7CAD87C1D9BDD3; // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   UpperBodyBoneName_16_3F810894438B6DE0A3EB2BA34613E7AD; // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         UpperBodyBlendDepth_19_4BB5934F447E0322665173B6A82F9CC3; // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FStruct_HumanoidLowerAndUpperBodySetup) == 0x000004, "Wrong alignment on FStruct_HumanoidLowerAndUpperBodySetup");
static_assert(sizeof(FStruct_HumanoidLowerAndUpperBodySetup) == 0x00002C, "Wrong size on FStruct_HumanoidLowerAndUpperBodySetup");
static_assert(offsetof(FStruct_HumanoidLowerAndUpperBodySetup, PelvisBoneName_2_9EE7B7FE4B2769D5E67E5B80B9D13038) == 0x000000, "Member 'FStruct_HumanoidLowerAndUpperBodySetup::PelvisBoneName_2_9EE7B7FE4B2769D5E67E5B80B9D13038' has a wrong offset!");
static_assert(offsetof(FStruct_HumanoidLowerAndUpperBodySetup, PelvisBlendDepth_5_CCFACDDA420FA2FBE99F6DBFAFE382BF) == 0x000008, "Member 'FStruct_HumanoidLowerAndUpperBodySetup::PelvisBlendDepth_5_CCFACDDA420FA2FBE99F6DBFAFE382BF' has a wrong offset!");
static_assert(offsetof(FStruct_HumanoidLowerAndUpperBodySetup, LeftLegBoneName_8_4182DA8440659573A8C179BDA73EA3CB) == 0x00000C, "Member 'FStruct_HumanoidLowerAndUpperBodySetup::LeftLegBoneName_8_4182DA8440659573A8C179BDA73EA3CB' has a wrong offset!");
static_assert(offsetof(FStruct_HumanoidLowerAndUpperBodySetup, RightLegBoneName_10_7CF505AE45201C0EE3165AA3FBB60113) == 0x000014, "Member 'FStruct_HumanoidLowerAndUpperBodySetup::RightLegBoneName_10_7CF505AE45201C0EE3165AA3FBB60113' has a wrong offset!");
static_assert(offsetof(FStruct_HumanoidLowerAndUpperBodySetup, LegsBlendDepth_13_A1D5A17B4DCD06C3AD7CAD87C1D9BDD3) == 0x00001C, "Member 'FStruct_HumanoidLowerAndUpperBodySetup::LegsBlendDepth_13_A1D5A17B4DCD06C3AD7CAD87C1D9BDD3' has a wrong offset!");
static_assert(offsetof(FStruct_HumanoidLowerAndUpperBodySetup, UpperBodyBoneName_16_3F810894438B6DE0A3EB2BA34613E7AD) == 0x000020, "Member 'FStruct_HumanoidLowerAndUpperBodySetup::UpperBodyBoneName_16_3F810894438B6DE0A3EB2BA34613E7AD' has a wrong offset!");
static_assert(offsetof(FStruct_HumanoidLowerAndUpperBodySetup, UpperBodyBlendDepth_19_4BB5934F447E0322665173B6A82F9CC3) == 0x000028, "Member 'FStruct_HumanoidLowerAndUpperBodySetup::UpperBodyBlendDepth_19_4BB5934F447E0322665173B6A82F9CC3' has a wrong offset!");

}

