#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_LocomotionTurn

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Struct_LocomotionTurn.Struct_LocomotionTurn
// 0x0020 (0x0020 - 0x0000)
struct FStruct_LocomotionTurn final
{
public:
	class UBlendSpace*                            BlendSpace_Moving_37_73A9965B4B03044D8136D4AA143711EC; // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Turn_Left_44_6ADD2A4343BD6CF0B64E8AB8931EB976;     // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Turn_Right_45_808C167846C1194D78D3DBBA5B8E0B51;    // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace*                            Blendspace_Turning_48_4A48DAD44023C36FF6E68190BD0C9DFB; // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FStruct_LocomotionTurn) == 0x000008, "Wrong alignment on FStruct_LocomotionTurn");
static_assert(sizeof(FStruct_LocomotionTurn) == 0x000020, "Wrong size on FStruct_LocomotionTurn");
static_assert(offsetof(FStruct_LocomotionTurn, BlendSpace_Moving_37_73A9965B4B03044D8136D4AA143711EC) == 0x000000, "Member 'FStruct_LocomotionTurn::BlendSpace_Moving_37_73A9965B4B03044D8136D4AA143711EC' has a wrong offset!");
static_assert(offsetof(FStruct_LocomotionTurn, Turn_Left_44_6ADD2A4343BD6CF0B64E8AB8931EB976) == 0x000008, "Member 'FStruct_LocomotionTurn::Turn_Left_44_6ADD2A4343BD6CF0B64E8AB8931EB976' has a wrong offset!");
static_assert(offsetof(FStruct_LocomotionTurn, Turn_Right_45_808C167846C1194D78D3DBBA5B8E0B51) == 0x000010, "Member 'FStruct_LocomotionTurn::Turn_Right_45_808C167846C1194D78D3DBBA5B8E0B51' has a wrong offset!");
static_assert(offsetof(FStruct_LocomotionTurn, Blendspace_Turning_48_4A48DAD44023C36FF6E68190BD0C9DFB) == 0x000018, "Member 'FStruct_LocomotionTurn::Blendspace_Turning_48_4A48DAD44023C36FF6E68190BD0C9DFB' has a wrong offset!");

}

