#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_EnhancedLocomotionInAir

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Struct_EnhancedLocomotionInAir.Struct_EnhancedLocomotionInAir
// 0x0040 (0x0040 - 0x0000)
struct FStruct_EnhancedLocomotionInAir final
{
public:
	class UAnimSequenceBase*                      JumpingInPlace_2_F47556224E3DE6ADDE13549C6DA50B90; // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      JumpingLeftFoot_4_76629CE5434E8181DD24329894B241CD; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      JumpingRightFoot_6_57FCC5C741E78ED680CA129E5CE03ACB; // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      InAirInPlace_8_40B4B44E43E2B5308695A4A622489727;   // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      InAirLeftFoot_11_C58B0BAE4289A41EE7CD32B2C565EC43; // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      InAirRightFoot_13_F45402EE486B7FB5F5585F949616BA6A; // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      LandInPlace_15_726909154F1536DE9B5D4490F4C86A6A;   // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      LandToSneak_17_A3692DFD4B19DC2F1D8336A9F53AD8ED;   // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FStruct_EnhancedLocomotionInAir) == 0x000008, "Wrong alignment on FStruct_EnhancedLocomotionInAir");
static_assert(sizeof(FStruct_EnhancedLocomotionInAir) == 0x000040, "Wrong size on FStruct_EnhancedLocomotionInAir");
static_assert(offsetof(FStruct_EnhancedLocomotionInAir, JumpingInPlace_2_F47556224E3DE6ADDE13549C6DA50B90) == 0x000000, "Member 'FStruct_EnhancedLocomotionInAir::JumpingInPlace_2_F47556224E3DE6ADDE13549C6DA50B90' has a wrong offset!");
static_assert(offsetof(FStruct_EnhancedLocomotionInAir, JumpingLeftFoot_4_76629CE5434E8181DD24329894B241CD) == 0x000008, "Member 'FStruct_EnhancedLocomotionInAir::JumpingLeftFoot_4_76629CE5434E8181DD24329894B241CD' has a wrong offset!");
static_assert(offsetof(FStruct_EnhancedLocomotionInAir, JumpingRightFoot_6_57FCC5C741E78ED680CA129E5CE03ACB) == 0x000010, "Member 'FStruct_EnhancedLocomotionInAir::JumpingRightFoot_6_57FCC5C741E78ED680CA129E5CE03ACB' has a wrong offset!");
static_assert(offsetof(FStruct_EnhancedLocomotionInAir, InAirInPlace_8_40B4B44E43E2B5308695A4A622489727) == 0x000018, "Member 'FStruct_EnhancedLocomotionInAir::InAirInPlace_8_40B4B44E43E2B5308695A4A622489727' has a wrong offset!");
static_assert(offsetof(FStruct_EnhancedLocomotionInAir, InAirLeftFoot_11_C58B0BAE4289A41EE7CD32B2C565EC43) == 0x000020, "Member 'FStruct_EnhancedLocomotionInAir::InAirLeftFoot_11_C58B0BAE4289A41EE7CD32B2C565EC43' has a wrong offset!");
static_assert(offsetof(FStruct_EnhancedLocomotionInAir, InAirRightFoot_13_F45402EE486B7FB5F5585F949616BA6A) == 0x000028, "Member 'FStruct_EnhancedLocomotionInAir::InAirRightFoot_13_F45402EE486B7FB5F5585F949616BA6A' has a wrong offset!");
static_assert(offsetof(FStruct_EnhancedLocomotionInAir, LandInPlace_15_726909154F1536DE9B5D4490F4C86A6A) == 0x000030, "Member 'FStruct_EnhancedLocomotionInAir::LandInPlace_15_726909154F1536DE9B5D4490F4C86A6A' has a wrong offset!");
static_assert(offsetof(FStruct_EnhancedLocomotionInAir, LandToSneak_17_A3692DFD4B19DC2F1D8336A9F53AD8ED) == 0x000038, "Member 'FStruct_EnhancedLocomotionInAir::LandToSneak_17_A3692DFD4B19DC2F1D8336A9F53AD8ED' has a wrong offset!");

}

