#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TABP_BlockShield

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function TABP_BlockShield.TABP_BlockShield_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct TABP_BlockShield_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(TABP_BlockShield_C_AnimGraph) == 0x000008, "Wrong alignment on TABP_BlockShield_C_AnimGraph");
static_assert(sizeof(TABP_BlockShield_C_AnimGraph) == 0x000010, "Wrong size on TABP_BlockShield_C_AnimGraph");
static_assert(offsetof(TABP_BlockShield_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'TABP_BlockShield_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function TABP_BlockShield.TABP_BlockShield_C.BlockingLayer
// 0x0010 (0x0010 - 0x0000)
struct TABP_BlockShield_C_BlockingLayer final
{
public:
	struct FPoseLink                              BlockingLayer_0;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(TABP_BlockShield_C_BlockingLayer) == 0x000008, "Wrong alignment on TABP_BlockShield_C_BlockingLayer");
static_assert(sizeof(TABP_BlockShield_C_BlockingLayer) == 0x000010, "Wrong size on TABP_BlockShield_C_BlockingLayer");
static_assert(offsetof(TABP_BlockShield_C_BlockingLayer, BlockingLayer_0) == 0x000000, "Member 'TABP_BlockShield_C_BlockingLayer::BlockingLayer_0' has a wrong offset!");

// Function TABP_BlockShield.TABP_BlockShield_C.ExecuteUbergraph_TABP_BlockShield
// 0x0004 (0x0004 - 0x0000)
struct TABP_BlockShield_C_ExecuteUbergraph_TABP_BlockShield final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TABP_BlockShield_C_ExecuteUbergraph_TABP_BlockShield) == 0x000004, "Wrong alignment on TABP_BlockShield_C_ExecuteUbergraph_TABP_BlockShield");
static_assert(sizeof(TABP_BlockShield_C_ExecuteUbergraph_TABP_BlockShield) == 0x000004, "Wrong size on TABP_BlockShield_C_ExecuteUbergraph_TABP_BlockShield");
static_assert(offsetof(TABP_BlockShield_C_ExecuteUbergraph_TABP_BlockShield, EntryPoint) == 0x000000, "Member 'TABP_BlockShield_C_ExecuteUbergraph_TABP_BlockShield::EntryPoint' has a wrong offset!");

}

