#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TABP_LookAt

#include "Basic.hpp"

#include "AnimationNodeRuntime_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "TABP_LookAt_structs.hpp"
#include "Altar_classes.hpp"
#include "Struct_LookAt_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass TABP_LookAt.TABP_LookAt_C
// 0x0520 (0x08D0 - 0x03B0)
class UTABP_LookAt_C final : public UVLookAtAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct TABP_LookAt::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                  // 0x03B8(0x0003)(HasGetValueTypeHash)
	uint8                                         Pad_3BB[0x5];                                      // 0x03BB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x03C0(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x03C8(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x03D0(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x03F0(0x00B8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x04A8(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x04F0(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x0570(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x0598(0x0028)()
	struct FAnimNode_AdvancedLookAt               AnimGraphNode_AdvancedLookAt;                      // 0x05C0(0x0200)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x07C0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x07E0(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0800(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x0848(0x0028)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0870(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x0890(0x0010)()
	struct FVector                                K2Node_PropertyAccess_2;                           // 0x08A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_PropertyAccess;                             // 0x08B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8B9[0x7];                                      // 0x08B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_LookAt                         LayerData;                                         // 0x08C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_TABP_LookAt_AnimGraphNode_AdvancedLookAt_A0FAD3894A8BA22925668A80995EC038();
	void ExecuteUbergraph_TABP_LookAt(int32 EntryPoint);
	void LookAtLayer(const struct FPoseLink& AnimationPose, struct FPoseLink* LookAtLayer_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TABP_LookAt_C">();
	}
	static class UTABP_LookAt_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTABP_LookAt_C>();
	}
};
static_assert(alignof(UTABP_LookAt_C) == 0x000010, "Wrong alignment on UTABP_LookAt_C");
static_assert(sizeof(UTABP_LookAt_C) == 0x0008D0, "Wrong size on UTABP_LookAt_C");
static_assert(offsetof(UTABP_LookAt_C, UberGraphFrame) == 0x0003B0, "Member 'UTABP_LookAt_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTABP_LookAt_C, __AnimBlueprintMutables) == 0x0003B8, "Member 'UTABP_LookAt_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UTABP_LookAt_C, AnimBlueprintExtension_PropertyAccess) == 0x0003C0, "Member 'UTABP_LookAt_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UTABP_LookAt_C, AnimBlueprintExtension_Base) == 0x0003C8, "Member 'UTABP_LookAt_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UTABP_LookAt_C, AnimGraphNode_Root_1) == 0x0003D0, "Member 'UTABP_LookAt_C::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(UTABP_LookAt_C, AnimGraphNode_LinkedInputPose) == 0x0003F0, "Member 'UTABP_LookAt_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UTABP_LookAt_C, AnimGraphNode_BlendListByBool_1) == 0x0004A8, "Member 'UTABP_LookAt_C::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(UTABP_LookAt_C, AnimGraphNode_SaveCachedPose) == 0x0004F0, "Member 'UTABP_LookAt_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UTABP_LookAt_C, AnimGraphNode_UseCachedPose_2) == 0x000570, "Member 'UTABP_LookAt_C::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(UTABP_LookAt_C, AnimGraphNode_UseCachedPose_1) == 0x000598, "Member 'UTABP_LookAt_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UTABP_LookAt_C, AnimGraphNode_AdvancedLookAt) == 0x0005C0, "Member 'UTABP_LookAt_C::AnimGraphNode_AdvancedLookAt' has a wrong offset!");
static_assert(offsetof(UTABP_LookAt_C, AnimGraphNode_LocalToComponentSpace) == 0x0007C0, "Member 'UTABP_LookAt_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UTABP_LookAt_C, AnimGraphNode_ComponentToLocalSpace) == 0x0007E0, "Member 'UTABP_LookAt_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UTABP_LookAt_C, AnimGraphNode_BlendListByBool) == 0x000800, "Member 'UTABP_LookAt_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UTABP_LookAt_C, AnimGraphNode_UseCachedPose) == 0x000848, "Member 'UTABP_LookAt_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UTABP_LookAt_C, AnimGraphNode_Root) == 0x000870, "Member 'UTABP_LookAt_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UTABP_LookAt_C, AnimGraphNode_LocalRefPose) == 0x000890, "Member 'UTABP_LookAt_C::AnimGraphNode_LocalRefPose' has a wrong offset!");
static_assert(offsetof(UTABP_LookAt_C, K2Node_PropertyAccess_2) == 0x0008A0, "Member 'UTABP_LookAt_C::K2Node_PropertyAccess_2' has a wrong offset!");
static_assert(offsetof(UTABP_LookAt_C, K2Node_PropertyAccess) == 0x0008B8, "Member 'UTABP_LookAt_C::K2Node_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UTABP_LookAt_C, LayerData) == 0x0008C0, "Member 'UTABP_LookAt_C::LayerData' has a wrong offset!");

}

