#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TABP_EquipUnequip_StandSneak_Single

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Altar_classes.hpp"
#include "TABP_EquipUnequip_StandSneak_Single_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass TABP_EquipUnequip_StandSneak_Single.TABP_EquipUnequip_StandSneak_Single_C
// 0x0330 (0x0710 - 0x03E0)
class UTABP_EquipUnequip_StandSneak_Single_C final : public UVEquipUnequipStandSneakSingle
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct TABP_EquipUnequip_StandSneak_Single::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x03E8(0x000C)(HasGetValueTypeHash)
	uint8                                         Pad_3F4[0x4];                                      // 0x03F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x03F8(0x0008)()
	struct FAnimSubsystemInstance_NodeRelevancy   AnimBlueprintExtension_NodeRelevancy;              // 0x0400(0x00A8)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x04A8(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x04B0(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x04D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x04F8(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0520(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0568(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0588(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x05D0(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x05F0(0x0028)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0618(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x06E0(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x0700(0x0010)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void EquipUnequipLayer(struct FPoseLink* EquipUnequipLayer_0);
	void ExecuteUbergraph_TABP_EquipUnequip_StandSneak_Single(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TABP_EquipUnequip_StandSneak_Single_C">();
	}
	static class UTABP_EquipUnequip_StandSneak_Single_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTABP_EquipUnequip_StandSneak_Single_C>();
	}
};
static_assert(alignof(UTABP_EquipUnequip_StandSneak_Single_C) == 0x000010, "Wrong alignment on UTABP_EquipUnequip_StandSneak_Single_C");
static_assert(sizeof(UTABP_EquipUnequip_StandSneak_Single_C) == 0x000710, "Wrong size on UTABP_EquipUnequip_StandSneak_Single_C");
static_assert(offsetof(UTABP_EquipUnequip_StandSneak_Single_C, UberGraphFrame) == 0x0003E0, "Member 'UTABP_EquipUnequip_StandSneak_Single_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTABP_EquipUnequip_StandSneak_Single_C, __AnimBlueprintMutables) == 0x0003E8, "Member 'UTABP_EquipUnequip_StandSneak_Single_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UTABP_EquipUnequip_StandSneak_Single_C, AnimBlueprintExtension_PropertyAccess) == 0x0003F8, "Member 'UTABP_EquipUnequip_StandSneak_Single_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UTABP_EquipUnequip_StandSneak_Single_C, AnimBlueprintExtension_NodeRelevancy) == 0x000400, "Member 'UTABP_EquipUnequip_StandSneak_Single_C::AnimBlueprintExtension_NodeRelevancy' has a wrong offset!");
static_assert(offsetof(UTABP_EquipUnequip_StandSneak_Single_C, AnimBlueprintExtension_Base) == 0x0004A8, "Member 'UTABP_EquipUnequip_StandSneak_Single_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UTABP_EquipUnequip_StandSneak_Single_C, AnimGraphNode_Root_1) == 0x0004B0, "Member 'UTABP_EquipUnequip_StandSneak_Single_C::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(UTABP_EquipUnequip_StandSneak_Single_C, AnimGraphNode_TransitionResult_2) == 0x0004D0, "Member 'UTABP_EquipUnequip_StandSneak_Single_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UTABP_EquipUnequip_StandSneak_Single_C, AnimGraphNode_TransitionResult_1) == 0x0004F8, "Member 'UTABP_EquipUnequip_StandSneak_Single_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UTABP_EquipUnequip_StandSneak_Single_C, AnimGraphNode_SequencePlayer_1) == 0x000520, "Member 'UTABP_EquipUnequip_StandSneak_Single_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UTABP_EquipUnequip_StandSneak_Single_C, AnimGraphNode_StateResult_1) == 0x000568, "Member 'UTABP_EquipUnequip_StandSneak_Single_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UTABP_EquipUnequip_StandSneak_Single_C, AnimGraphNode_SequencePlayer) == 0x000588, "Member 'UTABP_EquipUnequip_StandSneak_Single_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UTABP_EquipUnequip_StandSneak_Single_C, AnimGraphNode_StateResult) == 0x0005D0, "Member 'UTABP_EquipUnequip_StandSneak_Single_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UTABP_EquipUnequip_StandSneak_Single_C, AnimGraphNode_TransitionResult) == 0x0005F0, "Member 'UTABP_EquipUnequip_StandSneak_Single_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UTABP_EquipUnequip_StandSneak_Single_C, AnimGraphNode_StateMachine) == 0x000618, "Member 'UTABP_EquipUnequip_StandSneak_Single_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UTABP_EquipUnequip_StandSneak_Single_C, AnimGraphNode_Root) == 0x0006E0, "Member 'UTABP_EquipUnequip_StandSneak_Single_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UTABP_EquipUnequip_StandSneak_Single_C, AnimGraphNode_LocalRefPose) == 0x000700, "Member 'UTABP_EquipUnequip_StandSneak_Single_C::AnimGraphNode_LocalRefPose' has a wrong offset!");

}

