#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TABP_Resurrection

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function TABP_Resurrection.TABP_Resurrection_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct TABP_Resurrection_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(TABP_Resurrection_C_AnimGraph) == 0x000008, "Wrong alignment on TABP_Resurrection_C_AnimGraph");
static_assert(sizeof(TABP_Resurrection_C_AnimGraph) == 0x000010, "Wrong size on TABP_Resurrection_C_AnimGraph");
static_assert(offsetof(TABP_Resurrection_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'TABP_Resurrection_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function TABP_Resurrection.TABP_Resurrection_C.ExecuteUbergraph_TABP_Resurrection
// 0x0004 (0x0004 - 0x0000)
struct TABP_Resurrection_C_ExecuteUbergraph_TABP_Resurrection final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TABP_Resurrection_C_ExecuteUbergraph_TABP_Resurrection) == 0x000004, "Wrong alignment on TABP_Resurrection_C_ExecuteUbergraph_TABP_Resurrection");
static_assert(sizeof(TABP_Resurrection_C_ExecuteUbergraph_TABP_Resurrection) == 0x000004, "Wrong size on TABP_Resurrection_C_ExecuteUbergraph_TABP_Resurrection");
static_assert(offsetof(TABP_Resurrection_C_ExecuteUbergraph_TABP_Resurrection, EntryPoint) == 0x000000, "Member 'TABP_Resurrection_C_ExecuteUbergraph_TABP_Resurrection::EntryPoint' has a wrong offset!");

// Function TABP_Resurrection.TABP_Resurrection_C.ResurrectionLayer
// 0x0010 (0x0010 - 0x0000)
struct TABP_Resurrection_C_ResurrectionLayer final
{
public:
	struct FPoseLink                              ResurrectionLayer_0;                               // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(TABP_Resurrection_C_ResurrectionLayer) == 0x000008, "Wrong alignment on TABP_Resurrection_C_ResurrectionLayer");
static_assert(sizeof(TABP_Resurrection_C_ResurrectionLayer) == 0x000010, "Wrong size on TABP_Resurrection_C_ResurrectionLayer");
static_assert(offsetof(TABP_Resurrection_C_ResurrectionLayer, ResurrectionLayer_0) == 0x000000, "Member 'TABP_Resurrection_C_ResurrectionLayer::ResurrectionLayer_0' has a wrong offset!");

}

