#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TABP_ReverseCharacter

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "TABP_ReverseCharacter_structs.hpp"
#include "Altar_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass TABP_ReverseCharacter.TABP_ReverseCharacter_C
// 0x3C00 (0x43E0 - 0x07E0)
class UTABP_ReverseCharacter_C : public UVMainCharacterAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct TABP_ReverseCharacter::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;        // 0x07E8(0x0003)(HasGetValueTypeHash)
	uint8                                         Pad_7EB[0x5];                                      // 0x07EB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x07F0(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x07F8(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_32;                             // 0x0800(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_23;                  // 0x0820(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_31;                             // 0x08D8(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_22;                  // 0x08F8(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_30;                             // 0x09B0(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_21;                  // 0x09D0(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_29;                             // 0x0A88(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_20;                  // 0x0AA8(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_28;                             // 0x0B60(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_12;                     // 0x0B80(0x0010)()
	struct FAnimNode_Root                         AnimGraphNode_Root_27;                             // 0x0B90(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_19;                  // 0x0BB0(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_26;                             // 0x0C68(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_18;                  // 0x0C88(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_25;                             // 0x0D40(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_17;                  // 0x0D60(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_24;                             // 0x0E18(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_23;                             // 0x0E38(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_16;                  // 0x0E58(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_22;                             // 0x0F10(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_11;                     // 0x0F30(0x0010)()
	struct FAnimNode_Root                         AnimGraphNode_Root_21;                             // 0x0F40(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_15;                  // 0x0F60(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_20;                             // 0x1018(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_10;                     // 0x1038(0x0010)()
	struct FAnimNode_Root                         AnimGraphNode_Root_19;                             // 0x1048(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_14;                  // 0x1068(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_18;                             // 0x1120(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_13;                  // 0x1140(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_17;                             // 0x11F8(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_12;                  // 0x1218(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_16;                             // 0x12D0(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_11;                  // 0x12F0(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_15;                             // 0x13A8(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_10;                  // 0x13C8(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_14;                             // 0x1480(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_9;                      // 0x14A0(0x0010)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_9;                   // 0x14B0(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_13;                             // 0x1568(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_8;                      // 0x1588(0x0010)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_8;                   // 0x1598(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_12;                             // 0x1650(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_7;                   // 0x1670(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_11;                             // 0x1728(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_6;                   // 0x1748(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_10;                             // 0x1800(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_5;                   // 0x1820(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_9;                              // 0x18D8(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_7;                      // 0x18F8(0x0010)()
	struct FAnimNode_Root                         AnimGraphNode_Root_8;                              // 0x1908(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_6;                      // 0x1928(0x0010)()
	struct FAnimNode_Root                         AnimGraphNode_Root_7;                              // 0x1938(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_5;                      // 0x1958(0x0010)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_4;                   // 0x1968(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_6;                              // 0x1A20(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_3;                   // 0x1A40(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_5;                              // 0x1AF8(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0x1B18(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_4;                              // 0x1BD0(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x1BF0(0x00B8)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x1CA8(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0x1D60(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_4;                      // 0x1D80(0x0010)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x1D90(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_3;                      // 0x1DB0(0x0010)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x1DC0(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_2;                      // 0x1DE0(0x0010)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x1DF0(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_21;                 // 0x1E10(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_20;                 // 0x1E38(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_19;                 // 0x1E60(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_18;                 // 0x1E88(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_17;                 // 0x1EB0(0x0028)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_31;                  // 0x1ED8(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_12;                      // 0x1FA0(0x0020)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_30;                  // 0x1FC0(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_11;                      // 0x2088(0x0020)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_29;                  // 0x20A8(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_10;                      // 0x2170(0x0020)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_28;                  // 0x2190(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_9;                       // 0x2258(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0x2278(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_3;                    // 0x2340(0x0080)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_1;                      // 0x23C0(0x0010)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_16;                 // 0x23D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_15;                 // 0x23F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_14;                 // 0x2420(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_13;                 // 0x2448(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_12;                 // 0x2470(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_11;                 // 0x2498(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_10;                 // 0x24C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9;                  // 0x24E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0x2510(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0x2538(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x2560(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x2588(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x25B0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x25D8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x2600(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x2628(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x2650(0x0028)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_27;                  // 0x2678(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_8;                       // 0x2740(0x0020)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_26;                  // 0x2760(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_7;                       // 0x2828(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x2848(0x0010)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_25;                  // 0x2858(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6;                       // 0x2920(0x0020)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_24;                  // 0x2940(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x2A08(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_7;                     // 0x2A28(0x0028)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_23;                  // 0x2A50(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x2B18(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_6;                     // 0x2B38(0x0028)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_22;                  // 0x2B60(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x2C28(0x0020)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_21;                  // 0x2C48(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x2D10(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5;                     // 0x2D30(0x0028)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_20;                  // 0x2D58(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x2E20(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x2E40(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x2E68(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x2E88(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2;                    // 0x2F50(0x0080)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_19;                  // 0x2FD0(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x3098(0x0080)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_3;                              // 0x3118(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2;                              // 0x3160(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x31A8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x31D0(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x31F8(0x0048)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_18;                  // 0x3240(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x3308(0x0028)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_17;                  // 0x3330(0x00C8)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_16;                  // 0x33F8(0x00C8)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_15;                  // 0x34C0(0x00C8)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_14;                  // 0x3588(0x00C8)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_13;                  // 0x3650(0x00C8)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_12;                  // 0x3718(0x00C8)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_11;                  // 0x37E0(0x00C8)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_10;                  // 0x38A8(0x00C8)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_9;                   // 0x3970(0x00C8)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_8;                   // 0x3A38(0x00C8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x3B00(0x0048)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_7;                   // 0x3B48(0x00C8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x3C10(0x0048)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_6;                   // 0x3C58(0x00C8)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_5;                   // 0x3D20(0x00C8)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_4;                   // 0x3DE8(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x3EB0(0x0080)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x3F30(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x3F78(0x0028)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_3;                   // 0x3FA0(0x00C8)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_2;                   // 0x4068(0x00C8)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_1;                   // 0x4130(0x00C8)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer;                     // 0x41F8(0x00C8)()
	struct FAnimNode_Inertialization              AnimGraphNode_Inertialization;                     // 0x42C0(0x0110)()
	bool                                          K2Node_PropertyAccess_21;                          // 0x43D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_PropertyAccess_19;                          // 0x43D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_PropertyAccess_15;                          // 0x43D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_PropertyAccess_14;                          // 0x43D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_PropertyAccess_13;                          // 0x43D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_PropertyAccess_12;                          // 0x43D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_PropertyAccess_11;                          // 0x43D6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_PropertyAccess_7;                           // 0x43D7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_PropertyAccess_6;                           // 0x43D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_PropertyAccess_5;                           // 0x43D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_PropertyAccess_4;                           // 0x43DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_PropertyAccess_3;                           // 0x43DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_PropertyAccess_2;                           // 0x43DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_PropertyAccess_1;                           // 0x43DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_PropertyAccess;                             // 0x43DE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void AttackingLayer(const struct FPoseLink& InPose, struct FPoseLink* AttackingLayer_0);
	void BlinkingLayer(const struct FPoseLink& InPose, struct FPoseLink* BlinkingLayer_0);
	void BlockingLayer(struct FPoseLink* BlockingLayer_0);
	void BodyPhysics(const struct FPoseLink& InPose, struct FPoseLink* BodyPhysics_0);
	void ConversationIdleLayer(const struct FPoseLink& InPose, struct FPoseLink* ConversationIdleLayer_0);
	void Death_Layer(const struct FPoseLink& InPose, struct FPoseLink* Death_Layer_0);
	void DodgeLayer(struct FPoseLink* DodgeLayer_0);
	void EnhancedLocomotionLayer(const struct FPoseLink& InPose, struct FPoseLink* EnhancedLocomotionLayer_0);
	void EquipUnequipLayer(struct FPoseLink* EquipUnequipLayer_0);
	void ExecuteUbergraph_TABP_ReverseCharacter(int32 EntryPoint);
