#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TABP_EnhancedLocomotionStanding

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "TABP_EnhancedLocomotionStanding_structs.hpp"
#include "Altar_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass TABP_EnhancedLocomotionStanding.TABP_EnhancedLocomotionStanding_C
// 0x0360 (0x07F0 - 0x0490)
class UTABP_EnhancedLocomotionStanding_C final : public UVEnhancedLocomotionCharacterAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0490(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct TABP_EnhancedLocomotionStanding::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x0498(0x0020)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x04B8(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x04C0(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x04C8(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x04E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0510(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0538(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0580(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_1;                  // 0x05A0(0x0070)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0610(0x0048)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x0658(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x06C8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x06E8(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x07B0(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x07D0(0x0010)()
	bool                                          K2Node_PropertyAccess_8;                           // 0x07E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_PropertyAccess_7;                           // 0x07E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_PropertyAccess_2;                           // 0x07E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_TABP_EnhancedLocomotionStanding(int32 EntryPoint);
	void StandingLayer(struct FPoseLink* StandingLayer_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TABP_EnhancedLocomotionStanding_C">();
	}
	static class UTABP_EnhancedLocomotionStanding_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTABP_EnhancedLocomotionStanding_C>();
	}
};
static_assert(alignof(UTABP_EnhancedLocomotionStanding_C) == 0x000010, "Wrong alignment on UTABP_EnhancedLocomotionStanding_C");
static_assert(sizeof(UTABP_EnhancedLocomotionStanding_C) == 0x0007F0, "Wrong size on UTABP_EnhancedLocomotionStanding_C");
static_assert(offsetof(UTABP_EnhancedLocomotionStanding_C, UberGraphFrame) == 0x000490, "Member 'UTABP_EnhancedLocomotionStanding_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTABP_EnhancedLocomotionStanding_C, __AnimBlueprintMutables) == 0x000498, "Member 'UTABP_EnhancedLocomotionStanding_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UTABP_EnhancedLocomotionStanding_C, AnimBlueprintExtension_PropertyAccess) == 0x0004B8, "Member 'UTABP_EnhancedLocomotionStanding_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UTABP_EnhancedLocomotionStanding_C, AnimBlueprintExtension_Base) == 0x0004C0, "Member 'UTABP_EnhancedLocomotionStanding_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UTABP_EnhancedLocomotionStanding_C, AnimGraphNode_Root_1) == 0x0004C8, "Member 'UTABP_EnhancedLocomotionStanding_C::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(UTABP_EnhancedLocomotionStanding_C, AnimGraphNode_TransitionResult_1) == 0x0004E8, "Member 'UTABP_EnhancedLocomotionStanding_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UTABP_EnhancedLocomotionStanding_C, AnimGraphNode_TransitionResult) == 0x000510, "Member 'UTABP_EnhancedLocomotionStanding_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UTABP_EnhancedLocomotionStanding_C, AnimGraphNode_SequencePlayer) == 0x000538, "Member 'UTABP_EnhancedLocomotionStanding_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UTABP_EnhancedLocomotionStanding_C, AnimGraphNode_StateResult_1) == 0x000580, "Member 'UTABP_EnhancedLocomotionStanding_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UTABP_EnhancedLocomotionStanding_C, AnimGraphNode_BlendSpacePlayer_1) == 0x0005A0, "Member 'UTABP_EnhancedLocomotionStanding_C::AnimGraphNode_BlendSpacePlayer_1' has a wrong offset!");
static_assert(offsetof(UTABP_EnhancedLocomotionStanding_C, AnimGraphNode_BlendListByBool) == 0x000610, "Member 'UTABP_EnhancedLocomotionStanding_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UTABP_EnhancedLocomotionStanding_C, AnimGraphNode_BlendSpacePlayer) == 0x000658, "Member 'UTABP_EnhancedLocomotionStanding_C::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(UTABP_EnhancedLocomotionStanding_C, AnimGraphNode_StateResult) == 0x0006C8, "Member 'UTABP_EnhancedLocomotionStanding_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UTABP_EnhancedLocomotionStanding_C, AnimGraphNode_StateMachine) == 0x0006E8, "Member 'UTABP_EnhancedLocomotionStanding_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UTABP_EnhancedLocomotionStanding_C, AnimGraphNode_Root) == 0x0007B0, "Member 'UTABP_EnhancedLocomotionStanding_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UTABP_EnhancedLocomotionStanding_C, AnimGraphNode_LocalRefPose) == 0x0007D0, "Member 'UTABP_EnhancedLocomotionStanding_C::AnimGraphNode_LocalRefPose' has a wrong offset!");
static_assert(offsetof(UTABP_EnhancedLocomotionStanding_C, K2Node_PropertyAccess_8) == 0x0007E0, "Member 'UTABP_EnhancedLocomotionStanding_C::K2Node_PropertyAccess_8' has a wrong offset!");
static_assert(offsetof(UTABP_EnhancedLocomotionStanding_C, K2Node_PropertyAccess_7) == 0x0007E1, "Member 'UTABP_EnhancedLocomotionStanding_C::K2Node_PropertyAccess_7' has a wrong offset!");
static_assert(offsetof(UTABP_EnhancedLocomotionStanding_C, K2Node_PropertyAccess_2) == 0x0007E2, "Member 'UTABP_EnhancedLocomotionStanding_C::K2Node_PropertyAccess_2' has a wrong offset!");

}

