#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TABP_TorchLayer_ThirdPerson

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function TABP_TorchLayer_ThirdPerson.TABP_TorchLayer_ThirdPerson_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct TABP_TorchLayer_ThirdPerson_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(TABP_TorchLayer_ThirdPerson_C_AnimGraph) == 0x000008, "Wrong alignment on TABP_TorchLayer_ThirdPerson_C_AnimGraph");
static_assert(sizeof(TABP_TorchLayer_ThirdPerson_C_AnimGraph) == 0x000010, "Wrong size on TABP_TorchLayer_ThirdPerson_C_AnimGraph");
static_assert(offsetof(TABP_TorchLayer_ThirdPerson_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'TABP_TorchLayer_ThirdPerson_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function TABP_TorchLayer_ThirdPerson.TABP_TorchLayer_ThirdPerson_C.ExecuteUbergraph_TABP_TorchLayer_ThirdPerson
// 0x0004 (0x0004 - 0x0000)
struct TABP_TorchLayer_ThirdPerson_C_ExecuteUbergraph_TABP_TorchLayer_ThirdPerson final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TABP_TorchLayer_ThirdPerson_C_ExecuteUbergraph_TABP_TorchLayer_ThirdPerson) == 0x000004, "Wrong alignment on TABP_TorchLayer_ThirdPerson_C_ExecuteUbergraph_TABP_TorchLayer_ThirdPerson");
static_assert(sizeof(TABP_TorchLayer_ThirdPerson_C_ExecuteUbergraph_TABP_TorchLayer_ThirdPerson) == 0x000004, "Wrong size on TABP_TorchLayer_ThirdPerson_C_ExecuteUbergraph_TABP_TorchLayer_ThirdPerson");
static_assert(offsetof(TABP_TorchLayer_ThirdPerson_C_ExecuteUbergraph_TABP_TorchLayer_ThirdPerson, EntryPoint) == 0x000000, "Member 'TABP_TorchLayer_ThirdPerson_C_ExecuteUbergraph_TABP_TorchLayer_ThirdPerson::EntryPoint' has a wrong offset!");

// Function TABP_TorchLayer_ThirdPerson.TABP_TorchLayer_ThirdPerson_C.TorchLayer
// 0x0020 (0x0020 - 0x0000)
struct TABP_TorchLayer_ThirdPerson_C_TorchLayer final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              TorchLayer_0;                                      // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(TABP_TorchLayer_ThirdPerson_C_TorchLayer) == 0x000008, "Wrong alignment on TABP_TorchLayer_ThirdPerson_C_TorchLayer");
static_assert(sizeof(TABP_TorchLayer_ThirdPerson_C_TorchLayer) == 0x000020, "Wrong size on TABP_TorchLayer_ThirdPerson_C_TorchLayer");
static_assert(offsetof(TABP_TorchLayer_ThirdPerson_C_TorchLayer, InPose) == 0x000000, "Member 'TABP_TorchLayer_ThirdPerson_C_TorchLayer::InPose' has a wrong offset!");
static_assert(offsetof(TABP_TorchLayer_ThirdPerson_C_TorchLayer, TorchLayer_0) == 0x000010, "Member 'TABP_TorchLayer_ThirdPerson_C_TorchLayer::TorchLayer_0' has a wrong offset!");

}

