#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TABP_MeleeAttack_LightCombo

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "TABP_MeleeAttack_LightCombo_structs.hpp"
#include "Altar_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass TABP_MeleeAttack_LightCombo.TABP_MeleeAttack_LightCombo_C
// 0x0530 (0x0940 - 0x0410)
class UTABP_MeleeAttack_LightCombo_C final : public UVMeleeAttackComboAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0410(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct TABP_MeleeAttack_LightCombo::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;  // 0x0418(0x0014)(HasGetValueTypeHash)
	uint8                                         Pad_42C[0x4];                                      // 0x042C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0430(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0438(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x0440(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x0460(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x0488(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x04B0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x04D8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0500(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x0528(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x0550(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x0570(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x05B8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x05D8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x0620(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0640(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0688(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x06A8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x06F0(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0710(0x00C8)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x07D8(0x00B8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x0890(0x0080)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0910(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x0930(0x0010)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void AttackingLayer(const struct FPoseLink& InPose, struct FPoseLink* AttackingLayer_0);
	void ExecuteUbergraph_TABP_MeleeAttack_LightCombo(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TABP_MeleeAttack_LightCombo_C">();
	}
	static class UTABP_MeleeAttack_LightCombo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTABP_MeleeAttack_LightCombo_C>();
	}
};
static_assert(alignof(UTABP_MeleeAttack_LightCombo_C) == 0x000010, "Wrong alignment on UTABP_MeleeAttack_LightCombo_C");
static_assert(sizeof(UTABP_MeleeAttack_LightCombo_C) == 0x000940, "Wrong size on UTABP_MeleeAttack_LightCombo_C");
static_assert(offsetof(UTABP_MeleeAttack_LightCombo_C, UberGraphFrame) == 0x000410, "Member 'UTABP_MeleeAttack_LightCombo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTABP_MeleeAttack_LightCombo_C, __AnimBlueprintMutables) == 0x000418, "Member 'UTABP_MeleeAttack_LightCombo_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UTABP_MeleeAttack_LightCombo_C, AnimBlueprintExtension_PropertyAccess) == 0x000430, "Member 'UTABP_MeleeAttack_LightCombo_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UTABP_MeleeAttack_LightCombo_C, AnimBlueprintExtension_Base) == 0x000438, "Member 'UTABP_MeleeAttack_LightCombo_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UTABP_MeleeAttack_LightCombo_C, AnimGraphNode_Root_1) == 0x000440, "Member 'UTABP_MeleeAttack_LightCombo_C::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(UTABP_MeleeAttack_LightCombo_C, AnimGraphNode_TransitionResult_4) == 0x000460, "Member 'UTABP_MeleeAttack_LightCombo_C::AnimGraphNode_TransitionResult_4' has a wrong offset!");
static_assert(offsetof(UTABP_MeleeAttack_LightCombo_C, AnimGraphNode_TransitionResult_3) == 0x000488, "Member 'UTABP_MeleeAttack_LightCombo_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UTABP_MeleeAttack_LightCombo_C, AnimGraphNode_TransitionResult_2) == 0x0004B0, "Member 'UTABP_MeleeAttack_LightCombo_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UTABP_MeleeAttack_LightCombo_C, AnimGraphNode_TransitionResult_1) == 0x0004D8, "Member 'UTABP_MeleeAttack_LightCombo_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UTABP_MeleeAttack_LightCombo_C, AnimGraphNode_TransitionResult) == 0x000500, "Member 'UTABP_MeleeAttack_LightCombo_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UTABP_MeleeAttack_LightCombo_C, AnimGraphNode_UseCachedPose) == 0x000528, "Member 'UTABP_MeleeAttack_LightCombo_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UTABP_MeleeAttack_LightCombo_C, AnimGraphNode_StateResult_4) == 0x000550, "Member 'UTABP_MeleeAttack_LightCombo_C::AnimGraphNode_StateResult_4' has a wrong offset!");
static_assert(offsetof(UTABP_MeleeAttack_LightCombo_C, AnimGraphNode_SequencePlayer_3) == 0x000570, "Member 'UTABP_MeleeAttack_LightCombo_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UTABP_MeleeAttack_LightCombo_C, AnimGraphNode_StateResult_3) == 0x0005B8, "Member 'UTABP_MeleeAttack_LightCombo_C::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(UTABP_MeleeAttack_LightCombo_C, AnimGraphNode_SequencePlayer_2) == 0x0005D8, "Member 'UTABP_MeleeAttack_LightCombo_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UTABP_MeleeAttack_LightCombo_C, AnimGraphNode_StateResult_2) == 0x000620, "Member 'UTABP_MeleeAttack_LightCombo_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UTABP_MeleeAttack_LightCombo_C, AnimGraphNode_SequencePlayer_1) == 0x000640, "Member 'UTABP_MeleeAttack_LightCombo_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UTABP_MeleeAttack_LightCombo_C, AnimGraphNode_StateResult_1) == 0x000688, "Member 'UTABP_MeleeAttack_LightCombo_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UTABP_MeleeAttack_LightCombo_C, AnimGraphNode_SequencePlayer) == 0x0006A8, "Member 'UTABP_MeleeAttack_LightCombo_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UTABP_MeleeAttack_LightCombo_C, AnimGraphNode_StateResult) == 0x0006F0, "Member 'UTABP_MeleeAttack_LightCombo_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UTABP_MeleeAttack_LightCombo_C, AnimGraphNode_StateMachine) == 0x000710, "Member 'UTABP_MeleeAttack_LightCombo_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UTABP_MeleeAttack_LightCombo_C, AnimGraphNode_LinkedInputPose) == 0x0007D8, "Member 'UTABP_MeleeAttack_LightCombo_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UTABP_MeleeAttack_LightCombo_C, AnimGraphNode_SaveCachedPose) == 0x000890, "Member 'UTABP_MeleeAttack_LightCombo_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UTABP_MeleeAttack_LightCombo_C, AnimGraphNode_Root) == 0x000910, "Member 'UTABP_MeleeAttack_LightCombo_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UTABP_MeleeAttack_LightCombo_C, AnimGraphNode_LocalRefPose) == 0x000930, "Member 'UTABP_MeleeAttack_LightCombo_C::AnimGraphNode_LocalRefPose' has a wrong offset!");

}

