#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TABP_Reverse_Bow_Generic

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function TABP_Reverse_Bow_Generic.TABP_Reverse_Bow_Generic_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct TABP_Reverse_Bow_Generic_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(TABP_Reverse_Bow_Generic_C_AnimGraph) == 0x000008, "Wrong alignment on TABP_Reverse_Bow_Generic_C_AnimGraph");
static_assert(sizeof(TABP_Reverse_Bow_Generic_C_AnimGraph) == 0x000010, "Wrong size on TABP_Reverse_Bow_Generic_C_AnimGraph");
static_assert(offsetof(TABP_Reverse_Bow_Generic_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'TABP_Reverse_Bow_Generic_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function TABP_Reverse_Bow_Generic.TABP_Reverse_Bow_Generic_C.AssignAnimationStructs
// 0x0002 (0x0002 - 0x0000)
struct TABP_Reverse_Bow_Generic_C_AssignAnimationStructs final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TABP_Reverse_Bow_Generic_C_AssignAnimationStructs) == 0x000001, "Wrong alignment on TABP_Reverse_Bow_Generic_C_AssignAnimationStructs");
static_assert(sizeof(TABP_Reverse_Bow_Generic_C_AssignAnimationStructs) == 0x000002, "Wrong size on TABP_Reverse_Bow_Generic_C_AssignAnimationStructs");
static_assert(offsetof(TABP_Reverse_Bow_Generic_C_AssignAnimationStructs, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'TABP_Reverse_Bow_Generic_C_AssignAnimationStructs::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(TABP_Reverse_Bow_Generic_C_AssignAnimationStructs, CallFunc_IsValid_ReturnValue_1) == 0x000001, "Member 'TABP_Reverse_Bow_Generic_C_AssignAnimationStructs::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function TABP_Reverse_Bow_Generic.TABP_Reverse_Bow_Generic_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct TABP_Reverse_Bow_Generic_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TABP_Reverse_Bow_Generic_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on TABP_Reverse_Bow_Generic_C_BlueprintUpdateAnimation");
static_assert(sizeof(TABP_Reverse_Bow_Generic_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on TABP_Reverse_Bow_Generic_C_BlueprintUpdateAnimation");
static_assert(offsetof(TABP_Reverse_Bow_Generic_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'TABP_Reverse_Bow_Generic_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function TABP_Reverse_Bow_Generic.TABP_Reverse_Bow_Generic_C.ExecuteUbergraph_TABP_Reverse_Bow_Generic
// 0x000C (0x000C - 0x0000)
struct TABP_Reverse_Bow_Generic_C_ExecuteUbergraph_TABP_Reverse_Bow_Generic final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TABP_Reverse_Bow_Generic_C_ExecuteUbergraph_TABP_Reverse_Bow_Generic) == 0x000004, "Wrong alignment on TABP_Reverse_Bow_Generic_C_ExecuteUbergraph_TABP_Reverse_Bow_Generic");
static_assert(sizeof(TABP_Reverse_Bow_Generic_C_ExecuteUbergraph_TABP_Reverse_Bow_Generic) == 0x00000C, "Wrong size on TABP_Reverse_Bow_Generic_C_ExecuteUbergraph_TABP_Reverse_Bow_Generic");
static_assert(offsetof(TABP_Reverse_Bow_Generic_C_ExecuteUbergraph_TABP_Reverse_Bow_Generic, EntryPoint) == 0x000000, "Member 'TABP_Reverse_Bow_Generic_C_ExecuteUbergraph_TABP_Reverse_Bow_Generic::EntryPoint' has a wrong offset!");
static_assert(offsetof(TABP_Reverse_Bow_Generic_C_ExecuteUbergraph_TABP_Reverse_Bow_Generic, K2Node_Event_DeltaTimeX) == 0x000004, "Member 'TABP_Reverse_Bow_Generic_C_ExecuteUbergraph_TABP_Reverse_Bow_Generic::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(TABP_Reverse_Bow_Generic_C_ExecuteUbergraph_TABP_Reverse_Bow_Generic, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'TABP_Reverse_Bow_Generic_C_ExecuteUbergraph_TABP_Reverse_Bow_Generic::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(TABP_Reverse_Bow_Generic_C_ExecuteUbergraph_TABP_Reverse_Bow_Generic, CallFunc_IsValid_ReturnValue_1) == 0x000009, "Member 'TABP_Reverse_Bow_Generic_C_ExecuteUbergraph_TABP_Reverse_Bow_Generic::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TABP_Reverse_Bow_Generic_C_ExecuteUbergraph_TABP_Reverse_Bow_Generic, CallFunc_BooleanOR_ReturnValue) == 0x00000A, "Member 'TABP_Reverse_Bow_Generic_C_ExecuteUbergraph_TABP_Reverse_Bow_Generic::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function TABP_Reverse_Bow_Generic.TABP_Reverse_Bow_Generic_C.GetCharacter
// 0x0038 (0x0038 - 0x0000)
struct TABP_Reverse_Bow_Generic_C_GetCharacter final
{
public:
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue;               // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAttachParentActor_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AVPairedCreature*                       K2Node_DynamicCast_AsVPaired_Creature;             // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AVPairedPawn*                           K2Node_DynamicCast_AsVPaired_Pawn;                 // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TABP_Reverse_Bow_Generic_C_GetCharacter) == 0x000008, "Wrong alignment on TABP_Reverse_Bow_Generic_C_GetCharacter");
static_assert(sizeof(TABP_Reverse_Bow_Generic_C_GetCharacter) == 0x000038, "Wrong size on TABP_Reverse_Bow_Generic_C_GetCharacter");
static_assert(offsetof(TABP_Reverse_Bow_Generic_C_GetCharacter, CallFunc_GetOwningActor_ReturnValue) == 0x000000, "Member 'TABP_Reverse_Bow_Generic_C_GetCharacter::CallFunc_GetOwningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(TABP_Reverse_Bow_Generic_C_GetCharacter, CallFunc_GetAttachParentActor_ReturnValue) == 0x000008, "Member 'TABP_Reverse_Bow_Generic_C_GetCharacter::CallFunc_GetAttachParentActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(TABP_Reverse_Bow_Generic_C_GetCharacter, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'TABP_Reverse_Bow_Generic_C_GetCharacter::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(TABP_Reverse_Bow_Generic_C_GetCharacter, K2Node_DynamicCast_AsVPaired_Creature) == 0x000018, "Member 'TABP_Reverse_Bow_Generic_C_GetCharacter::K2Node_DynamicCast_AsVPaired_Creature' has a wrong offset!");
static_assert(offsetof(TABP_Reverse_Bow_Generic_C_GetCharacter, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'TABP_Reverse_Bow_Generic_C_GetCharacter::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TABP_Reverse_Bow_Generic_C_GetCharacter, K2Node_DynamicCast_AsVPaired_Pawn) == 0x000028, "Member 'TABP_Reverse_Bow_Generic_C_GetCharacter::K2Node_DynamicCast_AsVPaired_Pawn' has a wrong offset!");
static_assert(offsetof(TABP_Reverse_Bow_Generic_C_GetCharacter, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'TABP_Reverse_Bow_Generic_C_GetCharacter::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(TABP_Reverse_Bow_Generic_C_GetCharacter, CallFunc_IsValid_ReturnValue_1) == 0x000031, "Member 'TABP_Reverse_Bow_Generic_C_GetCharacter::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function TABP_Reverse_Bow_Generic.TABP_Reverse_Bow_Generic_C.UpdateAnimations
// 0x0004 (0x0004 - 0x0000)
struct TABP_Reverse_Bow_Generic_C_UpdateAnimations final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasGameplayTag_ReturnValue;               // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasGameplayTag_ReturnValue_1;             // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TABP_Reverse_Bow_Generic_C_UpdateAnimations) == 0x000001, "Wrong alignment on TABP_Reverse_Bow_Generic_C_UpdateAnimations");
static_assert(sizeof(TABP_Reverse_Bow_Generic_C_UpdateAnimations) == 0x000004, "Wrong size on TABP_Reverse_Bow_Generic_C_UpdateAnimations");
static_assert(offsetof(TABP_Reverse_Bow_Generic_C_UpdateAnimations, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'TABP_Reverse_Bow_Generic_C_UpdateAnimations::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(TABP_Reverse_Bow_Generic_C_UpdateAnimations, CallFunc_IsValid_ReturnValue_1) == 0x000001, "Member 'TABP_Reverse_Bow_Generic_C_UpdateAnimations::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TABP_Reverse_Bow_Generic_C_UpdateAnimations, CallFunc_HasGameplayTag_ReturnValue) == 0x000002, "Member 'TABP_Reverse_Bow_Generic_C_UpdateAnimations::CallFunc_HasGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(TABP_Reverse_Bow_Generic_C_UpdateAnimations, CallFunc_HasGameplayTag_ReturnValue_1) == 0x000003, "Member 'TABP_Reverse_Bow_Generic_C_UpdateAnimations::CallFunc_HasGameplayTag_ReturnValue_1' has a wrong offset!");

// Function TABP_Reverse_Bow_Generic.TABP_Reverse_Bow_Generic_C.UpdateStates
// 0x0006 (0x0006 - 0x0000)
struct TABP_Reverse_Bow_Generic_C_UpdateStates final
{
public:
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue_1;                     // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanNOR_ReturnValue;                   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue_2;                     // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue_3;                     // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TABP_Reverse_Bow_Generic_C_UpdateStates) == 0x000001, "Wrong alignment on TABP_Reverse_Bow_Generic_C_UpdateStates");
static_assert(sizeof(TABP_Reverse_Bow_Generic_C_UpdateStates) == 0x000006, "Wrong size on TABP_Reverse_Bow_Generic_C_UpdateStates");
static_assert(offsetof(TABP_Reverse_Bow_Generic_C_UpdateStates, CallFunc_HasTag_ReturnValue) == 0x000000, "Member 'TABP_Reverse_Bow_Generic_C_UpdateStates::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(TABP_Reverse_Bow_Generic_C_UpdateStates, CallFunc_HasTag_ReturnValue_1) == 0x000001, "Member 'TABP_Reverse_Bow_Generic_C_UpdateStates::CallFunc_HasTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TABP_Reverse_Bow_Generic_C_UpdateStates, CallFunc_BooleanNOR_ReturnValue) == 0x000002, "Member 'TABP_Reverse_Bow_Generic_C_UpdateStates::CallFunc_BooleanNOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(TABP_Reverse_Bow_Generic_C_UpdateStates, CallFunc_IsValid_ReturnValue) == 0x000003, "Member 'TABP_Reverse_Bow_Generic_C_UpdateStates::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(TABP_Reverse_Bow_Generic_C_UpdateStates, CallFunc_HasTag_ReturnValue_2) == 0x000004, "Member 'TABP_Reverse_Bow_Generic_C_UpdateStates::CallFunc_HasTag_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(TABP_Reverse_Bow_Generic_C_UpdateStates, CallFunc_HasTag_ReturnValue_3) == 0x000005, "Member 'TABP_Reverse_Bow_Generic_C_UpdateStates::CallFunc_HasTag_ReturnValue_3' has a wrong offset!");

}

