#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TABP_TurnInPlace

#include "Basic.hpp"

#include "TABP_TurnInPlace_structs.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Altar_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass TABP_TurnInPlace.TABP_TurnInPlace_C
// 0x0FA0 (0x1440 - 0x04A0)
class UTABP_TurnInPlace_C final : public UVTurnInPlaceCharacterAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct TABP_TurnInPlace::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;             // 0x04A8(0x001C)(HasGetValueTypeHash)
	uint8                                         Pad_4C4[0x4];                                      // 0x04C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x04C8(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x04D0(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x04D8(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x04F8(0x00B8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2;                    // 0x05B0(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0x0630(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0x0658(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_10;                    // 0x0680(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6;                       // 0x06A8(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x06C8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x06F0(0x0028)()
	struct FAnimNode_RotateRootBone               AnimGraphNode_RotateRootBone_1;                    // 0x0718(0x00B0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_9;                     // 0x07C8(0x0028)()
	struct FAnimNode_LayeredBoneBlendTemplate     AnimGraphNode_LayeredBoneBlendTemplate;            // 0x07F0(0x0110)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_8;                     // 0x0900(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_7;                     // 0x0928(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x0950(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_6;                     // 0x0970(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x0998(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_2;                      // 0x09B8(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x0A80(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0x0AA0(0x00C8)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x0B68(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x0B90(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x0BB8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0BE0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0C08(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5;                     // 0x0C30(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x0C58(0x0020)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive;              // 0x0C78(0x00D0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x0D48(0x0028)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_1;                  // 0x0D70(0x0070)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x0DE0(0x0048)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x0E28(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0E98(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x0EB8(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0EE0(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0F00(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x0FC8(0x0080)()
	struct FAnimNode_RotateRootBone               AnimGraphNode_RotateRootBone;                      // 0x1048(0x00B0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x10F8(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x1140(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x1168(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x1190(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x1210(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x1238(0x0048)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph;                     // 0x1280(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x1338(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x1358(0x00B8)()
	float                                         __CustomProperty_AimSpeed_06CEAA2F47935D57D09B39AD3DC4DF92; // 0x1410(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1414[0x4];                                     // 0x1414(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               __CustomProperty_TargetAimOffset_06CEAA2F47935D57D09B39AD3DC4DF92; // 0x1418(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UBlendSpace*                            __CustomProperty_AimBlendSpace_06CEAA2F47935D57D09B39AD3DC4DF92; // 0x1430(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_TABP_TurnInPlace(int32 EntryPoint);
	void TurnInPlaceLayer(const struct FPoseLink& InPose, struct FPoseLink* TurnInPlaceLayer_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TABP_TurnInPlace_C">();
	}
	static class UTABP_TurnInPlace_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTABP_TurnInPlace_C>();
	}
};
static_assert(alignof(UTABP_TurnInPlace_C) == 0x000010, "Wrong alignment on UTABP_TurnInPlace_C");
static_assert(sizeof(UTABP_TurnInPlace_C) == 0x001440, "Wrong size on UTABP_TurnInPlace_C");
static_assert(offsetof(UTABP_TurnInPlace_C, UberGraphFrame) == 0x0004A0, "Member 'UTABP_TurnInPlace_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlace_C, __AnimBlueprintMutables) == 0x0004A8, "Member 'UTABP_TurnInPlace_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlace_C, AnimBlueprintExtension_PropertyAccess) == 0x0004C8, "Member 'UTABP_TurnInPlace_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlace_C, AnimBlueprintExtension_Base) == 0x0004D0, "Member 'UTABP_TurnInPlace_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlace_C, AnimGraphNode_Root_1) == 0x0004D8, "Member 'UTABP_TurnInPlace_C::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlace_C, AnimGraphNode_LinkedInputPose_1) == 0x0004F8, "Member 'UTABP_TurnInPlace_C::AnimGraphNode_LinkedInputPose_1' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlace_C, AnimGraphNode_SaveCachedPose_2) == 0x0005B0, "Member 'UTABP_TurnInPlace_C::AnimGraphNode_SaveCachedPose_2' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlace_C, AnimGraphNode_TransitionResult_8) == 0x000630, "Member 'UTABP_TurnInPlace_C::AnimGraphNode_TransitionResult_8' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlace_C, AnimGraphNode_TransitionResult_7) == 0x000658, "Member 'UTABP_TurnInPlace_C::AnimGraphNode_TransitionResult_7' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlace_C, AnimGraphNode_UseCachedPose_10) == 0x000680, "Member 'UTABP_TurnInPlace_C::AnimGraphNode_UseCachedPose_10' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlace_C, AnimGraphNode_StateResult_6) == 0x0006A8, "Member 'UTABP_TurnInPlace_C::AnimGraphNode_StateResult_6' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlace_C, AnimGraphNode_TransitionResult_6) == 0x0006C8, "Member 'UTABP_TurnInPlace_C::AnimGraphNode_TransitionResult_6' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlace_C, AnimGraphNode_TransitionResult_5) == 0x0006F0, "Member 'UTABP_TurnInPlace_C::AnimGraphNode_TransitionResult_5' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlace_C, AnimGraphNode_RotateRootBone_1) == 0x000718, "Member 'UTABP_TurnInPlace_C::AnimGraphNode_RotateRootBone_1' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlace_C, AnimGraphNode_UseCachedPose_9) == 0x0007C8, "Member 'UTABP_TurnInPlace_C::AnimGraphNode_UseCachedPose_9' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlace_C, AnimGraphNode_LayeredBoneBlendTemplate) == 0x0007F0, "Member 'UTABP_TurnInPlace_C::AnimGraphNode_LayeredBoneBlendTemplate' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlace_C, AnimGraphNode_UseCachedPose_8) == 0x000900, "Member 'UTABP_TurnInPlace_C::AnimGraphNode_UseCachedPose_8' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlace_C, AnimGraphNode_UseCachedPose_7) == 0x000928, "Member 'UTABP_TurnInPlace_C::AnimGraphNode_UseCachedPose_7' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlace_C, AnimGraphNode_StateResult_5) == 0x000950, "Member 'UTABP_TurnInPlace_C::AnimGraphNode_StateResult_5' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlace_C, AnimGraphNode_UseCachedPose_6) == 0x000970, "Member 'UTABP_TurnInPlace_C::AnimGraphNode_UseCachedPose_6' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlace_C, AnimGraphNode_StateResult_4) == 0x000998, "Member 'UTABP_TurnInPlace_C::AnimGraphNode_StateResult_4' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlace_C, AnimGraphNode_StateMachine_2) == 0x0009B8, "Member 'UTABP_TurnInPlace_C::AnimGraphNode_StateMachine_2' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlace_C, AnimGraphNode_StateResult_3) == 0x000A80, "Member 'UTABP_TurnInPlace_C::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlace_C, AnimGraphNode_StateMachine_1) == 0x000AA0, "Member 'UTABP_TurnInPlace_C::AnimGraphNode_StateMachine_1' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlace_C, AnimGraphNode_TransitionResult_4) == 0x000B68, "Member 'UTABP_TurnInPlace_C::AnimGraphNode_TransitionResult_4' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlace_C, AnimGraphNode_TransitionResult_3) == 0x000B90, "Member 'UTABP_TurnInPlace_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlace_C, AnimGraphNode_TransitionResult_2) == 0x000BB8, "Member 'UTABP_TurnInPlace_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlace_C, AnimGraphNode_TransitionResult_1) == 0x000BE0, "Member 'UTABP_TurnInPlace_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlace_C, AnimGraphNode_TransitionResult) == 0x000C08, "Member 'UTABP_TurnInPlace_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlace_C, AnimGraphNode_UseCachedPose_5) == 0x000C30, "Member 'UTABP_TurnInPlace_C::AnimGraphNode_UseCachedPose_5' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlace_C, AnimGraphNode_StateResult_2) == 0x000C58, "Member 'UTABP_TurnInPlace_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlace_C, AnimGraphNode_ApplyMeshSpaceAdditive) == 0x000C78, "Member 'UTABP_TurnInPlace_C::AnimGraphNode_ApplyMeshSpaceAdditive' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlace_C, AnimGraphNode_UseCachedPose_4) == 0x000D48, "Member 'UTABP_TurnInPlace_C::AnimGraphNode_UseCachedPose_4' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlace_C, AnimGraphNode_BlendSpacePlayer_1) == 0x000D70, "Member 'UTABP_TurnInPlace_C::AnimGraphNode_BlendSpacePlayer_1' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlace_C, AnimGraphNode_BlendListByBool_2) == 0x000DE0, "Member 'UTABP_TurnInPlace_C::AnimGraphNode_BlendListByBool_2' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlace_C, AnimGraphNode_BlendSpacePlayer) == 0x000E28, "Member 'UTABP_TurnInPlace_C::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlace_C, AnimGraphNode_StateResult_1) == 0x000E98, "Member 'UTABP_TurnInPlace_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlace_C, AnimGraphNode_UseCachedPose_3) == 0x000EB8, "Member 'UTABP_TurnInPlace_C::AnimGraphNode_UseCachedPose_3' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlace_C, AnimGraphNode_StateResult) == 0x000EE0, "Member 'UTABP_TurnInPlace_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlace_C, AnimGraphNode_StateMachine) == 0x000F00, "Member 'UTABP_TurnInPlace_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlace_C, AnimGraphNode_SaveCachedPose_1) == 0x000FC8, "Member 'UTABP_TurnInPlace_C::AnimGraphNode_SaveCachedPose_1' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlace_C, AnimGraphNode_RotateRootBone) == 0x001048, "Member 'UTABP_TurnInPlace_C::AnimGraphNode_RotateRootBone' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlace_C, AnimGraphNode_BlendListByBool_1) == 0x0010F8, "Member 'UTABP_TurnInPlace_C::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlace_C, AnimGraphNode_UseCachedPose_2) == 0x001140, "Member 'UTABP_TurnInPlace_C::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlace_C, AnimGraphNode_UseCachedPose_1) == 0x001168, "Member 'UTABP_TurnInPlace_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlace_C, AnimGraphNode_SaveCachedPose) == 0x001190, "Member 'UTABP_TurnInPlace_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlace_C, AnimGraphNode_UseCachedPose) == 0x001210, "Member 'UTABP_TurnInPlace_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlace_C, AnimGraphNode_BlendListByBool) == 0x001238, "Member 'UTABP_TurnInPlace_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlace_C, AnimGraphNode_LinkedAnimGraph) == 0x001280, "Member 'UTABP_TurnInPlace_C::AnimGraphNode_LinkedAnimGraph' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlace_C, AnimGraphNode_Root) == 0x001338, "Member 'UTABP_TurnInPlace_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlace_C, AnimGraphNode_LinkedInputPose) == 0x001358, "Member 'UTABP_TurnInPlace_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlace_C, __CustomProperty_AimSpeed_06CEAA2F47935D57D09B39AD3DC4DF92) == 0x001410, "Member 'UTABP_TurnInPlace_C::__CustomProperty_AimSpeed_06CEAA2F47935D57D09B39AD3DC4DF92' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlace_C, __CustomProperty_TargetAimOffset_06CEAA2F47935D57D09B39AD3DC4DF92) == 0x001418, "Member 'UTABP_TurnInPlace_C::__CustomProperty_TargetAimOffset_06CEAA2F47935D57D09B39AD3DC4DF92' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlace_C, __CustomProperty_AimBlendSpace_06CEAA2F47935D57D09B39AD3DC4DF92) == 0x001430, "Member 'UTABP_TurnInPlace_C::__CustomProperty_AimBlendSpace_06CEAA2F47935D57D09B39AD3DC4DF92' has a wrong offset!");

}

