#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TABP_SpecialIdleAndDock

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct TABP_SpecialIdleAndDock.TABP_SpecialIdleAndDock_C.AnimBlueprintGeneratedConstantData
// 0x015F (0x0160 - 0x0001)
struct TABP_SpecialIdleAndDock::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_104;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_105;                                // 0x000C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_106;                               // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_107;                              // 0x0014(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_108;                               // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_109;                                // 0x0044(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_110;                               // 0x0048(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_111;                               // 0x0058(0x0010)(BlueprintVisible, EditFixedSize)
	class UBlendProfile*                          __BlendProfile_112;                                // 0x0068(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_113;                                  // 0x0070(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_114;                                // 0x0078(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_115;                                // 0x0079(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_116;                                // 0x007A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7B[0x5];                                       // 0x007B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_117;                               // 0x0080(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_118;                                // 0x0090(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_119;                                // 0x0098(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_120;                              // 0x00A0(0x0020)(BlueprintVisible, NoDestructor)
	ERefPoseType                                  __ByteProperty_121;                                // 0x00C0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00C8(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0148(0x0018)()
};
static_assert(alignof(TABP_SpecialIdleAndDock::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on TABP_SpecialIdleAndDock::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(TABP_SpecialIdleAndDock::FAnimBlueprintGeneratedConstantData) == 0x000160, "Wrong size on TABP_SpecialIdleAndDock::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(TABP_SpecialIdleAndDock::FAnimBlueprintGeneratedConstantData, __NameProperty_104) == 0x000004, "Member 'TABP_SpecialIdleAndDock::FAnimBlueprintGeneratedConstantData::__NameProperty_104' has a wrong offset!");
static_assert(offsetof(TABP_SpecialIdleAndDock::FAnimBlueprintGeneratedConstantData, __BoolProperty_105) == 0x00000C, "Member 'TABP_SpecialIdleAndDock::FAnimBlueprintGeneratedConstantData::__BoolProperty_105' has a wrong offset!");
static_assert(offsetof(TABP_SpecialIdleAndDock::FAnimBlueprintGeneratedConstantData, __FloatProperty_106) == 0x000010, "Member 'TABP_SpecialIdleAndDock::FAnimBlueprintGeneratedConstantData::__FloatProperty_106' has a wrong offset!");
static_assert(offsetof(TABP_SpecialIdleAndDock::FAnimBlueprintGeneratedConstantData, __StructProperty_107) == 0x000014, "Member 'TABP_SpecialIdleAndDock::FAnimBlueprintGeneratedConstantData::__StructProperty_107' has a wrong offset!");
static_assert(offsetof(TABP_SpecialIdleAndDock::FAnimBlueprintGeneratedConstantData, __FloatProperty_108) == 0x000040, "Member 'TABP_SpecialIdleAndDock::FAnimBlueprintGeneratedConstantData::__FloatProperty_108' has a wrong offset!");
static_assert(offsetof(TABP_SpecialIdleAndDock::FAnimBlueprintGeneratedConstantData, __EnumProperty_109) == 0x000044, "Member 'TABP_SpecialIdleAndDock::FAnimBlueprintGeneratedConstantData::__EnumProperty_109' has a wrong offset!");
static_assert(offsetof(TABP_SpecialIdleAndDock::FAnimBlueprintGeneratedConstantData, __ArrayProperty_110) == 0x000048, "Member 'TABP_SpecialIdleAndDock::FAnimBlueprintGeneratedConstantData::__ArrayProperty_110' has a wrong offset!");
static_assert(offsetof(TABP_SpecialIdleAndDock::FAnimBlueprintGeneratedConstantData, __ArrayProperty_111) == 0x000058, "Member 'TABP_SpecialIdleAndDock::FAnimBlueprintGeneratedConstantData::__ArrayProperty_111' has a wrong offset!");
static_assert(offsetof(TABP_SpecialIdleAndDock::FAnimBlueprintGeneratedConstantData, __BlendProfile_112) == 0x000068, "Member 'TABP_SpecialIdleAndDock::FAnimBlueprintGeneratedConstantData::__BlendProfile_112' has a wrong offset!");
static_assert(offsetof(TABP_SpecialIdleAndDock::FAnimBlueprintGeneratedConstantData, __CurveFloat_113) == 0x000070, "Member 'TABP_SpecialIdleAndDock::FAnimBlueprintGeneratedConstantData::__CurveFloat_113' has a wrong offset!");
static_assert(offsetof(TABP_SpecialIdleAndDock::FAnimBlueprintGeneratedConstantData, __BoolProperty_114) == 0x000078, "Member 'TABP_SpecialIdleAndDock::FAnimBlueprintGeneratedConstantData::__BoolProperty_114' has a wrong offset!");
static_assert(offsetof(TABP_SpecialIdleAndDock::FAnimBlueprintGeneratedConstantData, __EnumProperty_115) == 0x000079, "Member 'TABP_SpecialIdleAndDock::FAnimBlueprintGeneratedConstantData::__EnumProperty_115' has a wrong offset!");
static_assert(offsetof(TABP_SpecialIdleAndDock::FAnimBlueprintGeneratedConstantData, __EnumProperty_116) == 0x00007A, "Member 'TABP_SpecialIdleAndDock::FAnimBlueprintGeneratedConstantData::__EnumProperty_116' has a wrong offset!");
static_assert(offsetof(TABP_SpecialIdleAndDock::FAnimBlueprintGeneratedConstantData, __ArrayProperty_117) == 0x000080, "Member 'TABP_SpecialIdleAndDock::FAnimBlueprintGeneratedConstantData::__ArrayProperty_117' has a wrong offset!");
static_assert(offsetof(TABP_SpecialIdleAndDock::FAnimBlueprintGeneratedConstantData, __NameProperty_118) == 0x000090, "Member 'TABP_SpecialIdleAndDock::FAnimBlueprintGeneratedConstantData::__NameProperty_118' has a wrong offset!");
static_assert(offsetof(TABP_SpecialIdleAndDock::FAnimBlueprintGeneratedConstantData, __NameProperty_119) == 0x000098, "Member 'TABP_SpecialIdleAndDock::FAnimBlueprintGeneratedConstantData::__NameProperty_119' has a wrong offset!");
static_assert(offsetof(TABP_SpecialIdleAndDock::FAnimBlueprintGeneratedConstantData, __StructProperty_120) == 0x0000A0, "Member 'TABP_SpecialIdleAndDock::FAnimBlueprintGeneratedConstantData::__StructProperty_120' has a wrong offset!");
static_assert(offsetof(TABP_SpecialIdleAndDock::FAnimBlueprintGeneratedConstantData, __ByteProperty_121) == 0x0000C0, "Member 'TABP_SpecialIdleAndDock::FAnimBlueprintGeneratedConstantData::__ByteProperty_121' has a wrong offset!");
static_assert(offsetof(TABP_SpecialIdleAndDock::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000C8, "Member 'TABP_SpecialIdleAndDock::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(TABP_SpecialIdleAndDock::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000148, "Member 'TABP_SpecialIdleAndDock::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct TABP_SpecialIdleAndDock.TABP_SpecialIdleAndDock_C.AnimBlueprintGeneratedMutableData
// 0x0004 (0x0005 - 0x0001)
struct TABP_SpecialIdleAndDock::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_0;                                  // 0x0002(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_1;                                  // 0x0003(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_2;                                  // 0x0004(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TABP_SpecialIdleAndDock::FAnimBlueprintGeneratedMutableData) == 0x000001, "Wrong alignment on TABP_SpecialIdleAndDock::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(TABP_SpecialIdleAndDock::FAnimBlueprintGeneratedMutableData) == 0x000005, "Wrong size on TABP_SpecialIdleAndDock::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(TABP_SpecialIdleAndDock::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'TABP_SpecialIdleAndDock::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");
static_assert(offsetof(TABP_SpecialIdleAndDock::FAnimBlueprintGeneratedMutableData, __BoolProperty_0) == 0x000002, "Member 'TABP_SpecialIdleAndDock::FAnimBlueprintGeneratedMutableData::__BoolProperty_0' has a wrong offset!");
static_assert(offsetof(TABP_SpecialIdleAndDock::FAnimBlueprintGeneratedMutableData, __BoolProperty_1) == 0x000003, "Member 'TABP_SpecialIdleAndDock::FAnimBlueprintGeneratedMutableData::__BoolProperty_1' has a wrong offset!");
static_assert(offsetof(TABP_SpecialIdleAndDock::FAnimBlueprintGeneratedMutableData, __BoolProperty_2) == 0x000004, "Member 'TABP_SpecialIdleAndDock::FAnimBlueprintGeneratedMutableData::__BoolProperty_2' has a wrong offset!");

}

