#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TABP_HitReact

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function TABP_HitReact.TABP_HitReact_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct TABP_HitReact_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(TABP_HitReact_C_AnimGraph) == 0x000008, "Wrong alignment on TABP_HitReact_C_AnimGraph");
static_assert(sizeof(TABP_HitReact_C_AnimGraph) == 0x000010, "Wrong size on TABP_HitReact_C_AnimGraph");
static_assert(offsetof(TABP_HitReact_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'TABP_HitReact_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function TABP_HitReact.TABP_HitReact_C.ExecuteUbergraph_TABP_HitReact
// 0x0008 (0x0008 - 0x0000)
struct TABP_HitReact_C_ExecuteUbergraph_TABP_HitReact final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldPlayHitReaction_ReturnValue;        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TABP_HitReact_C_ExecuteUbergraph_TABP_HitReact) == 0x000004, "Wrong alignment on TABP_HitReact_C_ExecuteUbergraph_TABP_HitReact");
static_assert(sizeof(TABP_HitReact_C_ExecuteUbergraph_TABP_HitReact) == 0x000008, "Wrong size on TABP_HitReact_C_ExecuteUbergraph_TABP_HitReact");
static_assert(offsetof(TABP_HitReact_C_ExecuteUbergraph_TABP_HitReact, EntryPoint) == 0x000000, "Member 'TABP_HitReact_C_ExecuteUbergraph_TABP_HitReact::EntryPoint' has a wrong offset!");
static_assert(offsetof(TABP_HitReact_C_ExecuteUbergraph_TABP_HitReact, CallFunc_ShouldPlayHitReaction_ReturnValue) == 0x000004, "Member 'TABP_HitReact_C_ExecuteUbergraph_TABP_HitReact::CallFunc_ShouldPlayHitReaction_ReturnValue' has a wrong offset!");

// Function TABP_HitReact.TABP_HitReact_C.HitReactLayer
// 0x0020 (0x0020 - 0x0000)
struct TABP_HitReact_C_HitReactLayer final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              HitReactLayer_0;                                   // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(TABP_HitReact_C_HitReactLayer) == 0x000008, "Wrong alignment on TABP_HitReact_C_HitReactLayer");
static_assert(sizeof(TABP_HitReact_C_HitReactLayer) == 0x000020, "Wrong size on TABP_HitReact_C_HitReactLayer");
static_assert(offsetof(TABP_HitReact_C_HitReactLayer, InPose) == 0x000000, "Member 'TABP_HitReact_C_HitReactLayer::InPose' has a wrong offset!");
static_assert(offsetof(TABP_HitReact_C_HitReactLayer, HitReactLayer_0) == 0x000010, "Member 'TABP_HitReact_C_HitReactLayer::HitReactLayer_0' has a wrong offset!");

}

