#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TABP_TurnInPlaceFP

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct TABP_TurnInPlaceFP.TABP_TurnInPlaceFP_C.AnimBlueprintGeneratedConstantData
// 0x0187 (0x0188 - 0x0001)
struct TABP_TurnInPlaceFP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_429;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_430;                                // 0x000C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_431;                               // 0x0010(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_432;                                // 0x0020(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_433;                                 // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_434;                                // 0x002C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_435;                                // 0x0034(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_436;                                // 0x003C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_437;                                 // 0x0044(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_438;                                // 0x0048(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_439;                               // 0x004C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_440;                              // 0x0050(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_441;                               // 0x007C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_442;                                // 0x0080(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_443;                                // 0x0084(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_444;                                 // 0x008C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendProfile*                          __BlendProfile_445;                                // 0x0090(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_446;                                  // 0x0098(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_447;                                // 0x00A0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_448;                                // 0x00A1(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_449;                                // 0x00A2(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A3[0x5];                                       // 0x00A3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_450;                               // 0x00A8(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_451;                                // 0x00B8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_452;                                // 0x00C0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_453;                              // 0x00C8(0x0020)(BlueprintVisible, NoDestructor)
	ERefPoseType                                  __ByteProperty_454;                                // 0x00E8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00F0(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0170(0x0018)()
};
static_assert(alignof(TABP_TurnInPlaceFP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on TABP_TurnInPlaceFP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(TABP_TurnInPlaceFP::FAnimBlueprintGeneratedConstantData) == 0x000188, "Wrong size on TABP_TurnInPlaceFP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(TABP_TurnInPlaceFP::FAnimBlueprintGeneratedConstantData, __NameProperty_429) == 0x000004, "Member 'TABP_TurnInPlaceFP::FAnimBlueprintGeneratedConstantData::__NameProperty_429' has a wrong offset!");
static_assert(offsetof(TABP_TurnInPlaceFP::FAnimBlueprintGeneratedConstantData, __EnumProperty_430) == 0x00000C, "Member 'TABP_TurnInPlaceFP::FAnimBlueprintGeneratedConstantData::__EnumProperty_430' has a wrong offset!");
static_assert(offsetof(TABP_TurnInPlaceFP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_431) == 0x000010, "Member 'TABP_TurnInPlaceFP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_431' has a wrong offset!");
static_assert(offsetof(TABP_TurnInPlaceFP::FAnimBlueprintGeneratedConstantData, __NameProperty_432) == 0x000020, "Member 'TABP_TurnInPlaceFP::FAnimBlueprintGeneratedConstantData::__NameProperty_432' has a wrong offset!");
static_assert(offsetof(TABP_TurnInPlaceFP::FAnimBlueprintGeneratedConstantData, __IntProperty_433) == 0x000028, "Member 'TABP_TurnInPlaceFP::FAnimBlueprintGeneratedConstantData::__IntProperty_433' has a wrong offset!");
static_assert(offsetof(TABP_TurnInPlaceFP::FAnimBlueprintGeneratedConstantData, __NameProperty_434) == 0x00002C, "Member 'TABP_TurnInPlaceFP::FAnimBlueprintGeneratedConstantData::__NameProperty_434' has a wrong offset!");
static_assert(offsetof(TABP_TurnInPlaceFP::FAnimBlueprintGeneratedConstantData, __NameProperty_435) == 0x000034, "Member 'TABP_TurnInPlaceFP::FAnimBlueprintGeneratedConstantData::__NameProperty_435' has a wrong offset!");
static_assert(offsetof(TABP_TurnInPlaceFP::FAnimBlueprintGeneratedConstantData, __NameProperty_436) == 0x00003C, "Member 'TABP_TurnInPlaceFP::FAnimBlueprintGeneratedConstantData::__NameProperty_436' has a wrong offset!");
static_assert(offsetof(TABP_TurnInPlaceFP::FAnimBlueprintGeneratedConstantData, __IntProperty_437) == 0x000044, "Member 'TABP_TurnInPlaceFP::FAnimBlueprintGeneratedConstantData::__IntProperty_437' has a wrong offset!");
static_assert(offsetof(TABP_TurnInPlaceFP::FAnimBlueprintGeneratedConstantData, __BoolProperty_438) == 0x000048, "Member 'TABP_TurnInPlaceFP::FAnimBlueprintGeneratedConstantData::__BoolProperty_438' has a wrong offset!");
static_assert(offsetof(TABP_TurnInPlaceFP::FAnimBlueprintGeneratedConstantData, __FloatProperty_439) == 0x00004C, "Member 'TABP_TurnInPlaceFP::FAnimBlueprintGeneratedConstantData::__FloatProperty_439' has a wrong offset!");
static_assert(offsetof(TABP_TurnInPlaceFP::FAnimBlueprintGeneratedConstantData, __StructProperty_440) == 0x000050, "Member 'TABP_TurnInPlaceFP::FAnimBlueprintGeneratedConstantData::__StructProperty_440' has a wrong offset!");
static_assert(offsetof(TABP_TurnInPlaceFP::FAnimBlueprintGeneratedConstantData, __FloatProperty_441) == 0x00007C, "Member 'TABP_TurnInPlaceFP::FAnimBlueprintGeneratedConstantData::__FloatProperty_441' has a wrong offset!");
static_assert(offsetof(TABP_TurnInPlaceFP::FAnimBlueprintGeneratedConstantData, __EnumProperty_442) == 0x000080, "Member 'TABP_TurnInPlaceFP::FAnimBlueprintGeneratedConstantData::__EnumProperty_442' has a wrong offset!");
static_assert(offsetof(TABP_TurnInPlaceFP::FAnimBlueprintGeneratedConstantData, __NameProperty_443) == 0x000084, "Member 'TABP_TurnInPlaceFP::FAnimBlueprintGeneratedConstantData::__NameProperty_443' has a wrong offset!");
static_assert(offsetof(TABP_TurnInPlaceFP::FAnimBlueprintGeneratedConstantData, __IntProperty_444) == 0x00008C, "Member 'TABP_TurnInPlaceFP::FAnimBlueprintGeneratedConstantData::__IntProperty_444' has a wrong offset!");
static_assert(offsetof(TABP_TurnInPlaceFP::FAnimBlueprintGeneratedConstantData, __BlendProfile_445) == 0x000090, "Member 'TABP_TurnInPlaceFP::FAnimBlueprintGeneratedConstantData::__BlendProfile_445' has a wrong offset!");
static_assert(offsetof(TABP_TurnInPlaceFP::FAnimBlueprintGeneratedConstantData, __CurveFloat_446) == 0x000098, "Member 'TABP_TurnInPlaceFP::FAnimBlueprintGeneratedConstantData::__CurveFloat_446' has a wrong offset!");
static_assert(offsetof(TABP_TurnInPlaceFP::FAnimBlueprintGeneratedConstantData, __BoolProperty_447) == 0x0000A0, "Member 'TABP_TurnInPlaceFP::FAnimBlueprintGeneratedConstantData::__BoolProperty_447' has a wrong offset!");
static_assert(offsetof(TABP_TurnInPlaceFP::FAnimBlueprintGeneratedConstantData, __EnumProperty_448) == 0x0000A1, "Member 'TABP_TurnInPlaceFP::FAnimBlueprintGeneratedConstantData::__EnumProperty_448' has a wrong offset!");
static_assert(offsetof(TABP_TurnInPlaceFP::FAnimBlueprintGeneratedConstantData, __EnumProperty_449) == 0x0000A2, "Member 'TABP_TurnInPlaceFP::FAnimBlueprintGeneratedConstantData::__EnumProperty_449' has a wrong offset!");
static_assert(offsetof(TABP_TurnInPlaceFP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_450) == 0x0000A8, "Member 'TABP_TurnInPlaceFP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_450' has a wrong offset!");
static_assert(offsetof(TABP_TurnInPlaceFP::FAnimBlueprintGeneratedConstantData, __NameProperty_451) == 0x0000B8, "Member 'TABP_TurnInPlaceFP::FAnimBlueprintGeneratedConstantData::__NameProperty_451' has a wrong offset!");
static_assert(offsetof(TABP_TurnInPlaceFP::FAnimBlueprintGeneratedConstantData, __NameProperty_452) == 0x0000C0, "Member 'TABP_TurnInPlaceFP::FAnimBlueprintGeneratedConstantData::__NameProperty_452' has a wrong offset!");
static_assert(offsetof(TABP_TurnInPlaceFP::FAnimBlueprintGeneratedConstantData, __StructProperty_453) == 0x0000C8, "Member 'TABP_TurnInPlaceFP::FAnimBlueprintGeneratedConstantData::__StructProperty_453' has a wrong offset!");
static_assert(offsetof(TABP_TurnInPlaceFP::FAnimBlueprintGeneratedConstantData, __ByteProperty_454) == 0x0000E8, "Member 'TABP_TurnInPlaceFP::FAnimBlueprintGeneratedConstantData::__ByteProperty_454' has a wrong offset!");
static_assert(offsetof(TABP_TurnInPlaceFP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000F0, "Member 'TABP_TurnInPlaceFP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(TABP_TurnInPlaceFP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000170, "Member 'TABP_TurnInPlaceFP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct TABP_TurnInPlaceFP.TABP_TurnInPlaceFP_C.AnimBlueprintGeneratedMutableData
// 0x0003 (0x0004 - 0x0001)
struct TABP_TurnInPlaceFP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_0;                                  // 0x0002(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_1;                                  // 0x0003(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TABP_TurnInPlaceFP::FAnimBlueprintGeneratedMutableData) == 0x000001, "Wrong alignment on TABP_TurnInPlaceFP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(TABP_TurnInPlaceFP::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong size on TABP_TurnInPlaceFP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(TABP_TurnInPlaceFP::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'TABP_TurnInPlaceFP::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");
static_assert(offsetof(TABP_TurnInPlaceFP::FAnimBlueprintGeneratedMutableData, __BoolProperty_0) == 0x000002, "Member 'TABP_TurnInPlaceFP::FAnimBlueprintGeneratedMutableData::__BoolProperty_0' has a wrong offset!");
static_assert(offsetof(TABP_TurnInPlaceFP::FAnimBlueprintGeneratedMutableData, __BoolProperty_1) == 0x000003, "Member 'TABP_TurnInPlaceFP::FAnimBlueprintGeneratedMutableData::__BoolProperty_1' has a wrong offset!");

}

