#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TABP_GetUp

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "TABP_GetUp_structs.hpp"
#include "Altar_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass TABP_GetUp.TABP_GetUp_C
// 0x02E0 (0x06B0 - 0x03D0)
class UTABP_GetUp_C final : public UVGetUpAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct TABP_GetUp::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                   // 0x03D8(0x0002)(HasGetValueTypeHash)
	uint8                                         Pad_3DA[0x6];                                      // 0x03DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x03E0(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x03E8(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x03F0(0x0020)()
	struct FAnimNode_PoseSnapshot                 AnimGraphNode_PoseSnapshot;                        // 0x0410(0x0090)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x04A0(0x00B8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0558(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x05A0(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x0620(0x0028)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0648(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x0668(0x0010)()
	struct FPoseSnapshot                          K2Node_PropertyAccess;                             // 0x0678(0x0038)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_TABP_GetUp(int32 EntryPoint);
	void GetUpLayer(const struct FPoseLink& InPose, struct FPoseLink* GetUpLayer_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TABP_GetUp_C">();
	}
	static class UTABP_GetUp_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTABP_GetUp_C>();
	}
};
static_assert(alignof(UTABP_GetUp_C) == 0x000010, "Wrong alignment on UTABP_GetUp_C");
static_assert(sizeof(UTABP_GetUp_C) == 0x0006B0, "Wrong size on UTABP_GetUp_C");
static_assert(offsetof(UTABP_GetUp_C, UberGraphFrame) == 0x0003D0, "Member 'UTABP_GetUp_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTABP_GetUp_C, __AnimBlueprintMutables) == 0x0003D8, "Member 'UTABP_GetUp_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UTABP_GetUp_C, AnimBlueprintExtension_PropertyAccess) == 0x0003E0, "Member 'UTABP_GetUp_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UTABP_GetUp_C, AnimBlueprintExtension_Base) == 0x0003E8, "Member 'UTABP_GetUp_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UTABP_GetUp_C, AnimGraphNode_Root_1) == 0x0003F0, "Member 'UTABP_GetUp_C::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(UTABP_GetUp_C, AnimGraphNode_PoseSnapshot) == 0x000410, "Member 'UTABP_GetUp_C::AnimGraphNode_PoseSnapshot' has a wrong offset!");
static_assert(offsetof(UTABP_GetUp_C, AnimGraphNode_LinkedInputPose) == 0x0004A0, "Member 'UTABP_GetUp_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UTABP_GetUp_C, AnimGraphNode_BlendListByBool) == 0x000558, "Member 'UTABP_GetUp_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UTABP_GetUp_C, AnimGraphNode_SaveCachedPose) == 0x0005A0, "Member 'UTABP_GetUp_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UTABP_GetUp_C, AnimGraphNode_UseCachedPose) == 0x000620, "Member 'UTABP_GetUp_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UTABP_GetUp_C, AnimGraphNode_Root) == 0x000648, "Member 'UTABP_GetUp_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UTABP_GetUp_C, AnimGraphNode_LocalRefPose) == 0x000668, "Member 'UTABP_GetUp_C::AnimGraphNode_LocalRefPose' has a wrong offset!");
static_assert(offsetof(UTABP_GetUp_C, K2Node_PropertyAccess) == 0x000678, "Member 'UTABP_GetUp_C::K2Node_PropertyAccess' has a wrong offset!");

}

