#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TABP_HumanoidTailPhysics

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct TABP_HumanoidTailPhysics.TABP_HumanoidTailPhysics_C.AnimBlueprintGeneratedConstantData
// 0x0107 (0x0108 - 0x0001)
struct TABP_HumanoidTailPhysics::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_32;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_33;                                 // 0x0010(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_34;                                   // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_35;                                 // 0x0020(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_36;                                 // 0x0021(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_37;                                 // 0x0022(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_38;                                // 0x0028(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_39;                                 // 0x0038(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_40;                                 // 0x0040(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_41;                               // 0x0048(0x0020)(BlueprintVisible, NoDestructor)
	ERefPoseType                                  __ByteProperty_42;                                 // 0x0068(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0070(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x00F0(0x0018)()
};
static_assert(alignof(TABP_HumanoidTailPhysics::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on TABP_HumanoidTailPhysics::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(TABP_HumanoidTailPhysics::FAnimBlueprintGeneratedConstantData) == 0x000108, "Wrong size on TABP_HumanoidTailPhysics::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(TABP_HumanoidTailPhysics::FAnimBlueprintGeneratedConstantData, __NameProperty_32) == 0x000004, "Member 'TABP_HumanoidTailPhysics::FAnimBlueprintGeneratedConstantData::__NameProperty_32' has a wrong offset!");
static_assert(offsetof(TABP_HumanoidTailPhysics::FAnimBlueprintGeneratedConstantData, __BlendProfile_33) == 0x000010, "Member 'TABP_HumanoidTailPhysics::FAnimBlueprintGeneratedConstantData::__BlendProfile_33' has a wrong offset!");
static_assert(offsetof(TABP_HumanoidTailPhysics::FAnimBlueprintGeneratedConstantData, __CurveFloat_34) == 0x000018, "Member 'TABP_HumanoidTailPhysics::FAnimBlueprintGeneratedConstantData::__CurveFloat_34' has a wrong offset!");
static_assert(offsetof(TABP_HumanoidTailPhysics::FAnimBlueprintGeneratedConstantData, __BoolProperty_35) == 0x000020, "Member 'TABP_HumanoidTailPhysics::FAnimBlueprintGeneratedConstantData::__BoolProperty_35' has a wrong offset!");
static_assert(offsetof(TABP_HumanoidTailPhysics::FAnimBlueprintGeneratedConstantData, __EnumProperty_36) == 0x000021, "Member 'TABP_HumanoidTailPhysics::FAnimBlueprintGeneratedConstantData::__EnumProperty_36' has a wrong offset!");
static_assert(offsetof(TABP_HumanoidTailPhysics::FAnimBlueprintGeneratedConstantData, __EnumProperty_37) == 0x000022, "Member 'TABP_HumanoidTailPhysics::FAnimBlueprintGeneratedConstantData::__EnumProperty_37' has a wrong offset!");
static_assert(offsetof(TABP_HumanoidTailPhysics::FAnimBlueprintGeneratedConstantData, __ArrayProperty_38) == 0x000028, "Member 'TABP_HumanoidTailPhysics::FAnimBlueprintGeneratedConstantData::__ArrayProperty_38' has a wrong offset!");
static_assert(offsetof(TABP_HumanoidTailPhysics::FAnimBlueprintGeneratedConstantData, __NameProperty_39) == 0x000038, "Member 'TABP_HumanoidTailPhysics::FAnimBlueprintGeneratedConstantData::__NameProperty_39' has a wrong offset!");
static_assert(offsetof(TABP_HumanoidTailPhysics::FAnimBlueprintGeneratedConstantData, __NameProperty_40) == 0x000040, "Member 'TABP_HumanoidTailPhysics::FAnimBlueprintGeneratedConstantData::__NameProperty_40' has a wrong offset!");
static_assert(offsetof(TABP_HumanoidTailPhysics::FAnimBlueprintGeneratedConstantData, __StructProperty_41) == 0x000048, "Member 'TABP_HumanoidTailPhysics::FAnimBlueprintGeneratedConstantData::__StructProperty_41' has a wrong offset!");
static_assert(offsetof(TABP_HumanoidTailPhysics::FAnimBlueprintGeneratedConstantData, __ByteProperty_42) == 0x000068, "Member 'TABP_HumanoidTailPhysics::FAnimBlueprintGeneratedConstantData::__ByteProperty_42' has a wrong offset!");
static_assert(offsetof(TABP_HumanoidTailPhysics::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000070, "Member 'TABP_HumanoidTailPhysics::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(TABP_HumanoidTailPhysics::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0000F0, "Member 'TABP_HumanoidTailPhysics::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct TABP_HumanoidTailPhysics.TABP_HumanoidTailPhysics_C.AnimBlueprintGeneratedMutableData
// 0x0001 (0x0002 - 0x0001)
struct TABP_HumanoidTailPhysics::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TABP_HumanoidTailPhysics::FAnimBlueprintGeneratedMutableData) == 0x000001, "Wrong alignment on TABP_HumanoidTailPhysics::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(TABP_HumanoidTailPhysics::FAnimBlueprintGeneratedMutableData) == 0x000002, "Wrong size on TABP_HumanoidTailPhysics::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(TABP_HumanoidTailPhysics::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'TABP_HumanoidTailPhysics::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");

}

