#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TABP_Dodge

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Altar_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass TABP_Dodge.TABP_Dodge_C
// 0x0080 (0x0480 - 0x0400)
class UTABP_Dodge_C final : public UVDodgeCharacterAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0400(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0408(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0410(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x0418(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_1;                      // 0x0438(0x0010)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0448(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x0468(0x0010)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void DodgeLayer(struct FPoseLink* DodgeLayer_0);
	void ExecuteUbergraph_TABP_Dodge(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TABP_Dodge_C">();
	}
	static class UTABP_Dodge_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTABP_Dodge_C>();
	}
};
static_assert(alignof(UTABP_Dodge_C) == 0x000010, "Wrong alignment on UTABP_Dodge_C");
static_assert(sizeof(UTABP_Dodge_C) == 0x000480, "Wrong size on UTABP_Dodge_C");
static_assert(offsetof(UTABP_Dodge_C, UberGraphFrame) == 0x000400, "Member 'UTABP_Dodge_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTABP_Dodge_C, AnimBlueprintExtension_PropertyAccess) == 0x000408, "Member 'UTABP_Dodge_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UTABP_Dodge_C, AnimBlueprintExtension_Base) == 0x000410, "Member 'UTABP_Dodge_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UTABP_Dodge_C, AnimGraphNode_Root_1) == 0x000418, "Member 'UTABP_Dodge_C::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(UTABP_Dodge_C, AnimGraphNode_LocalRefPose_1) == 0x000438, "Member 'UTABP_Dodge_C::AnimGraphNode_LocalRefPose_1' has a wrong offset!");
static_assert(offsetof(UTABP_Dodge_C, AnimGraphNode_Root) == 0x000448, "Member 'UTABP_Dodge_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UTABP_Dodge_C, AnimGraphNode_LocalRefPose) == 0x000468, "Member 'UTABP_Dodge_C::AnimGraphNode_LocalRefPose' has a wrong offset!");

}

