#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TABP_TurnInPlaceFP

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "TABP_TurnInPlaceFP_structs.hpp"
#include "Altar_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass TABP_TurnInPlaceFP.TABP_TurnInPlaceFP_C
// 0x18A0 (0x1DC0 - 0x0520)
class UTABP_TurnInPlaceFP_C final : public UVTurnInPlaceFPAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0520(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct TABP_TurnInPlaceFP::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;           // 0x0528(0x0004)(HasGetValueTypeHash)
	uint8                                         Pad_52C[0x4];                                      // 0x052C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0530(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0538(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x0540(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0560(0x00B8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_4;                    // 0x0618(0x0080)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x0698(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_12;                    // 0x06E0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_22;                 // 0x0708(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_21;                 // 0x0730(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9;                    // 0x0758(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_11;                      // 0x07A0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8;                    // 0x07C0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_10;                      // 0x0808(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_20;                 // 0x0828(0x0028)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_4;                      // 0x0850(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_3;                    // 0x0918(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_19;                 // 0x0998(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_18;                 // 0x09C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_17;                 // 0x09E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_16;                 // 0x0A10(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_15;                 // 0x0A38(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_14;                 // 0x0A60(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_13;                 // 0x0A88(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_12;                 // 0x0AB0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_11;                 // 0x0AD8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_10;                 // 0x0B00(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9;                  // 0x0B28(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_11;                    // 0x0B50(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_1;                       // 0x0B78(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7;                    // 0x0C40(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_9;                       // 0x0C88(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_10;                    // 0x0CA8(0x0028)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_5;                     // 0x0CD0(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0x0D98(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_8;                       // 0x0DE0(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_9;                     // 0x0E00(0x0028)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_4;                     // 0x0E28(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x0EF0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_7;                       // 0x0F38(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_3;                      // 0x0F58(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6;                       // 0x1020(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0x1040(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0x1068(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x1090(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x10B8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x10E0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x1108(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_8;                     // 0x1130(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend;                         // 0x1158(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x1220(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x1268(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_7;                     // 0x1288(0x0028)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_3;                     // 0x12B0(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x1378(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x13C0(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_6;                     // 0x13E0(0x0028)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_2;                     // 0x1408(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x14D0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x1518(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_2;                      // 0x1538(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x1600(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0x1620(0x00C8)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x16E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x1710(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x1738(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x1780(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x17A0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x17E8(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x1808(0x0028)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x1830(0x00C8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x18F8(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5;                     // 0x1940(0x0028)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_1;                     // 0x1968(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2;                    // 0x1A30(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x1AB0(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x1AD8(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x1B20(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x1B48(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x1BC8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x1BF0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x1C18(0x0028)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x1C40(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x1D08(0x0080)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x1D88(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x1DA8(0x0010)()
	bool                                          K2Node_PropertyAccess_20;                          // 0x1DB8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_TABP_TurnInPlaceFP(int32 EntryPoint);
	void TurnInPlaceLayer(const struct FPoseLink& InPose, struct FPoseLink* TurnInPlaceLayer_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TABP_TurnInPlaceFP_C">();
	}
	static class UTABP_TurnInPlaceFP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTABP_TurnInPlaceFP_C>();
	}
};
static_assert(alignof(UTABP_TurnInPlaceFP_C) == 0x000010, "Wrong alignment on UTABP_TurnInPlaceFP_C");
static_assert(sizeof(UTABP_TurnInPlaceFP_C) == 0x001DC0, "Wrong size on UTABP_TurnInPlaceFP_C");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, UberGraphFrame) == 0x000520, "Member 'UTABP_TurnInPlaceFP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, __AnimBlueprintMutables) == 0x000528, "Member 'UTABP_TurnInPlaceFP_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimBlueprintExtension_PropertyAccess) == 0x000530, "Member 'UTABP_TurnInPlaceFP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimBlueprintExtension_Base) == 0x000538, "Member 'UTABP_TurnInPlaceFP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_Root_1) == 0x000540, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_LinkedInputPose) == 0x000560, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_SaveCachedPose_4) == 0x000618, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_SaveCachedPose_4' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_BlendListByBool_2) == 0x000698, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_BlendListByBool_2' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_UseCachedPose_12) == 0x0006E0, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_UseCachedPose_12' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_TransitionResult_22) == 0x000708, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_TransitionResult_22' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_TransitionResult_21) == 0x000730, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_TransitionResult_21' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_SequencePlayer_9) == 0x000758, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_SequencePlayer_9' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_StateResult_11) == 0x0007A0, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_StateResult_11' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_SequencePlayer_8) == 0x0007C0, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_SequencePlayer_8' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_StateResult_10) == 0x000808, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_StateResult_10' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_TransitionResult_20) == 0x000828, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_TransitionResult_20' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_StateMachine_4) == 0x000850, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_StateMachine_4' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_SaveCachedPose_3) == 0x000918, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_SaveCachedPose_3' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_TransitionResult_19) == 0x000998, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_TransitionResult_19' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_TransitionResult_18) == 0x0009C0, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_TransitionResult_18' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_TransitionResult_17) == 0x0009E8, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_TransitionResult_17' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_TransitionResult_16) == 0x000A10, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_TransitionResult_16' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_TransitionResult_15) == 0x000A38, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_TransitionResult_15' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_TransitionResult_14) == 0x000A60, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_TransitionResult_14' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_TransitionResult_13) == 0x000A88, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_TransitionResult_13' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_TransitionResult_12) == 0x000AB0, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_TransitionResult_12' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_TransitionResult_11) == 0x000AD8, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_TransitionResult_11' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_TransitionResult_10) == 0x000B00, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_TransitionResult_10' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_TransitionResult_9) == 0x000B28, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_TransitionResult_9' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_UseCachedPose_11) == 0x000B50, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_UseCachedPose_11' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_TwoWayBlend_1) == 0x000B78, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_TwoWayBlend_1' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_SequencePlayer_7) == 0x000C40, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_SequencePlayer_7' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_StateResult_9) == 0x000C88, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_StateResult_9' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_UseCachedPose_10) == 0x000CA8, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_UseCachedPose_10' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_ApplyAdditive_5) == 0x000CD0, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_ApplyAdditive_5' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_SequencePlayer_6) == 0x000D98, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_SequencePlayer_6' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_StateResult_8) == 0x000DE0, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_StateResult_8' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_UseCachedPose_9) == 0x000E00, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_UseCachedPose_9' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_ApplyAdditive_4) == 0x000E28, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_ApplyAdditive_4' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_SequencePlayer_5) == 0x000EF0, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_SequencePlayer_5' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_StateResult_7) == 0x000F38, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_StateResult_7' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_StateMachine_3) == 0x000F58, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_StateMachine_3' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_StateResult_6) == 0x001020, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_StateResult_6' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_TransitionResult_8) == 0x001040, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_TransitionResult_8' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_TransitionResult_7) == 0x001068, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_TransitionResult_7' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_TransitionResult_6) == 0x001090, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_TransitionResult_6' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_TransitionResult_5) == 0x0010B8, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_TransitionResult_5' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_TransitionResult_4) == 0x0010E0, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_TransitionResult_4' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_TransitionResult_3) == 0x001108, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_UseCachedPose_8) == 0x001130, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_UseCachedPose_8' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_TwoWayBlend) == 0x001158, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_TwoWayBlend' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_SequencePlayer_4) == 0x001220, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_StateResult_5) == 0x001268, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_StateResult_5' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_UseCachedPose_7) == 0x001288, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_UseCachedPose_7' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_ApplyAdditive_3) == 0x0012B0, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_ApplyAdditive_3' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_SequencePlayer_3) == 0x001378, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_StateResult_4) == 0x0013C0, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_StateResult_4' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_UseCachedPose_6) == 0x0013E0, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_UseCachedPose_6' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_ApplyAdditive_2) == 0x001408, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_ApplyAdditive_2' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_SequencePlayer_2) == 0x0014D0, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_StateResult_3) == 0x001518, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_StateMachine_2) == 0x001538, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_StateMachine_2' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_StateResult_2) == 0x001600, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_StateMachine_1) == 0x001620, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_StateMachine_1' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_TransitionResult_2) == 0x0016E8, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_TransitionResult_1) == 0x001710, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_SequencePlayer_1) == 0x001738, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_StateResult_1) == 0x001780, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_SequencePlayer) == 0x0017A0, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_StateResult) == 0x0017E8, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_TransitionResult) == 0x001808, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_StateMachine) == 0x001830, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_BlendListByBool_1) == 0x0018F8, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_UseCachedPose_5) == 0x001940, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_UseCachedPose_5' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_ApplyAdditive_1) == 0x001968, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_ApplyAdditive_1' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_SaveCachedPose_2) == 0x001A30, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_SaveCachedPose_2' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_UseCachedPose_4) == 0x001AB0, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_UseCachedPose_4' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_BlendListByBool) == 0x001AD8, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_UseCachedPose_3) == 0x001B20, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_UseCachedPose_3' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_SaveCachedPose_1) == 0x001B48, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_SaveCachedPose_1' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_UseCachedPose_2) == 0x001BC8, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_UseCachedPose_1) == 0x001BF0, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_UseCachedPose) == 0x001C18, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_ApplyAdditive) == 0x001C40, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_ApplyAdditive' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_SaveCachedPose) == 0x001D08, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_Root) == 0x001D88, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, AnimGraphNode_LocalRefPose) == 0x001DA8, "Member 'UTABP_TurnInPlaceFP_C::AnimGraphNode_LocalRefPose' has a wrong offset!");
static_assert(offsetof(UTABP_TurnInPlaceFP_C, K2Node_PropertyAccess_20) == 0x001DB8, "Member 'UTABP_TurnInPlaceFP_C::K2Node_PropertyAccess_20' has a wrong offset!");

}

