#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TABP_HumanoidTailPhysics

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function TABP_HumanoidTailPhysics.TABP_HumanoidTailPhysics_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct TABP_HumanoidTailPhysics_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(TABP_HumanoidTailPhysics_C_AnimGraph) == 0x000008, "Wrong alignment on TABP_HumanoidTailPhysics_C_AnimGraph");
static_assert(sizeof(TABP_HumanoidTailPhysics_C_AnimGraph) == 0x000010, "Wrong size on TABP_HumanoidTailPhysics_C_AnimGraph");
static_assert(offsetof(TABP_HumanoidTailPhysics_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'TABP_HumanoidTailPhysics_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function TABP_HumanoidTailPhysics.TABP_HumanoidTailPhysics_C.ExecuteUbergraph_TABP_HumanoidTailPhysics
// 0x0004 (0x0004 - 0x0000)
struct TABP_HumanoidTailPhysics_C_ExecuteUbergraph_TABP_HumanoidTailPhysics final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TABP_HumanoidTailPhysics_C_ExecuteUbergraph_TABP_HumanoidTailPhysics) == 0x000004, "Wrong alignment on TABP_HumanoidTailPhysics_C_ExecuteUbergraph_TABP_HumanoidTailPhysics");
static_assert(sizeof(TABP_HumanoidTailPhysics_C_ExecuteUbergraph_TABP_HumanoidTailPhysics) == 0x000004, "Wrong size on TABP_HumanoidTailPhysics_C_ExecuteUbergraph_TABP_HumanoidTailPhysics");
static_assert(offsetof(TABP_HumanoidTailPhysics_C_ExecuteUbergraph_TABP_HumanoidTailPhysics, EntryPoint) == 0x000000, "Member 'TABP_HumanoidTailPhysics_C_ExecuteUbergraph_TABP_HumanoidTailPhysics::EntryPoint' has a wrong offset!");

// Function TABP_HumanoidTailPhysics.TABP_HumanoidTailPhysics_C.Humanoid Tail Physics
// 0x0020 (0x0020 - 0x0000)
struct TABP_HumanoidTailPhysics_C_Humanoid_Tail_Physics final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Humanoid_Tail_Physics_0;                           // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(TABP_HumanoidTailPhysics_C_Humanoid_Tail_Physics) == 0x000008, "Wrong alignment on TABP_HumanoidTailPhysics_C_Humanoid_Tail_Physics");
static_assert(sizeof(TABP_HumanoidTailPhysics_C_Humanoid_Tail_Physics) == 0x000020, "Wrong size on TABP_HumanoidTailPhysics_C_Humanoid_Tail_Physics");
static_assert(offsetof(TABP_HumanoidTailPhysics_C_Humanoid_Tail_Physics, InPose) == 0x000000, "Member 'TABP_HumanoidTailPhysics_C_Humanoid_Tail_Physics::InPose' has a wrong offset!");
static_assert(offsetof(TABP_HumanoidTailPhysics_C_Humanoid_Tail_Physics, Humanoid_Tail_Physics_0) == 0x000010, "Member 'TABP_HumanoidTailPhysics_C_Humanoid_Tail_Physics::Humanoid_Tail_Physics_0' has a wrong offset!");

}

