#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TABP_MeleeAttack_MediumCombo

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct TABP_MeleeAttack_MediumCombo.TABP_MeleeAttack_MediumCombo_C.AnimBlueprintGeneratedConstantData
// 0x0147 (0x0148 - 0x0001)
struct TABP_MeleeAttack_MediumCombo::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_95;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_96;                                 // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_97;                                  // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_98;                                 // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_99;                                  // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_100;                                // 0x0024(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_101;                                 // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_102;                               // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_103;                              // 0x0034(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_104;                               // 0x0060(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_105;                                // 0x0064(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_106;                                // 0x0065(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_66[0x2];                                       // 0x0066(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_107;                                // 0x0068(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_108;                                 // 0x0070(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_109;                                // 0x0074(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_110;                                // 0x007C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_111;                              // 0x0088(0x0020)(BlueprintVisible, NoDestructor)
	ERefPoseType                                  __ByteProperty_112;                                // 0x00A8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00B0(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0130(0x0018)()
};
static_assert(alignof(TABP_MeleeAttack_MediumCombo::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on TABP_MeleeAttack_MediumCombo::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(TABP_MeleeAttack_MediumCombo::FAnimBlueprintGeneratedConstantData) == 0x000148, "Wrong size on TABP_MeleeAttack_MediumCombo::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(TABP_MeleeAttack_MediumCombo::FAnimBlueprintGeneratedConstantData, __NameProperty_95) == 0x000004, "Member 'TABP_MeleeAttack_MediumCombo::FAnimBlueprintGeneratedConstantData::__NameProperty_95' has a wrong offset!");
static_assert(offsetof(TABP_MeleeAttack_MediumCombo::FAnimBlueprintGeneratedConstantData, __NameProperty_96) == 0x00000C, "Member 'TABP_MeleeAttack_MediumCombo::FAnimBlueprintGeneratedConstantData::__NameProperty_96' has a wrong offset!");
static_assert(offsetof(TABP_MeleeAttack_MediumCombo::FAnimBlueprintGeneratedConstantData, __IntProperty_97) == 0x000014, "Member 'TABP_MeleeAttack_MediumCombo::FAnimBlueprintGeneratedConstantData::__IntProperty_97' has a wrong offset!");
static_assert(offsetof(TABP_MeleeAttack_MediumCombo::FAnimBlueprintGeneratedConstantData, __NameProperty_98) == 0x000018, "Member 'TABP_MeleeAttack_MediumCombo::FAnimBlueprintGeneratedConstantData::__NameProperty_98' has a wrong offset!");
static_assert(offsetof(TABP_MeleeAttack_MediumCombo::FAnimBlueprintGeneratedConstantData, __IntProperty_99) == 0x000020, "Member 'TABP_MeleeAttack_MediumCombo::FAnimBlueprintGeneratedConstantData::__IntProperty_99' has a wrong offset!");
static_assert(offsetof(TABP_MeleeAttack_MediumCombo::FAnimBlueprintGeneratedConstantData, __NameProperty_100) == 0x000024, "Member 'TABP_MeleeAttack_MediumCombo::FAnimBlueprintGeneratedConstantData::__NameProperty_100' has a wrong offset!");
static_assert(offsetof(TABP_MeleeAttack_MediumCombo::FAnimBlueprintGeneratedConstantData, __IntProperty_101) == 0x00002C, "Member 'TABP_MeleeAttack_MediumCombo::FAnimBlueprintGeneratedConstantData::__IntProperty_101' has a wrong offset!");
static_assert(offsetof(TABP_MeleeAttack_MediumCombo::FAnimBlueprintGeneratedConstantData, __FloatProperty_102) == 0x000030, "Member 'TABP_MeleeAttack_MediumCombo::FAnimBlueprintGeneratedConstantData::__FloatProperty_102' has a wrong offset!");
static_assert(offsetof(TABP_MeleeAttack_MediumCombo::FAnimBlueprintGeneratedConstantData, __StructProperty_103) == 0x000034, "Member 'TABP_MeleeAttack_MediumCombo::FAnimBlueprintGeneratedConstantData::__StructProperty_103' has a wrong offset!");
static_assert(offsetof(TABP_MeleeAttack_MediumCombo::FAnimBlueprintGeneratedConstantData, __FloatProperty_104) == 0x000060, "Member 'TABP_MeleeAttack_MediumCombo::FAnimBlueprintGeneratedConstantData::__FloatProperty_104' has a wrong offset!");
static_assert(offsetof(TABP_MeleeAttack_MediumCombo::FAnimBlueprintGeneratedConstantData, __BoolProperty_105) == 0x000064, "Member 'TABP_MeleeAttack_MediumCombo::FAnimBlueprintGeneratedConstantData::__BoolProperty_105' has a wrong offset!");
static_assert(offsetof(TABP_MeleeAttack_MediumCombo::FAnimBlueprintGeneratedConstantData, __EnumProperty_106) == 0x000065, "Member 'TABP_MeleeAttack_MediumCombo::FAnimBlueprintGeneratedConstantData::__EnumProperty_106' has a wrong offset!");
static_assert(offsetof(TABP_MeleeAttack_MediumCombo::FAnimBlueprintGeneratedConstantData, __NameProperty_107) == 0x000068, "Member 'TABP_MeleeAttack_MediumCombo::FAnimBlueprintGeneratedConstantData::__NameProperty_107' has a wrong offset!");
static_assert(offsetof(TABP_MeleeAttack_MediumCombo::FAnimBlueprintGeneratedConstantData, __IntProperty_108) == 0x000070, "Member 'TABP_MeleeAttack_MediumCombo::FAnimBlueprintGeneratedConstantData::__IntProperty_108' has a wrong offset!");
static_assert(offsetof(TABP_MeleeAttack_MediumCombo::FAnimBlueprintGeneratedConstantData, __NameProperty_109) == 0x000074, "Member 'TABP_MeleeAttack_MediumCombo::FAnimBlueprintGeneratedConstantData::__NameProperty_109' has a wrong offset!");
static_assert(offsetof(TABP_MeleeAttack_MediumCombo::FAnimBlueprintGeneratedConstantData, __NameProperty_110) == 0x00007C, "Member 'TABP_MeleeAttack_MediumCombo::FAnimBlueprintGeneratedConstantData::__NameProperty_110' has a wrong offset!");
static_assert(offsetof(TABP_MeleeAttack_MediumCombo::FAnimBlueprintGeneratedConstantData, __StructProperty_111) == 0x000088, "Member 'TABP_MeleeAttack_MediumCombo::FAnimBlueprintGeneratedConstantData::__StructProperty_111' has a wrong offset!");
static_assert(offsetof(TABP_MeleeAttack_MediumCombo::FAnimBlueprintGeneratedConstantData, __ByteProperty_112) == 0x0000A8, "Member 'TABP_MeleeAttack_MediumCombo::FAnimBlueprintGeneratedConstantData::__ByteProperty_112' has a wrong offset!");
static_assert(offsetof(TABP_MeleeAttack_MediumCombo::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000B0, "Member 'TABP_MeleeAttack_MediumCombo::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(TABP_MeleeAttack_MediumCombo::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000130, "Member 'TABP_MeleeAttack_MediumCombo::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct TABP_MeleeAttack_MediumCombo.TABP_MeleeAttack_MediumCombo_C.AnimBlueprintGeneratedMutableData
// 0x000F (0x0010 - 0x0001)
struct TABP_MeleeAttack_MediumCombo::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_0;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_1;                                 // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TABP_MeleeAttack_MediumCombo::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on TABP_MeleeAttack_MediumCombo::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(TABP_MeleeAttack_MediumCombo::FAnimBlueprintGeneratedMutableData) == 0x000010, "Wrong size on TABP_MeleeAttack_MediumCombo::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(TABP_MeleeAttack_MediumCombo::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'TABP_MeleeAttack_MediumCombo::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");
static_assert(offsetof(TABP_MeleeAttack_MediumCombo::FAnimBlueprintGeneratedMutableData, __FloatProperty_0) == 0x000008, "Member 'TABP_MeleeAttack_MediumCombo::FAnimBlueprintGeneratedMutableData::__FloatProperty_0' has a wrong offset!");
static_assert(offsetof(TABP_MeleeAttack_MediumCombo::FAnimBlueprintGeneratedMutableData, __FloatProperty_1) == 0x00000C, "Member 'TABP_MeleeAttack_MediumCombo::FAnimBlueprintGeneratedMutableData::__FloatProperty_1' has a wrong offset!");

}

