#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TABP_HorseRiding_Ground

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function TABP_HorseRiding_Ground.TABP_HorseRiding_Ground_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct TABP_HorseRiding_Ground_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(TABP_HorseRiding_Ground_C_AnimGraph) == 0x000008, "Wrong alignment on TABP_HorseRiding_Ground_C_AnimGraph");
static_assert(sizeof(TABP_HorseRiding_Ground_C_AnimGraph) == 0x000010, "Wrong size on TABP_HorseRiding_Ground_C_AnimGraph");
static_assert(offsetof(TABP_HorseRiding_Ground_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'TABP_HorseRiding_Ground_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function TABP_HorseRiding_Ground.TABP_HorseRiding_Ground_C.ExecuteUbergraph_TABP_HorseRiding_Ground
// 0x0004 (0x0004 - 0x0000)
struct TABP_HorseRiding_Ground_C_ExecuteUbergraph_TABP_HorseRiding_Ground final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TABP_HorseRiding_Ground_C_ExecuteUbergraph_TABP_HorseRiding_Ground) == 0x000004, "Wrong alignment on TABP_HorseRiding_Ground_C_ExecuteUbergraph_TABP_HorseRiding_Ground");
static_assert(sizeof(TABP_HorseRiding_Ground_C_ExecuteUbergraph_TABP_HorseRiding_Ground) == 0x000004, "Wrong size on TABP_HorseRiding_Ground_C_ExecuteUbergraph_TABP_HorseRiding_Ground");
static_assert(offsetof(TABP_HorseRiding_Ground_C_ExecuteUbergraph_TABP_HorseRiding_Ground, EntryPoint) == 0x000000, "Member 'TABP_HorseRiding_Ground_C_ExecuteUbergraph_TABP_HorseRiding_Ground::EntryPoint' has a wrong offset!");

// Function TABP_HorseRiding_Ground.TABP_HorseRiding_Ground_C.HorseRidingLayer
// 0x0010 (0x0010 - 0x0000)
struct TABP_HorseRiding_Ground_C_HorseRidingLayer final
{
public:
	struct FPoseLink                              HorseRidingLayer_0;                                // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(TABP_HorseRiding_Ground_C_HorseRidingLayer) == 0x000008, "Wrong alignment on TABP_HorseRiding_Ground_C_HorseRidingLayer");
static_assert(sizeof(TABP_HorseRiding_Ground_C_HorseRidingLayer) == 0x000010, "Wrong size on TABP_HorseRiding_Ground_C_HorseRidingLayer");
static_assert(offsetof(TABP_HorseRiding_Ground_C_HorseRidingLayer, HorseRidingLayer_0) == 0x000000, "Member 'TABP_HorseRiding_Ground_C_HorseRidingLayer::HorseRidingLayer_0' has a wrong offset!");

}

