#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TABP_HumanoidLowerAndUpperBody

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "TABP_HumanoidLowerAndUpperBody_structs.hpp"
#include "Altar_structs.hpp"
#include "Altar_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass TABP_HumanoidLowerAndUpperBody.TABP_HumanoidLowerAndUpperBody_C
// 0x11A0 (0x1620 - 0x0480)
class UTABP_HumanoidLowerAndUpperBody_C final : public UVHumanoidLowerAndUpperCharacterAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0480(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct TABP_HumanoidLowerAndUpperBody::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x0488(0x0006)(HasGetValueTypeHash)
	uint8                                         Pad_48E[0x2];                                      // 0x048E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0490(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0498(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x04A0(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x04C0(0x00B8)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0578(0x00B8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_4;                   // 0x0630(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_6;                    // 0x0678(0x0080)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_5;                    // 0x06F8(0x0080)()
	struct FAnimNode_LayeredBoneBlendTemplate     AnimGraphNode_LayeredBoneBlendTemplate_3;          // 0x0778(0x0110)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_4;                    // 0x0888(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_22;                    // 0x0908(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_21;                    // 0x0930(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_20;                    // 0x0958(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_19;                    // 0x0980(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_18;                    // 0x09A8(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_3;                    // 0x09D0(0x0080)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_3;                   // 0x0A50(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_17;                    // 0x0A98(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_16;                    // 0x0AC0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_15;                    // 0x0AE8(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x0B10(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2;                    // 0x0B58(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_14;                    // 0x0BD8(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x0C00(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_13;                    // 0x0C48(0x0028)()
	struct FAnimNode_LayeredBoneBlendTemplate     AnimGraphNode_LayeredBoneBlendTemplate_2;          // 0x0C70(0x0110)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_12;                    // 0x0D80(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_11;                    // 0x0DA8(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x0DD0(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_10;                    // 0x0E50(0x0028)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0E78(0x0128)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0FA0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0FC0(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0FE0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x1008(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_9;                     // 0x1030(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_8;                     // 0x1058(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_7;                     // 0x1080(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_6;                     // 0x10A8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5;                     // 0x10D0(0x0028)()
	struct FAnimNode_LayeredBoneBlendTemplate     AnimGraphNode_LayeredBoneBlendTemplate_1;          // 0x10F8(0x0110)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x1208(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x1228(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x1250(0x0028)()
	struct FAnimNode_LayeredBoneBlendTemplate     AnimGraphNode_LayeredBoneBlendTemplate;            // 0x1278(0x0110)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x1388(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x13A8(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x1470(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x1498(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x14E0(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x1560(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x1588(0x0028)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x15B0(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x15D0(0x0010)()
	bool                                          K2Node_PropertyAccess_20;                          // 0x15E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_PropertyAccess_19;                          // 0x15E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_PropertyAccess_9;                           // 0x15E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_PropertyAccess_8;                           // 0x15E3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_PropertyAccess_7;                           // 0x15E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_PropertyAccess_5;                           // 0x15E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15E6[0x2];                                     // 0x15E6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVHumanoidLowerAndUpperBodySetup       LayeredBlendSettings;                              // 0x15E8(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_TABP_HumanoidLowerAndUpperBody(int32 EntryPoint);
	void LowerAndUpperBodyLayer(const struct FPoseLink& LowerBody, const struct FPoseLink& UpperBody, struct FPoseLink* LowerAndUpperBodyLayer_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TABP_HumanoidLowerAndUpperBody_C">();
	}
	static class UTABP_HumanoidLowerAndUpperBody_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTABP_HumanoidLowerAndUpperBody_C>();
	}
};
static_assert(alignof(UTABP_HumanoidLowerAndUpperBody_C) == 0x000010, "Wrong alignment on UTABP_HumanoidLowerAndUpperBody_C");
static_assert(sizeof(UTABP_HumanoidLowerAndUpperBody_C) == 0x001620, "Wrong size on UTABP_HumanoidLowerAndUpperBody_C");
static_assert(offsetof(UTABP_HumanoidLowerAndUpperBody_C, UberGraphFrame) == 0x000480, "Member 'UTABP_HumanoidLowerAndUpperBody_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTABP_HumanoidLowerAndUpperBody_C, __AnimBlueprintMutables) == 0x000488, "Member 'UTABP_HumanoidLowerAndUpperBody_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UTABP_HumanoidLowerAndUpperBody_C, AnimBlueprintExtension_PropertyAccess) == 0x000490, "Member 'UTABP_HumanoidLowerAndUpperBody_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UTABP_HumanoidLowerAndUpperBody_C, AnimBlueprintExtension_Base) == 0x000498, "Member 'UTABP_HumanoidLowerAndUpperBody_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UTABP_HumanoidLowerAndUpperBody_C, AnimGraphNode_Root_1) == 0x0004A0, "Member 'UTABP_HumanoidLowerAndUpperBody_C::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(UTABP_HumanoidLowerAndUpperBody_C, AnimGraphNode_LinkedInputPose_1) == 0x0004C0, "Member 'UTABP_HumanoidLowerAndUpperBody_C::AnimGraphNode_LinkedInputPose_1' has a wrong offset!");
static_assert(offsetof(UTABP_HumanoidLowerAndUpperBody_C, AnimGraphNode_LinkedInputPose) == 0x000578, "Member 'UTABP_HumanoidLowerAndUpperBody_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UTABP_HumanoidLowerAndUpperBody_C, AnimGraphNode_BlendListByBool_4) == 0x000630, "Member 'UTABP_HumanoidLowerAndUpperBody_C::AnimGraphNode_BlendListByBool_4' has a wrong offset!");
static_assert(offsetof(UTABP_HumanoidLowerAndUpperBody_C, AnimGraphNode_SaveCachedPose_6) == 0x000678, "Member 'UTABP_HumanoidLowerAndUpperBody_C::AnimGraphNode_SaveCachedPose_6' has a wrong offset!");
static_assert(offsetof(UTABP_HumanoidLowerAndUpperBody_C, AnimGraphNode_SaveCachedPose_5) == 0x0006F8, "Member 'UTABP_HumanoidLowerAndUpperBody_C::AnimGraphNode_SaveCachedPose_5' has a wrong offset!");
static_assert(offsetof(UTABP_HumanoidLowerAndUpperBody_C, AnimGraphNode_LayeredBoneBlendTemplate_3) == 0x000778, "Member 'UTABP_HumanoidLowerAndUpperBody_C::AnimGraphNode_LayeredBoneBlendTemplate_3' has a wrong offset!");
static_assert(offsetof(UTABP_HumanoidLowerAndUpperBody_C, AnimGraphNode_SaveCachedPose_4) == 0x000888, "Member 'UTABP_HumanoidLowerAndUpperBody_C::AnimGraphNode_SaveCachedPose_4' has a wrong offset!");
static_assert(offsetof(UTABP_HumanoidLowerAndUpperBody_C, AnimGraphNode_UseCachedPose_22) == 0x000908, "Member 'UTABP_HumanoidLowerAndUpperBody_C::AnimGraphNode_UseCachedPose_22' has a wrong offset!");
static_assert(offsetof(UTABP_HumanoidLowerAndUpperBody_C, AnimGraphNode_UseCachedPose_21) == 0x000930, "Member 'UTABP_HumanoidLowerAndUpperBody_C::AnimGraphNode_UseCachedPose_21' has a wrong offset!");
static_assert(offsetof(UTABP_HumanoidLowerAndUpperBody_C, AnimGraphNode_UseCachedPose_20) == 0x000958, "Member 'UTABP_HumanoidLowerAndUpperBody_C::AnimGraphNode_UseCachedPose_20' has a wrong offset!");
static_assert(offsetof(UTABP_HumanoidLowerAndUpperBody_C, AnimGraphNode_UseCachedPose_19) == 0x000980, "Member 'UTABP_HumanoidLowerAndUpperBody_C::AnimGraphNode_UseCachedPose_19' has a wrong offset!");
static_assert(offsetof(UTABP_HumanoidLowerAndUpperBody_C, AnimGraphNode_UseCachedPose_18) == 0x0009A8, "Member 'UTABP_HumanoidLowerAndUpperBody_C::AnimGraphNode_UseCachedPose_18' has a wrong offset!");
static_assert(offsetof(UTABP_HumanoidLowerAndUpperBody_C, AnimGraphNode_SaveCachedPose_3) == 0x0009D0, "Member 'UTABP_HumanoidLowerAndUpperBody_C::AnimGraphNode_SaveCachedPose_3' has a wrong offset!");
static_assert(offsetof(UTABP_HumanoidLowerAndUpperBody_C, AnimGraphNode_BlendListByBool_3) == 0x000A50, "Member 'UTABP_HumanoidLowerAndUpperBody_C::AnimGraphNode_BlendListByBool_3' has a wrong offset!");
static_assert(offsetof(UTABP_HumanoidLowerAndUpperBody_C, AnimGraphNode_UseCachedPose_17) == 0x000A98, "Member 'UTABP_HumanoidLowerAndUpperBody_C::AnimGraphNode_UseCachedPose_17' has a wrong offset!");
static_assert(offsetof(UTABP_HumanoidLowerAndUpperBody_C, AnimGraphNode_UseCachedPose_16) == 0x000AC0, "Member 'UTABP_HumanoidLowerAndUpperBody_C::AnimGraphNode_UseCachedPose_16' has a wrong offset!");
static_assert(offsetof(UTABP_HumanoidLowerAndUpperBody_C, AnimGraphNode_UseCachedPose_15) == 0x000AE8, "Member 'UTABP_HumanoidLowerAndUpperBody_C::AnimGraphNode_UseCachedPose_15' has a wrong offset!");
static_assert(offsetof(UTABP_HumanoidLowerAndUpperBody_C, AnimGraphNode_BlendListByBool_2) == 0x000B10, "Member 'UTABP_HumanoidLowerAndUpperBody_C::AnimGraphNode_BlendListByBool_2' has a wrong offset!");
static_assert(offsetof(UTABP_HumanoidLowerAndUpperBody_C, AnimGraphNode_SaveCachedPose_2) == 0x000B58, "Member 'UTABP_HumanoidLowerAndUpperBody_C::AnimGraphNode_SaveCachedPose_2' has a wrong offset!");
static_assert(offsetof(UTABP_HumanoidLowerAndUpperBody_C, AnimGraphNode_UseCachedPose_14) == 0x000BD8, "Member 'UTABP_HumanoidLowerAndUpperBody_C::AnimGraphNode_UseCachedPose_14' has a wrong offset!");
static_assert(offsetof(UTABP_HumanoidLowerAndUpperBody_C, AnimGraphNode_BlendListByBool_1) == 0x000C00, "Member 'UTABP_HumanoidLowerAndUpperBody_C::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(UTABP_HumanoidLowerAndUpperBody_C, AnimGraphNode_UseCachedPose_13) == 0x000C48, "Member 'UTABP_HumanoidLowerAndUpperBody_C::AnimGraphNode_UseCachedPose_13' has a wrong offset!");
static_assert(offsetof(UTABP_HumanoidLowerAndUpperBody_C, AnimGraphNode_LayeredBoneBlendTemplate_2) == 0x000C70, "Member 'UTABP_HumanoidLowerAndUpperBody_C::AnimGraphNode_LayeredBoneBlendTemplate_2' has a wrong offset!");
static_assert(offsetof(UTABP_HumanoidLowerAndUpperBody_C, AnimGraphNode_UseCachedPose_12) == 0x000D80, "Member 'UTABP_HumanoidLowerAndUpperBody_C::AnimGraphNode_UseCachedPose_12' has a wrong offset!");
static_assert(offsetof(UTABP_HumanoidLowerAndUpperBody_C, AnimGraphNode_UseCachedPose_11) == 0x000DA8, "Member 'UTABP_HumanoidLowerAndUpperBody_C::AnimGraphNode_UseCachedPose_11' has a wrong offset!");
static_assert(offsetof(UTABP_HumanoidLowerAndUpperBody_C, AnimGraphNode_SaveCachedPose_1) == 0x000DD0, "Member 'UTABP_HumanoidLowerAndUpperBody_C::AnimGraphNode_SaveCachedPose_1' has a wrong offset!");
static_assert(offsetof(UTABP_HumanoidLowerAndUpperBody_C, AnimGraphNode_UseCachedPose_10) == 0x000E50, "Member 'UTABP_HumanoidLowerAndUpperBody_C::AnimGraphNode_UseCachedPose_10' has a wrong offset!");
static_assert(offsetof(UTABP_HumanoidLowerAndUpperBody_C, AnimGraphNode_ModifyBone) == 0x000E78, "Member 'UTABP_HumanoidLowerAndUpperBody_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UTABP_HumanoidLowerAndUpperBody_C, AnimGraphNode_LocalToComponentSpace) == 0x000FA0, "Member 'UTABP_HumanoidLowerAndUpperBody_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UTABP_HumanoidLowerAndUpperBody_C, AnimGraphNode_ComponentToLocalSpace) == 0x000FC0, "Member 'UTABP_HumanoidLowerAndUpperBody_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UTABP_HumanoidLowerAndUpperBody_C, AnimGraphNode_TransitionResult_1) == 0x000FE0, "Member 'UTABP_HumanoidLowerAndUpperBody_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UTABP_HumanoidLowerAndUpperBody_C, AnimGraphNode_TransitionResult) == 0x001008, "Member 'UTABP_HumanoidLowerAndUpperBody_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UTABP_HumanoidLowerAndUpperBody_C, AnimGraphNode_UseCachedPose_9) == 0x001030, "Member 'UTABP_HumanoidLowerAndUpperBody_C::AnimGraphNode_UseCachedPose_9' has a wrong offset!");
static_assert(offsetof(UTABP_HumanoidLowerAndUpperBody_C, AnimGraphNode_UseCachedPose_8) == 0x001058, "Member 'UTABP_HumanoidLowerAndUpperBody_C::AnimGraphNode_UseCachedPose_8' has a wrong offset!");
static_assert(offsetof(UTABP_HumanoidLowerAndUpperBody_C, AnimGraphNode_UseCachedPose_7) == 0x001080, "Member 'UTABP_HumanoidLowerAndUpperBody_C::AnimGraphNode_UseCachedPose_7' has a wrong offset!");
static_assert(offsetof(UTABP_HumanoidLowerAndUpperBody_C, AnimGraphNode_UseCachedPose_6) == 0x0010A8, "Member 'UTABP_HumanoidLowerAndUpperBody_C::AnimGraphNode_UseCachedPose_6' has a wrong offset!");
static_assert(offsetof(UTABP_HumanoidLowerAndUpperBody_C, AnimGraphNode_UseCachedPose_5) == 0x0010D0, "Member 'UTABP_HumanoidLowerAndUpperBody_C::AnimGraphNode_UseCachedPose_5' has a wrong offset!");
static_assert(offsetof(UTABP_HumanoidLowerAndUpperBody_C, AnimGraphNode_LayeredBoneBlendTemplate_1) == 0x0010F8, "Member 'UTABP_HumanoidLowerAndUpperBody_C::AnimGraphNode_LayeredBoneBlendTemplate_1' has a wrong offset!");
static_assert(offsetof(UTABP_HumanoidLowerAndUpperBody_C, AnimGraphNode_StateResult_1) == 0x001208, "Member 'UTABP_HumanoidLowerAndUpperBody_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UTABP_HumanoidLowerAndUpperBody_C, AnimGraphNode_UseCachedPose_4) == 0x001228, "Member 'UTABP_HumanoidLowerAndUpperBody_C::AnimGraphNode_UseCachedPose_4' has a wrong offset!");
static_assert(offsetof(UTABP_HumanoidLowerAndUpperBody_C, AnimGraphNode_UseCachedPose_3) == 0x001250, "Member 'UTABP_HumanoidLowerAndUpperBody_C::AnimGraphNode_UseCachedPose_3' has a wrong offset!");
static_assert(offsetof(UTABP_HumanoidLowerAndUpperBody_C, AnimGraphNode_LayeredBoneBlendTemplate) == 0x001278, "Member 'UTABP_HumanoidLowerAndUpperBody_C::AnimGraphNode_LayeredBoneBlendTemplate' has a wrong offset!");
static_assert(offsetof(UTABP_HumanoidLowerAndUpperBody_C, AnimGraphNode_StateResult) == 0x001388, "Member 'UTABP_HumanoidLowerAndUpperBody_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UTABP_HumanoidLowerAndUpperBody_C, AnimGraphNode_StateMachine) == 0x0013A8, "Member 'UTABP_HumanoidLowerAndUpperBody_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UTABP_HumanoidLowerAndUpperBody_C, AnimGraphNode_UseCachedPose_2) == 0x001470, "Member 'UTABP_HumanoidLowerAndUpperBody_C::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(UTABP_HumanoidLowerAndUpperBody_C, AnimGraphNode_BlendListByBool) == 0x001498, "Member 'UTABP_HumanoidLowerAndUpperBody_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UTABP_HumanoidLowerAndUpperBody_C, AnimGraphNode_SaveCachedPose) == 0x0014E0, "Member 'UTABP_HumanoidLowerAndUpperBody_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UTABP_HumanoidLowerAndUpperBody_C, AnimGraphNode_UseCachedPose_1) == 0x001560, "Member 'UTABP_HumanoidLowerAndUpperBody_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UTABP_HumanoidLowerAndUpperBody_C, AnimGraphNode_UseCachedPose) == 0x001588, "Member 'UTABP_HumanoidLowerAndUpperBody_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UTABP_HumanoidLowerAndUpperBody_C, AnimGraphNode_Root) == 0x0015B0, "Member 'UTABP_HumanoidLowerAndUpperBody_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UTABP_HumanoidLowerAndUpperBody_C, AnimGraphNode_LocalRefPose) == 0x0015D0, "Member 'UTABP_HumanoidLowerAndUpperBody_C::AnimGraphNode_LocalRefPose' has a wrong offset!");
static_assert(offsetof(UTABP_HumanoidLowerAndUpperBody_C, K2Node_PropertyAccess_20) == 0x0015E0, "Member 'UTABP_HumanoidLowerAndUpperBody_C::K2Node_PropertyAccess_20' has a wrong offset!");
static_assert(offsetof(UTABP_HumanoidLowerAndUpperBody_C, K2Node_PropertyAccess_19) == 0x0015E1, "Member 'UTABP_HumanoidLowerAndUpperBody_C::K2Node_PropertyAccess_19' has a wrong offset!");
static_assert(offsetof(UTABP_HumanoidLowerAndUpperBody_C, K2Node_PropertyAccess_9) == 0x0015E2, "Member 'UTABP_HumanoidLowerAndUpperBody_C::K2Node_PropertyAccess_9' has a wrong offset!");
static_assert(offsetof(UTABP_HumanoidLowerAndUpperBody_C, K2Node_PropertyAccess_8) == 0x0015E3, "Member 'UTABP_HumanoidLowerAndUpperBody_C::K2Node_PropertyAccess_8' has a wrong offset!");
static_assert(offsetof(UTABP_HumanoidLowerAndUpperBody_C, K2Node_PropertyAccess_7) == 0x0015E4, "Member 'UTABP_HumanoidLowerAndUpperBody_C::K2Node_PropertyAccess_7' has a wrong offset!");
static_assert(offsetof(UTABP_HumanoidLowerAndUpperBody_C, K2Node_PropertyAccess_5) == 0x0015E5, "Member 'UTABP_HumanoidLowerAndUpperBody_C::K2Node_PropertyAccess_5' has a wrong offset!");
static_assert(offsetof(UTABP_HumanoidLowerAndUpperBody_C, LayeredBlendSettings) == 0x0015E8, "Member 'UTABP_HumanoidLowerAndUpperBody_C::LayeredBlendSettings' has a wrong offset!");

}

