#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TABP_HorseRiding_Swimming

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct TABP_HorseRiding_Swimming.TABP_HorseRiding_Swimming_C.AnimBlueprintGeneratedConstantData
// 0x013F (0x0140 - 0x0001)
struct TABP_HorseRiding_Swimming::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_94;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_95;                                 // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_96;                                  // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_97;                                 // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_98;                                  // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_99;                                 // 0x0024(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_100;                               // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_101;                              // 0x002C(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_102;                               // 0x0058(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_103;                                // 0x005C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_104;                                // 0x005D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_105;                                // 0x005E(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F[0x1];                                       // 0x005F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_106;                                // 0x0060(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_107;                                 // 0x0068(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_108;                                // 0x006C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_109;                                 // 0x0074(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_110;                              // 0x0078(0x0020)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_111;                                // 0x0098(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_112;                                // 0x00A0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00A8(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0128(0x0018)()
};
static_assert(alignof(TABP_HorseRiding_Swimming::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on TABP_HorseRiding_Swimming::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(TABP_HorseRiding_Swimming::FAnimBlueprintGeneratedConstantData) == 0x000140, "Wrong size on TABP_HorseRiding_Swimming::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(TABP_HorseRiding_Swimming::FAnimBlueprintGeneratedConstantData, __NameProperty_94) == 0x000004, "Member 'TABP_HorseRiding_Swimming::FAnimBlueprintGeneratedConstantData::__NameProperty_94' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_Swimming::FAnimBlueprintGeneratedConstantData, __NameProperty_95) == 0x00000C, "Member 'TABP_HorseRiding_Swimming::FAnimBlueprintGeneratedConstantData::__NameProperty_95' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_Swimming::FAnimBlueprintGeneratedConstantData, __IntProperty_96) == 0x000014, "Member 'TABP_HorseRiding_Swimming::FAnimBlueprintGeneratedConstantData::__IntProperty_96' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_Swimming::FAnimBlueprintGeneratedConstantData, __NameProperty_97) == 0x000018, "Member 'TABP_HorseRiding_Swimming::FAnimBlueprintGeneratedConstantData::__NameProperty_97' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_Swimming::FAnimBlueprintGeneratedConstantData, __IntProperty_98) == 0x000020, "Member 'TABP_HorseRiding_Swimming::FAnimBlueprintGeneratedConstantData::__IntProperty_98' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_Swimming::FAnimBlueprintGeneratedConstantData, __BoolProperty_99) == 0x000024, "Member 'TABP_HorseRiding_Swimming::FAnimBlueprintGeneratedConstantData::__BoolProperty_99' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_Swimming::FAnimBlueprintGeneratedConstantData, __FloatProperty_100) == 0x000028, "Member 'TABP_HorseRiding_Swimming::FAnimBlueprintGeneratedConstantData::__FloatProperty_100' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_Swimming::FAnimBlueprintGeneratedConstantData, __StructProperty_101) == 0x00002C, "Member 'TABP_HorseRiding_Swimming::FAnimBlueprintGeneratedConstantData::__StructProperty_101' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_Swimming::FAnimBlueprintGeneratedConstantData, __FloatProperty_102) == 0x000058, "Member 'TABP_HorseRiding_Swimming::FAnimBlueprintGeneratedConstantData::__FloatProperty_102' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_Swimming::FAnimBlueprintGeneratedConstantData, __BoolProperty_103) == 0x00005C, "Member 'TABP_HorseRiding_Swimming::FAnimBlueprintGeneratedConstantData::__BoolProperty_103' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_Swimming::FAnimBlueprintGeneratedConstantData, __EnumProperty_104) == 0x00005D, "Member 'TABP_HorseRiding_Swimming::FAnimBlueprintGeneratedConstantData::__EnumProperty_104' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_Swimming::FAnimBlueprintGeneratedConstantData, __ByteProperty_105) == 0x00005E, "Member 'TABP_HorseRiding_Swimming::FAnimBlueprintGeneratedConstantData::__ByteProperty_105' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_Swimming::FAnimBlueprintGeneratedConstantData, __NameProperty_106) == 0x000060, "Member 'TABP_HorseRiding_Swimming::FAnimBlueprintGeneratedConstantData::__NameProperty_106' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_Swimming::FAnimBlueprintGeneratedConstantData, __IntProperty_107) == 0x000068, "Member 'TABP_HorseRiding_Swimming::FAnimBlueprintGeneratedConstantData::__IntProperty_107' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_Swimming::FAnimBlueprintGeneratedConstantData, __NameProperty_108) == 0x00006C, "Member 'TABP_HorseRiding_Swimming::FAnimBlueprintGeneratedConstantData::__NameProperty_108' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_Swimming::FAnimBlueprintGeneratedConstantData, __IntProperty_109) == 0x000074, "Member 'TABP_HorseRiding_Swimming::FAnimBlueprintGeneratedConstantData::__IntProperty_109' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_Swimming::FAnimBlueprintGeneratedConstantData, __StructProperty_110) == 0x000078, "Member 'TABP_HorseRiding_Swimming::FAnimBlueprintGeneratedConstantData::__StructProperty_110' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_Swimming::FAnimBlueprintGeneratedConstantData, __NameProperty_111) == 0x000098, "Member 'TABP_HorseRiding_Swimming::FAnimBlueprintGeneratedConstantData::__NameProperty_111' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_Swimming::FAnimBlueprintGeneratedConstantData, __NameProperty_112) == 0x0000A0, "Member 'TABP_HorseRiding_Swimming::FAnimBlueprintGeneratedConstantData::__NameProperty_112' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_Swimming::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000A8, "Member 'TABP_HorseRiding_Swimming::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_Swimming::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000128, "Member 'TABP_HorseRiding_Swimming::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct TABP_HorseRiding_Swimming.TABP_HorseRiding_Swimming_C.AnimBlueprintGeneratedMutableData
// 0x000B (0x000C - 0x0001)
struct TABP_HorseRiding_Swimming::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_0;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TABP_HorseRiding_Swimming::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on TABP_HorseRiding_Swimming::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(TABP_HorseRiding_Swimming::FAnimBlueprintGeneratedMutableData) == 0x00000C, "Wrong size on TABP_HorseRiding_Swimming::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(TABP_HorseRiding_Swimming::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'TABP_HorseRiding_Swimming::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_Swimming::FAnimBlueprintGeneratedMutableData, __FloatProperty_0) == 0x000008, "Member 'TABP_HorseRiding_Swimming::FAnimBlueprintGeneratedMutableData::__FloatProperty_0' has a wrong offset!");

}

