#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TABP_TurnInPlaceFP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function TABP_TurnInPlaceFP.TABP_TurnInPlaceFP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct TABP_TurnInPlaceFP_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(TABP_TurnInPlaceFP_C_AnimGraph) == 0x000008, "Wrong alignment on TABP_TurnInPlaceFP_C_AnimGraph");
static_assert(sizeof(TABP_TurnInPlaceFP_C_AnimGraph) == 0x000010, "Wrong size on TABP_TurnInPlaceFP_C_AnimGraph");
static_assert(offsetof(TABP_TurnInPlaceFP_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'TABP_TurnInPlaceFP_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function TABP_TurnInPlaceFP.TABP_TurnInPlaceFP_C.ExecuteUbergraph_TABP_TurnInPlaceFP
// 0x0004 (0x0004 - 0x0000)
struct TABP_TurnInPlaceFP_C_ExecuteUbergraph_TABP_TurnInPlaceFP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TABP_TurnInPlaceFP_C_ExecuteUbergraph_TABP_TurnInPlaceFP) == 0x000004, "Wrong alignment on TABP_TurnInPlaceFP_C_ExecuteUbergraph_TABP_TurnInPlaceFP");
static_assert(sizeof(TABP_TurnInPlaceFP_C_ExecuteUbergraph_TABP_TurnInPlaceFP) == 0x000004, "Wrong size on TABP_TurnInPlaceFP_C_ExecuteUbergraph_TABP_TurnInPlaceFP");
static_assert(offsetof(TABP_TurnInPlaceFP_C_ExecuteUbergraph_TABP_TurnInPlaceFP, EntryPoint) == 0x000000, "Member 'TABP_TurnInPlaceFP_C_ExecuteUbergraph_TABP_TurnInPlaceFP::EntryPoint' has a wrong offset!");

// Function TABP_TurnInPlaceFP.TABP_TurnInPlaceFP_C.TurnInPlaceLayer
// 0x0020 (0x0020 - 0x0000)
struct TABP_TurnInPlaceFP_C_TurnInPlaceLayer final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              TurnInPlaceLayer_0;                                // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(TABP_TurnInPlaceFP_C_TurnInPlaceLayer) == 0x000008, "Wrong alignment on TABP_TurnInPlaceFP_C_TurnInPlaceLayer");
static_assert(sizeof(TABP_TurnInPlaceFP_C_TurnInPlaceLayer) == 0x000020, "Wrong size on TABP_TurnInPlaceFP_C_TurnInPlaceLayer");
static_assert(offsetof(TABP_TurnInPlaceFP_C_TurnInPlaceLayer, InPose) == 0x000000, "Member 'TABP_TurnInPlaceFP_C_TurnInPlaceLayer::InPose' has a wrong offset!");
static_assert(offsetof(TABP_TurnInPlaceFP_C_TurnInPlaceLayer, TurnInPlaceLayer_0) == 0x000010, "Member 'TABP_TurnInPlaceFP_C_TurnInPlaceLayer::TurnInPlaceLayer_0' has a wrong offset!");

}

