#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TABP_TurnInPlace

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct TABP_TurnInPlace.TABP_TurnInPlace_C.AnimBlueprintGeneratedConstantData
// 0x0187 (0x0188 - 0x0001)
struct TABP_TurnInPlace::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_203;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_204;                                // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_205;                                // 0x0014(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_206;                                // 0x001C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_207;                                 // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_208;                                // 0x0028(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_209;                               // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_210;                                // 0x0030(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_211;                                // 0x0031(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_212;                                // 0x0034(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_213;                              // 0x0040(0x0020)(BlueprintVisible, NoDestructor)
	int32                                         __IntProperty_214;                                 // 0x0060(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_215;                                // 0x0064(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_216;                              // 0x0070(0x0020)(BlueprintVisible, NoDestructor)
	int32                                         __IntProperty_217;                                 // 0x0090(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_218;                                // 0x0098(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_219;                                  // 0x00A0(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_220;                                // 0x00A8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_221;                                // 0x00A9(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_222;                                // 0x00AA(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AB[0x5];                                       // 0x00AB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_223;                               // 0x00B0(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_224;                                // 0x00C0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_225;                                // 0x00C8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_226;                              // 0x00D0(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00F0(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0170(0x0018)()
};
static_assert(alignof(TABP_TurnInPlace::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on TABP_TurnInPlace::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(TABP_TurnInPlace::FAnimBlueprintGeneratedConstantData) == 0x000188, "Wrong size on TABP_TurnInPlace::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(TABP_TurnInPlace::FAnimBlueprintGeneratedConstantData, __NameProperty_203) == 0x000004, "Member 'TABP_TurnInPlace::FAnimBlueprintGeneratedConstantData::__NameProperty_203' has a wrong offset!");
static_assert(offsetof(TABP_TurnInPlace::FAnimBlueprintGeneratedConstantData, __NameProperty_204) == 0x00000C, "Member 'TABP_TurnInPlace::FAnimBlueprintGeneratedConstantData::__NameProperty_204' has a wrong offset!");
static_assert(offsetof(TABP_TurnInPlace::FAnimBlueprintGeneratedConstantData, __NameProperty_205) == 0x000014, "Member 'TABP_TurnInPlace::FAnimBlueprintGeneratedConstantData::__NameProperty_205' has a wrong offset!");
static_assert(offsetof(TABP_TurnInPlace::FAnimBlueprintGeneratedConstantData, __NameProperty_206) == 0x00001C, "Member 'TABP_TurnInPlace::FAnimBlueprintGeneratedConstantData::__NameProperty_206' has a wrong offset!");
static_assert(offsetof(TABP_TurnInPlace::FAnimBlueprintGeneratedConstantData, __IntProperty_207) == 0x000024, "Member 'TABP_TurnInPlace::FAnimBlueprintGeneratedConstantData::__IntProperty_207' has a wrong offset!");
static_assert(offsetof(TABP_TurnInPlace::FAnimBlueprintGeneratedConstantData, __BoolProperty_208) == 0x000028, "Member 'TABP_TurnInPlace::FAnimBlueprintGeneratedConstantData::__BoolProperty_208' has a wrong offset!");
static_assert(offsetof(TABP_TurnInPlace::FAnimBlueprintGeneratedConstantData, __FloatProperty_209) == 0x00002C, "Member 'TABP_TurnInPlace::FAnimBlueprintGeneratedConstantData::__FloatProperty_209' has a wrong offset!");
static_assert(offsetof(TABP_TurnInPlace::FAnimBlueprintGeneratedConstantData, __EnumProperty_210) == 0x000030, "Member 'TABP_TurnInPlace::FAnimBlueprintGeneratedConstantData::__EnumProperty_210' has a wrong offset!");
static_assert(offsetof(TABP_TurnInPlace::FAnimBlueprintGeneratedConstantData, __ByteProperty_211) == 0x000031, "Member 'TABP_TurnInPlace::FAnimBlueprintGeneratedConstantData::__ByteProperty_211' has a wrong offset!");
static_assert(offsetof(TABP_TurnInPlace::FAnimBlueprintGeneratedConstantData, __NameProperty_212) == 0x000034, "Member 'TABP_TurnInPlace::FAnimBlueprintGeneratedConstantData::__NameProperty_212' has a wrong offset!");
static_assert(offsetof(TABP_TurnInPlace::FAnimBlueprintGeneratedConstantData, __StructProperty_213) == 0x000040, "Member 'TABP_TurnInPlace::FAnimBlueprintGeneratedConstantData::__StructProperty_213' has a wrong offset!");
static_assert(offsetof(TABP_TurnInPlace::FAnimBlueprintGeneratedConstantData, __IntProperty_214) == 0x000060, "Member 'TABP_TurnInPlace::FAnimBlueprintGeneratedConstantData::__IntProperty_214' has a wrong offset!");
static_assert(offsetof(TABP_TurnInPlace::FAnimBlueprintGeneratedConstantData, __NameProperty_215) == 0x000064, "Member 'TABP_TurnInPlace::FAnimBlueprintGeneratedConstantData::__NameProperty_215' has a wrong offset!");
static_assert(offsetof(TABP_TurnInPlace::FAnimBlueprintGeneratedConstantData, __StructProperty_216) == 0x000070, "Member 'TABP_TurnInPlace::FAnimBlueprintGeneratedConstantData::__StructProperty_216' has a wrong offset!");
static_assert(offsetof(TABP_TurnInPlace::FAnimBlueprintGeneratedConstantData, __IntProperty_217) == 0x000090, "Member 'TABP_TurnInPlace::FAnimBlueprintGeneratedConstantData::__IntProperty_217' has a wrong offset!");
static_assert(offsetof(TABP_TurnInPlace::FAnimBlueprintGeneratedConstantData, __BlendProfile_218) == 0x000098, "Member 'TABP_TurnInPlace::FAnimBlueprintGeneratedConstantData::__BlendProfile_218' has a wrong offset!");
static_assert(offsetof(TABP_TurnInPlace::FAnimBlueprintGeneratedConstantData, __CurveFloat_219) == 0x0000A0, "Member 'TABP_TurnInPlace::FAnimBlueprintGeneratedConstantData::__CurveFloat_219' has a wrong offset!");
static_assert(offsetof(TABP_TurnInPlace::FAnimBlueprintGeneratedConstantData, __BoolProperty_220) == 0x0000A8, "Member 'TABP_TurnInPlace::FAnimBlueprintGeneratedConstantData::__BoolProperty_220' has a wrong offset!");
static_assert(offsetof(TABP_TurnInPlace::FAnimBlueprintGeneratedConstantData, __EnumProperty_221) == 0x0000A9, "Member 'TABP_TurnInPlace::FAnimBlueprintGeneratedConstantData::__EnumProperty_221' has a wrong offset!");
static_assert(offsetof(TABP_TurnInPlace::FAnimBlueprintGeneratedConstantData, __EnumProperty_222) == 0x0000AA, "Member 'TABP_TurnInPlace::FAnimBlueprintGeneratedConstantData::__EnumProperty_222' has a wrong offset!");
static_assert(offsetof(TABP_TurnInPlace::FAnimBlueprintGeneratedConstantData, __ArrayProperty_223) == 0x0000B0, "Member 'TABP_TurnInPlace::FAnimBlueprintGeneratedConstantData::__ArrayProperty_223' has a wrong offset!");
static_assert(offsetof(TABP_TurnInPlace::FAnimBlueprintGeneratedConstantData, __NameProperty_224) == 0x0000C0, "Member 'TABP_TurnInPlace::FAnimBlueprintGeneratedConstantData::__NameProperty_224' has a wrong offset!");
static_assert(offsetof(TABP_TurnInPlace::FAnimBlueprintGeneratedConstantData, __NameProperty_225) == 0x0000C8, "Member 'TABP_TurnInPlace::FAnimBlueprintGeneratedConstantData::__NameProperty_225' has a wrong offset!");
static_assert(offsetof(TABP_TurnInPlace::FAnimBlueprintGeneratedConstantData, __StructProperty_226) == 0x0000D0, "Member 'TABP_TurnInPlace::FAnimBlueprintGeneratedConstantData::__StructProperty_226' has a wrong offset!");
static_assert(offsetof(TABP_TurnInPlace::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000F0, "Member 'TABP_TurnInPlace::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(TABP_TurnInPlace::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000170, "Member 'TABP_TurnInPlace::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct TABP_TurnInPlace.TABP_TurnInPlace_C.AnimBlueprintGeneratedMutableData
// 0x001B (0x001C - 0x0001)
struct TABP_TurnInPlace::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_0;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_1;                                  // 0x000C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_2;                                 // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_3;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_4;                                  // 0x0018(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_5;                                  // 0x0019(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TABP_TurnInPlace::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on TABP_TurnInPlace::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(TABP_TurnInPlace::FAnimBlueprintGeneratedMutableData) == 0x00001C, "Wrong size on TABP_TurnInPlace::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(TABP_TurnInPlace::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'TABP_TurnInPlace::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");
static_assert(offsetof(TABP_TurnInPlace::FAnimBlueprintGeneratedMutableData, __FloatProperty_0) == 0x000008, "Member 'TABP_TurnInPlace::FAnimBlueprintGeneratedMutableData::__FloatProperty_0' has a wrong offset!");
static_assert(offsetof(TABP_TurnInPlace::FAnimBlueprintGeneratedMutableData, __BoolProperty_1) == 0x00000C, "Member 'TABP_TurnInPlace::FAnimBlueprintGeneratedMutableData::__BoolProperty_1' has a wrong offset!");
static_assert(offsetof(TABP_TurnInPlace::FAnimBlueprintGeneratedMutableData, __FloatProperty_2) == 0x000010, "Member 'TABP_TurnInPlace::FAnimBlueprintGeneratedMutableData::__FloatProperty_2' has a wrong offset!");
static_assert(offsetof(TABP_TurnInPlace::FAnimBlueprintGeneratedMutableData, __FloatProperty_3) == 0x000014, "Member 'TABP_TurnInPlace::FAnimBlueprintGeneratedMutableData::__FloatProperty_3' has a wrong offset!");
static_assert(offsetof(TABP_TurnInPlace::FAnimBlueprintGeneratedMutableData, __BoolProperty_4) == 0x000018, "Member 'TABP_TurnInPlace::FAnimBlueprintGeneratedMutableData::__BoolProperty_4' has a wrong offset!");
static_assert(offsetof(TABP_TurnInPlace::FAnimBlueprintGeneratedMutableData, __BoolProperty_5) == 0x000019, "Member 'TABP_TurnInPlace::FAnimBlueprintGeneratedMutableData::__BoolProperty_5' has a wrong offset!");

}

