#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TABP_StandSneak_BowAttack

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function TABP_StandSneak_BowAttack.TABP_StandSneak_BowAttack_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct TABP_StandSneak_BowAttack_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(TABP_StandSneak_BowAttack_C_AnimGraph) == 0x000008, "Wrong alignment on TABP_StandSneak_BowAttack_C_AnimGraph");
static_assert(sizeof(TABP_StandSneak_BowAttack_C_AnimGraph) == 0x000010, "Wrong size on TABP_StandSneak_BowAttack_C_AnimGraph");
static_assert(offsetof(TABP_StandSneak_BowAttack_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'TABP_StandSneak_BowAttack_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function TABP_StandSneak_BowAttack.TABP_StandSneak_BowAttack_C.AttackingLayer
// 0x0020 (0x0020 - 0x0000)
struct TABP_StandSneak_BowAttack_C_AttackingLayer final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              AttackingLayer_0;                                  // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(TABP_StandSneak_BowAttack_C_AttackingLayer) == 0x000008, "Wrong alignment on TABP_StandSneak_BowAttack_C_AttackingLayer");
static_assert(sizeof(TABP_StandSneak_BowAttack_C_AttackingLayer) == 0x000020, "Wrong size on TABP_StandSneak_BowAttack_C_AttackingLayer");
static_assert(offsetof(TABP_StandSneak_BowAttack_C_AttackingLayer, InPose) == 0x000000, "Member 'TABP_StandSneak_BowAttack_C_AttackingLayer::InPose' has a wrong offset!");
static_assert(offsetof(TABP_StandSneak_BowAttack_C_AttackingLayer, AttackingLayer_0) == 0x000010, "Member 'TABP_StandSneak_BowAttack_C_AttackingLayer::AttackingLayer_0' has a wrong offset!");

// Function TABP_StandSneak_BowAttack.TABP_StandSneak_BowAttack_C.ExecuteUbergraph_TABP_StandSneak_BowAttack
// 0x000C (0x000C - 0x0000)
struct TABP_StandSneak_BowAttack_C_ExecuteUbergraph_TABP_StandSneak_BowAttack final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSneaking_ReturnValue;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSneaking_ReturnValue_1;                 // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue_1;                     // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSneaking_ReturnValue_2;                 // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TABP_StandSneak_BowAttack_C_ExecuteUbergraph_TABP_StandSneak_BowAttack) == 0x000004, "Wrong alignment on TABP_StandSneak_BowAttack_C_ExecuteUbergraph_TABP_StandSneak_BowAttack");
static_assert(sizeof(TABP_StandSneak_BowAttack_C_ExecuteUbergraph_TABP_StandSneak_BowAttack) == 0x00000C, "Wrong size on TABP_StandSneak_BowAttack_C_ExecuteUbergraph_TABP_StandSneak_BowAttack");
static_assert(offsetof(TABP_StandSneak_BowAttack_C_ExecuteUbergraph_TABP_StandSneak_BowAttack, EntryPoint) == 0x000000, "Member 'TABP_StandSneak_BowAttack_C_ExecuteUbergraph_TABP_StandSneak_BowAttack::EntryPoint' has a wrong offset!");
static_assert(offsetof(TABP_StandSneak_BowAttack_C_ExecuteUbergraph_TABP_StandSneak_BowAttack, CallFunc_IsSneaking_ReturnValue) == 0x000004, "Member 'TABP_StandSneak_BowAttack_C_ExecuteUbergraph_TABP_StandSneak_BowAttack::CallFunc_IsSneaking_ReturnValue' has a wrong offset!");
static_assert(offsetof(TABP_StandSneak_BowAttack_C_ExecuteUbergraph_TABP_StandSneak_BowAttack, CallFunc_HasTag_ReturnValue) == 0x000005, "Member 'TABP_StandSneak_BowAttack_C_ExecuteUbergraph_TABP_StandSneak_BowAttack::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(TABP_StandSneak_BowAttack_C_ExecuteUbergraph_TABP_StandSneak_BowAttack, CallFunc_IsSneaking_ReturnValue_1) == 0x000006, "Member 'TABP_StandSneak_BowAttack_C_ExecuteUbergraph_TABP_StandSneak_BowAttack::CallFunc_IsSneaking_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TABP_StandSneak_BowAttack_C_ExecuteUbergraph_TABP_StandSneak_BowAttack, CallFunc_HasTag_ReturnValue_1) == 0x000007, "Member 'TABP_StandSneak_BowAttack_C_ExecuteUbergraph_TABP_StandSneak_BowAttack::CallFunc_HasTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TABP_StandSneak_BowAttack_C_ExecuteUbergraph_TABP_StandSneak_BowAttack, CallFunc_IsSneaking_ReturnValue_2) == 0x000008, "Member 'TABP_StandSneak_BowAttack_C_ExecuteUbergraph_TABP_StandSneak_BowAttack::CallFunc_IsSneaking_ReturnValue_2' has a wrong offset!");

}

