#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TABP_MeleeAttack_MediumCombo

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "TABP_MeleeAttack_MediumCombo_structs.hpp"
#include "Altar_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass TABP_MeleeAttack_MediumCombo.TABP_MeleeAttack_MediumCombo_C
// 0x04A0 (0x08B0 - 0x0410)
class UTABP_MeleeAttack_MediumCombo_C final : public UVMeleeAttackComboAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0410(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct TABP_MeleeAttack_MediumCombo::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x0418(0x0010)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0428(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0430(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x0438(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x0458(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x0480(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x04A8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x04D0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x04F8(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x0520(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0540(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x0588(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x05A8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x05F0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0610(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0658(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0678(0x00C8)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0740(0x00B8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x07F8(0x0080)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0878(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x0898(0x0010)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void AttackingLayer(const struct FPoseLink& InPose, struct FPoseLink* AttackingLayer_0);
	void ExecuteUbergraph_TABP_MeleeAttack_MediumCombo(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TABP_MeleeAttack_MediumCombo_C">();
	}
	static class UTABP_MeleeAttack_MediumCombo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTABP_MeleeAttack_MediumCombo_C>();
	}
};
static_assert(alignof(UTABP_MeleeAttack_MediumCombo_C) == 0x000010, "Wrong alignment on UTABP_MeleeAttack_MediumCombo_C");
static_assert(sizeof(UTABP_MeleeAttack_MediumCombo_C) == 0x0008B0, "Wrong size on UTABP_MeleeAttack_MediumCombo_C");
static_assert(offsetof(UTABP_MeleeAttack_MediumCombo_C, UberGraphFrame) == 0x000410, "Member 'UTABP_MeleeAttack_MediumCombo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTABP_MeleeAttack_MediumCombo_C, __AnimBlueprintMutables) == 0x000418, "Member 'UTABP_MeleeAttack_MediumCombo_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UTABP_MeleeAttack_MediumCombo_C, AnimBlueprintExtension_PropertyAccess) == 0x000428, "Member 'UTABP_MeleeAttack_MediumCombo_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UTABP_MeleeAttack_MediumCombo_C, AnimBlueprintExtension_Base) == 0x000430, "Member 'UTABP_MeleeAttack_MediumCombo_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UTABP_MeleeAttack_MediumCombo_C, AnimGraphNode_Root_1) == 0x000438, "Member 'UTABP_MeleeAttack_MediumCombo_C::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(UTABP_MeleeAttack_MediumCombo_C, AnimGraphNode_TransitionResult_3) == 0x000458, "Member 'UTABP_MeleeAttack_MediumCombo_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UTABP_MeleeAttack_MediumCombo_C, AnimGraphNode_TransitionResult_2) == 0x000480, "Member 'UTABP_MeleeAttack_MediumCombo_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UTABP_MeleeAttack_MediumCombo_C, AnimGraphNode_TransitionResult_1) == 0x0004A8, "Member 'UTABP_MeleeAttack_MediumCombo_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UTABP_MeleeAttack_MediumCombo_C, AnimGraphNode_TransitionResult) == 0x0004D0, "Member 'UTABP_MeleeAttack_MediumCombo_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UTABP_MeleeAttack_MediumCombo_C, AnimGraphNode_UseCachedPose) == 0x0004F8, "Member 'UTABP_MeleeAttack_MediumCombo_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UTABP_MeleeAttack_MediumCombo_C, AnimGraphNode_StateResult_3) == 0x000520, "Member 'UTABP_MeleeAttack_MediumCombo_C::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(UTABP_MeleeAttack_MediumCombo_C, AnimGraphNode_SequencePlayer_2) == 0x000540, "Member 'UTABP_MeleeAttack_MediumCombo_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UTABP_MeleeAttack_MediumCombo_C, AnimGraphNode_StateResult_2) == 0x000588, "Member 'UTABP_MeleeAttack_MediumCombo_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UTABP_MeleeAttack_MediumCombo_C, AnimGraphNode_SequencePlayer_1) == 0x0005A8, "Member 'UTABP_MeleeAttack_MediumCombo_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UTABP_MeleeAttack_MediumCombo_C, AnimGraphNode_StateResult_1) == 0x0005F0, "Member 'UTABP_MeleeAttack_MediumCombo_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UTABP_MeleeAttack_MediumCombo_C, AnimGraphNode_SequencePlayer) == 0x000610, "Member 'UTABP_MeleeAttack_MediumCombo_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UTABP_MeleeAttack_MediumCombo_C, AnimGraphNode_StateResult) == 0x000658, "Member 'UTABP_MeleeAttack_MediumCombo_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UTABP_MeleeAttack_MediumCombo_C, AnimGraphNode_StateMachine) == 0x000678, "Member 'UTABP_MeleeAttack_MediumCombo_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UTABP_MeleeAttack_MediumCombo_C, AnimGraphNode_LinkedInputPose) == 0x000740, "Member 'UTABP_MeleeAttack_MediumCombo_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UTABP_MeleeAttack_MediumCombo_C, AnimGraphNode_SaveCachedPose) == 0x0007F8, "Member 'UTABP_MeleeAttack_MediumCombo_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UTABP_MeleeAttack_MediumCombo_C, AnimGraphNode_Root) == 0x000878, "Member 'UTABP_MeleeAttack_MediumCombo_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UTABP_MeleeAttack_MediumCombo_C, AnimGraphNode_LocalRefPose) == 0x000898, "Member 'UTABP_MeleeAttack_MediumCombo_C::AnimGraphNode_LocalRefPose' has a wrong offset!");

}

