#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TABP_AimOffset

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "TABP_AimOffset_structs.hpp"
#include "Altar_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass TABP_AimOffset.TABP_AimOffset_C
// 0x0350 (0x06E0 - 0x0390)
class UTABP_AimOffset_C final : public UVAimOffsetCharacterAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0390(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct TABP_AimOffset::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;               // 0x0398(0x0010)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x03A8(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x03B0(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x03B8(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x03D8(0x0070)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x0448(0x00C8)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0510(0x00B8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x05C8(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x0610(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x0690(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x06B8(0x0028)()

public:
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_TABP_AimOffset(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TABP_AimOffset_C">();
	}
	static class UTABP_AimOffset_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTABP_AimOffset_C>();
	}
};
static_assert(alignof(UTABP_AimOffset_C) == 0x000010, "Wrong alignment on UTABP_AimOffset_C");
static_assert(sizeof(UTABP_AimOffset_C) == 0x0006E0, "Wrong size on UTABP_AimOffset_C");
static_assert(offsetof(UTABP_AimOffset_C, UberGraphFrame) == 0x000390, "Member 'UTABP_AimOffset_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTABP_AimOffset_C, __AnimBlueprintMutables) == 0x000398, "Member 'UTABP_AimOffset_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UTABP_AimOffset_C, AnimBlueprintExtension_PropertyAccess) == 0x0003A8, "Member 'UTABP_AimOffset_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UTABP_AimOffset_C, AnimBlueprintExtension_Base) == 0x0003B0, "Member 'UTABP_AimOffset_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UTABP_AimOffset_C, AnimGraphNode_Root) == 0x0003B8, "Member 'UTABP_AimOffset_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UTABP_AimOffset_C, AnimGraphNode_BlendSpacePlayer) == 0x0003D8, "Member 'UTABP_AimOffset_C::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(UTABP_AimOffset_C, AnimGraphNode_ApplyAdditive) == 0x000448, "Member 'UTABP_AimOffset_C::AnimGraphNode_ApplyAdditive' has a wrong offset!");
static_assert(offsetof(UTABP_AimOffset_C, AnimGraphNode_LinkedInputPose) == 0x000510, "Member 'UTABP_AimOffset_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UTABP_AimOffset_C, AnimGraphNode_BlendListByBool) == 0x0005C8, "Member 'UTABP_AimOffset_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UTABP_AimOffset_C, AnimGraphNode_SaveCachedPose) == 0x000610, "Member 'UTABP_AimOffset_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UTABP_AimOffset_C, AnimGraphNode_UseCachedPose_1) == 0x000690, "Member 'UTABP_AimOffset_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UTABP_AimOffset_C, AnimGraphNode_UseCachedPose) == 0x0006B8, "Member 'UTABP_AimOffset_C::AnimGraphNode_UseCachedPose' has a wrong offset!");

}

