#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TABP_StandSneak_StaffAttack

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct TABP_StandSneak_StaffAttack.TABP_StandSneak_StaffAttack_C.AnimBlueprintGeneratedConstantData
// 0x013F (0x0140 - 0x0001)
struct TABP_StandSneak_StaffAttack::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_27;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_28;                                // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_29;                               // 0x0010(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_30;                                // 0x003C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_31;                                 // 0x0040(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_32;                                 // 0x0041(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_33;                                 // 0x0042(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43[0x1];                                       // 0x0043(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_34;                                 // 0x0044(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_35;                               // 0x0050(0x0020)(BlueprintVisible, NoDestructor)
	int32                                         __IntProperty_36;                                  // 0x0070(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_37;                               // 0x0078(0x0020)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_38;                                 // 0x0098(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_39;                                 // 0x00A0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00A8(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0128(0x0018)()
};
static_assert(alignof(TABP_StandSneak_StaffAttack::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on TABP_StandSneak_StaffAttack::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(TABP_StandSneak_StaffAttack::FAnimBlueprintGeneratedConstantData) == 0x000140, "Wrong size on TABP_StandSneak_StaffAttack::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(TABP_StandSneak_StaffAttack::FAnimBlueprintGeneratedConstantData, __NameProperty_27) == 0x000004, "Member 'TABP_StandSneak_StaffAttack::FAnimBlueprintGeneratedConstantData::__NameProperty_27' has a wrong offset!");
static_assert(offsetof(TABP_StandSneak_StaffAttack::FAnimBlueprintGeneratedConstantData, __FloatProperty_28) == 0x00000C, "Member 'TABP_StandSneak_StaffAttack::FAnimBlueprintGeneratedConstantData::__FloatProperty_28' has a wrong offset!");
static_assert(offsetof(TABP_StandSneak_StaffAttack::FAnimBlueprintGeneratedConstantData, __StructProperty_29) == 0x000010, "Member 'TABP_StandSneak_StaffAttack::FAnimBlueprintGeneratedConstantData::__StructProperty_29' has a wrong offset!");
static_assert(offsetof(TABP_StandSneak_StaffAttack::FAnimBlueprintGeneratedConstantData, __FloatProperty_30) == 0x00003C, "Member 'TABP_StandSneak_StaffAttack::FAnimBlueprintGeneratedConstantData::__FloatProperty_30' has a wrong offset!");
static_assert(offsetof(TABP_StandSneak_StaffAttack::FAnimBlueprintGeneratedConstantData, __BoolProperty_31) == 0x000040, "Member 'TABP_StandSneak_StaffAttack::FAnimBlueprintGeneratedConstantData::__BoolProperty_31' has a wrong offset!");
static_assert(offsetof(TABP_StandSneak_StaffAttack::FAnimBlueprintGeneratedConstantData, __EnumProperty_32) == 0x000041, "Member 'TABP_StandSneak_StaffAttack::FAnimBlueprintGeneratedConstantData::__EnumProperty_32' has a wrong offset!");
static_assert(offsetof(TABP_StandSneak_StaffAttack::FAnimBlueprintGeneratedConstantData, __ByteProperty_33) == 0x000042, "Member 'TABP_StandSneak_StaffAttack::FAnimBlueprintGeneratedConstantData::__ByteProperty_33' has a wrong offset!");
static_assert(offsetof(TABP_StandSneak_StaffAttack::FAnimBlueprintGeneratedConstantData, __NameProperty_34) == 0x000044, "Member 'TABP_StandSneak_StaffAttack::FAnimBlueprintGeneratedConstantData::__NameProperty_34' has a wrong offset!");
static_assert(offsetof(TABP_StandSneak_StaffAttack::FAnimBlueprintGeneratedConstantData, __StructProperty_35) == 0x000050, "Member 'TABP_StandSneak_StaffAttack::FAnimBlueprintGeneratedConstantData::__StructProperty_35' has a wrong offset!");
static_assert(offsetof(TABP_StandSneak_StaffAttack::FAnimBlueprintGeneratedConstantData, __IntProperty_36) == 0x000070, "Member 'TABP_StandSneak_StaffAttack::FAnimBlueprintGeneratedConstantData::__IntProperty_36' has a wrong offset!");
static_assert(offsetof(TABP_StandSneak_StaffAttack::FAnimBlueprintGeneratedConstantData, __StructProperty_37) == 0x000078, "Member 'TABP_StandSneak_StaffAttack::FAnimBlueprintGeneratedConstantData::__StructProperty_37' has a wrong offset!");
static_assert(offsetof(TABP_StandSneak_StaffAttack::FAnimBlueprintGeneratedConstantData, __NameProperty_38) == 0x000098, "Member 'TABP_StandSneak_StaffAttack::FAnimBlueprintGeneratedConstantData::__NameProperty_38' has a wrong offset!");
static_assert(offsetof(TABP_StandSneak_StaffAttack::FAnimBlueprintGeneratedConstantData, __NameProperty_39) == 0x0000A0, "Member 'TABP_StandSneak_StaffAttack::FAnimBlueprintGeneratedConstantData::__NameProperty_39' has a wrong offset!");
static_assert(offsetof(TABP_StandSneak_StaffAttack::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000A8, "Member 'TABP_StandSneak_StaffAttack::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(TABP_StandSneak_StaffAttack::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000128, "Member 'TABP_StandSneak_StaffAttack::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct TABP_StandSneak_StaffAttack.TABP_StandSneak_StaffAttack_C.AnimBlueprintGeneratedMutableData
// 0x0007 (0x0008 - 0x0001)
struct TABP_StandSneak_StaffAttack::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TABP_StandSneak_StaffAttack::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on TABP_StandSneak_StaffAttack::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(TABP_StandSneak_StaffAttack::FAnimBlueprintGeneratedMutableData) == 0x000008, "Wrong size on TABP_StandSneak_StaffAttack::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(TABP_StandSneak_StaffAttack::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'TABP_StandSneak_StaffAttack::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");

}

