#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TABP_ConversationIdle

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct TABP_ConversationIdle.TABP_ConversationIdle_C.AnimBlueprintGeneratedConstantData
// 0x0147 (0x0148 - 0x0001)
struct TABP_ConversationIdle::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_33;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_34;                                 // 0x0010(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_35;                                   // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_36;                                 // 0x0020(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_37;                                 // 0x0021(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_38;                                // 0x0028(0x0010)(BlueprintVisible, EditFixedSize)
	bool                                          __BoolProperty_39;                                 // 0x0038(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_40;                                // 0x003C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_41;                               // 0x0040(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_42;                                // 0x006C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_43;                                 // 0x0070(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_44;                                 // 0x0071(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x2];                                       // 0x0072(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_45;                                 // 0x0074(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_46;                                 // 0x007C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_47;                               // 0x0088(0x0020)(BlueprintVisible, NoDestructor)
	ERefPoseType                                  __ByteProperty_48;                                 // 0x00A8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00B0(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0130(0x0018)()
};
static_assert(alignof(TABP_ConversationIdle::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on TABP_ConversationIdle::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(TABP_ConversationIdle::FAnimBlueprintGeneratedConstantData) == 0x000148, "Wrong size on TABP_ConversationIdle::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(TABP_ConversationIdle::FAnimBlueprintGeneratedConstantData, __NameProperty_33) == 0x000004, "Member 'TABP_ConversationIdle::FAnimBlueprintGeneratedConstantData::__NameProperty_33' has a wrong offset!");
static_assert(offsetof(TABP_ConversationIdle::FAnimBlueprintGeneratedConstantData, __BlendProfile_34) == 0x000010, "Member 'TABP_ConversationIdle::FAnimBlueprintGeneratedConstantData::__BlendProfile_34' has a wrong offset!");
static_assert(offsetof(TABP_ConversationIdle::FAnimBlueprintGeneratedConstantData, __CurveFloat_35) == 0x000018, "Member 'TABP_ConversationIdle::FAnimBlueprintGeneratedConstantData::__CurveFloat_35' has a wrong offset!");
static_assert(offsetof(TABP_ConversationIdle::FAnimBlueprintGeneratedConstantData, __EnumProperty_36) == 0x000020, "Member 'TABP_ConversationIdle::FAnimBlueprintGeneratedConstantData::__EnumProperty_36' has a wrong offset!");
static_assert(offsetof(TABP_ConversationIdle::FAnimBlueprintGeneratedConstantData, __EnumProperty_37) == 0x000021, "Member 'TABP_ConversationIdle::FAnimBlueprintGeneratedConstantData::__EnumProperty_37' has a wrong offset!");
static_assert(offsetof(TABP_ConversationIdle::FAnimBlueprintGeneratedConstantData, __ArrayProperty_38) == 0x000028, "Member 'TABP_ConversationIdle::FAnimBlueprintGeneratedConstantData::__ArrayProperty_38' has a wrong offset!");
static_assert(offsetof(TABP_ConversationIdle::FAnimBlueprintGeneratedConstantData, __BoolProperty_39) == 0x000038, "Member 'TABP_ConversationIdle::FAnimBlueprintGeneratedConstantData::__BoolProperty_39' has a wrong offset!");
static_assert(offsetof(TABP_ConversationIdle::FAnimBlueprintGeneratedConstantData, __FloatProperty_40) == 0x00003C, "Member 'TABP_ConversationIdle::FAnimBlueprintGeneratedConstantData::__FloatProperty_40' has a wrong offset!");
static_assert(offsetof(TABP_ConversationIdle::FAnimBlueprintGeneratedConstantData, __StructProperty_41) == 0x000040, "Member 'TABP_ConversationIdle::FAnimBlueprintGeneratedConstantData::__StructProperty_41' has a wrong offset!");
static_assert(offsetof(TABP_ConversationIdle::FAnimBlueprintGeneratedConstantData, __FloatProperty_42) == 0x00006C, "Member 'TABP_ConversationIdle::FAnimBlueprintGeneratedConstantData::__FloatProperty_42' has a wrong offset!");
static_assert(offsetof(TABP_ConversationIdle::FAnimBlueprintGeneratedConstantData, __BoolProperty_43) == 0x000070, "Member 'TABP_ConversationIdle::FAnimBlueprintGeneratedConstantData::__BoolProperty_43' has a wrong offset!");
static_assert(offsetof(TABP_ConversationIdle::FAnimBlueprintGeneratedConstantData, __EnumProperty_44) == 0x000071, "Member 'TABP_ConversationIdle::FAnimBlueprintGeneratedConstantData::__EnumProperty_44' has a wrong offset!");
static_assert(offsetof(TABP_ConversationIdle::FAnimBlueprintGeneratedConstantData, __NameProperty_45) == 0x000074, "Member 'TABP_ConversationIdle::FAnimBlueprintGeneratedConstantData::__NameProperty_45' has a wrong offset!");
static_assert(offsetof(TABP_ConversationIdle::FAnimBlueprintGeneratedConstantData, __NameProperty_46) == 0x00007C, "Member 'TABP_ConversationIdle::FAnimBlueprintGeneratedConstantData::__NameProperty_46' has a wrong offset!");
static_assert(offsetof(TABP_ConversationIdle::FAnimBlueprintGeneratedConstantData, __StructProperty_47) == 0x000088, "Member 'TABP_ConversationIdle::FAnimBlueprintGeneratedConstantData::__StructProperty_47' has a wrong offset!");
static_assert(offsetof(TABP_ConversationIdle::FAnimBlueprintGeneratedConstantData, __ByteProperty_48) == 0x0000A8, "Member 'TABP_ConversationIdle::FAnimBlueprintGeneratedConstantData::__ByteProperty_48' has a wrong offset!");
static_assert(offsetof(TABP_ConversationIdle::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000B0, "Member 'TABP_ConversationIdle::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(TABP_ConversationIdle::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000130, "Member 'TABP_ConversationIdle::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct TABP_ConversationIdle.TABP_ConversationIdle_C.AnimBlueprintGeneratedMutableData
// 0x0007 (0x0008 - 0x0001)
struct TABP_ConversationIdle::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_0;                                 // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TABP_ConversationIdle::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on TABP_ConversationIdle::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(TABP_ConversationIdle::FAnimBlueprintGeneratedMutableData) == 0x000008, "Wrong size on TABP_ConversationIdle::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(TABP_ConversationIdle::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'TABP_ConversationIdle::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");
static_assert(offsetof(TABP_ConversationIdle::FAnimBlueprintGeneratedMutableData, __FloatProperty_0) == 0x000004, "Member 'TABP_ConversationIdle::FAnimBlueprintGeneratedMutableData::__FloatProperty_0' has a wrong offset!");

}

