#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TABP_PoseSnapshot

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "TABP_PoseSnapshot_structs.hpp"
#include "Altar_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass TABP_PoseSnapshot.TABP_PoseSnapshot_C
// 0x0210 (0x05B0 - 0x03A0)
class UTABP_PoseSnapshot_C final : public UVLayerCharacterAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct TABP_PoseSnapshot::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;            // 0x03A8(0x0002)(HasGetValueTypeHash)
	uint8                                         Pad_3AA[0x6];                                      // 0x03AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x03B0(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x03B8(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x03C0(0x0020)()
	struct FAnimNode_PoseSnapshot                 AnimGraphNode_PoseSnapshot;                        // 0x03E0(0x0090)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0470(0x00B8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0528(0x0048)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0570(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x0590(0x0010)()
	bool                                          K2Node_PropertyAccess;                             // 0x05A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_TABP_PoseSnapshot(int32 EntryPoint);
	void Pose_Snapshot_Layer(const struct FPoseLink& InPose, struct FPoseLink* Pose_Snapshot_Layer_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TABP_PoseSnapshot_C">();
	}
	static class UTABP_PoseSnapshot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTABP_PoseSnapshot_C>();
	}
};
static_assert(alignof(UTABP_PoseSnapshot_C) == 0x000010, "Wrong alignment on UTABP_PoseSnapshot_C");
static_assert(sizeof(UTABP_PoseSnapshot_C) == 0x0005B0, "Wrong size on UTABP_PoseSnapshot_C");
static_assert(offsetof(UTABP_PoseSnapshot_C, UberGraphFrame) == 0x0003A0, "Member 'UTABP_PoseSnapshot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTABP_PoseSnapshot_C, __AnimBlueprintMutables) == 0x0003A8, "Member 'UTABP_PoseSnapshot_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UTABP_PoseSnapshot_C, AnimBlueprintExtension_PropertyAccess) == 0x0003B0, "Member 'UTABP_PoseSnapshot_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UTABP_PoseSnapshot_C, AnimBlueprintExtension_Base) == 0x0003B8, "Member 'UTABP_PoseSnapshot_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UTABP_PoseSnapshot_C, AnimGraphNode_Root_1) == 0x0003C0, "Member 'UTABP_PoseSnapshot_C::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(UTABP_PoseSnapshot_C, AnimGraphNode_PoseSnapshot) == 0x0003E0, "Member 'UTABP_PoseSnapshot_C::AnimGraphNode_PoseSnapshot' has a wrong offset!");
static_assert(offsetof(UTABP_PoseSnapshot_C, AnimGraphNode_LinkedInputPose) == 0x000470, "Member 'UTABP_PoseSnapshot_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UTABP_PoseSnapshot_C, AnimGraphNode_BlendListByBool) == 0x000528, "Member 'UTABP_PoseSnapshot_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UTABP_PoseSnapshot_C, AnimGraphNode_Root) == 0x000570, "Member 'UTABP_PoseSnapshot_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UTABP_PoseSnapshot_C, AnimGraphNode_LocalRefPose) == 0x000590, "Member 'UTABP_PoseSnapshot_C::AnimGraphNode_LocalRefPose' has a wrong offset!");
static_assert(offsetof(UTABP_PoseSnapshot_C, K2Node_PropertyAccess) == 0x0005A0, "Member 'UTABP_PoseSnapshot_C::K2Node_PropertyAccess' has a wrong offset!");

}

