#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TABP_TorchLayer_FirstPerson

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "TABP_TorchLayer_FirstPerson_structs.hpp"
#include "Altar_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass TABP_TorchLayer_FirstPerson.TABP_TorchLayer_FirstPerson_C
// 0x0830 (0x0CE0 - 0x04B0)
class UTABP_TorchLayer_FirstPerson_C final : public UVTorchCharacterAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct TABP_TorchLayer_FirstPerson::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;  // 0x04B8(0x0050)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0508(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0510(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x0518(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0538(0x00B8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x05F0(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x0638(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x06B8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x06E0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0708(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x0730(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x0758(0x0028)()
	struct FAnimNode_LayeredBoneBlendTemplate     AnimGraphNode_LayeredBoneBlendTemplate_1;          // 0x0780(0x0110)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0890(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x08B0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x08D8(0x0028)()
	struct FAnimNode_LayeredBoneBlendTemplate     AnimGraphNode_LayeredBoneBlendTemplate;            // 0x0900(0x0110)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0A10(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0A30(0x00C8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0AF8(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x0B40(0x0080)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_1;                  // 0x0BC0(0x0070)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x0C30(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0CA0(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x0CC0(0x0010)()
	bool                                          K2Node_PropertyAccess_17;                          // 0x0CD0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_PropertyAccess_16;                          // 0x0CD1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_PropertyAccess_3;                           // 0x0CD2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_PropertyAccess_2;                           // 0x0CD3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_TABP_TorchLayer_FirstPerson(int32 EntryPoint);
	void TorchLayer(const struct FPoseLink& InPose, struct FPoseLink* TorchLayer_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TABP_TorchLayer_FirstPerson_C">();
	}
	static class UTABP_TorchLayer_FirstPerson_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTABP_TorchLayer_FirstPerson_C>();
	}
};
static_assert(alignof(UTABP_TorchLayer_FirstPerson_C) == 0x000010, "Wrong alignment on UTABP_TorchLayer_FirstPerson_C");
static_assert(sizeof(UTABP_TorchLayer_FirstPerson_C) == 0x000CE0, "Wrong size on UTABP_TorchLayer_FirstPerson_C");
static_assert(offsetof(UTABP_TorchLayer_FirstPerson_C, UberGraphFrame) == 0x0004B0, "Member 'UTABP_TorchLayer_FirstPerson_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTABP_TorchLayer_FirstPerson_C, __AnimBlueprintMutables) == 0x0004B8, "Member 'UTABP_TorchLayer_FirstPerson_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UTABP_TorchLayer_FirstPerson_C, AnimBlueprintExtension_PropertyAccess) == 0x000508, "Member 'UTABP_TorchLayer_FirstPerson_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UTABP_TorchLayer_FirstPerson_C, AnimBlueprintExtension_Base) == 0x000510, "Member 'UTABP_TorchLayer_FirstPerson_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UTABP_TorchLayer_FirstPerson_C, AnimGraphNode_Root_1) == 0x000518, "Member 'UTABP_TorchLayer_FirstPerson_C::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(UTABP_TorchLayer_FirstPerson_C, AnimGraphNode_LinkedInputPose) == 0x000538, "Member 'UTABP_TorchLayer_FirstPerson_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UTABP_TorchLayer_FirstPerson_C, AnimGraphNode_BlendListByBool_1) == 0x0005F0, "Member 'UTABP_TorchLayer_FirstPerson_C::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(UTABP_TorchLayer_FirstPerson_C, AnimGraphNode_SaveCachedPose_1) == 0x000638, "Member 'UTABP_TorchLayer_FirstPerson_C::AnimGraphNode_SaveCachedPose_1' has a wrong offset!");
static_assert(offsetof(UTABP_TorchLayer_FirstPerson_C, AnimGraphNode_UseCachedPose_4) == 0x0006B8, "Member 'UTABP_TorchLayer_FirstPerson_C::AnimGraphNode_UseCachedPose_4' has a wrong offset!");
static_assert(offsetof(UTABP_TorchLayer_FirstPerson_C, AnimGraphNode_TransitionResult_1) == 0x0006E0, "Member 'UTABP_TorchLayer_FirstPerson_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UTABP_TorchLayer_FirstPerson_C, AnimGraphNode_TransitionResult) == 0x000708, "Member 'UTABP_TorchLayer_FirstPerson_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UTABP_TorchLayer_FirstPerson_C, AnimGraphNode_UseCachedPose_3) == 0x000730, "Member 'UTABP_TorchLayer_FirstPerson_C::AnimGraphNode_UseCachedPose_3' has a wrong offset!");
static_assert(offsetof(UTABP_TorchLayer_FirstPerson_C, AnimGraphNode_UseCachedPose_2) == 0x000758, "Member 'UTABP_TorchLayer_FirstPerson_C::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(UTABP_TorchLayer_FirstPerson_C, AnimGraphNode_LayeredBoneBlendTemplate_1) == 0x000780, "Member 'UTABP_TorchLayer_FirstPerson_C::AnimGraphNode_LayeredBoneBlendTemplate_1' has a wrong offset!");
static_assert(offsetof(UTABP_TorchLayer_FirstPerson_C, AnimGraphNode_StateResult_1) == 0x000890, "Member 'UTABP_TorchLayer_FirstPerson_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UTABP_TorchLayer_FirstPerson_C, AnimGraphNode_UseCachedPose_1) == 0x0008B0, "Member 'UTABP_TorchLayer_FirstPerson_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UTABP_TorchLayer_FirstPerson_C, AnimGraphNode_UseCachedPose) == 0x0008D8, "Member 'UTABP_TorchLayer_FirstPerson_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UTABP_TorchLayer_FirstPerson_C, AnimGraphNode_LayeredBoneBlendTemplate) == 0x000900, "Member 'UTABP_TorchLayer_FirstPerson_C::AnimGraphNode_LayeredBoneBlendTemplate' has a wrong offset!");
static_assert(offsetof(UTABP_TorchLayer_FirstPerson_C, AnimGraphNode_StateResult) == 0x000A10, "Member 'UTABP_TorchLayer_FirstPerson_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UTABP_TorchLayer_FirstPerson_C, AnimGraphNode_StateMachine) == 0x000A30, "Member 'UTABP_TorchLayer_FirstPerson_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UTABP_TorchLayer_FirstPerson_C, AnimGraphNode_BlendListByBool) == 0x000AF8, "Member 'UTABP_TorchLayer_FirstPerson_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UTABP_TorchLayer_FirstPerson_C, AnimGraphNode_SaveCachedPose) == 0x000B40, "Member 'UTABP_TorchLayer_FirstPerson_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UTABP_TorchLayer_FirstPerson_C, AnimGraphNode_BlendSpacePlayer_1) == 0x000BC0, "Member 'UTABP_TorchLayer_FirstPerson_C::AnimGraphNode_BlendSpacePlayer_1' has a wrong offset!");
static_assert(offsetof(UTABP_TorchLayer_FirstPerson_C, AnimGraphNode_BlendSpacePlayer) == 0x000C30, "Member 'UTABP_TorchLayer_FirstPerson_C::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(UTABP_TorchLayer_FirstPerson_C, AnimGraphNode_Root) == 0x000CA0, "Member 'UTABP_TorchLayer_FirstPerson_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UTABP_TorchLayer_FirstPerson_C, AnimGraphNode_LocalRefPose) == 0x000CC0, "Member 'UTABP_TorchLayer_FirstPerson_C::AnimGraphNode_LocalRefPose' has a wrong offset!");
static_assert(offsetof(UTABP_TorchLayer_FirstPerson_C, K2Node_PropertyAccess_17) == 0x000CD0, "Member 'UTABP_TorchLayer_FirstPerson_C::K2Node_PropertyAccess_17' has a wrong offset!");
static_assert(offsetof(UTABP_TorchLayer_FirstPerson_C, K2Node_PropertyAccess_16) == 0x000CD1, "Member 'UTABP_TorchLayer_FirstPerson_C::K2Node_PropertyAccess_16' has a wrong offset!");
static_assert(offsetof(UTABP_TorchLayer_FirstPerson_C, K2Node_PropertyAccess_3) == 0x000CD2, "Member 'UTABP_TorchLayer_FirstPerson_C::K2Node_PropertyAccess_3' has a wrong offset!");
static_assert(offsetof(UTABP_TorchLayer_FirstPerson_C, K2Node_PropertyAccess_2) == 0x000CD3, "Member 'UTABP_TorchLayer_FirstPerson_C::K2Node_PropertyAccess_2' has a wrong offset!");

}

