#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TABP_ShieldHandPose

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct TABP_ShieldHandPose.TABP_ShieldHandPose_C.AnimBlueprintGeneratedConstantData
// 0x012F (0x0130 - 0x0001)
struct TABP_ShieldHandPose::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_34;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_35;                                 // 0x0010(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_36;                                   // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_37;                                 // 0x0020(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_38;                                 // 0x0021(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_39;                                 // 0x0022(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23[0x1];                                       // 0x0023(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_40;                                // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_41;                               // 0x0028(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_42;                                // 0x0054(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_43;                                 // 0x0058(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_44;                                 // 0x0059(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x2];                                       // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_45;                                 // 0x005C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_46;                                 // 0x0064(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_47;                               // 0x0070(0x0020)(BlueprintVisible, NoDestructor)
	ERefPoseType                                  __ByteProperty_48;                                 // 0x0090(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0098(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0118(0x0018)()
};
static_assert(alignof(TABP_ShieldHandPose::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on TABP_ShieldHandPose::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(TABP_ShieldHandPose::FAnimBlueprintGeneratedConstantData) == 0x000130, "Wrong size on TABP_ShieldHandPose::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(TABP_ShieldHandPose::FAnimBlueprintGeneratedConstantData, __NameProperty_34) == 0x000004, "Member 'TABP_ShieldHandPose::FAnimBlueprintGeneratedConstantData::__NameProperty_34' has a wrong offset!");
static_assert(offsetof(TABP_ShieldHandPose::FAnimBlueprintGeneratedConstantData, __BlendProfile_35) == 0x000010, "Member 'TABP_ShieldHandPose::FAnimBlueprintGeneratedConstantData::__BlendProfile_35' has a wrong offset!");
static_assert(offsetof(TABP_ShieldHandPose::FAnimBlueprintGeneratedConstantData, __CurveFloat_36) == 0x000018, "Member 'TABP_ShieldHandPose::FAnimBlueprintGeneratedConstantData::__CurveFloat_36' has a wrong offset!");
static_assert(offsetof(TABP_ShieldHandPose::FAnimBlueprintGeneratedConstantData, __EnumProperty_37) == 0x000020, "Member 'TABP_ShieldHandPose::FAnimBlueprintGeneratedConstantData::__EnumProperty_37' has a wrong offset!");
static_assert(offsetof(TABP_ShieldHandPose::FAnimBlueprintGeneratedConstantData, __EnumProperty_38) == 0x000021, "Member 'TABP_ShieldHandPose::FAnimBlueprintGeneratedConstantData::__EnumProperty_38' has a wrong offset!");
static_assert(offsetof(TABP_ShieldHandPose::FAnimBlueprintGeneratedConstantData, __BoolProperty_39) == 0x000022, "Member 'TABP_ShieldHandPose::FAnimBlueprintGeneratedConstantData::__BoolProperty_39' has a wrong offset!");
static_assert(offsetof(TABP_ShieldHandPose::FAnimBlueprintGeneratedConstantData, __FloatProperty_40) == 0x000024, "Member 'TABP_ShieldHandPose::FAnimBlueprintGeneratedConstantData::__FloatProperty_40' has a wrong offset!");
static_assert(offsetof(TABP_ShieldHandPose::FAnimBlueprintGeneratedConstantData, __StructProperty_41) == 0x000028, "Member 'TABP_ShieldHandPose::FAnimBlueprintGeneratedConstantData::__StructProperty_41' has a wrong offset!");
static_assert(offsetof(TABP_ShieldHandPose::FAnimBlueprintGeneratedConstantData, __FloatProperty_42) == 0x000054, "Member 'TABP_ShieldHandPose::FAnimBlueprintGeneratedConstantData::__FloatProperty_42' has a wrong offset!");
static_assert(offsetof(TABP_ShieldHandPose::FAnimBlueprintGeneratedConstantData, __BoolProperty_43) == 0x000058, "Member 'TABP_ShieldHandPose::FAnimBlueprintGeneratedConstantData::__BoolProperty_43' has a wrong offset!");
static_assert(offsetof(TABP_ShieldHandPose::FAnimBlueprintGeneratedConstantData, __EnumProperty_44) == 0x000059, "Member 'TABP_ShieldHandPose::FAnimBlueprintGeneratedConstantData::__EnumProperty_44' has a wrong offset!");
static_assert(offsetof(TABP_ShieldHandPose::FAnimBlueprintGeneratedConstantData, __NameProperty_45) == 0x00005C, "Member 'TABP_ShieldHandPose::FAnimBlueprintGeneratedConstantData::__NameProperty_45' has a wrong offset!");
static_assert(offsetof(TABP_ShieldHandPose::FAnimBlueprintGeneratedConstantData, __NameProperty_46) == 0x000064, "Member 'TABP_ShieldHandPose::FAnimBlueprintGeneratedConstantData::__NameProperty_46' has a wrong offset!");
static_assert(offsetof(TABP_ShieldHandPose::FAnimBlueprintGeneratedConstantData, __StructProperty_47) == 0x000070, "Member 'TABP_ShieldHandPose::FAnimBlueprintGeneratedConstantData::__StructProperty_47' has a wrong offset!");
static_assert(offsetof(TABP_ShieldHandPose::FAnimBlueprintGeneratedConstantData, __ByteProperty_48) == 0x000090, "Member 'TABP_ShieldHandPose::FAnimBlueprintGeneratedConstantData::__ByteProperty_48' has a wrong offset!");
static_assert(offsetof(TABP_ShieldHandPose::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000098, "Member 'TABP_ShieldHandPose::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(TABP_ShieldHandPose::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000118, "Member 'TABP_ShieldHandPose::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct TABP_ShieldHandPose.TABP_ShieldHandPose_C.AnimBlueprintGeneratedMutableData
// 0x001F (0x0020 - 0x0001)
struct TABP_ShieldHandPose::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty;                                   // 0x0008(0x0010)(BlueprintVisible, EditFixedSize)
	bool                                          __BoolProperty_0;                                  // 0x0018(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TABP_ShieldHandPose::FAnimBlueprintGeneratedMutableData) == 0x000008, "Wrong alignment on TABP_ShieldHandPose::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(TABP_ShieldHandPose::FAnimBlueprintGeneratedMutableData) == 0x000020, "Wrong size on TABP_ShieldHandPose::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(TABP_ShieldHandPose::FAnimBlueprintGeneratedMutableData, __ArrayProperty) == 0x000008, "Member 'TABP_ShieldHandPose::FAnimBlueprintGeneratedMutableData::__ArrayProperty' has a wrong offset!");
static_assert(offsetof(TABP_ShieldHandPose::FAnimBlueprintGeneratedMutableData, __BoolProperty_0) == 0x000018, "Member 'TABP_ShieldHandPose::FAnimBlueprintGeneratedMutableData::__BoolProperty_0' has a wrong offset!");

}

