#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TABP_ConversationIdle

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function TABP_ConversationIdle.TABP_ConversationIdle_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct TABP_ConversationIdle_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(TABP_ConversationIdle_C_AnimGraph) == 0x000008, "Wrong alignment on TABP_ConversationIdle_C_AnimGraph");
static_assert(sizeof(TABP_ConversationIdle_C_AnimGraph) == 0x000010, "Wrong size on TABP_ConversationIdle_C_AnimGraph");
static_assert(offsetof(TABP_ConversationIdle_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'TABP_ConversationIdle_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function TABP_ConversationIdle.TABP_ConversationIdle_C.ConversationIdleLayer
// 0x0020 (0x0020 - 0x0000)
struct TABP_ConversationIdle_C_ConversationIdleLayer final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              ConversationIdleLayer_0;                           // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(TABP_ConversationIdle_C_ConversationIdleLayer) == 0x000008, "Wrong alignment on TABP_ConversationIdle_C_ConversationIdleLayer");
static_assert(sizeof(TABP_ConversationIdle_C_ConversationIdleLayer) == 0x000020, "Wrong size on TABP_ConversationIdle_C_ConversationIdleLayer");
static_assert(offsetof(TABP_ConversationIdle_C_ConversationIdleLayer, InPose) == 0x000000, "Member 'TABP_ConversationIdle_C_ConversationIdleLayer::InPose' has a wrong offset!");
static_assert(offsetof(TABP_ConversationIdle_C_ConversationIdleLayer, ConversationIdleLayer_0) == 0x000010, "Member 'TABP_ConversationIdle_C_ConversationIdleLayer::ConversationIdleLayer_0' has a wrong offset!");

// Function TABP_ConversationIdle.TABP_ConversationIdle_C.ExecuteUbergraph_TABP_ConversationIdle
// 0x0004 (0x0004 - 0x0000)
struct TABP_ConversationIdle_C_ExecuteUbergraph_TABP_ConversationIdle final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TABP_ConversationIdle_C_ExecuteUbergraph_TABP_ConversationIdle) == 0x000004, "Wrong alignment on TABP_ConversationIdle_C_ExecuteUbergraph_TABP_ConversationIdle");
static_assert(sizeof(TABP_ConversationIdle_C_ExecuteUbergraph_TABP_ConversationIdle) == 0x000004, "Wrong size on TABP_ConversationIdle_C_ExecuteUbergraph_TABP_ConversationIdle");
static_assert(offsetof(TABP_ConversationIdle_C_ExecuteUbergraph_TABP_ConversationIdle, EntryPoint) == 0x000000, "Member 'TABP_ConversationIdle_C_ExecuteUbergraph_TABP_ConversationIdle::EntryPoint' has a wrong offset!");

}

