#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TABP_EnhancedLocomotionStanding

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct TABP_EnhancedLocomotionStanding.TABP_EnhancedLocomotionStanding_C.AnimBlueprintGeneratedConstantData
// 0x0167 (0x0168 - 0x0001)
struct TABP_EnhancedLocomotionStanding::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_61;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_62;                               // 0x000C(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_63;                                // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_64;                                 // 0x003C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_65;                                 // 0x0040(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_66;                                  // 0x0048(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_67;                                 // 0x0050(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_68;                                   // 0x0058(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_69;                                 // 0x0060(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_70;                                 // 0x0061(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_71;                                // 0x0068(0x0010)(BlueprintVisible, EditFixedSize)
	bool                                          __BoolProperty_72;                                 // 0x0078(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_73;                                // 0x007C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_74;                                 // 0x0080(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_75;                                 // 0x0081(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_76;                                 // 0x0082(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_83[0x1];                                       // 0x0083(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_77;                                 // 0x0084(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_78;                                 // 0x008C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_79;                                  // 0x0094(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_80;                                 // 0x0098(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_81;                                 // 0x00A0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_82;                               // 0x00A8(0x0020)(BlueprintVisible, NoDestructor)
	ERefPoseType                                  __ByteProperty_83;                                 // 0x00C8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00D0(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0150(0x0018)()
};
static_assert(alignof(TABP_EnhancedLocomotionStanding::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on TABP_EnhancedLocomotionStanding::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(TABP_EnhancedLocomotionStanding::FAnimBlueprintGeneratedConstantData) == 0x000168, "Wrong size on TABP_EnhancedLocomotionStanding::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(TABP_EnhancedLocomotionStanding::FAnimBlueprintGeneratedConstantData, __NameProperty_61) == 0x000004, "Member 'TABP_EnhancedLocomotionStanding::FAnimBlueprintGeneratedConstantData::__NameProperty_61' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionStanding::FAnimBlueprintGeneratedConstantData, __StructProperty_62) == 0x00000C, "Member 'TABP_EnhancedLocomotionStanding::FAnimBlueprintGeneratedConstantData::__StructProperty_62' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionStanding::FAnimBlueprintGeneratedConstantData, __FloatProperty_63) == 0x000038, "Member 'TABP_EnhancedLocomotionStanding::FAnimBlueprintGeneratedConstantData::__FloatProperty_63' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionStanding::FAnimBlueprintGeneratedConstantData, __EnumProperty_64) == 0x00003C, "Member 'TABP_EnhancedLocomotionStanding::FAnimBlueprintGeneratedConstantData::__EnumProperty_64' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionStanding::FAnimBlueprintGeneratedConstantData, __NameProperty_65) == 0x000040, "Member 'TABP_EnhancedLocomotionStanding::FAnimBlueprintGeneratedConstantData::__NameProperty_65' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionStanding::FAnimBlueprintGeneratedConstantData, __IntProperty_66) == 0x000048, "Member 'TABP_EnhancedLocomotionStanding::FAnimBlueprintGeneratedConstantData::__IntProperty_66' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionStanding::FAnimBlueprintGeneratedConstantData, __BlendProfile_67) == 0x000050, "Member 'TABP_EnhancedLocomotionStanding::FAnimBlueprintGeneratedConstantData::__BlendProfile_67' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionStanding::FAnimBlueprintGeneratedConstantData, __CurveFloat_68) == 0x000058, "Member 'TABP_EnhancedLocomotionStanding::FAnimBlueprintGeneratedConstantData::__CurveFloat_68' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionStanding::FAnimBlueprintGeneratedConstantData, __EnumProperty_69) == 0x000060, "Member 'TABP_EnhancedLocomotionStanding::FAnimBlueprintGeneratedConstantData::__EnumProperty_69' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionStanding::FAnimBlueprintGeneratedConstantData, __EnumProperty_70) == 0x000061, "Member 'TABP_EnhancedLocomotionStanding::FAnimBlueprintGeneratedConstantData::__EnumProperty_70' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionStanding::FAnimBlueprintGeneratedConstantData, __ArrayProperty_71) == 0x000068, "Member 'TABP_EnhancedLocomotionStanding::FAnimBlueprintGeneratedConstantData::__ArrayProperty_71' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionStanding::FAnimBlueprintGeneratedConstantData, __BoolProperty_72) == 0x000078, "Member 'TABP_EnhancedLocomotionStanding::FAnimBlueprintGeneratedConstantData::__BoolProperty_72' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionStanding::FAnimBlueprintGeneratedConstantData, __FloatProperty_73) == 0x00007C, "Member 'TABP_EnhancedLocomotionStanding::FAnimBlueprintGeneratedConstantData::__FloatProperty_73' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionStanding::FAnimBlueprintGeneratedConstantData, __BoolProperty_74) == 0x000080, "Member 'TABP_EnhancedLocomotionStanding::FAnimBlueprintGeneratedConstantData::__BoolProperty_74' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionStanding::FAnimBlueprintGeneratedConstantData, __EnumProperty_75) == 0x000081, "Member 'TABP_EnhancedLocomotionStanding::FAnimBlueprintGeneratedConstantData::__EnumProperty_75' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionStanding::FAnimBlueprintGeneratedConstantData, __ByteProperty_76) == 0x000082, "Member 'TABP_EnhancedLocomotionStanding::FAnimBlueprintGeneratedConstantData::__ByteProperty_76' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionStanding::FAnimBlueprintGeneratedConstantData, __NameProperty_77) == 0x000084, "Member 'TABP_EnhancedLocomotionStanding::FAnimBlueprintGeneratedConstantData::__NameProperty_77' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionStanding::FAnimBlueprintGeneratedConstantData, __NameProperty_78) == 0x00008C, "Member 'TABP_EnhancedLocomotionStanding::FAnimBlueprintGeneratedConstantData::__NameProperty_78' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionStanding::FAnimBlueprintGeneratedConstantData, __IntProperty_79) == 0x000094, "Member 'TABP_EnhancedLocomotionStanding::FAnimBlueprintGeneratedConstantData::__IntProperty_79' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionStanding::FAnimBlueprintGeneratedConstantData, __NameProperty_80) == 0x000098, "Member 'TABP_EnhancedLocomotionStanding::FAnimBlueprintGeneratedConstantData::__NameProperty_80' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionStanding::FAnimBlueprintGeneratedConstantData, __NameProperty_81) == 0x0000A0, "Member 'TABP_EnhancedLocomotionStanding::FAnimBlueprintGeneratedConstantData::__NameProperty_81' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionStanding::FAnimBlueprintGeneratedConstantData, __StructProperty_82) == 0x0000A8, "Member 'TABP_EnhancedLocomotionStanding::FAnimBlueprintGeneratedConstantData::__StructProperty_82' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionStanding::FAnimBlueprintGeneratedConstantData, __ByteProperty_83) == 0x0000C8, "Member 'TABP_EnhancedLocomotionStanding::FAnimBlueprintGeneratedConstantData::__ByteProperty_83' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionStanding::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000D0, "Member 'TABP_EnhancedLocomotionStanding::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionStanding::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000150, "Member 'TABP_EnhancedLocomotionStanding::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct TABP_EnhancedLocomotionStanding.TABP_EnhancedLocomotionStanding_C.AnimBlueprintGeneratedMutableData
// 0x001F (0x0020 - 0x0001)
struct TABP_EnhancedLocomotionStanding::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_0;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_1;                                 // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_2;                                 // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_3;                                  // 0x0014(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_4;                                 // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_5;                                 // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TABP_EnhancedLocomotionStanding::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on TABP_EnhancedLocomotionStanding::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(TABP_EnhancedLocomotionStanding::FAnimBlueprintGeneratedMutableData) == 0x000020, "Wrong size on TABP_EnhancedLocomotionStanding::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(TABP_EnhancedLocomotionStanding::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'TABP_EnhancedLocomotionStanding::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionStanding::FAnimBlueprintGeneratedMutableData, __FloatProperty_0) == 0x000008, "Member 'TABP_EnhancedLocomotionStanding::FAnimBlueprintGeneratedMutableData::__FloatProperty_0' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionStanding::FAnimBlueprintGeneratedMutableData, __FloatProperty_1) == 0x00000C, "Member 'TABP_EnhancedLocomotionStanding::FAnimBlueprintGeneratedMutableData::__FloatProperty_1' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionStanding::FAnimBlueprintGeneratedMutableData, __FloatProperty_2) == 0x000010, "Member 'TABP_EnhancedLocomotionStanding::FAnimBlueprintGeneratedMutableData::__FloatProperty_2' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionStanding::FAnimBlueprintGeneratedMutableData, __BoolProperty_3) == 0x000014, "Member 'TABP_EnhancedLocomotionStanding::FAnimBlueprintGeneratedMutableData::__BoolProperty_3' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionStanding::FAnimBlueprintGeneratedMutableData, __FloatProperty_4) == 0x000018, "Member 'TABP_EnhancedLocomotionStanding::FAnimBlueprintGeneratedMutableData::__FloatProperty_4' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionStanding::FAnimBlueprintGeneratedMutableData, __FloatProperty_5) == 0x00001C, "Member 'TABP_EnhancedLocomotionStanding::FAnimBlueprintGeneratedMutableData::__FloatProperty_5' has a wrong offset!");

}

