#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TABP_HorseRiding_InAir

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct TABP_HorseRiding_InAir.TABP_HorseRiding_InAir_C.AnimBlueprintGeneratedConstantData
// 0x017F (0x0180 - 0x0001)
struct TABP_HorseRiding_InAir::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_297;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_298;                                // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_299;                                // 0x0014(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_300;                                 // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_301;                                // 0x0020(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_302;                                // 0x0028(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_303;                                // 0x0030(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_304;                                // 0x0034(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_305;                                // 0x003C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_306;                                // 0x0044(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_307;                                 // 0x004C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_308;                                // 0x0050(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_309;                                // 0x0054(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_310;                                 // 0x005C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_311;                               // 0x0060(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_312;                              // 0x0064(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_313;                               // 0x0090(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_314;                                // 0x0094(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_315;                                // 0x0095(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_96[0x2];                                       // 0x0096(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_316;                                // 0x0098(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_317;                                 // 0x00A0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_318;                                // 0x00A4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_319;                                 // 0x00AC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_320;                                // 0x00B0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_321;                                // 0x00B8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_322;                              // 0x00C0(0x0020)(BlueprintVisible, NoDestructor)
	ERefPoseType                                  __ByteProperty_323;                                // 0x00E0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00E8(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0168(0x0018)()
};
static_assert(alignof(TABP_HorseRiding_InAir::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on TABP_HorseRiding_InAir::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(TABP_HorseRiding_InAir::FAnimBlueprintGeneratedConstantData) == 0x000180, "Wrong size on TABP_HorseRiding_InAir::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(TABP_HorseRiding_InAir::FAnimBlueprintGeneratedConstantData, __NameProperty_297) == 0x000004, "Member 'TABP_HorseRiding_InAir::FAnimBlueprintGeneratedConstantData::__NameProperty_297' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_InAir::FAnimBlueprintGeneratedConstantData, __NameProperty_298) == 0x00000C, "Member 'TABP_HorseRiding_InAir::FAnimBlueprintGeneratedConstantData::__NameProperty_298' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_InAir::FAnimBlueprintGeneratedConstantData, __NameProperty_299) == 0x000014, "Member 'TABP_HorseRiding_InAir::FAnimBlueprintGeneratedConstantData::__NameProperty_299' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_InAir::FAnimBlueprintGeneratedConstantData, __IntProperty_300) == 0x00001C, "Member 'TABP_HorseRiding_InAir::FAnimBlueprintGeneratedConstantData::__IntProperty_300' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_InAir::FAnimBlueprintGeneratedConstantData, __NameProperty_301) == 0x000020, "Member 'TABP_HorseRiding_InAir::FAnimBlueprintGeneratedConstantData::__NameProperty_301' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_InAir::FAnimBlueprintGeneratedConstantData, __NameProperty_302) == 0x000028, "Member 'TABP_HorseRiding_InAir::FAnimBlueprintGeneratedConstantData::__NameProperty_302' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_InAir::FAnimBlueprintGeneratedConstantData, __EnumProperty_303) == 0x000030, "Member 'TABP_HorseRiding_InAir::FAnimBlueprintGeneratedConstantData::__EnumProperty_303' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_InAir::FAnimBlueprintGeneratedConstantData, __NameProperty_304) == 0x000034, "Member 'TABP_HorseRiding_InAir::FAnimBlueprintGeneratedConstantData::__NameProperty_304' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_InAir::FAnimBlueprintGeneratedConstantData, __NameProperty_305) == 0x00003C, "Member 'TABP_HorseRiding_InAir::FAnimBlueprintGeneratedConstantData::__NameProperty_305' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_InAir::FAnimBlueprintGeneratedConstantData, __NameProperty_306) == 0x000044, "Member 'TABP_HorseRiding_InAir::FAnimBlueprintGeneratedConstantData::__NameProperty_306' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_InAir::FAnimBlueprintGeneratedConstantData, __IntProperty_307) == 0x00004C, "Member 'TABP_HorseRiding_InAir::FAnimBlueprintGeneratedConstantData::__IntProperty_307' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_InAir::FAnimBlueprintGeneratedConstantData, __BoolProperty_308) == 0x000050, "Member 'TABP_HorseRiding_InAir::FAnimBlueprintGeneratedConstantData::__BoolProperty_308' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_InAir::FAnimBlueprintGeneratedConstantData, __NameProperty_309) == 0x000054, "Member 'TABP_HorseRiding_InAir::FAnimBlueprintGeneratedConstantData::__NameProperty_309' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_InAir::FAnimBlueprintGeneratedConstantData, __IntProperty_310) == 0x00005C, "Member 'TABP_HorseRiding_InAir::FAnimBlueprintGeneratedConstantData::__IntProperty_310' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_InAir::FAnimBlueprintGeneratedConstantData, __FloatProperty_311) == 0x000060, "Member 'TABP_HorseRiding_InAir::FAnimBlueprintGeneratedConstantData::__FloatProperty_311' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_InAir::FAnimBlueprintGeneratedConstantData, __StructProperty_312) == 0x000064, "Member 'TABP_HorseRiding_InAir::FAnimBlueprintGeneratedConstantData::__StructProperty_312' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_InAir::FAnimBlueprintGeneratedConstantData, __FloatProperty_313) == 0x000090, "Member 'TABP_HorseRiding_InAir::FAnimBlueprintGeneratedConstantData::__FloatProperty_313' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_InAir::FAnimBlueprintGeneratedConstantData, __BoolProperty_314) == 0x000094, "Member 'TABP_HorseRiding_InAir::FAnimBlueprintGeneratedConstantData::__BoolProperty_314' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_InAir::FAnimBlueprintGeneratedConstantData, __EnumProperty_315) == 0x000095, "Member 'TABP_HorseRiding_InAir::FAnimBlueprintGeneratedConstantData::__EnumProperty_315' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_InAir::FAnimBlueprintGeneratedConstantData, __NameProperty_316) == 0x000098, "Member 'TABP_HorseRiding_InAir::FAnimBlueprintGeneratedConstantData::__NameProperty_316' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_InAir::FAnimBlueprintGeneratedConstantData, __IntProperty_317) == 0x0000A0, "Member 'TABP_HorseRiding_InAir::FAnimBlueprintGeneratedConstantData::__IntProperty_317' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_InAir::FAnimBlueprintGeneratedConstantData, __NameProperty_318) == 0x0000A4, "Member 'TABP_HorseRiding_InAir::FAnimBlueprintGeneratedConstantData::__NameProperty_318' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_InAir::FAnimBlueprintGeneratedConstantData, __IntProperty_319) == 0x0000AC, "Member 'TABP_HorseRiding_InAir::FAnimBlueprintGeneratedConstantData::__IntProperty_319' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_InAir::FAnimBlueprintGeneratedConstantData, __NameProperty_320) == 0x0000B0, "Member 'TABP_HorseRiding_InAir::FAnimBlueprintGeneratedConstantData::__NameProperty_320' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_InAir::FAnimBlueprintGeneratedConstantData, __NameProperty_321) == 0x0000B8, "Member 'TABP_HorseRiding_InAir::FAnimBlueprintGeneratedConstantData::__NameProperty_321' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_InAir::FAnimBlueprintGeneratedConstantData, __StructProperty_322) == 0x0000C0, "Member 'TABP_HorseRiding_InAir::FAnimBlueprintGeneratedConstantData::__StructProperty_322' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_InAir::FAnimBlueprintGeneratedConstantData, __ByteProperty_323) == 0x0000E0, "Member 'TABP_HorseRiding_InAir::FAnimBlueprintGeneratedConstantData::__ByteProperty_323' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_InAir::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000E8, "Member 'TABP_HorseRiding_InAir::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_InAir::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000168, "Member 'TABP_HorseRiding_InAir::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct TABP_HorseRiding_InAir.TABP_HorseRiding_InAir_C.AnimBlueprintGeneratedMutableData
// 0x0007 (0x0008 - 0x0001)
struct TABP_HorseRiding_InAir::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TABP_HorseRiding_InAir::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on TABP_HorseRiding_InAir::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(TABP_HorseRiding_InAir::FAnimBlueprintGeneratedMutableData) == 0x000008, "Wrong size on TABP_HorseRiding_InAir::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(TABP_HorseRiding_InAir::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'TABP_HorseRiding_InAir::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");

}

