#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TABP_SpellCast_Single

#include "Basic.hpp"

#include "TABP_SpellCast_Single_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Altar_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass TABP_SpellCast_Single.TABP_SpellCast_Single_C
// 0x04E0 (0x08C0 - 0x03E0)
class UTABP_SpellCast_Single_C final : public UVSpellCastSingleAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct TABP_SpellCast_Single::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;        // 0x03E8(0x001C)(HasGetValueTypeHash)
	uint8                                         Pad_404[0x4];                                      // 0x0404(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0408(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0410(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x0418(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x0438(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x0460(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x0488(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x04B0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x04D8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0500(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0528(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x0550(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x0598(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x05B8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x0600(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x0620(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x0668(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0688(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x06D0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x06F0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0738(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0758(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x07A0(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x07C0(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0888(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x08A8(0x0010)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_TABP_SpellCast_Single_AnimGraphNode_TransitionResult_65EF51F4457F755020BF1DA476D23C69();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_TABP_SpellCast_Single_AnimGraphNode_TransitionResult_709473A44FC3E99319EABC8F1E1BC292();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_TABP_SpellCast_Single_AnimGraphNode_TransitionResult_A1F0AA6C456A532A99D0EDA528863022();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_TABP_SpellCast_Single_AnimGraphNode_TransitionResult_A92D6C994E7E5E62CD57E5BC865A96EE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_TABP_SpellCast_Single_AnimGraphNode_TransitionResult_B0A1CCC44BC9125DE1282388601DFF1A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_TABP_SpellCast_Single_AnimGraphNode_TransitionResult_B5C534CF4AAB05487959C3BAF2F0C3AF();
	void ExecuteUbergraph_TABP_SpellCast_Single(int32 EntryPoint);
	void SpellCastingLayer(struct FPoseLink* SpellCastingLayer_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TABP_SpellCast_Single_C">();
	}
	static class UTABP_SpellCast_Single_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTABP_SpellCast_Single_C>();
	}
};
static_assert(alignof(UTABP_SpellCast_Single_C) == 0x000010, "Wrong alignment on UTABP_SpellCast_Single_C");
static_assert(sizeof(UTABP_SpellCast_Single_C) == 0x0008C0, "Wrong size on UTABP_SpellCast_Single_C");
static_assert(offsetof(UTABP_SpellCast_Single_C, UberGraphFrame) == 0x0003E0, "Member 'UTABP_SpellCast_Single_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTABP_SpellCast_Single_C, __AnimBlueprintMutables) == 0x0003E8, "Member 'UTABP_SpellCast_Single_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UTABP_SpellCast_Single_C, AnimBlueprintExtension_PropertyAccess) == 0x000408, "Member 'UTABP_SpellCast_Single_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UTABP_SpellCast_Single_C, AnimBlueprintExtension_Base) == 0x000410, "Member 'UTABP_SpellCast_Single_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UTABP_SpellCast_Single_C, AnimGraphNode_Root_1) == 0x000418, "Member 'UTABP_SpellCast_Single_C::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(UTABP_SpellCast_Single_C, AnimGraphNode_TransitionResult_6) == 0x000438, "Member 'UTABP_SpellCast_Single_C::AnimGraphNode_TransitionResult_6' has a wrong offset!");
static_assert(offsetof(UTABP_SpellCast_Single_C, AnimGraphNode_TransitionResult_5) == 0x000460, "Member 'UTABP_SpellCast_Single_C::AnimGraphNode_TransitionResult_5' has a wrong offset!");
static_assert(offsetof(UTABP_SpellCast_Single_C, AnimGraphNode_TransitionResult_4) == 0x000488, "Member 'UTABP_SpellCast_Single_C::AnimGraphNode_TransitionResult_4' has a wrong offset!");
static_assert(offsetof(UTABP_SpellCast_Single_C, AnimGraphNode_TransitionResult_3) == 0x0004B0, "Member 'UTABP_SpellCast_Single_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UTABP_SpellCast_Single_C, AnimGraphNode_TransitionResult_2) == 0x0004D8, "Member 'UTABP_SpellCast_Single_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UTABP_SpellCast_Single_C, AnimGraphNode_TransitionResult_1) == 0x000500, "Member 'UTABP_SpellCast_Single_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UTABP_SpellCast_Single_C, AnimGraphNode_TransitionResult) == 0x000528, "Member 'UTABP_SpellCast_Single_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UTABP_SpellCast_Single_C, AnimGraphNode_SequencePlayer_5) == 0x000550, "Member 'UTABP_SpellCast_Single_C::AnimGraphNode_SequencePlayer_5' has a wrong offset!");
static_assert(offsetof(UTABP_SpellCast_Single_C, AnimGraphNode_StateResult_5) == 0x000598, "Member 'UTABP_SpellCast_Single_C::AnimGraphNode_StateResult_5' has a wrong offset!");
static_assert(offsetof(UTABP_SpellCast_Single_C, AnimGraphNode_SequencePlayer_4) == 0x0005B8, "Member 'UTABP_SpellCast_Single_C::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(UTABP_SpellCast_Single_C, AnimGraphNode_StateResult_4) == 0x000600, "Member 'UTABP_SpellCast_Single_C::AnimGraphNode_StateResult_4' has a wrong offset!");
static_assert(offsetof(UTABP_SpellCast_Single_C, AnimGraphNode_SequencePlayer_3) == 0x000620, "Member 'UTABP_SpellCast_Single_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UTABP_SpellCast_Single_C, AnimGraphNode_StateResult_3) == 0x000668, "Member 'UTABP_SpellCast_Single_C::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(UTABP_SpellCast_Single_C, AnimGraphNode_SequencePlayer_2) == 0x000688, "Member 'UTABP_SpellCast_Single_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UTABP_SpellCast_Single_C, AnimGraphNode_StateResult_2) == 0x0006D0, "Member 'UTABP_SpellCast_Single_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UTABP_SpellCast_Single_C, AnimGraphNode_SequencePlayer_1) == 0x0006F0, "Member 'UTABP_SpellCast_Single_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UTABP_SpellCast_Single_C, AnimGraphNode_StateResult_1) == 0x000738, "Member 'UTABP_SpellCast_Single_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UTABP_SpellCast_Single_C, AnimGraphNode_SequencePlayer) == 0x000758, "Member 'UTABP_SpellCast_Single_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UTABP_SpellCast_Single_C, AnimGraphNode_StateResult) == 0x0007A0, "Member 'UTABP_SpellCast_Single_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UTABP_SpellCast_Single_C, AnimGraphNode_StateMachine) == 0x0007C0, "Member 'UTABP_SpellCast_Single_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UTABP_SpellCast_Single_C, AnimGraphNode_Root) == 0x000888, "Member 'UTABP_SpellCast_Single_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UTABP_SpellCast_Single_C, AnimGraphNode_LocalRefPose) == 0x0008A8, "Member 'UTABP_SpellCast_Single_C::AnimGraphNode_LocalRefPose' has a wrong offset!");

}

