#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TABP_Stagger_Swim

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct TABP_Stagger_Swim.TABP_Stagger_Swim_C.AnimBlueprintGeneratedConstantData
// 0x00DF (0x00E0 - 0x0001)
struct TABP_Stagger_Swim::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_11;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_12;                                 // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_13;                                 // 0x0014(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_14;                               // 0x0020(0x0020)(BlueprintVisible, NoDestructor)
	ERefPoseType                                  __ByteProperty_15;                                 // 0x0040(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0048(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x00C8(0x0018)()
};
static_assert(alignof(TABP_Stagger_Swim::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on TABP_Stagger_Swim::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(TABP_Stagger_Swim::FAnimBlueprintGeneratedConstantData) == 0x0000E0, "Wrong size on TABP_Stagger_Swim::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(TABP_Stagger_Swim::FAnimBlueprintGeneratedConstantData, __NameProperty_11) == 0x000004, "Member 'TABP_Stagger_Swim::FAnimBlueprintGeneratedConstantData::__NameProperty_11' has a wrong offset!");
static_assert(offsetof(TABP_Stagger_Swim::FAnimBlueprintGeneratedConstantData, __NameProperty_12) == 0x00000C, "Member 'TABP_Stagger_Swim::FAnimBlueprintGeneratedConstantData::__NameProperty_12' has a wrong offset!");
static_assert(offsetof(TABP_Stagger_Swim::FAnimBlueprintGeneratedConstantData, __NameProperty_13) == 0x000014, "Member 'TABP_Stagger_Swim::FAnimBlueprintGeneratedConstantData::__NameProperty_13' has a wrong offset!");
static_assert(offsetof(TABP_Stagger_Swim::FAnimBlueprintGeneratedConstantData, __StructProperty_14) == 0x000020, "Member 'TABP_Stagger_Swim::FAnimBlueprintGeneratedConstantData::__StructProperty_14' has a wrong offset!");
static_assert(offsetof(TABP_Stagger_Swim::FAnimBlueprintGeneratedConstantData, __ByteProperty_15) == 0x000040, "Member 'TABP_Stagger_Swim::FAnimBlueprintGeneratedConstantData::__ByteProperty_15' has a wrong offset!");
static_assert(offsetof(TABP_Stagger_Swim::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000048, "Member 'TABP_Stagger_Swim::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(TABP_Stagger_Swim::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0000C8, "Member 'TABP_Stagger_Swim::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

}

