#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TABP_LocomotionSwimming

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct TABP_LocomotionSwimming.TABP_LocomotionSwimming_C.AnimBlueprintGeneratedConstantData
// 0x00EF (0x00F0 - 0x0001)
struct TABP_LocomotionSwimming::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_14;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_15;                                // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_16;                                 // 0x0010(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_17;                                // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_18;                                 // 0x0018(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_19;                                 // 0x0019(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_20;                                 // 0x001C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_21;                                 // 0x0024(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_22;                               // 0x0030(0x0020)(BlueprintVisible, NoDestructor)
	ERefPoseType                                  __ByteProperty_23;                                 // 0x0050(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0058(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x00D8(0x0018)()
};
static_assert(alignof(TABP_LocomotionSwimming::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on TABP_LocomotionSwimming::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(TABP_LocomotionSwimming::FAnimBlueprintGeneratedConstantData) == 0x0000F0, "Wrong size on TABP_LocomotionSwimming::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(TABP_LocomotionSwimming::FAnimBlueprintGeneratedConstantData, __NameProperty_14) == 0x000004, "Member 'TABP_LocomotionSwimming::FAnimBlueprintGeneratedConstantData::__NameProperty_14' has a wrong offset!");
static_assert(offsetof(TABP_LocomotionSwimming::FAnimBlueprintGeneratedConstantData, __FloatProperty_15) == 0x00000C, "Member 'TABP_LocomotionSwimming::FAnimBlueprintGeneratedConstantData::__FloatProperty_15' has a wrong offset!");
static_assert(offsetof(TABP_LocomotionSwimming::FAnimBlueprintGeneratedConstantData, __BoolProperty_16) == 0x000010, "Member 'TABP_LocomotionSwimming::FAnimBlueprintGeneratedConstantData::__BoolProperty_16' has a wrong offset!");
static_assert(offsetof(TABP_LocomotionSwimming::FAnimBlueprintGeneratedConstantData, __FloatProperty_17) == 0x000014, "Member 'TABP_LocomotionSwimming::FAnimBlueprintGeneratedConstantData::__FloatProperty_17' has a wrong offset!");
static_assert(offsetof(TABP_LocomotionSwimming::FAnimBlueprintGeneratedConstantData, __BoolProperty_18) == 0x000018, "Member 'TABP_LocomotionSwimming::FAnimBlueprintGeneratedConstantData::__BoolProperty_18' has a wrong offset!");
static_assert(offsetof(TABP_LocomotionSwimming::FAnimBlueprintGeneratedConstantData, __EnumProperty_19) == 0x000019, "Member 'TABP_LocomotionSwimming::FAnimBlueprintGeneratedConstantData::__EnumProperty_19' has a wrong offset!");
static_assert(offsetof(TABP_LocomotionSwimming::FAnimBlueprintGeneratedConstantData, __NameProperty_20) == 0x00001C, "Member 'TABP_LocomotionSwimming::FAnimBlueprintGeneratedConstantData::__NameProperty_20' has a wrong offset!");
static_assert(offsetof(TABP_LocomotionSwimming::FAnimBlueprintGeneratedConstantData, __NameProperty_21) == 0x000024, "Member 'TABP_LocomotionSwimming::FAnimBlueprintGeneratedConstantData::__NameProperty_21' has a wrong offset!");
static_assert(offsetof(TABP_LocomotionSwimming::FAnimBlueprintGeneratedConstantData, __StructProperty_22) == 0x000030, "Member 'TABP_LocomotionSwimming::FAnimBlueprintGeneratedConstantData::__StructProperty_22' has a wrong offset!");
static_assert(offsetof(TABP_LocomotionSwimming::FAnimBlueprintGeneratedConstantData, __ByteProperty_23) == 0x000050, "Member 'TABP_LocomotionSwimming::FAnimBlueprintGeneratedConstantData::__ByteProperty_23' has a wrong offset!");
static_assert(offsetof(TABP_LocomotionSwimming::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000058, "Member 'TABP_LocomotionSwimming::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(TABP_LocomotionSwimming::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0000D8, "Member 'TABP_LocomotionSwimming::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct TABP_LocomotionSwimming.TABP_LocomotionSwimming_C.AnimBlueprintGeneratedMutableData
// 0x000B (0x000C - 0x0001)
struct TABP_LocomotionSwimming::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_0;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TABP_LocomotionSwimming::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on TABP_LocomotionSwimming::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(TABP_LocomotionSwimming::FAnimBlueprintGeneratedMutableData) == 0x00000C, "Wrong size on TABP_LocomotionSwimming::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(TABP_LocomotionSwimming::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'TABP_LocomotionSwimming::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");
static_assert(offsetof(TABP_LocomotionSwimming::FAnimBlueprintGeneratedMutableData, __FloatProperty_0) == 0x000008, "Member 'TABP_LocomotionSwimming::FAnimBlueprintGeneratedMutableData::__FloatProperty_0' has a wrong offset!");

}

