#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TABP_StandSneak_StaffAttack

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TABP_StandSneak_StaffAttack_structs.hpp"
#include "Altar_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass TABP_StandSneak_StaffAttack.TABP_StandSneak_StaffAttack_C
// 0x02D0 (0x0690 - 0x03C0)
class UTABP_StandSneak_StaffAttack_C final : public UVStandSneakStaffAttackAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct TABP_StandSneak_StaffAttack::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;  // 0x03C8(0x0008)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x03D0(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x03D8(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x03E0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0400(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0448(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0468(0x00C8)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0530(0x00B8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x05E8(0x0080)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0668(0x0020)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void AttackingLayer(const struct FPoseLink& InPose, struct FPoseLink* AttackingLayer_0);
	void ExecuteUbergraph_TABP_StandSneak_StaffAttack(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TABP_StandSneak_StaffAttack_C">();
	}
	static class UTABP_StandSneak_StaffAttack_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTABP_StandSneak_StaffAttack_C>();
	}
};
static_assert(alignof(UTABP_StandSneak_StaffAttack_C) == 0x000010, "Wrong alignment on UTABP_StandSneak_StaffAttack_C");
static_assert(sizeof(UTABP_StandSneak_StaffAttack_C) == 0x000690, "Wrong size on UTABP_StandSneak_StaffAttack_C");
static_assert(offsetof(UTABP_StandSneak_StaffAttack_C, UberGraphFrame) == 0x0003C0, "Member 'UTABP_StandSneak_StaffAttack_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTABP_StandSneak_StaffAttack_C, __AnimBlueprintMutables) == 0x0003C8, "Member 'UTABP_StandSneak_StaffAttack_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UTABP_StandSneak_StaffAttack_C, AnimBlueprintExtension_PropertyAccess) == 0x0003D0, "Member 'UTABP_StandSneak_StaffAttack_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UTABP_StandSneak_StaffAttack_C, AnimBlueprintExtension_Base) == 0x0003D8, "Member 'UTABP_StandSneak_StaffAttack_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UTABP_StandSneak_StaffAttack_C, AnimGraphNode_Root_1) == 0x0003E0, "Member 'UTABP_StandSneak_StaffAttack_C::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(UTABP_StandSneak_StaffAttack_C, AnimGraphNode_SequencePlayer) == 0x000400, "Member 'UTABP_StandSneak_StaffAttack_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UTABP_StandSneak_StaffAttack_C, AnimGraphNode_StateResult) == 0x000448, "Member 'UTABP_StandSneak_StaffAttack_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UTABP_StandSneak_StaffAttack_C, AnimGraphNode_StateMachine) == 0x000468, "Member 'UTABP_StandSneak_StaffAttack_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UTABP_StandSneak_StaffAttack_C, AnimGraphNode_LinkedInputPose) == 0x000530, "Member 'UTABP_StandSneak_StaffAttack_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UTABP_StandSneak_StaffAttack_C, AnimGraphNode_SaveCachedPose) == 0x0005E8, "Member 'UTABP_StandSneak_StaffAttack_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UTABP_StandSneak_StaffAttack_C, AnimGraphNode_Root) == 0x000668, "Member 'UTABP_StandSneak_StaffAttack_C::AnimGraphNode_Root' has a wrong offset!");

}

