#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TABP_MeleeAttack_HeavyCombo

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct TABP_MeleeAttack_HeavyCombo.TABP_MeleeAttack_HeavyCombo_C.AnimBlueprintGeneratedConstantData
// 0x0137 (0x0138 - 0x0001)
struct TABP_MeleeAttack_HeavyCombo::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_72;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_73;                                 // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_74;                                  // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_75;                                 // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_76;                                  // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_77;                                // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_78;                               // 0x0028(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_79;                                // 0x0054(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_80;                                 // 0x0058(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_81;                                 // 0x0059(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x2];                                       // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_82;                                 // 0x005C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_83;                                  // 0x0064(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_84;                                 // 0x0068(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_85;                                 // 0x0070(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_86;                               // 0x0078(0x0020)(BlueprintVisible, NoDestructor)
	ERefPoseType                                  __ByteProperty_87;                                 // 0x0098(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00A0(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0120(0x0018)()
};
static_assert(alignof(TABP_MeleeAttack_HeavyCombo::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on TABP_MeleeAttack_HeavyCombo::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(TABP_MeleeAttack_HeavyCombo::FAnimBlueprintGeneratedConstantData) == 0x000138, "Wrong size on TABP_MeleeAttack_HeavyCombo::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(TABP_MeleeAttack_HeavyCombo::FAnimBlueprintGeneratedConstantData, __NameProperty_72) == 0x000004, "Member 'TABP_MeleeAttack_HeavyCombo::FAnimBlueprintGeneratedConstantData::__NameProperty_72' has a wrong offset!");
static_assert(offsetof(TABP_MeleeAttack_HeavyCombo::FAnimBlueprintGeneratedConstantData, __NameProperty_73) == 0x00000C, "Member 'TABP_MeleeAttack_HeavyCombo::FAnimBlueprintGeneratedConstantData::__NameProperty_73' has a wrong offset!");
static_assert(offsetof(TABP_MeleeAttack_HeavyCombo::FAnimBlueprintGeneratedConstantData, __IntProperty_74) == 0x000014, "Member 'TABP_MeleeAttack_HeavyCombo::FAnimBlueprintGeneratedConstantData::__IntProperty_74' has a wrong offset!");
static_assert(offsetof(TABP_MeleeAttack_HeavyCombo::FAnimBlueprintGeneratedConstantData, __NameProperty_75) == 0x000018, "Member 'TABP_MeleeAttack_HeavyCombo::FAnimBlueprintGeneratedConstantData::__NameProperty_75' has a wrong offset!");
static_assert(offsetof(TABP_MeleeAttack_HeavyCombo::FAnimBlueprintGeneratedConstantData, __IntProperty_76) == 0x000020, "Member 'TABP_MeleeAttack_HeavyCombo::FAnimBlueprintGeneratedConstantData::__IntProperty_76' has a wrong offset!");
static_assert(offsetof(TABP_MeleeAttack_HeavyCombo::FAnimBlueprintGeneratedConstantData, __FloatProperty_77) == 0x000024, "Member 'TABP_MeleeAttack_HeavyCombo::FAnimBlueprintGeneratedConstantData::__FloatProperty_77' has a wrong offset!");
static_assert(offsetof(TABP_MeleeAttack_HeavyCombo::FAnimBlueprintGeneratedConstantData, __StructProperty_78) == 0x000028, "Member 'TABP_MeleeAttack_HeavyCombo::FAnimBlueprintGeneratedConstantData::__StructProperty_78' has a wrong offset!");
static_assert(offsetof(TABP_MeleeAttack_HeavyCombo::FAnimBlueprintGeneratedConstantData, __FloatProperty_79) == 0x000054, "Member 'TABP_MeleeAttack_HeavyCombo::FAnimBlueprintGeneratedConstantData::__FloatProperty_79' has a wrong offset!");
static_assert(offsetof(TABP_MeleeAttack_HeavyCombo::FAnimBlueprintGeneratedConstantData, __BoolProperty_80) == 0x000058, "Member 'TABP_MeleeAttack_HeavyCombo::FAnimBlueprintGeneratedConstantData::__BoolProperty_80' has a wrong offset!");
static_assert(offsetof(TABP_MeleeAttack_HeavyCombo::FAnimBlueprintGeneratedConstantData, __EnumProperty_81) == 0x000059, "Member 'TABP_MeleeAttack_HeavyCombo::FAnimBlueprintGeneratedConstantData::__EnumProperty_81' has a wrong offset!");
static_assert(offsetof(TABP_MeleeAttack_HeavyCombo::FAnimBlueprintGeneratedConstantData, __NameProperty_82) == 0x00005C, "Member 'TABP_MeleeAttack_HeavyCombo::FAnimBlueprintGeneratedConstantData::__NameProperty_82' has a wrong offset!");
static_assert(offsetof(TABP_MeleeAttack_HeavyCombo::FAnimBlueprintGeneratedConstantData, __IntProperty_83) == 0x000064, "Member 'TABP_MeleeAttack_HeavyCombo::FAnimBlueprintGeneratedConstantData::__IntProperty_83' has a wrong offset!");
static_assert(offsetof(TABP_MeleeAttack_HeavyCombo::FAnimBlueprintGeneratedConstantData, __NameProperty_84) == 0x000068, "Member 'TABP_MeleeAttack_HeavyCombo::FAnimBlueprintGeneratedConstantData::__NameProperty_84' has a wrong offset!");
static_assert(offsetof(TABP_MeleeAttack_HeavyCombo::FAnimBlueprintGeneratedConstantData, __NameProperty_85) == 0x000070, "Member 'TABP_MeleeAttack_HeavyCombo::FAnimBlueprintGeneratedConstantData::__NameProperty_85' has a wrong offset!");
static_assert(offsetof(TABP_MeleeAttack_HeavyCombo::FAnimBlueprintGeneratedConstantData, __StructProperty_86) == 0x000078, "Member 'TABP_MeleeAttack_HeavyCombo::FAnimBlueprintGeneratedConstantData::__StructProperty_86' has a wrong offset!");
static_assert(offsetof(TABP_MeleeAttack_HeavyCombo::FAnimBlueprintGeneratedConstantData, __ByteProperty_87) == 0x000098, "Member 'TABP_MeleeAttack_HeavyCombo::FAnimBlueprintGeneratedConstantData::__ByteProperty_87' has a wrong offset!");
static_assert(offsetof(TABP_MeleeAttack_HeavyCombo::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000A0, "Member 'TABP_MeleeAttack_HeavyCombo::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(TABP_MeleeAttack_HeavyCombo::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000120, "Member 'TABP_MeleeAttack_HeavyCombo::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct TABP_MeleeAttack_HeavyCombo.TABP_MeleeAttack_HeavyCombo_C.AnimBlueprintGeneratedMutableData
// 0x000B (0x000C - 0x0001)
struct TABP_MeleeAttack_HeavyCombo::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_0;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TABP_MeleeAttack_HeavyCombo::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on TABP_MeleeAttack_HeavyCombo::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(TABP_MeleeAttack_HeavyCombo::FAnimBlueprintGeneratedMutableData) == 0x00000C, "Wrong size on TABP_MeleeAttack_HeavyCombo::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(TABP_MeleeAttack_HeavyCombo::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'TABP_MeleeAttack_HeavyCombo::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");
static_assert(offsetof(TABP_MeleeAttack_HeavyCombo::FAnimBlueprintGeneratedMutableData, __FloatProperty_0) == 0x000008, "Member 'TABP_MeleeAttack_HeavyCombo::FAnimBlueprintGeneratedMutableData::__FloatProperty_0' has a wrong offset!");

}

