#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TABP_EquipUnequip_StandSneakSwim_Single

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "TABP_EquipUnequip_StandSneakSwim_Single_structs.hpp"
#include "Altar_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass TABP_EquipUnequip_StandSneakSwim_Single.TABP_EquipUnequip_StandSneakSwim_Single_C
// 0x0330 (0x0720 - 0x03F0)
class UTABP_EquipUnequip_StandSneakSwim_Single_C final : public UVEquipUnequipSSSwimSingle
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct TABP_EquipUnequip_StandSneakSwim_Single::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x03F8(0x000C)(HasGetValueTypeHash)
	uint8                                         Pad_404[0x4];                                      // 0x0404(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0408(0x0008)()
	struct FAnimSubsystemInstance_NodeRelevancy   AnimBlueprintExtension_NodeRelevancy;              // 0x0410(0x00A8)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x04B8(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x04C0(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x04E0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0508(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0530(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0578(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0598(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x05E0(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0600(0x0028)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0628(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x06F0(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x0710(0x0010)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void EquipUnequipLayer(struct FPoseLink* EquipUnequipLayer_0);
	void ExecuteUbergraph_TABP_EquipUnequip_StandSneakSwim_Single(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TABP_EquipUnequip_StandSneakSwim_Single_C">();
	}
	static class UTABP_EquipUnequip_StandSneakSwim_Single_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTABP_EquipUnequip_StandSneakSwim_Single_C>();
	}
};
static_assert(alignof(UTABP_EquipUnequip_StandSneakSwim_Single_C) == 0x000010, "Wrong alignment on UTABP_EquipUnequip_StandSneakSwim_Single_C");
static_assert(sizeof(UTABP_EquipUnequip_StandSneakSwim_Single_C) == 0x000720, "Wrong size on UTABP_EquipUnequip_StandSneakSwim_Single_C");
static_assert(offsetof(UTABP_EquipUnequip_StandSneakSwim_Single_C, UberGraphFrame) == 0x0003F0, "Member 'UTABP_EquipUnequip_StandSneakSwim_Single_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTABP_EquipUnequip_StandSneakSwim_Single_C, __AnimBlueprintMutables) == 0x0003F8, "Member 'UTABP_EquipUnequip_StandSneakSwim_Single_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UTABP_EquipUnequip_StandSneakSwim_Single_C, AnimBlueprintExtension_PropertyAccess) == 0x000408, "Member 'UTABP_EquipUnequip_StandSneakSwim_Single_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UTABP_EquipUnequip_StandSneakSwim_Single_C, AnimBlueprintExtension_NodeRelevancy) == 0x000410, "Member 'UTABP_EquipUnequip_StandSneakSwim_Single_C::AnimBlueprintExtension_NodeRelevancy' has a wrong offset!");
static_assert(offsetof(UTABP_EquipUnequip_StandSneakSwim_Single_C, AnimBlueprintExtension_Base) == 0x0004B8, "Member 'UTABP_EquipUnequip_StandSneakSwim_Single_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UTABP_EquipUnequip_StandSneakSwim_Single_C, AnimGraphNode_Root_1) == 0x0004C0, "Member 'UTABP_EquipUnequip_StandSneakSwim_Single_C::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(UTABP_EquipUnequip_StandSneakSwim_Single_C, AnimGraphNode_TransitionResult_2) == 0x0004E0, "Member 'UTABP_EquipUnequip_StandSneakSwim_Single_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UTABP_EquipUnequip_StandSneakSwim_Single_C, AnimGraphNode_TransitionResult_1) == 0x000508, "Member 'UTABP_EquipUnequip_StandSneakSwim_Single_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UTABP_EquipUnequip_StandSneakSwim_Single_C, AnimGraphNode_SequencePlayer_1) == 0x000530, "Member 'UTABP_EquipUnequip_StandSneakSwim_Single_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UTABP_EquipUnequip_StandSneakSwim_Single_C, AnimGraphNode_StateResult_1) == 0x000578, "Member 'UTABP_EquipUnequip_StandSneakSwim_Single_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UTABP_EquipUnequip_StandSneakSwim_Single_C, AnimGraphNode_SequencePlayer) == 0x000598, "Member 'UTABP_EquipUnequip_StandSneakSwim_Single_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UTABP_EquipUnequip_StandSneakSwim_Single_C, AnimGraphNode_StateResult) == 0x0005E0, "Member 'UTABP_EquipUnequip_StandSneakSwim_Single_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UTABP_EquipUnequip_StandSneakSwim_Single_C, AnimGraphNode_TransitionResult) == 0x000600, "Member 'UTABP_EquipUnequip_StandSneakSwim_Single_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UTABP_EquipUnequip_StandSneakSwim_Single_C, AnimGraphNode_StateMachine) == 0x000628, "Member 'UTABP_EquipUnequip_StandSneakSwim_Single_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UTABP_EquipUnequip_StandSneakSwim_Single_C, AnimGraphNode_Root) == 0x0006F0, "Member 'UTABP_EquipUnequip_StandSneakSwim_Single_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UTABP_EquipUnequip_StandSneakSwim_Single_C, AnimGraphNode_LocalRefPose) == 0x000710, "Member 'UTABP_EquipUnequip_StandSneakSwim_Single_C::AnimGraphNode_LocalRefPose' has a wrong offset!");

}

