#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TABP_TorchLayer_FirstPerson

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct TABP_TorchLayer_FirstPerson.TABP_TorchLayer_FirstPerson_C.AnimBlueprintGeneratedConstantData
// 0x0117 (0x0118 - 0x0001)
struct TABP_TorchLayer_FirstPerson::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_91;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_92;                                 // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_93;                                  // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_94;                                 // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_95;                                  // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_96;                                 // 0x0028(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_97;                                   // 0x0030(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_98;                                 // 0x0038(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_99;                                 // 0x0039(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_100;                               // 0x003C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_101;                                // 0x0040(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_102;                                // 0x0041(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_103;                                // 0x0042(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43[0x1];                                       // 0x0043(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_104;                                // 0x0044(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_105;                                // 0x004C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_106;                              // 0x0058(0x0020)(BlueprintVisible, NoDestructor)
	ERefPoseType                                  __ByteProperty_107;                                // 0x0078(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0080(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0100(0x0018)()
};
static_assert(alignof(TABP_TorchLayer_FirstPerson::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on TABP_TorchLayer_FirstPerson::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(TABP_TorchLayer_FirstPerson::FAnimBlueprintGeneratedConstantData) == 0x000118, "Wrong size on TABP_TorchLayer_FirstPerson::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(TABP_TorchLayer_FirstPerson::FAnimBlueprintGeneratedConstantData, __NameProperty_91) == 0x000004, "Member 'TABP_TorchLayer_FirstPerson::FAnimBlueprintGeneratedConstantData::__NameProperty_91' has a wrong offset!");
static_assert(offsetof(TABP_TorchLayer_FirstPerson::FAnimBlueprintGeneratedConstantData, __NameProperty_92) == 0x00000C, "Member 'TABP_TorchLayer_FirstPerson::FAnimBlueprintGeneratedConstantData::__NameProperty_92' has a wrong offset!");
static_assert(offsetof(TABP_TorchLayer_FirstPerson::FAnimBlueprintGeneratedConstantData, __IntProperty_93) == 0x000014, "Member 'TABP_TorchLayer_FirstPerson::FAnimBlueprintGeneratedConstantData::__IntProperty_93' has a wrong offset!");
static_assert(offsetof(TABP_TorchLayer_FirstPerson::FAnimBlueprintGeneratedConstantData, __NameProperty_94) == 0x000018, "Member 'TABP_TorchLayer_FirstPerson::FAnimBlueprintGeneratedConstantData::__NameProperty_94' has a wrong offset!");
static_assert(offsetof(TABP_TorchLayer_FirstPerson::FAnimBlueprintGeneratedConstantData, __IntProperty_95) == 0x000020, "Member 'TABP_TorchLayer_FirstPerson::FAnimBlueprintGeneratedConstantData::__IntProperty_95' has a wrong offset!");
static_assert(offsetof(TABP_TorchLayer_FirstPerson::FAnimBlueprintGeneratedConstantData, __BlendProfile_96) == 0x000028, "Member 'TABP_TorchLayer_FirstPerson::FAnimBlueprintGeneratedConstantData::__BlendProfile_96' has a wrong offset!");
static_assert(offsetof(TABP_TorchLayer_FirstPerson::FAnimBlueprintGeneratedConstantData, __CurveFloat_97) == 0x000030, "Member 'TABP_TorchLayer_FirstPerson::FAnimBlueprintGeneratedConstantData::__CurveFloat_97' has a wrong offset!");
static_assert(offsetof(TABP_TorchLayer_FirstPerson::FAnimBlueprintGeneratedConstantData, __EnumProperty_98) == 0x000038, "Member 'TABP_TorchLayer_FirstPerson::FAnimBlueprintGeneratedConstantData::__EnumProperty_98' has a wrong offset!");
static_assert(offsetof(TABP_TorchLayer_FirstPerson::FAnimBlueprintGeneratedConstantData, __EnumProperty_99) == 0x000039, "Member 'TABP_TorchLayer_FirstPerson::FAnimBlueprintGeneratedConstantData::__EnumProperty_99' has a wrong offset!");
static_assert(offsetof(TABP_TorchLayer_FirstPerson::FAnimBlueprintGeneratedConstantData, __FloatProperty_100) == 0x00003C, "Member 'TABP_TorchLayer_FirstPerson::FAnimBlueprintGeneratedConstantData::__FloatProperty_100' has a wrong offset!");
static_assert(offsetof(TABP_TorchLayer_FirstPerson::FAnimBlueprintGeneratedConstantData, __BoolProperty_101) == 0x000040, "Member 'TABP_TorchLayer_FirstPerson::FAnimBlueprintGeneratedConstantData::__BoolProperty_101' has a wrong offset!");
static_assert(offsetof(TABP_TorchLayer_FirstPerson::FAnimBlueprintGeneratedConstantData, __BoolProperty_102) == 0x000041, "Member 'TABP_TorchLayer_FirstPerson::FAnimBlueprintGeneratedConstantData::__BoolProperty_102' has a wrong offset!");
static_assert(offsetof(TABP_TorchLayer_FirstPerson::FAnimBlueprintGeneratedConstantData, __EnumProperty_103) == 0x000042, "Member 'TABP_TorchLayer_FirstPerson::FAnimBlueprintGeneratedConstantData::__EnumProperty_103' has a wrong offset!");
static_assert(offsetof(TABP_TorchLayer_FirstPerson::FAnimBlueprintGeneratedConstantData, __NameProperty_104) == 0x000044, "Member 'TABP_TorchLayer_FirstPerson::FAnimBlueprintGeneratedConstantData::__NameProperty_104' has a wrong offset!");
static_assert(offsetof(TABP_TorchLayer_FirstPerson::FAnimBlueprintGeneratedConstantData, __NameProperty_105) == 0x00004C, "Member 'TABP_TorchLayer_FirstPerson::FAnimBlueprintGeneratedConstantData::__NameProperty_105' has a wrong offset!");
static_assert(offsetof(TABP_TorchLayer_FirstPerson::FAnimBlueprintGeneratedConstantData, __StructProperty_106) == 0x000058, "Member 'TABP_TorchLayer_FirstPerson::FAnimBlueprintGeneratedConstantData::__StructProperty_106' has a wrong offset!");
static_assert(offsetof(TABP_TorchLayer_FirstPerson::FAnimBlueprintGeneratedConstantData, __ByteProperty_107) == 0x000078, "Member 'TABP_TorchLayer_FirstPerson::FAnimBlueprintGeneratedConstantData::__ByteProperty_107' has a wrong offset!");
static_assert(offsetof(TABP_TorchLayer_FirstPerson::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000080, "Member 'TABP_TorchLayer_FirstPerson::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(TABP_TorchLayer_FirstPerson::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000100, "Member 'TABP_TorchLayer_FirstPerson::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct TABP_TorchLayer_FirstPerson.TABP_TorchLayer_FirstPerson_C.AnimBlueprintGeneratedMutableData
// 0x004F (0x0050 - 0x0001)
struct TABP_TorchLayer_FirstPerson::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty;                                   // 0x0008(0x0010)(BlueprintVisible, EditFixedSize)
	bool                                          __BoolProperty_0;                                  // 0x0018(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_1;                                 // 0x0020(0x0010)(BlueprintVisible, EditFixedSize)
	bool                                          __BoolProperty_2;                                  // 0x0030(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_3;                                 // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_4;                                 // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_5;                                 // 0x003C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_6;                                 // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_7;                                 // 0x0044(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_8;                                 // 0x0048(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TABP_TorchLayer_FirstPerson::FAnimBlueprintGeneratedMutableData) == 0x000008, "Wrong alignment on TABP_TorchLayer_FirstPerson::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(TABP_TorchLayer_FirstPerson::FAnimBlueprintGeneratedMutableData) == 0x000050, "Wrong size on TABP_TorchLayer_FirstPerson::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(TABP_TorchLayer_FirstPerson::FAnimBlueprintGeneratedMutableData, __ArrayProperty) == 0x000008, "Member 'TABP_TorchLayer_FirstPerson::FAnimBlueprintGeneratedMutableData::__ArrayProperty' has a wrong offset!");
static_assert(offsetof(TABP_TorchLayer_FirstPerson::FAnimBlueprintGeneratedMutableData, __BoolProperty_0) == 0x000018, "Member 'TABP_TorchLayer_FirstPerson::FAnimBlueprintGeneratedMutableData::__BoolProperty_0' has a wrong offset!");
static_assert(offsetof(TABP_TorchLayer_FirstPerson::FAnimBlueprintGeneratedMutableData, __ArrayProperty_1) == 0x000020, "Member 'TABP_TorchLayer_FirstPerson::FAnimBlueprintGeneratedMutableData::__ArrayProperty_1' has a wrong offset!");
static_assert(offsetof(TABP_TorchLayer_FirstPerson::FAnimBlueprintGeneratedMutableData, __BoolProperty_2) == 0x000030, "Member 'TABP_TorchLayer_FirstPerson::FAnimBlueprintGeneratedMutableData::__BoolProperty_2' has a wrong offset!");
static_assert(offsetof(TABP_TorchLayer_FirstPerson::FAnimBlueprintGeneratedMutableData, __FloatProperty_3) == 0x000034, "Member 'TABP_TorchLayer_FirstPerson::FAnimBlueprintGeneratedMutableData::__FloatProperty_3' has a wrong offset!");
static_assert(offsetof(TABP_TorchLayer_FirstPerson::FAnimBlueprintGeneratedMutableData, __FloatProperty_4) == 0x000038, "Member 'TABP_TorchLayer_FirstPerson::FAnimBlueprintGeneratedMutableData::__FloatProperty_4' has a wrong offset!");
static_assert(offsetof(TABP_TorchLayer_FirstPerson::FAnimBlueprintGeneratedMutableData, __FloatProperty_5) == 0x00003C, "Member 'TABP_TorchLayer_FirstPerson::FAnimBlueprintGeneratedMutableData::__FloatProperty_5' has a wrong offset!");
static_assert(offsetof(TABP_TorchLayer_FirstPerson::FAnimBlueprintGeneratedMutableData, __FloatProperty_6) == 0x000040, "Member 'TABP_TorchLayer_FirstPerson::FAnimBlueprintGeneratedMutableData::__FloatProperty_6' has a wrong offset!");
static_assert(offsetof(TABP_TorchLayer_FirstPerson::FAnimBlueprintGeneratedMutableData, __FloatProperty_7) == 0x000044, "Member 'TABP_TorchLayer_FirstPerson::FAnimBlueprintGeneratedMutableData::__FloatProperty_7' has a wrong offset!");
static_assert(offsetof(TABP_TorchLayer_FirstPerson::FAnimBlueprintGeneratedMutableData, __FloatProperty_8) == 0x000048, "Member 'TABP_TorchLayer_FirstPerson::FAnimBlueprintGeneratedMutableData::__FloatProperty_8' has a wrong offset!");

}

