#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TABP_LocomotionSneaking

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Altar_classes.hpp"
#include "TABP_LocomotionSneaking_structs.hpp"
#include "Struct_LocomotionTurn_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass TABP_LocomotionSneaking.TABP_LocomotionSneaking_C
// 0x01F0 (0x0650 - 0x0460)
class UTABP_LocomotionSneaking_C final : public UVLocomotionCharacterAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct TABP_LocomotionSneaking::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;      // 0x0468(0x0010)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0478(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0480(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x0488(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x04A8(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0518(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0538(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0600(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x0620(0x0010)()
	struct FStruct_LocomotionTurn                 AnimSet;                                           // 0x0630(0x0020)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_TABP_LocomotionSneaking(int32 EntryPoint);
	void SneakingLayer(struct FPoseLink* SneakingLayer_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TABP_LocomotionSneaking_C">();
	}
	static class UTABP_LocomotionSneaking_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTABP_LocomotionSneaking_C>();
	}
};
static_assert(alignof(UTABP_LocomotionSneaking_C) == 0x000010, "Wrong alignment on UTABP_LocomotionSneaking_C");
static_assert(sizeof(UTABP_LocomotionSneaking_C) == 0x000650, "Wrong size on UTABP_LocomotionSneaking_C");
static_assert(offsetof(UTABP_LocomotionSneaking_C, UberGraphFrame) == 0x000460, "Member 'UTABP_LocomotionSneaking_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTABP_LocomotionSneaking_C, __AnimBlueprintMutables) == 0x000468, "Member 'UTABP_LocomotionSneaking_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UTABP_LocomotionSneaking_C, AnimBlueprintExtension_PropertyAccess) == 0x000478, "Member 'UTABP_LocomotionSneaking_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UTABP_LocomotionSneaking_C, AnimBlueprintExtension_Base) == 0x000480, "Member 'UTABP_LocomotionSneaking_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UTABP_LocomotionSneaking_C, AnimGraphNode_Root_1) == 0x000488, "Member 'UTABP_LocomotionSneaking_C::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(UTABP_LocomotionSneaking_C, AnimGraphNode_BlendSpacePlayer) == 0x0004A8, "Member 'UTABP_LocomotionSneaking_C::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(UTABP_LocomotionSneaking_C, AnimGraphNode_StateResult) == 0x000518, "Member 'UTABP_LocomotionSneaking_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UTABP_LocomotionSneaking_C, AnimGraphNode_StateMachine) == 0x000538, "Member 'UTABP_LocomotionSneaking_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UTABP_LocomotionSneaking_C, AnimGraphNode_Root) == 0x000600, "Member 'UTABP_LocomotionSneaking_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UTABP_LocomotionSneaking_C, AnimGraphNode_LocalRefPose) == 0x000620, "Member 'UTABP_LocomotionSneaking_C::AnimGraphNode_LocalRefPose' has a wrong offset!");
static_assert(offsetof(UTABP_LocomotionSneaking_C, AnimSet) == 0x000630, "Member 'UTABP_LocomotionSneaking_C::AnimSet' has a wrong offset!");

}

