#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TABP_SpecialIdleAndDock

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "TABP_SpecialIdleAndDock_structs.hpp"
#include "Altar_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass TABP_SpecialIdleAndDock.TABP_SpecialIdleAndDock_C
// 0x0970 (0x0DB0 - 0x0440)
class UTABP_SpecialIdleAndDock_C final : public UVSpecialIdleAndDockCharacterAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0440(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct TABP_SpecialIdleAndDock::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;      // 0x0448(0x0005)(HasGetValueTypeHash)
	uint8                                         Pad_44D[0x3];                                      // 0x044D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0450(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0458(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x0460(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0480(0x00B8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_5;                    // 0x0538(0x0080)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_4;                    // 0x05B8(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0638(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_10;                    // 0x0680(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_3;                   // 0x06A8(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_3;                    // 0x06F0(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_9;                     // 0x0770(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2;                    // 0x0798(0x0080)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x0818(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_8;                     // 0x0860(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_7;                     // 0x0888(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x08B0(0x0048)()
	struct FAnimNode_LayeredBoneBlendTemplate     AnimGraphNode_LayeredBoneBlendTemplate_1;          // 0x08F8(0x0110)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_6;                     // 0x0A08(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5;                     // 0x0A30(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x0A58(0x0080)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0AD8(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x0B20(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x0B48(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x0B70(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x0B98(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x0BC0(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x0C40(0x0028)()
	struct FAnimNode_LayeredBoneBlendTemplate     AnimGraphNode_LayeredBoneBlendTemplate;            // 0x0C68(0x0110)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0D78(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x0D98(0x0010)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_TABP_SpecialIdleAndDock(int32 EntryPoint);
	void SpecialAndDynamicIdleLayer(const struct FPoseLink& InPose, struct FPoseLink* SpecialAndDynamicIdleLayer_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TABP_SpecialIdleAndDock_C">();
	}
	static class UTABP_SpecialIdleAndDock_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTABP_SpecialIdleAndDock_C>();
	}
};
static_assert(alignof(UTABP_SpecialIdleAndDock_C) == 0x000010, "Wrong alignment on UTABP_SpecialIdleAndDock_C");
static_assert(sizeof(UTABP_SpecialIdleAndDock_C) == 0x000DB0, "Wrong size on UTABP_SpecialIdleAndDock_C");
static_assert(offsetof(UTABP_SpecialIdleAndDock_C, UberGraphFrame) == 0x000440, "Member 'UTABP_SpecialIdleAndDock_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTABP_SpecialIdleAndDock_C, __AnimBlueprintMutables) == 0x000448, "Member 'UTABP_SpecialIdleAndDock_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UTABP_SpecialIdleAndDock_C, AnimBlueprintExtension_PropertyAccess) == 0x000450, "Member 'UTABP_SpecialIdleAndDock_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UTABP_SpecialIdleAndDock_C, AnimBlueprintExtension_Base) == 0x000458, "Member 'UTABP_SpecialIdleAndDock_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UTABP_SpecialIdleAndDock_C, AnimGraphNode_Root_1) == 0x000460, "Member 'UTABP_SpecialIdleAndDock_C::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(UTABP_SpecialIdleAndDock_C, AnimGraphNode_LinkedInputPose) == 0x000480, "Member 'UTABP_SpecialIdleAndDock_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UTABP_SpecialIdleAndDock_C, AnimGraphNode_SaveCachedPose_5) == 0x000538, "Member 'UTABP_SpecialIdleAndDock_C::AnimGraphNode_SaveCachedPose_5' has a wrong offset!");
static_assert(offsetof(UTABP_SpecialIdleAndDock_C, AnimGraphNode_SaveCachedPose_4) == 0x0005B8, "Member 'UTABP_SpecialIdleAndDock_C::AnimGraphNode_SaveCachedPose_4' has a wrong offset!");
static_assert(offsetof(UTABP_SpecialIdleAndDock_C, AnimGraphNode_SequencePlayer) == 0x000638, "Member 'UTABP_SpecialIdleAndDock_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UTABP_SpecialIdleAndDock_C, AnimGraphNode_UseCachedPose_10) == 0x000680, "Member 'UTABP_SpecialIdleAndDock_C::AnimGraphNode_UseCachedPose_10' has a wrong offset!");
static_assert(offsetof(UTABP_SpecialIdleAndDock_C, AnimGraphNode_BlendListByBool_3) == 0x0006A8, "Member 'UTABP_SpecialIdleAndDock_C::AnimGraphNode_BlendListByBool_3' has a wrong offset!");
static_assert(offsetof(UTABP_SpecialIdleAndDock_C, AnimGraphNode_SaveCachedPose_3) == 0x0006F0, "Member 'UTABP_SpecialIdleAndDock_C::AnimGraphNode_SaveCachedPose_3' has a wrong offset!");
static_assert(offsetof(UTABP_SpecialIdleAndDock_C, AnimGraphNode_UseCachedPose_9) == 0x000770, "Member 'UTABP_SpecialIdleAndDock_C::AnimGraphNode_UseCachedPose_9' has a wrong offset!");
static_assert(offsetof(UTABP_SpecialIdleAndDock_C, AnimGraphNode_SaveCachedPose_2) == 0x000798, "Member 'UTABP_SpecialIdleAndDock_C::AnimGraphNode_SaveCachedPose_2' has a wrong offset!");
static_assert(offsetof(UTABP_SpecialIdleAndDock_C, AnimGraphNode_BlendListByBool_2) == 0x000818, "Member 'UTABP_SpecialIdleAndDock_C::AnimGraphNode_BlendListByBool_2' has a wrong offset!");
static_assert(offsetof(UTABP_SpecialIdleAndDock_C, AnimGraphNode_UseCachedPose_8) == 0x000860, "Member 'UTABP_SpecialIdleAndDock_C::AnimGraphNode_UseCachedPose_8' has a wrong offset!");
static_assert(offsetof(UTABP_SpecialIdleAndDock_C, AnimGraphNode_UseCachedPose_7) == 0x000888, "Member 'UTABP_SpecialIdleAndDock_C::AnimGraphNode_UseCachedPose_7' has a wrong offset!");
static_assert(offsetof(UTABP_SpecialIdleAndDock_C, AnimGraphNode_BlendListByBool_1) == 0x0008B0, "Member 'UTABP_SpecialIdleAndDock_C::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(UTABP_SpecialIdleAndDock_C, AnimGraphNode_LayeredBoneBlendTemplate_1) == 0x0008F8, "Member 'UTABP_SpecialIdleAndDock_C::AnimGraphNode_LayeredBoneBlendTemplate_1' has a wrong offset!");
static_assert(offsetof(UTABP_SpecialIdleAndDock_C, AnimGraphNode_UseCachedPose_6) == 0x000A08, "Member 'UTABP_SpecialIdleAndDock_C::AnimGraphNode_UseCachedPose_6' has a wrong offset!");
static_assert(offsetof(UTABP_SpecialIdleAndDock_C, AnimGraphNode_UseCachedPose_5) == 0x000A30, "Member 'UTABP_SpecialIdleAndDock_C::AnimGraphNode_UseCachedPose_5' has a wrong offset!");
static_assert(offsetof(UTABP_SpecialIdleAndDock_C, AnimGraphNode_SaveCachedPose_1) == 0x000A58, "Member 'UTABP_SpecialIdleAndDock_C::AnimGraphNode_SaveCachedPose_1' has a wrong offset!");
static_assert(offsetof(UTABP_SpecialIdleAndDock_C, AnimGraphNode_BlendListByBool) == 0x000AD8, "Member 'UTABP_SpecialIdleAndDock_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UTABP_SpecialIdleAndDock_C, AnimGraphNode_UseCachedPose_4) == 0x000B20, "Member 'UTABP_SpecialIdleAndDock_C::AnimGraphNode_UseCachedPose_4' has a wrong offset!");
static_assert(offsetof(UTABP_SpecialIdleAndDock_C, AnimGraphNode_UseCachedPose_3) == 0x000B48, "Member 'UTABP_SpecialIdleAndDock_C::AnimGraphNode_UseCachedPose_3' has a wrong offset!");
static_assert(offsetof(UTABP_SpecialIdleAndDock_C, AnimGraphNode_UseCachedPose_2) == 0x000B70, "Member 'UTABP_SpecialIdleAndDock_C::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(UTABP_SpecialIdleAndDock_C, AnimGraphNode_UseCachedPose_1) == 0x000B98, "Member 'UTABP_SpecialIdleAndDock_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UTABP_SpecialIdleAndDock_C, AnimGraphNode_SaveCachedPose) == 0x000BC0, "Member 'UTABP_SpecialIdleAndDock_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UTABP_SpecialIdleAndDock_C, AnimGraphNode_UseCachedPose) == 0x000C40, "Member 'UTABP_SpecialIdleAndDock_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UTABP_SpecialIdleAndDock_C, AnimGraphNode_LayeredBoneBlendTemplate) == 0x000C68, "Member 'UTABP_SpecialIdleAndDock_C::AnimGraphNode_LayeredBoneBlendTemplate' has a wrong offset!");
static_assert(offsetof(UTABP_SpecialIdleAndDock_C, AnimGraphNode_Root) == 0x000D78, "Member 'UTABP_SpecialIdleAndDock_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UTABP_SpecialIdleAndDock_C, AnimGraphNode_LocalRefPose) == 0x000D98, "Member 'UTABP_SpecialIdleAndDock_C::AnimGraphNode_LocalRefPose' has a wrong offset!");

}

