#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TABP_FeetIK_Humanoid

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "AnimationNodeRuntime_structs.hpp"
#include "Altar_classes.hpp"
#include "ControlRig_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass TABP_FeetIK_Humanoid.TABP_FeetIK_Humanoid_C
// 0x05B0 (0x0990 - 0x03E0)
class UTABP_FeetIK_Humanoid_C final : public UVFeetIKCharacterAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x03E8(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x03F0(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x03F8(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0418(0x00B8)()
	struct FAnimNode_TemplateControlRig           AnimGraphNode_TemplateControlRig;                  // 0x04D0(0x0460)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0930(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x0950(0x0010)()
	bool                                          K2Node_PropertyAccess_6;                           // 0x0960(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_PropertyAccess_4;                           // 0x0961(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_bIsSneaking_075959F34821BEAC1F20A9B6E19952E9; // 0x0962(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_bIsMoving_075959F34821BEAC1F20A9B6E19952E9; // 0x0963(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_bIsInAir_075959F34821BEAC1F20A9B6E19952E9; // 0x0964(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_965[0x3];                                      // 0x0965(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        __CustomProperty_Scale_075959F34821BEAC1F20A9B6E19952E9; // 0x0968(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_SpeedRatio_075959F34821BEAC1F20A9B6E19952E9; // 0x0970(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActorFeetIKSettings                   __CustomProperty_ActorDataAsset_075959F34821BEAC1F20A9B6E19952E9; // 0x0978(0x0008)(NoDestructor)
	struct FActorFeetIKSettings                   Settings;                                          // 0x0980(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_TABP_FeetIK_Humanoid(int32 EntryPoint);
	void FeetIKLayer(const struct FPoseLink& AnimationPose, struct FPoseLink* FeetIKLayer_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TABP_FeetIK_Humanoid_C">();
	}
	static class UTABP_FeetIK_Humanoid_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTABP_FeetIK_Humanoid_C>();
	}
};
static_assert(alignof(UTABP_FeetIK_Humanoid_C) == 0x000010, "Wrong alignment on UTABP_FeetIK_Humanoid_C");
static_assert(sizeof(UTABP_FeetIK_Humanoid_C) == 0x000990, "Wrong size on UTABP_FeetIK_Humanoid_C");
static_assert(offsetof(UTABP_FeetIK_Humanoid_C, UberGraphFrame) == 0x0003E0, "Member 'UTABP_FeetIK_Humanoid_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTABP_FeetIK_Humanoid_C, AnimBlueprintExtension_PropertyAccess) == 0x0003E8, "Member 'UTABP_FeetIK_Humanoid_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UTABP_FeetIK_Humanoid_C, AnimBlueprintExtension_Base) == 0x0003F0, "Member 'UTABP_FeetIK_Humanoid_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UTABP_FeetIK_Humanoid_C, AnimGraphNode_Root_1) == 0x0003F8, "Member 'UTABP_FeetIK_Humanoid_C::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(UTABP_FeetIK_Humanoid_C, AnimGraphNode_LinkedInputPose) == 0x000418, "Member 'UTABP_FeetIK_Humanoid_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UTABP_FeetIK_Humanoid_C, AnimGraphNode_TemplateControlRig) == 0x0004D0, "Member 'UTABP_FeetIK_Humanoid_C::AnimGraphNode_TemplateControlRig' has a wrong offset!");
static_assert(offsetof(UTABP_FeetIK_Humanoid_C, AnimGraphNode_Root) == 0x000930, "Member 'UTABP_FeetIK_Humanoid_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UTABP_FeetIK_Humanoid_C, AnimGraphNode_LocalRefPose) == 0x000950, "Member 'UTABP_FeetIK_Humanoid_C::AnimGraphNode_LocalRefPose' has a wrong offset!");
static_assert(offsetof(UTABP_FeetIK_Humanoid_C, K2Node_PropertyAccess_6) == 0x000960, "Member 'UTABP_FeetIK_Humanoid_C::K2Node_PropertyAccess_6' has a wrong offset!");
static_assert(offsetof(UTABP_FeetIK_Humanoid_C, K2Node_PropertyAccess_4) == 0x000961, "Member 'UTABP_FeetIK_Humanoid_C::K2Node_PropertyAccess_4' has a wrong offset!");
static_assert(offsetof(UTABP_FeetIK_Humanoid_C, __CustomProperty_bIsSneaking_075959F34821BEAC1F20A9B6E19952E9) == 0x000962, "Member 'UTABP_FeetIK_Humanoid_C::__CustomProperty_bIsSneaking_075959F34821BEAC1F20A9B6E19952E9' has a wrong offset!");
static_assert(offsetof(UTABP_FeetIK_Humanoid_C, __CustomProperty_bIsMoving_075959F34821BEAC1F20A9B6E19952E9) == 0x000963, "Member 'UTABP_FeetIK_Humanoid_C::__CustomProperty_bIsMoving_075959F34821BEAC1F20A9B6E19952E9' has a wrong offset!");
static_assert(offsetof(UTABP_FeetIK_Humanoid_C, __CustomProperty_bIsInAir_075959F34821BEAC1F20A9B6E19952E9) == 0x000964, "Member 'UTABP_FeetIK_Humanoid_C::__CustomProperty_bIsInAir_075959F34821BEAC1F20A9B6E19952E9' has a wrong offset!");
static_assert(offsetof(UTABP_FeetIK_Humanoid_C, __CustomProperty_Scale_075959F34821BEAC1F20A9B6E19952E9) == 0x000968, "Member 'UTABP_FeetIK_Humanoid_C::__CustomProperty_Scale_075959F34821BEAC1F20A9B6E19952E9' has a wrong offset!");
static_assert(offsetof(UTABP_FeetIK_Humanoid_C, __CustomProperty_SpeedRatio_075959F34821BEAC1F20A9B6E19952E9) == 0x000970, "Member 'UTABP_FeetIK_Humanoid_C::__CustomProperty_SpeedRatio_075959F34821BEAC1F20A9B6E19952E9' has a wrong offset!");
static_assert(offsetof(UTABP_FeetIK_Humanoid_C, __CustomProperty_ActorDataAsset_075959F34821BEAC1F20A9B6E19952E9) == 0x000978, "Member 'UTABP_FeetIK_Humanoid_C::__CustomProperty_ActorDataAsset_075959F34821BEAC1F20A9B6E19952E9' has a wrong offset!");
static_assert(offsetof(UTABP_FeetIK_Humanoid_C, Settings) == 0x000980, "Member 'UTABP_FeetIK_Humanoid_C::Settings' has a wrong offset!");

}

