#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TABP_LocomotionSwimming

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "TABP_LocomotionSwimming_structs.hpp"
#include "Struct_Locomotion_structs.hpp"
#include "Altar_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass TABP_LocomotionSwimming.TABP_LocomotionSwimming_C
// 0x00F0 (0x0550 - 0x0460)
class UTABP_LocomotionSwimming_C final : public UVLocomotionCharacterAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct TABP_LocomotionSwimming::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;      // 0x0468(0x000C)(HasGetValueTypeHash)
	uint8                                         Pad_474[0x4];                                      // 0x0474(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0478(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0480(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x0488(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x04A8(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0518(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x0538(0x0010)()
	struct FStruct_Locomotion                     AnimSet;                                           // 0x0548(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_TABP_LocomotionSwimming(int32 EntryPoint);
	void SwimmingLayer(struct FPoseLink* SwimmingLayer_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TABP_LocomotionSwimming_C">();
	}
	static class UTABP_LocomotionSwimming_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTABP_LocomotionSwimming_C>();
	}
};
static_assert(alignof(UTABP_LocomotionSwimming_C) == 0x000010, "Wrong alignment on UTABP_LocomotionSwimming_C");
static_assert(sizeof(UTABP_LocomotionSwimming_C) == 0x000550, "Wrong size on UTABP_LocomotionSwimming_C");
static_assert(offsetof(UTABP_LocomotionSwimming_C, UberGraphFrame) == 0x000460, "Member 'UTABP_LocomotionSwimming_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTABP_LocomotionSwimming_C, __AnimBlueprintMutables) == 0x000468, "Member 'UTABP_LocomotionSwimming_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UTABP_LocomotionSwimming_C, AnimBlueprintExtension_PropertyAccess) == 0x000478, "Member 'UTABP_LocomotionSwimming_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UTABP_LocomotionSwimming_C, AnimBlueprintExtension_Base) == 0x000480, "Member 'UTABP_LocomotionSwimming_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UTABP_LocomotionSwimming_C, AnimGraphNode_Root_1) == 0x000488, "Member 'UTABP_LocomotionSwimming_C::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(UTABP_LocomotionSwimming_C, AnimGraphNode_BlendSpacePlayer) == 0x0004A8, "Member 'UTABP_LocomotionSwimming_C::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(UTABP_LocomotionSwimming_C, AnimGraphNode_Root) == 0x000518, "Member 'UTABP_LocomotionSwimming_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UTABP_LocomotionSwimming_C, AnimGraphNode_LocalRefPose) == 0x000538, "Member 'UTABP_LocomotionSwimming_C::AnimGraphNode_LocalRefPose' has a wrong offset!");
static_assert(offsetof(UTABP_LocomotionSwimming_C, AnimSet) == 0x000548, "Member 'UTABP_LocomotionSwimming_C::AnimSet' has a wrong offset!");

}

