#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TABP_HorseRiding_Ground

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct TABP_HorseRiding_Ground.TABP_HorseRiding_Ground_C.AnimBlueprintGeneratedConstantData
// 0x0197 (0x0198 - 0x0001)
struct TABP_HorseRiding_Ground::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_190;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_191;                               // 0x0010(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_192;                                // 0x0020(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_193;                                 // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_194;                                // 0x002C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_195;                                 // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_196;                                // 0x0038(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_197;                                 // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_198;                                // 0x0044(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_199;                                 // 0x004C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_200;                                // 0x0050(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_201;                                 // 0x0058(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_202;                                // 0x005C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_203;                               // 0x0060(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_204;                              // 0x0064(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_205;                               // 0x0090(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_206;                                // 0x0094(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_207;                                // 0x0095(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_96[0x2];                                       // 0x0096(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_208;                                // 0x0098(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_209;                                 // 0x00A0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_210;                                // 0x00A8(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_211;                                  // 0x00B0(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_212;                                // 0x00B8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_213;                                // 0x00B9(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_214;                                // 0x00BA(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BB[0x5];                                       // 0x00BB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_215;                               // 0x00C0(0x0010)(BlueprintVisible, EditFixedSize)
	struct FAnimNodeFunctionRef                   __StructProperty_216;                              // 0x00D0(0x0020)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_217;                                // 0x00F0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_218;                                // 0x00F8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0100(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0180(0x0018)()
};
static_assert(alignof(TABP_HorseRiding_Ground::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on TABP_HorseRiding_Ground::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(TABP_HorseRiding_Ground::FAnimBlueprintGeneratedConstantData) == 0x000198, "Wrong size on TABP_HorseRiding_Ground::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(TABP_HorseRiding_Ground::FAnimBlueprintGeneratedConstantData, __NameProperty_190) == 0x000004, "Member 'TABP_HorseRiding_Ground::FAnimBlueprintGeneratedConstantData::__NameProperty_190' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_Ground::FAnimBlueprintGeneratedConstantData, __ArrayProperty_191) == 0x000010, "Member 'TABP_HorseRiding_Ground::FAnimBlueprintGeneratedConstantData::__ArrayProperty_191' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_Ground::FAnimBlueprintGeneratedConstantData, __NameProperty_192) == 0x000020, "Member 'TABP_HorseRiding_Ground::FAnimBlueprintGeneratedConstantData::__NameProperty_192' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_Ground::FAnimBlueprintGeneratedConstantData, __IntProperty_193) == 0x000028, "Member 'TABP_HorseRiding_Ground::FAnimBlueprintGeneratedConstantData::__IntProperty_193' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_Ground::FAnimBlueprintGeneratedConstantData, __NameProperty_194) == 0x00002C, "Member 'TABP_HorseRiding_Ground::FAnimBlueprintGeneratedConstantData::__NameProperty_194' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_Ground::FAnimBlueprintGeneratedConstantData, __IntProperty_195) == 0x000034, "Member 'TABP_HorseRiding_Ground::FAnimBlueprintGeneratedConstantData::__IntProperty_195' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_Ground::FAnimBlueprintGeneratedConstantData, __NameProperty_196) == 0x000038, "Member 'TABP_HorseRiding_Ground::FAnimBlueprintGeneratedConstantData::__NameProperty_196' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_Ground::FAnimBlueprintGeneratedConstantData, __IntProperty_197) == 0x000040, "Member 'TABP_HorseRiding_Ground::FAnimBlueprintGeneratedConstantData::__IntProperty_197' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_Ground::FAnimBlueprintGeneratedConstantData, __NameProperty_198) == 0x000044, "Member 'TABP_HorseRiding_Ground::FAnimBlueprintGeneratedConstantData::__NameProperty_198' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_Ground::FAnimBlueprintGeneratedConstantData, __IntProperty_199) == 0x00004C, "Member 'TABP_HorseRiding_Ground::FAnimBlueprintGeneratedConstantData::__IntProperty_199' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_Ground::FAnimBlueprintGeneratedConstantData, __NameProperty_200) == 0x000050, "Member 'TABP_HorseRiding_Ground::FAnimBlueprintGeneratedConstantData::__NameProperty_200' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_Ground::FAnimBlueprintGeneratedConstantData, __IntProperty_201) == 0x000058, "Member 'TABP_HorseRiding_Ground::FAnimBlueprintGeneratedConstantData::__IntProperty_201' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_Ground::FAnimBlueprintGeneratedConstantData, __BoolProperty_202) == 0x00005C, "Member 'TABP_HorseRiding_Ground::FAnimBlueprintGeneratedConstantData::__BoolProperty_202' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_Ground::FAnimBlueprintGeneratedConstantData, __FloatProperty_203) == 0x000060, "Member 'TABP_HorseRiding_Ground::FAnimBlueprintGeneratedConstantData::__FloatProperty_203' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_Ground::FAnimBlueprintGeneratedConstantData, __StructProperty_204) == 0x000064, "Member 'TABP_HorseRiding_Ground::FAnimBlueprintGeneratedConstantData::__StructProperty_204' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_Ground::FAnimBlueprintGeneratedConstantData, __FloatProperty_205) == 0x000090, "Member 'TABP_HorseRiding_Ground::FAnimBlueprintGeneratedConstantData::__FloatProperty_205' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_Ground::FAnimBlueprintGeneratedConstantData, __EnumProperty_206) == 0x000094, "Member 'TABP_HorseRiding_Ground::FAnimBlueprintGeneratedConstantData::__EnumProperty_206' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_Ground::FAnimBlueprintGeneratedConstantData, __ByteProperty_207) == 0x000095, "Member 'TABP_HorseRiding_Ground::FAnimBlueprintGeneratedConstantData::__ByteProperty_207' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_Ground::FAnimBlueprintGeneratedConstantData, __NameProperty_208) == 0x000098, "Member 'TABP_HorseRiding_Ground::FAnimBlueprintGeneratedConstantData::__NameProperty_208' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_Ground::FAnimBlueprintGeneratedConstantData, __IntProperty_209) == 0x0000A0, "Member 'TABP_HorseRiding_Ground::FAnimBlueprintGeneratedConstantData::__IntProperty_209' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_Ground::FAnimBlueprintGeneratedConstantData, __BlendProfile_210) == 0x0000A8, "Member 'TABP_HorseRiding_Ground::FAnimBlueprintGeneratedConstantData::__BlendProfile_210' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_Ground::FAnimBlueprintGeneratedConstantData, __CurveFloat_211) == 0x0000B0, "Member 'TABP_HorseRiding_Ground::FAnimBlueprintGeneratedConstantData::__CurveFloat_211' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_Ground::FAnimBlueprintGeneratedConstantData, __BoolProperty_212) == 0x0000B8, "Member 'TABP_HorseRiding_Ground::FAnimBlueprintGeneratedConstantData::__BoolProperty_212' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_Ground::FAnimBlueprintGeneratedConstantData, __EnumProperty_213) == 0x0000B9, "Member 'TABP_HorseRiding_Ground::FAnimBlueprintGeneratedConstantData::__EnumProperty_213' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_Ground::FAnimBlueprintGeneratedConstantData, __EnumProperty_214) == 0x0000BA, "Member 'TABP_HorseRiding_Ground::FAnimBlueprintGeneratedConstantData::__EnumProperty_214' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_Ground::FAnimBlueprintGeneratedConstantData, __ArrayProperty_215) == 0x0000C0, "Member 'TABP_HorseRiding_Ground::FAnimBlueprintGeneratedConstantData::__ArrayProperty_215' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_Ground::FAnimBlueprintGeneratedConstantData, __StructProperty_216) == 0x0000D0, "Member 'TABP_HorseRiding_Ground::FAnimBlueprintGeneratedConstantData::__StructProperty_216' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_Ground::FAnimBlueprintGeneratedConstantData, __NameProperty_217) == 0x0000F0, "Member 'TABP_HorseRiding_Ground::FAnimBlueprintGeneratedConstantData::__NameProperty_217' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_Ground::FAnimBlueprintGeneratedConstantData, __NameProperty_218) == 0x0000F8, "Member 'TABP_HorseRiding_Ground::FAnimBlueprintGeneratedConstantData::__NameProperty_218' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_Ground::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000100, "Member 'TABP_HorseRiding_Ground::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_Ground::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000180, "Member 'TABP_HorseRiding_Ground::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct TABP_HorseRiding_Ground.TABP_HorseRiding_Ground_C.AnimBlueprintGeneratedMutableData
// 0x0037 (0x0038 - 0x0001)
struct TABP_HorseRiding_Ground::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_0;                                  // 0x0008(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_1;                                 // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_2;                                 // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_3;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_4;                                 // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_5;                                 // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_6;                                 // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_7;                                 // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_8;                                 // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_9;                                 // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_10;                                // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_11;                                 // 0x0034(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TABP_HorseRiding_Ground::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on TABP_HorseRiding_Ground::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(TABP_HorseRiding_Ground::FAnimBlueprintGeneratedMutableData) == 0x000038, "Wrong size on TABP_HorseRiding_Ground::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(TABP_HorseRiding_Ground::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'TABP_HorseRiding_Ground::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_Ground::FAnimBlueprintGeneratedMutableData, __BoolProperty_0) == 0x000008, "Member 'TABP_HorseRiding_Ground::FAnimBlueprintGeneratedMutableData::__BoolProperty_0' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_Ground::FAnimBlueprintGeneratedMutableData, __FloatProperty_1) == 0x00000C, "Member 'TABP_HorseRiding_Ground::FAnimBlueprintGeneratedMutableData::__FloatProperty_1' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_Ground::FAnimBlueprintGeneratedMutableData, __FloatProperty_2) == 0x000010, "Member 'TABP_HorseRiding_Ground::FAnimBlueprintGeneratedMutableData::__FloatProperty_2' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_Ground::FAnimBlueprintGeneratedMutableData, __FloatProperty_3) == 0x000014, "Member 'TABP_HorseRiding_Ground::FAnimBlueprintGeneratedMutableData::__FloatProperty_3' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_Ground::FAnimBlueprintGeneratedMutableData, __FloatProperty_4) == 0x000018, "Member 'TABP_HorseRiding_Ground::FAnimBlueprintGeneratedMutableData::__FloatProperty_4' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_Ground::FAnimBlueprintGeneratedMutableData, __FloatProperty_5) == 0x00001C, "Member 'TABP_HorseRiding_Ground::FAnimBlueprintGeneratedMutableData::__FloatProperty_5' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_Ground::FAnimBlueprintGeneratedMutableData, __FloatProperty_6) == 0x000020, "Member 'TABP_HorseRiding_Ground::FAnimBlueprintGeneratedMutableData::__FloatProperty_6' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_Ground::FAnimBlueprintGeneratedMutableData, __FloatProperty_7) == 0x000024, "Member 'TABP_HorseRiding_Ground::FAnimBlueprintGeneratedMutableData::__FloatProperty_7' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_Ground::FAnimBlueprintGeneratedMutableData, __FloatProperty_8) == 0x000028, "Member 'TABP_HorseRiding_Ground::FAnimBlueprintGeneratedMutableData::__FloatProperty_8' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_Ground::FAnimBlueprintGeneratedMutableData, __FloatProperty_9) == 0x00002C, "Member 'TABP_HorseRiding_Ground::FAnimBlueprintGeneratedMutableData::__FloatProperty_9' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_Ground::FAnimBlueprintGeneratedMutableData, __FloatProperty_10) == 0x000030, "Member 'TABP_HorseRiding_Ground::FAnimBlueprintGeneratedMutableData::__FloatProperty_10' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_Ground::FAnimBlueprintGeneratedMutableData, __BoolProperty_11) == 0x000034, "Member 'TABP_HorseRiding_Ground::FAnimBlueprintGeneratedMutableData::__BoolProperty_11' has a wrong offset!");

}

