#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TABP_HorseJump

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct TABP_HorseJump.TABP_HorseJump_C.AnimBlueprintGeneratedConstantData
// 0x01BF (0x01C0 - 0x0001)
struct TABP_HorseJump::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_292;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_293;                                // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_294;                                // 0x0014(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_295;                                 // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_296;                                // 0x0020(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_297;                                // 0x0028(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_298;                                 // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_299;                                // 0x0034(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_300;                                // 0x0035(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_301;                                // 0x0038(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_302;                                // 0x0040(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_303;                                 // 0x0048(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_304;                                // 0x004C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_305;                                 // 0x0054(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_306;                               // 0x0058(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_307;                              // 0x005C(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_308;                               // 0x0088(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_309;                                // 0x008C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_310;                                // 0x008D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8E[0x2];                                       // 0x008E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_311;                                // 0x0090(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_312;                                // 0x0098(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_313;                                // 0x00A0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_314;                              // 0x00A8(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimNodeFunctionRef                   __StructProperty_315;                              // 0x00C8(0x0020)(BlueprintVisible, NoDestructor)
	int32                                         __IntProperty_316;                                 // 0x00E8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_317;                                // 0x00EC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_318;                                // 0x00F4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_319;                              // 0x0100(0x0020)(BlueprintVisible, NoDestructor)
	ERefPoseType                                  __ByteProperty_320;                                // 0x0120(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0128(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x01A8(0x0018)()
};
static_assert(alignof(TABP_HorseJump::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on TABP_HorseJump::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(TABP_HorseJump::FAnimBlueprintGeneratedConstantData) == 0x0001C0, "Wrong size on TABP_HorseJump::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(TABP_HorseJump::FAnimBlueprintGeneratedConstantData, __NameProperty_292) == 0x000004, "Member 'TABP_HorseJump::FAnimBlueprintGeneratedConstantData::__NameProperty_292' has a wrong offset!");
static_assert(offsetof(TABP_HorseJump::FAnimBlueprintGeneratedConstantData, __NameProperty_293) == 0x00000C, "Member 'TABP_HorseJump::FAnimBlueprintGeneratedConstantData::__NameProperty_293' has a wrong offset!");
static_assert(offsetof(TABP_HorseJump::FAnimBlueprintGeneratedConstantData, __NameProperty_294) == 0x000014, "Member 'TABP_HorseJump::FAnimBlueprintGeneratedConstantData::__NameProperty_294' has a wrong offset!");
static_assert(offsetof(TABP_HorseJump::FAnimBlueprintGeneratedConstantData, __IntProperty_295) == 0x00001C, "Member 'TABP_HorseJump::FAnimBlueprintGeneratedConstantData::__IntProperty_295' has a wrong offset!");
static_assert(offsetof(TABP_HorseJump::FAnimBlueprintGeneratedConstantData, __NameProperty_296) == 0x000020, "Member 'TABP_HorseJump::FAnimBlueprintGeneratedConstantData::__NameProperty_296' has a wrong offset!");
static_assert(offsetof(TABP_HorseJump::FAnimBlueprintGeneratedConstantData, __NameProperty_297) == 0x000028, "Member 'TABP_HorseJump::FAnimBlueprintGeneratedConstantData::__NameProperty_297' has a wrong offset!");
static_assert(offsetof(TABP_HorseJump::FAnimBlueprintGeneratedConstantData, __IntProperty_298) == 0x000030, "Member 'TABP_HorseJump::FAnimBlueprintGeneratedConstantData::__IntProperty_298' has a wrong offset!");
static_assert(offsetof(TABP_HorseJump::FAnimBlueprintGeneratedConstantData, __BoolProperty_299) == 0x000034, "Member 'TABP_HorseJump::FAnimBlueprintGeneratedConstantData::__BoolProperty_299' has a wrong offset!");
static_assert(offsetof(TABP_HorseJump::FAnimBlueprintGeneratedConstantData, __EnumProperty_300) == 0x000035, "Member 'TABP_HorseJump::FAnimBlueprintGeneratedConstantData::__EnumProperty_300' has a wrong offset!");
static_assert(offsetof(TABP_HorseJump::FAnimBlueprintGeneratedConstantData, __NameProperty_301) == 0x000038, "Member 'TABP_HorseJump::FAnimBlueprintGeneratedConstantData::__NameProperty_301' has a wrong offset!");
static_assert(offsetof(TABP_HorseJump::FAnimBlueprintGeneratedConstantData, __NameProperty_302) == 0x000040, "Member 'TABP_HorseJump::FAnimBlueprintGeneratedConstantData::__NameProperty_302' has a wrong offset!");
static_assert(offsetof(TABP_HorseJump::FAnimBlueprintGeneratedConstantData, __IntProperty_303) == 0x000048, "Member 'TABP_HorseJump::FAnimBlueprintGeneratedConstantData::__IntProperty_303' has a wrong offset!");
static_assert(offsetof(TABP_HorseJump::FAnimBlueprintGeneratedConstantData, __NameProperty_304) == 0x00004C, "Member 'TABP_HorseJump::FAnimBlueprintGeneratedConstantData::__NameProperty_304' has a wrong offset!");
static_assert(offsetof(TABP_HorseJump::FAnimBlueprintGeneratedConstantData, __IntProperty_305) == 0x000054, "Member 'TABP_HorseJump::FAnimBlueprintGeneratedConstantData::__IntProperty_305' has a wrong offset!");
static_assert(offsetof(TABP_HorseJump::FAnimBlueprintGeneratedConstantData, __FloatProperty_306) == 0x000058, "Member 'TABP_HorseJump::FAnimBlueprintGeneratedConstantData::__FloatProperty_306' has a wrong offset!");
static_assert(offsetof(TABP_HorseJump::FAnimBlueprintGeneratedConstantData, __StructProperty_307) == 0x00005C, "Member 'TABP_HorseJump::FAnimBlueprintGeneratedConstantData::__StructProperty_307' has a wrong offset!");
static_assert(offsetof(TABP_HorseJump::FAnimBlueprintGeneratedConstantData, __FloatProperty_308) == 0x000088, "Member 'TABP_HorseJump::FAnimBlueprintGeneratedConstantData::__FloatProperty_308' has a wrong offset!");
static_assert(offsetof(TABP_HorseJump::FAnimBlueprintGeneratedConstantData, __BoolProperty_309) == 0x00008C, "Member 'TABP_HorseJump::FAnimBlueprintGeneratedConstantData::__BoolProperty_309' has a wrong offset!");
static_assert(offsetof(TABP_HorseJump::FAnimBlueprintGeneratedConstantData, __EnumProperty_310) == 0x00008D, "Member 'TABP_HorseJump::FAnimBlueprintGeneratedConstantData::__EnumProperty_310' has a wrong offset!");
static_assert(offsetof(TABP_HorseJump::FAnimBlueprintGeneratedConstantData, __NameProperty_311) == 0x000090, "Member 'TABP_HorseJump::FAnimBlueprintGeneratedConstantData::__NameProperty_311' has a wrong offset!");
static_assert(offsetof(TABP_HorseJump::FAnimBlueprintGeneratedConstantData, __NameProperty_312) == 0x000098, "Member 'TABP_HorseJump::FAnimBlueprintGeneratedConstantData::__NameProperty_312' has a wrong offset!");
static_assert(offsetof(TABP_HorseJump::FAnimBlueprintGeneratedConstantData, __NameProperty_313) == 0x0000A0, "Member 'TABP_HorseJump::FAnimBlueprintGeneratedConstantData::__NameProperty_313' has a wrong offset!");
static_assert(offsetof(TABP_HorseJump::FAnimBlueprintGeneratedConstantData, __StructProperty_314) == 0x0000A8, "Member 'TABP_HorseJump::FAnimBlueprintGeneratedConstantData::__StructProperty_314' has a wrong offset!");
static_assert(offsetof(TABP_HorseJump::FAnimBlueprintGeneratedConstantData, __StructProperty_315) == 0x0000C8, "Member 'TABP_HorseJump::FAnimBlueprintGeneratedConstantData::__StructProperty_315' has a wrong offset!");
static_assert(offsetof(TABP_HorseJump::FAnimBlueprintGeneratedConstantData, __IntProperty_316) == 0x0000E8, "Member 'TABP_HorseJump::FAnimBlueprintGeneratedConstantData::__IntProperty_316' has a wrong offset!");
static_assert(offsetof(TABP_HorseJump::FAnimBlueprintGeneratedConstantData, __NameProperty_317) == 0x0000EC, "Member 'TABP_HorseJump::FAnimBlueprintGeneratedConstantData::__NameProperty_317' has a wrong offset!");
static_assert(offsetof(TABP_HorseJump::FAnimBlueprintGeneratedConstantData, __NameProperty_318) == 0x0000F4, "Member 'TABP_HorseJump::FAnimBlueprintGeneratedConstantData::__NameProperty_318' has a wrong offset!");
static_assert(offsetof(TABP_HorseJump::FAnimBlueprintGeneratedConstantData, __StructProperty_319) == 0x000100, "Member 'TABP_HorseJump::FAnimBlueprintGeneratedConstantData::__StructProperty_319' has a wrong offset!");
static_assert(offsetof(TABP_HorseJump::FAnimBlueprintGeneratedConstantData, __ByteProperty_320) == 0x000120, "Member 'TABP_HorseJump::FAnimBlueprintGeneratedConstantData::__ByteProperty_320' has a wrong offset!");
static_assert(offsetof(TABP_HorseJump::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000128, "Member 'TABP_HorseJump::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(TABP_HorseJump::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0001A8, "Member 'TABP_HorseJump::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct TABP_HorseJump.TABP_HorseJump_C.AnimBlueprintGeneratedMutableData
// 0x0007 (0x0008 - 0x0001)
struct TABP_HorseJump::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TABP_HorseJump::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on TABP_HorseJump::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(TABP_HorseJump::FAnimBlueprintGeneratedMutableData) == 0x000008, "Wrong size on TABP_HorseJump::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(TABP_HorseJump::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'TABP_HorseJump::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");

}

