#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TABP_LocomotionStanding

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct TABP_LocomotionStanding.TABP_LocomotionStanding_C.AnimBlueprintGeneratedConstantData
// 0x016F (0x0170 - 0x0001)
struct TABP_LocomotionStanding::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_82;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_83;                               // 0x000C(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_84;                                // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_85;                                 // 0x003C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_86;                                // 0x0040(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_87;                                 // 0x0050(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_88;                                  // 0x0058(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_89;                                // 0x005C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_90;                                 // 0x0060(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_91;                                 // 0x0061(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_92;                                 // 0x0064(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_93;                                 // 0x006C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_94;                                  // 0x0074(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendProfile*                          __BlendProfile_95;                                 // 0x0078(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_96;                                   // 0x0080(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_97;                                 // 0x0088(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_98;                                 // 0x0089(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_99;                                 // 0x008A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8B[0x5];                                       // 0x008B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_100;                               // 0x0090(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_101;                                // 0x00A0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_102;                                // 0x00A8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_103;                              // 0x00B0(0x0020)(BlueprintVisible, NoDestructor)
	ERefPoseType                                  __ByteProperty_104;                                // 0x00D0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00D8(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0158(0x0018)()
};
static_assert(alignof(TABP_LocomotionStanding::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on TABP_LocomotionStanding::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(TABP_LocomotionStanding::FAnimBlueprintGeneratedConstantData) == 0x000170, "Wrong size on TABP_LocomotionStanding::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(TABP_LocomotionStanding::FAnimBlueprintGeneratedConstantData, __NameProperty_82) == 0x000004, "Member 'TABP_LocomotionStanding::FAnimBlueprintGeneratedConstantData::__NameProperty_82' has a wrong offset!");
static_assert(offsetof(TABP_LocomotionStanding::FAnimBlueprintGeneratedConstantData, __StructProperty_83) == 0x00000C, "Member 'TABP_LocomotionStanding::FAnimBlueprintGeneratedConstantData::__StructProperty_83' has a wrong offset!");
static_assert(offsetof(TABP_LocomotionStanding::FAnimBlueprintGeneratedConstantData, __FloatProperty_84) == 0x000038, "Member 'TABP_LocomotionStanding::FAnimBlueprintGeneratedConstantData::__FloatProperty_84' has a wrong offset!");
static_assert(offsetof(TABP_LocomotionStanding::FAnimBlueprintGeneratedConstantData, __EnumProperty_85) == 0x00003C, "Member 'TABP_LocomotionStanding::FAnimBlueprintGeneratedConstantData::__EnumProperty_85' has a wrong offset!");
static_assert(offsetof(TABP_LocomotionStanding::FAnimBlueprintGeneratedConstantData, __ArrayProperty_86) == 0x000040, "Member 'TABP_LocomotionStanding::FAnimBlueprintGeneratedConstantData::__ArrayProperty_86' has a wrong offset!");
static_assert(offsetof(TABP_LocomotionStanding::FAnimBlueprintGeneratedConstantData, __NameProperty_87) == 0x000050, "Member 'TABP_LocomotionStanding::FAnimBlueprintGeneratedConstantData::__NameProperty_87' has a wrong offset!");
static_assert(offsetof(TABP_LocomotionStanding::FAnimBlueprintGeneratedConstantData, __IntProperty_88) == 0x000058, "Member 'TABP_LocomotionStanding::FAnimBlueprintGeneratedConstantData::__IntProperty_88' has a wrong offset!");
static_assert(offsetof(TABP_LocomotionStanding::FAnimBlueprintGeneratedConstantData, __FloatProperty_89) == 0x00005C, "Member 'TABP_LocomotionStanding::FAnimBlueprintGeneratedConstantData::__FloatProperty_89' has a wrong offset!");
static_assert(offsetof(TABP_LocomotionStanding::FAnimBlueprintGeneratedConstantData, __BoolProperty_90) == 0x000060, "Member 'TABP_LocomotionStanding::FAnimBlueprintGeneratedConstantData::__BoolProperty_90' has a wrong offset!");
static_assert(offsetof(TABP_LocomotionStanding::FAnimBlueprintGeneratedConstantData, __EnumProperty_91) == 0x000061, "Member 'TABP_LocomotionStanding::FAnimBlueprintGeneratedConstantData::__EnumProperty_91' has a wrong offset!");
static_assert(offsetof(TABP_LocomotionStanding::FAnimBlueprintGeneratedConstantData, __NameProperty_92) == 0x000064, "Member 'TABP_LocomotionStanding::FAnimBlueprintGeneratedConstantData::__NameProperty_92' has a wrong offset!");
static_assert(offsetof(TABP_LocomotionStanding::FAnimBlueprintGeneratedConstantData, __NameProperty_93) == 0x00006C, "Member 'TABP_LocomotionStanding::FAnimBlueprintGeneratedConstantData::__NameProperty_93' has a wrong offset!");
static_assert(offsetof(TABP_LocomotionStanding::FAnimBlueprintGeneratedConstantData, __IntProperty_94) == 0x000074, "Member 'TABP_LocomotionStanding::FAnimBlueprintGeneratedConstantData::__IntProperty_94' has a wrong offset!");
static_assert(offsetof(TABP_LocomotionStanding::FAnimBlueprintGeneratedConstantData, __BlendProfile_95) == 0x000078, "Member 'TABP_LocomotionStanding::FAnimBlueprintGeneratedConstantData::__BlendProfile_95' has a wrong offset!");
static_assert(offsetof(TABP_LocomotionStanding::FAnimBlueprintGeneratedConstantData, __CurveFloat_96) == 0x000080, "Member 'TABP_LocomotionStanding::FAnimBlueprintGeneratedConstantData::__CurveFloat_96' has a wrong offset!");
static_assert(offsetof(TABP_LocomotionStanding::FAnimBlueprintGeneratedConstantData, __BoolProperty_97) == 0x000088, "Member 'TABP_LocomotionStanding::FAnimBlueprintGeneratedConstantData::__BoolProperty_97' has a wrong offset!");
static_assert(offsetof(TABP_LocomotionStanding::FAnimBlueprintGeneratedConstantData, __EnumProperty_98) == 0x000089, "Member 'TABP_LocomotionStanding::FAnimBlueprintGeneratedConstantData::__EnumProperty_98' has a wrong offset!");
static_assert(offsetof(TABP_LocomotionStanding::FAnimBlueprintGeneratedConstantData, __EnumProperty_99) == 0x00008A, "Member 'TABP_LocomotionStanding::FAnimBlueprintGeneratedConstantData::__EnumProperty_99' has a wrong offset!");
static_assert(offsetof(TABP_LocomotionStanding::FAnimBlueprintGeneratedConstantData, __ArrayProperty_100) == 0x000090, "Member 'TABP_LocomotionStanding::FAnimBlueprintGeneratedConstantData::__ArrayProperty_100' has a wrong offset!");
static_assert(offsetof(TABP_LocomotionStanding::FAnimBlueprintGeneratedConstantData, __NameProperty_101) == 0x0000A0, "Member 'TABP_LocomotionStanding::FAnimBlueprintGeneratedConstantData::__NameProperty_101' has a wrong offset!");
static_assert(offsetof(TABP_LocomotionStanding::FAnimBlueprintGeneratedConstantData, __NameProperty_102) == 0x0000A8, "Member 'TABP_LocomotionStanding::FAnimBlueprintGeneratedConstantData::__NameProperty_102' has a wrong offset!");
static_assert(offsetof(TABP_LocomotionStanding::FAnimBlueprintGeneratedConstantData, __StructProperty_103) == 0x0000B0, "Member 'TABP_LocomotionStanding::FAnimBlueprintGeneratedConstantData::__StructProperty_103' has a wrong offset!");
static_assert(offsetof(TABP_LocomotionStanding::FAnimBlueprintGeneratedConstantData, __ByteProperty_104) == 0x0000D0, "Member 'TABP_LocomotionStanding::FAnimBlueprintGeneratedConstantData::__ByteProperty_104' has a wrong offset!");
static_assert(offsetof(TABP_LocomotionStanding::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000D8, "Member 'TABP_LocomotionStanding::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(TABP_LocomotionStanding::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000158, "Member 'TABP_LocomotionStanding::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct TABP_LocomotionStanding.TABP_LocomotionStanding_C.AnimBlueprintGeneratedMutableData
// 0x001F (0x0020 - 0x0001)
struct TABP_LocomotionStanding::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_0;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_1;                                  // 0x000C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_2;                                 // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_3;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_4;                                 // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_5;                                  // 0x001C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TABP_LocomotionStanding::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on TABP_LocomotionStanding::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(TABP_LocomotionStanding::FAnimBlueprintGeneratedMutableData) == 0x000020, "Wrong size on TABP_LocomotionStanding::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(TABP_LocomotionStanding::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'TABP_LocomotionStanding::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");
static_assert(offsetof(TABP_LocomotionStanding::FAnimBlueprintGeneratedMutableData, __FloatProperty_0) == 0x000008, "Member 'TABP_LocomotionStanding::FAnimBlueprintGeneratedMutableData::__FloatProperty_0' has a wrong offset!");
static_assert(offsetof(TABP_LocomotionStanding::FAnimBlueprintGeneratedMutableData, __BoolProperty_1) == 0x00000C, "Member 'TABP_LocomotionStanding::FAnimBlueprintGeneratedMutableData::__BoolProperty_1' has a wrong offset!");
static_assert(offsetof(TABP_LocomotionStanding::FAnimBlueprintGeneratedMutableData, __FloatProperty_2) == 0x000010, "Member 'TABP_LocomotionStanding::FAnimBlueprintGeneratedMutableData::__FloatProperty_2' has a wrong offset!");
static_assert(offsetof(TABP_LocomotionStanding::FAnimBlueprintGeneratedMutableData, __FloatProperty_3) == 0x000014, "Member 'TABP_LocomotionStanding::FAnimBlueprintGeneratedMutableData::__FloatProperty_3' has a wrong offset!");
static_assert(offsetof(TABP_LocomotionStanding::FAnimBlueprintGeneratedMutableData, __FloatProperty_4) == 0x000018, "Member 'TABP_LocomotionStanding::FAnimBlueprintGeneratedMutableData::__FloatProperty_4' has a wrong offset!");
static_assert(offsetof(TABP_LocomotionStanding::FAnimBlueprintGeneratedMutableData, __BoolProperty_5) == 0x00001C, "Member 'TABP_LocomotionStanding::FAnimBlueprintGeneratedMutableData::__BoolProperty_5' has a wrong offset!");

}

