#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TABP_LookAt

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function TABP_LookAt.TABP_LookAt_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct TABP_LookAt_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(TABP_LookAt_C_AnimGraph) == 0x000008, "Wrong alignment on TABP_LookAt_C_AnimGraph");
static_assert(sizeof(TABP_LookAt_C_AnimGraph) == 0x000010, "Wrong size on TABP_LookAt_C_AnimGraph");
static_assert(offsetof(TABP_LookAt_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'TABP_LookAt_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function TABP_LookAt.TABP_LookAt_C.ExecuteUbergraph_TABP_LookAt
// 0x0008 (0x0008 - 0x0000)
struct TABP_LookAt_C_ExecuteUbergraph_TABP_LookAt final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSitting_ReturnValue;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TABP_LookAt_C_ExecuteUbergraph_TABP_LookAt) == 0x000004, "Wrong alignment on TABP_LookAt_C_ExecuteUbergraph_TABP_LookAt");
static_assert(sizeof(TABP_LookAt_C_ExecuteUbergraph_TABP_LookAt) == 0x000008, "Wrong size on TABP_LookAt_C_ExecuteUbergraph_TABP_LookAt");
static_assert(offsetof(TABP_LookAt_C_ExecuteUbergraph_TABP_LookAt, EntryPoint) == 0x000000, "Member 'TABP_LookAt_C_ExecuteUbergraph_TABP_LookAt::EntryPoint' has a wrong offset!");
static_assert(offsetof(TABP_LookAt_C_ExecuteUbergraph_TABP_LookAt, CallFunc_IsSitting_ReturnValue) == 0x000004, "Member 'TABP_LookAt_C_ExecuteUbergraph_TABP_LookAt::CallFunc_IsSitting_ReturnValue' has a wrong offset!");

// Function TABP_LookAt.TABP_LookAt_C.LookAtLayer
// 0x0020 (0x0020 - 0x0000)
struct TABP_LookAt_C_LookAtLayer final
{
public:
	struct FPoseLink                              AnimationPose;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              LookAtLayer_0;                                     // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(TABP_LookAt_C_LookAtLayer) == 0x000008, "Wrong alignment on TABP_LookAt_C_LookAtLayer");
static_assert(sizeof(TABP_LookAt_C_LookAtLayer) == 0x000020, "Wrong size on TABP_LookAt_C_LookAtLayer");
static_assert(offsetof(TABP_LookAt_C_LookAtLayer, AnimationPose) == 0x000000, "Member 'TABP_LookAt_C_LookAtLayer::AnimationPose' has a wrong offset!");
static_assert(offsetof(TABP_LookAt_C_LookAtLayer, LookAtLayer_0) == 0x000010, "Member 'TABP_LookAt_C_LookAtLayer::LookAtLayer_0' has a wrong offset!");

}

