#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TABP_EnhancedLocomotionSystem

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct TABP_EnhancedLocomotionSystem.TABP_EnhancedLocomotionSystem_C.AnimBlueprintGeneratedConstantData
// 0x01F7 (0x01F8 - 0x0001)
struct TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_319;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_320;                               // 0x0010(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_321;                                // 0x0020(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_322;                              // 0x0028(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimNodeFunctionRef                   __StructProperty_323;                              // 0x0048(0x0020)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_324;                               // 0x0068(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_325;                                // 0x006C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_326;                                // 0x0074(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_327;                                 // 0x007C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_328;                              // 0x0080(0x0020)(BlueprintVisible, NoDestructor)
	struct FInputScaleBiasClampConstants          __StructProperty_329;                              // 0x00A0(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_330;                               // 0x00CC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_331;                                // 0x00D0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_332;                                // 0x00D4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_333;                                 // 0x00DC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_334;                                // 0x00E0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_335;                                 // 0x00E8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_336;                               // 0x00F0(0x0010)(BlueprintVisible, EditFixedSize)
	class UBlendProfile*                          __BlendProfile_337;                                // 0x0100(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_338;                                  // 0x0108(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_339;                                // 0x0110(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_340;                                // 0x0111(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_341;                                // 0x0112(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_113[0x5];                                      // 0x0113(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_342;                               // 0x0118(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_343;                                // 0x0128(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_344;                                // 0x0130(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_345;                              // 0x0138(0x0020)(BlueprintVisible, NoDestructor)
	ERefPoseType                                  __ByteProperty_346;                                // 0x0158(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0160(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x01E0(0x0018)()
};
static_assert(alignof(TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedConstantData) == 0x0001F8, "Wrong size on TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedConstantData, __NameProperty_319) == 0x000004, "Member 'TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedConstantData::__NameProperty_319' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedConstantData, __ArrayProperty_320) == 0x000010, "Member 'TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedConstantData::__ArrayProperty_320' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedConstantData, __NameProperty_321) == 0x000020, "Member 'TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedConstantData::__NameProperty_321' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedConstantData, __StructProperty_322) == 0x000028, "Member 'TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedConstantData::__StructProperty_322' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedConstantData, __StructProperty_323) == 0x000048, "Member 'TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedConstantData::__StructProperty_323' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedConstantData, __FloatProperty_324) == 0x000068, "Member 'TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedConstantData::__FloatProperty_324' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedConstantData, __NameProperty_325) == 0x00006C, "Member 'TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedConstantData::__NameProperty_325' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedConstantData, __NameProperty_326) == 0x000074, "Member 'TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedConstantData::__NameProperty_326' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedConstantData, __IntProperty_327) == 0x00007C, "Member 'TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedConstantData::__IntProperty_327' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedConstantData, __StructProperty_328) == 0x000080, "Member 'TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedConstantData::__StructProperty_328' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedConstantData, __StructProperty_329) == 0x0000A0, "Member 'TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedConstantData::__StructProperty_329' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedConstantData, __FloatProperty_330) == 0x0000CC, "Member 'TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedConstantData::__FloatProperty_330' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedConstantData, __EnumProperty_331) == 0x0000D0, "Member 'TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedConstantData::__EnumProperty_331' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedConstantData, __NameProperty_332) == 0x0000D4, "Member 'TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedConstantData::__NameProperty_332' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedConstantData, __IntProperty_333) == 0x0000DC, "Member 'TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedConstantData::__IntProperty_333' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedConstantData, __NameProperty_334) == 0x0000E0, "Member 'TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedConstantData::__NameProperty_334' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedConstantData, __IntProperty_335) == 0x0000E8, "Member 'TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedConstantData::__IntProperty_335' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedConstantData, __ArrayProperty_336) == 0x0000F0, "Member 'TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedConstantData::__ArrayProperty_336' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedConstantData, __BlendProfile_337) == 0x000100, "Member 'TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedConstantData::__BlendProfile_337' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedConstantData, __CurveFloat_338) == 0x000108, "Member 'TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedConstantData::__CurveFloat_338' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedConstantData, __BoolProperty_339) == 0x000110, "Member 'TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedConstantData::__BoolProperty_339' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedConstantData, __EnumProperty_340) == 0x000111, "Member 'TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedConstantData::__EnumProperty_340' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedConstantData, __EnumProperty_341) == 0x000112, "Member 'TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedConstantData::__EnumProperty_341' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedConstantData, __ArrayProperty_342) == 0x000118, "Member 'TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedConstantData::__ArrayProperty_342' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedConstantData, __NameProperty_343) == 0x000128, "Member 'TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedConstantData::__NameProperty_343' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedConstantData, __NameProperty_344) == 0x000130, "Member 'TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedConstantData::__NameProperty_344' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedConstantData, __StructProperty_345) == 0x000138, "Member 'TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedConstantData::__StructProperty_345' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedConstantData, __ByteProperty_346) == 0x000158, "Member 'TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedConstantData::__ByteProperty_346' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000160, "Member 'TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0001E0, "Member 'TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct TABP_EnhancedLocomotionSystem.TABP_EnhancedLocomotionSystem_C.AnimBlueprintGeneratedMutableData
// 0x0033 (0x0034 - 0x0001)
struct TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_0;                                  // 0x0002(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_1;                                 // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_2;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_3;                                  // 0x000C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_4;                                 // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_5;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_6;                                 // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_7;                                  // 0x001C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_8;                                 // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_9;                                 // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_10;                                // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_11;                                // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_12;                                 // 0x0030(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_13;                                 // 0x0031(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_14;                                 // 0x0032(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedMutableData) == 0x000034, "Wrong size on TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedMutableData, __BoolProperty_0) == 0x000002, "Member 'TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedMutableData::__BoolProperty_0' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedMutableData, __FloatProperty_1) == 0x000004, "Member 'TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedMutableData::__FloatProperty_1' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedMutableData, __FloatProperty_2) == 0x000008, "Member 'TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedMutableData::__FloatProperty_2' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedMutableData, __BoolProperty_3) == 0x00000C, "Member 'TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedMutableData::__BoolProperty_3' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedMutableData, __FloatProperty_4) == 0x000010, "Member 'TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedMutableData::__FloatProperty_4' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedMutableData, __FloatProperty_5) == 0x000014, "Member 'TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedMutableData::__FloatProperty_5' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedMutableData, __FloatProperty_6) == 0x000018, "Member 'TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedMutableData::__FloatProperty_6' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedMutableData, __BoolProperty_7) == 0x00001C, "Member 'TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedMutableData::__BoolProperty_7' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedMutableData, __FloatProperty_8) == 0x000020, "Member 'TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedMutableData::__FloatProperty_8' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedMutableData, __FloatProperty_9) == 0x000024, "Member 'TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedMutableData::__FloatProperty_9' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedMutableData, __FloatProperty_10) == 0x000028, "Member 'TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedMutableData::__FloatProperty_10' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedMutableData, __FloatProperty_11) == 0x00002C, "Member 'TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedMutableData::__FloatProperty_11' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedMutableData, __BoolProperty_12) == 0x000030, "Member 'TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedMutableData::__BoolProperty_12' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedMutableData, __BoolProperty_13) == 0x000031, "Member 'TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedMutableData::__BoolProperty_13' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedMutableData, __BoolProperty_14) == 0x000032, "Member 'TABP_EnhancedLocomotionSystem::FAnimBlueprintGeneratedMutableData::__BoolProperty_14' has a wrong offset!");

}

