#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TABP_ConversationIdle

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "TABP_ConversationIdle_structs.hpp"
#include "Altar_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass TABP_ConversationIdle.TABP_ConversationIdle_C
// 0x0360 (0x0750 - 0x03F0)
class UTABP_ConversationIdle_C final : public UVConversationIdleAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct TABP_ConversationIdle::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;        // 0x03F8(0x0008)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0400(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0408(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x0410(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0430(0x00B8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x04E8(0x00C8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x05B0(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x05F8(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x0678(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x06A0(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x06C8(0x0048)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0710(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x0730(0x0010)()
	class USkeletalMeshComponent*                 SkelMeshComp;                                      // 0x0740(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CurrentAnimMontage;                                // 0x0748(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ConversationIdleLayer(const struct FPoseLink& InPose, struct FPoseLink* ConversationIdleLayer_0);
	void ExecuteUbergraph_TABP_ConversationIdle(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TABP_ConversationIdle_C">();
	}
	static class UTABP_ConversationIdle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTABP_ConversationIdle_C>();
	}
};
static_assert(alignof(UTABP_ConversationIdle_C) == 0x000010, "Wrong alignment on UTABP_ConversationIdle_C");
static_assert(sizeof(UTABP_ConversationIdle_C) == 0x000750, "Wrong size on UTABP_ConversationIdle_C");
static_assert(offsetof(UTABP_ConversationIdle_C, UberGraphFrame) == 0x0003F0, "Member 'UTABP_ConversationIdle_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTABP_ConversationIdle_C, __AnimBlueprintMutables) == 0x0003F8, "Member 'UTABP_ConversationIdle_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UTABP_ConversationIdle_C, AnimBlueprintExtension_PropertyAccess) == 0x000400, "Member 'UTABP_ConversationIdle_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UTABP_ConversationIdle_C, AnimBlueprintExtension_Base) == 0x000408, "Member 'UTABP_ConversationIdle_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UTABP_ConversationIdle_C, AnimGraphNode_Root_1) == 0x000410, "Member 'UTABP_ConversationIdle_C::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(UTABP_ConversationIdle_C, AnimGraphNode_LinkedInputPose) == 0x000430, "Member 'UTABP_ConversationIdle_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UTABP_ConversationIdle_C, AnimGraphNode_ApplyAdditive) == 0x0004E8, "Member 'UTABP_ConversationIdle_C::AnimGraphNode_ApplyAdditive' has a wrong offset!");
static_assert(offsetof(UTABP_ConversationIdle_C, AnimGraphNode_BlendListByBool) == 0x0005B0, "Member 'UTABP_ConversationIdle_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UTABP_ConversationIdle_C, AnimGraphNode_SaveCachedPose) == 0x0005F8, "Member 'UTABP_ConversationIdle_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UTABP_ConversationIdle_C, AnimGraphNode_UseCachedPose_1) == 0x000678, "Member 'UTABP_ConversationIdle_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UTABP_ConversationIdle_C, AnimGraphNode_UseCachedPose) == 0x0006A0, "Member 'UTABP_ConversationIdle_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UTABP_ConversationIdle_C, AnimGraphNode_SequencePlayer) == 0x0006C8, "Member 'UTABP_ConversationIdle_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UTABP_ConversationIdle_C, AnimGraphNode_Root) == 0x000710, "Member 'UTABP_ConversationIdle_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UTABP_ConversationIdle_C, AnimGraphNode_LocalRefPose) == 0x000730, "Member 'UTABP_ConversationIdle_C::AnimGraphNode_LocalRefPose' has a wrong offset!");
static_assert(offsetof(UTABP_ConversationIdle_C, SkelMeshComp) == 0x000740, "Member 'UTABP_ConversationIdle_C::SkelMeshComp' has a wrong offset!");
static_assert(offsetof(UTABP_ConversationIdle_C, CurrentAnimMontage) == 0x000748, "Member 'UTABP_ConversationIdle_C::CurrentAnimMontage' has a wrong offset!");

}

