#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TABP_HorseRiding_InAir

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function TABP_HorseRiding_InAir.TABP_HorseRiding_InAir_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct TABP_HorseRiding_InAir_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(TABP_HorseRiding_InAir_C_AnimGraph) == 0x000008, "Wrong alignment on TABP_HorseRiding_InAir_C_AnimGraph");
static_assert(sizeof(TABP_HorseRiding_InAir_C_AnimGraph) == 0x000010, "Wrong size on TABP_HorseRiding_InAir_C_AnimGraph");
static_assert(offsetof(TABP_HorseRiding_InAir_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'TABP_HorseRiding_InAir_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function TABP_HorseRiding_InAir.TABP_HorseRiding_InAir_C.ExecuteUbergraph_TABP_HorseRiding_InAir
// 0x0004 (0x0004 - 0x0000)
struct TABP_HorseRiding_InAir_C_ExecuteUbergraph_TABP_HorseRiding_InAir final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TABP_HorseRiding_InAir_C_ExecuteUbergraph_TABP_HorseRiding_InAir) == 0x000004, "Wrong alignment on TABP_HorseRiding_InAir_C_ExecuteUbergraph_TABP_HorseRiding_InAir");
static_assert(sizeof(TABP_HorseRiding_InAir_C_ExecuteUbergraph_TABP_HorseRiding_InAir) == 0x000004, "Wrong size on TABP_HorseRiding_InAir_C_ExecuteUbergraph_TABP_HorseRiding_InAir");
static_assert(offsetof(TABP_HorseRiding_InAir_C_ExecuteUbergraph_TABP_HorseRiding_InAir, EntryPoint) == 0x000000, "Member 'TABP_HorseRiding_InAir_C_ExecuteUbergraph_TABP_HorseRiding_InAir::EntryPoint' has a wrong offset!");

// Function TABP_HorseRiding_InAir.TABP_HorseRiding_InAir_C.HorseRidingInAirLayer
// 0x0020 (0x0020 - 0x0000)
struct TABP_HorseRiding_InAir_C_HorseRidingInAirLayer final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              HorseRidingInAirLayer_0;                           // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(TABP_HorseRiding_InAir_C_HorseRidingInAirLayer) == 0x000008, "Wrong alignment on TABP_HorseRiding_InAir_C_HorseRidingInAirLayer");
static_assert(sizeof(TABP_HorseRiding_InAir_C_HorseRidingInAirLayer) == 0x000020, "Wrong size on TABP_HorseRiding_InAir_C_HorseRidingInAirLayer");
static_assert(offsetof(TABP_HorseRiding_InAir_C_HorseRidingInAirLayer, InPose) == 0x000000, "Member 'TABP_HorseRiding_InAir_C_HorseRidingInAirLayer::InPose' has a wrong offset!");
static_assert(offsetof(TABP_HorseRiding_InAir_C_HorseRidingInAirLayer, HorseRidingInAirLayer_0) == 0x000010, "Member 'TABP_HorseRiding_InAir_C_HorseRidingInAirLayer::HorseRidingInAirLayer_0' has a wrong offset!");

}

