#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TABP_EnhancedLocomotionSneaking

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct TABP_EnhancedLocomotionSneaking.TABP_EnhancedLocomotionSneaking_C.AnimBlueprintGeneratedConstantData
// 0x0117 (0x0118 - 0x0001)
struct TABP_EnhancedLocomotionSneaking::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_27;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_28;                                 // 0x0010(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_29;                                   // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_30;                                 // 0x0020(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_31;                                 // 0x0021(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_32;                                // 0x0028(0x0010)(BlueprintVisible, EditFixedSize)
	float                                         __FloatProperty_33;                                // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_34;                                 // 0x003C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_35;                                 // 0x003D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_36;                                 // 0x003E(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_37;                                 // 0x003F(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_38;                                 // 0x0040(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_39;                                 // 0x0048(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_40;                                 // 0x0050(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_41;                               // 0x0058(0x0020)(BlueprintVisible, NoDestructor)
	ERefPoseType                                  __ByteProperty_42;                                 // 0x0078(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0080(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0100(0x0018)()
};
static_assert(alignof(TABP_EnhancedLocomotionSneaking::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on TABP_EnhancedLocomotionSneaking::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(TABP_EnhancedLocomotionSneaking::FAnimBlueprintGeneratedConstantData) == 0x000118, "Wrong size on TABP_EnhancedLocomotionSneaking::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(TABP_EnhancedLocomotionSneaking::FAnimBlueprintGeneratedConstantData, __NameProperty_27) == 0x000004, "Member 'TABP_EnhancedLocomotionSneaking::FAnimBlueprintGeneratedConstantData::__NameProperty_27' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionSneaking::FAnimBlueprintGeneratedConstantData, __BlendProfile_28) == 0x000010, "Member 'TABP_EnhancedLocomotionSneaking::FAnimBlueprintGeneratedConstantData::__BlendProfile_28' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionSneaking::FAnimBlueprintGeneratedConstantData, __CurveFloat_29) == 0x000018, "Member 'TABP_EnhancedLocomotionSneaking::FAnimBlueprintGeneratedConstantData::__CurveFloat_29' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionSneaking::FAnimBlueprintGeneratedConstantData, __EnumProperty_30) == 0x000020, "Member 'TABP_EnhancedLocomotionSneaking::FAnimBlueprintGeneratedConstantData::__EnumProperty_30' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionSneaking::FAnimBlueprintGeneratedConstantData, __EnumProperty_31) == 0x000021, "Member 'TABP_EnhancedLocomotionSneaking::FAnimBlueprintGeneratedConstantData::__EnumProperty_31' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionSneaking::FAnimBlueprintGeneratedConstantData, __ArrayProperty_32) == 0x000028, "Member 'TABP_EnhancedLocomotionSneaking::FAnimBlueprintGeneratedConstantData::__ArrayProperty_32' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionSneaking::FAnimBlueprintGeneratedConstantData, __FloatProperty_33) == 0x000038, "Member 'TABP_EnhancedLocomotionSneaking::FAnimBlueprintGeneratedConstantData::__FloatProperty_33' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionSneaking::FAnimBlueprintGeneratedConstantData, __BoolProperty_34) == 0x00003C, "Member 'TABP_EnhancedLocomotionSneaking::FAnimBlueprintGeneratedConstantData::__BoolProperty_34' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionSneaking::FAnimBlueprintGeneratedConstantData, __BoolProperty_35) == 0x00003D, "Member 'TABP_EnhancedLocomotionSneaking::FAnimBlueprintGeneratedConstantData::__BoolProperty_35' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionSneaking::FAnimBlueprintGeneratedConstantData, __EnumProperty_36) == 0x00003E, "Member 'TABP_EnhancedLocomotionSneaking::FAnimBlueprintGeneratedConstantData::__EnumProperty_36' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionSneaking::FAnimBlueprintGeneratedConstantData, __ByteProperty_37) == 0x00003F, "Member 'TABP_EnhancedLocomotionSneaking::FAnimBlueprintGeneratedConstantData::__ByteProperty_37' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionSneaking::FAnimBlueprintGeneratedConstantData, __NameProperty_38) == 0x000040, "Member 'TABP_EnhancedLocomotionSneaking::FAnimBlueprintGeneratedConstantData::__NameProperty_38' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionSneaking::FAnimBlueprintGeneratedConstantData, __NameProperty_39) == 0x000048, "Member 'TABP_EnhancedLocomotionSneaking::FAnimBlueprintGeneratedConstantData::__NameProperty_39' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionSneaking::FAnimBlueprintGeneratedConstantData, __NameProperty_40) == 0x000050, "Member 'TABP_EnhancedLocomotionSneaking::FAnimBlueprintGeneratedConstantData::__NameProperty_40' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionSneaking::FAnimBlueprintGeneratedConstantData, __StructProperty_41) == 0x000058, "Member 'TABP_EnhancedLocomotionSneaking::FAnimBlueprintGeneratedConstantData::__StructProperty_41' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionSneaking::FAnimBlueprintGeneratedConstantData, __ByteProperty_42) == 0x000078, "Member 'TABP_EnhancedLocomotionSneaking::FAnimBlueprintGeneratedConstantData::__ByteProperty_42' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionSneaking::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000080, "Member 'TABP_EnhancedLocomotionSneaking::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionSneaking::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000100, "Member 'TABP_EnhancedLocomotionSneaking::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct TABP_EnhancedLocomotionSneaking.TABP_EnhancedLocomotionSneaking_C.AnimBlueprintGeneratedMutableData
// 0x001B (0x001C - 0x0001)
struct TABP_EnhancedLocomotionSneaking::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_0;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_1;                                  // 0x000C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_2;                                 // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_3;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_4;                                 // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TABP_EnhancedLocomotionSneaking::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on TABP_EnhancedLocomotionSneaking::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(TABP_EnhancedLocomotionSneaking::FAnimBlueprintGeneratedMutableData) == 0x00001C, "Wrong size on TABP_EnhancedLocomotionSneaking::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(TABP_EnhancedLocomotionSneaking::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'TABP_EnhancedLocomotionSneaking::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionSneaking::FAnimBlueprintGeneratedMutableData, __FloatProperty_0) == 0x000008, "Member 'TABP_EnhancedLocomotionSneaking::FAnimBlueprintGeneratedMutableData::__FloatProperty_0' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionSneaking::FAnimBlueprintGeneratedMutableData, __BoolProperty_1) == 0x00000C, "Member 'TABP_EnhancedLocomotionSneaking::FAnimBlueprintGeneratedMutableData::__BoolProperty_1' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionSneaking::FAnimBlueprintGeneratedMutableData, __FloatProperty_2) == 0x000010, "Member 'TABP_EnhancedLocomotionSneaking::FAnimBlueprintGeneratedMutableData::__FloatProperty_2' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionSneaking::FAnimBlueprintGeneratedMutableData, __FloatProperty_3) == 0x000014, "Member 'TABP_EnhancedLocomotionSneaking::FAnimBlueprintGeneratedMutableData::__FloatProperty_3' has a wrong offset!");
static_assert(offsetof(TABP_EnhancedLocomotionSneaking::FAnimBlueprintGeneratedMutableData, __FloatProperty_4) == 0x000018, "Member 'TABP_EnhancedLocomotionSneaking::FAnimBlueprintGeneratedMutableData::__FloatProperty_4' has a wrong offset!");

}

