#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TABP_ShieldHandPose

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "TABP_ShieldHandPose_structs.hpp"
#include "Altar_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass TABP_ShieldHandPose.TABP_ShieldHandPose_C
// 0x03C0 (0x0780 - 0x03C0)
class UTABP_ShieldHandPose_C final : public UVShieldHandPoseCharacterAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct TABP_ShieldHandPose::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;          // 0x03C8(0x0020)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x03E8(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x03F0(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x03F8(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0418(0x00B8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x04D0(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x0550(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0578(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x05C0(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x05E8(0x0048)()
	struct FAnimNode_LayeredBoneBlendTemplate     AnimGraphNode_LayeredBoneBlendTemplate;            // 0x0630(0x0110)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0740(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x0760(0x0010)()
	bool                                          K2Node_PropertyAccess_3;                           // 0x0770(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_TABP_ShieldHandPose(int32 EntryPoint);
	void HandPoseLayer(const struct FPoseLink& AnimationPose, struct FPoseLink* HandPoseLayer_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TABP_ShieldHandPose_C">();
	}
	static class UTABP_ShieldHandPose_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTABP_ShieldHandPose_C>();
	}
};
static_assert(alignof(UTABP_ShieldHandPose_C) == 0x000010, "Wrong alignment on UTABP_ShieldHandPose_C");
static_assert(sizeof(UTABP_ShieldHandPose_C) == 0x000780, "Wrong size on UTABP_ShieldHandPose_C");
static_assert(offsetof(UTABP_ShieldHandPose_C, UberGraphFrame) == 0x0003C0, "Member 'UTABP_ShieldHandPose_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTABP_ShieldHandPose_C, __AnimBlueprintMutables) == 0x0003C8, "Member 'UTABP_ShieldHandPose_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UTABP_ShieldHandPose_C, AnimBlueprintExtension_PropertyAccess) == 0x0003E8, "Member 'UTABP_ShieldHandPose_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UTABP_ShieldHandPose_C, AnimBlueprintExtension_Base) == 0x0003F0, "Member 'UTABP_ShieldHandPose_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UTABP_ShieldHandPose_C, AnimGraphNode_Root_1) == 0x0003F8, "Member 'UTABP_ShieldHandPose_C::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(UTABP_ShieldHandPose_C, AnimGraphNode_LinkedInputPose) == 0x000418, "Member 'UTABP_ShieldHandPose_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UTABP_ShieldHandPose_C, AnimGraphNode_SaveCachedPose) == 0x0004D0, "Member 'UTABP_ShieldHandPose_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UTABP_ShieldHandPose_C, AnimGraphNode_UseCachedPose_1) == 0x000550, "Member 'UTABP_ShieldHandPose_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UTABP_ShieldHandPose_C, AnimGraphNode_BlendListByBool) == 0x000578, "Member 'UTABP_ShieldHandPose_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UTABP_ShieldHandPose_C, AnimGraphNode_UseCachedPose) == 0x0005C0, "Member 'UTABP_ShieldHandPose_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UTABP_ShieldHandPose_C, AnimGraphNode_SequencePlayer) == 0x0005E8, "Member 'UTABP_ShieldHandPose_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UTABP_ShieldHandPose_C, AnimGraphNode_LayeredBoneBlendTemplate) == 0x000630, "Member 'UTABP_ShieldHandPose_C::AnimGraphNode_LayeredBoneBlendTemplate' has a wrong offset!");
static_assert(offsetof(UTABP_ShieldHandPose_C, AnimGraphNode_Root) == 0x000740, "Member 'UTABP_ShieldHandPose_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UTABP_ShieldHandPose_C, AnimGraphNode_LocalRefPose) == 0x000760, "Member 'UTABP_ShieldHandPose_C::AnimGraphNode_LocalRefPose' has a wrong offset!");
static_assert(offsetof(UTABP_ShieldHandPose_C, K2Node_PropertyAccess_3) == 0x000770, "Member 'UTABP_ShieldHandPose_C::K2Node_PropertyAccess_3' has a wrong offset!");

}

