#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TABP_LocomotionSneaking

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function TABP_LocomotionSneaking.TABP_LocomotionSneaking_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct TABP_LocomotionSneaking_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(TABP_LocomotionSneaking_C_AnimGraph) == 0x000008, "Wrong alignment on TABP_LocomotionSneaking_C_AnimGraph");
static_assert(sizeof(TABP_LocomotionSneaking_C_AnimGraph) == 0x000010, "Wrong size on TABP_LocomotionSneaking_C_AnimGraph");
static_assert(offsetof(TABP_LocomotionSneaking_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'TABP_LocomotionSneaking_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function TABP_LocomotionSneaking.TABP_LocomotionSneaking_C.ExecuteUbergraph_TABP_LocomotionSneaking
// 0x0004 (0x0004 - 0x0000)
struct TABP_LocomotionSneaking_C_ExecuteUbergraph_TABP_LocomotionSneaking final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TABP_LocomotionSneaking_C_ExecuteUbergraph_TABP_LocomotionSneaking) == 0x000004, "Wrong alignment on TABP_LocomotionSneaking_C_ExecuteUbergraph_TABP_LocomotionSneaking");
static_assert(sizeof(TABP_LocomotionSneaking_C_ExecuteUbergraph_TABP_LocomotionSneaking) == 0x000004, "Wrong size on TABP_LocomotionSneaking_C_ExecuteUbergraph_TABP_LocomotionSneaking");
static_assert(offsetof(TABP_LocomotionSneaking_C_ExecuteUbergraph_TABP_LocomotionSneaking, EntryPoint) == 0x000000, "Member 'TABP_LocomotionSneaking_C_ExecuteUbergraph_TABP_LocomotionSneaking::EntryPoint' has a wrong offset!");

// Function TABP_LocomotionSneaking.TABP_LocomotionSneaking_C.SneakingLayer
// 0x0010 (0x0010 - 0x0000)
struct TABP_LocomotionSneaking_C_SneakingLayer final
{
public:
	struct FPoseLink                              SneakingLayer_0;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(TABP_LocomotionSneaking_C_SneakingLayer) == 0x000008, "Wrong alignment on TABP_LocomotionSneaking_C_SneakingLayer");
static_assert(sizeof(TABP_LocomotionSneaking_C_SneakingLayer) == 0x000010, "Wrong size on TABP_LocomotionSneaking_C_SneakingLayer");
static_assert(offsetof(TABP_LocomotionSneaking_C_SneakingLayer, SneakingLayer_0) == 0x000000, "Member 'TABP_LocomotionSneaking_C_SneakingLayer::SneakingLayer_0' has a wrong offset!");

}

