#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TABP_HitReact

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct TABP_HitReact.TABP_HitReact_C.AnimBlueprintGeneratedConstantData
// 0x010F (0x0110 - 0x0001)
struct TABP_HitReact::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_68;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_69;                                 // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_70;                                  // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_71;                                // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_72;                                 // 0x001C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_73;                                // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_74;                                 // 0x0024(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_75;                                 // 0x0025(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_76;                                 // 0x0028(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_77;                                  // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_78;                                 // 0x0034(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_79;                                  // 0x003C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_80;                                 // 0x0040(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_81;                                 // 0x0048(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_82;                               // 0x0050(0x0020)(BlueprintVisible, NoDestructor)
	ERefPoseType                                  __ByteProperty_83;                                 // 0x0070(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0078(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x00F8(0x0018)()
};
static_assert(alignof(TABP_HitReact::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on TABP_HitReact::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(TABP_HitReact::FAnimBlueprintGeneratedConstantData) == 0x000110, "Wrong size on TABP_HitReact::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(TABP_HitReact::FAnimBlueprintGeneratedConstantData, __NameProperty_68) == 0x000004, "Member 'TABP_HitReact::FAnimBlueprintGeneratedConstantData::__NameProperty_68' has a wrong offset!");
static_assert(offsetof(TABP_HitReact::FAnimBlueprintGeneratedConstantData, __NameProperty_69) == 0x00000C, "Member 'TABP_HitReact::FAnimBlueprintGeneratedConstantData::__NameProperty_69' has a wrong offset!");
static_assert(offsetof(TABP_HitReact::FAnimBlueprintGeneratedConstantData, __IntProperty_70) == 0x000014, "Member 'TABP_HitReact::FAnimBlueprintGeneratedConstantData::__IntProperty_70' has a wrong offset!");
static_assert(offsetof(TABP_HitReact::FAnimBlueprintGeneratedConstantData, __FloatProperty_71) == 0x000018, "Member 'TABP_HitReact::FAnimBlueprintGeneratedConstantData::__FloatProperty_71' has a wrong offset!");
static_assert(offsetof(TABP_HitReact::FAnimBlueprintGeneratedConstantData, __BoolProperty_72) == 0x00001C, "Member 'TABP_HitReact::FAnimBlueprintGeneratedConstantData::__BoolProperty_72' has a wrong offset!");
static_assert(offsetof(TABP_HitReact::FAnimBlueprintGeneratedConstantData, __FloatProperty_73) == 0x000020, "Member 'TABP_HitReact::FAnimBlueprintGeneratedConstantData::__FloatProperty_73' has a wrong offset!");
static_assert(offsetof(TABP_HitReact::FAnimBlueprintGeneratedConstantData, __BoolProperty_74) == 0x000024, "Member 'TABP_HitReact::FAnimBlueprintGeneratedConstantData::__BoolProperty_74' has a wrong offset!");
static_assert(offsetof(TABP_HitReact::FAnimBlueprintGeneratedConstantData, __EnumProperty_75) == 0x000025, "Member 'TABP_HitReact::FAnimBlueprintGeneratedConstantData::__EnumProperty_75' has a wrong offset!");
static_assert(offsetof(TABP_HitReact::FAnimBlueprintGeneratedConstantData, __NameProperty_76) == 0x000028, "Member 'TABP_HitReact::FAnimBlueprintGeneratedConstantData::__NameProperty_76' has a wrong offset!");
static_assert(offsetof(TABP_HitReact::FAnimBlueprintGeneratedConstantData, __IntProperty_77) == 0x000030, "Member 'TABP_HitReact::FAnimBlueprintGeneratedConstantData::__IntProperty_77' has a wrong offset!");
static_assert(offsetof(TABP_HitReact::FAnimBlueprintGeneratedConstantData, __NameProperty_78) == 0x000034, "Member 'TABP_HitReact::FAnimBlueprintGeneratedConstantData::__NameProperty_78' has a wrong offset!");
static_assert(offsetof(TABP_HitReact::FAnimBlueprintGeneratedConstantData, __IntProperty_79) == 0x00003C, "Member 'TABP_HitReact::FAnimBlueprintGeneratedConstantData::__IntProperty_79' has a wrong offset!");
static_assert(offsetof(TABP_HitReact::FAnimBlueprintGeneratedConstantData, __NameProperty_80) == 0x000040, "Member 'TABP_HitReact::FAnimBlueprintGeneratedConstantData::__NameProperty_80' has a wrong offset!");
static_assert(offsetof(TABP_HitReact::FAnimBlueprintGeneratedConstantData, __NameProperty_81) == 0x000048, "Member 'TABP_HitReact::FAnimBlueprintGeneratedConstantData::__NameProperty_81' has a wrong offset!");
static_assert(offsetof(TABP_HitReact::FAnimBlueprintGeneratedConstantData, __StructProperty_82) == 0x000050, "Member 'TABP_HitReact::FAnimBlueprintGeneratedConstantData::__StructProperty_82' has a wrong offset!");
static_assert(offsetof(TABP_HitReact::FAnimBlueprintGeneratedConstantData, __ByteProperty_83) == 0x000070, "Member 'TABP_HitReact::FAnimBlueprintGeneratedConstantData::__ByteProperty_83' has a wrong offset!");
static_assert(offsetof(TABP_HitReact::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000078, "Member 'TABP_HitReact::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(TABP_HitReact::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0000F8, "Member 'TABP_HitReact::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct TABP_HitReact.TABP_HitReact_C.AnimBlueprintGeneratedMutableData
// 0x000B (0x000C - 0x0001)
struct TABP_HitReact::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_0;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TABP_HitReact::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on TABP_HitReact::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(TABP_HitReact::FAnimBlueprintGeneratedMutableData) == 0x00000C, "Wrong size on TABP_HitReact::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(TABP_HitReact::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'TABP_HitReact::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");
static_assert(offsetof(TABP_HitReact::FAnimBlueprintGeneratedMutableData, __FloatProperty_0) == 0x000008, "Member 'TABP_HitReact::FAnimBlueprintGeneratedMutableData::__FloatProperty_0' has a wrong offset!");

}

