#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TABP_StandSneak_BowAttack

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct TABP_StandSneak_BowAttack.TABP_StandSneak_BowAttack_C.AnimBlueprintGeneratedConstantData
// 0x01BF (0x01C0 - 0x0001)
struct TABP_StandSneak_BowAttack::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_135;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_136;                                // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_137;                                // 0x0014(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_138;                              // 0x0020(0x0020)(BlueprintVisible, NoDestructor)
	int32                                         __IntProperty_139;                                 // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_140;                                // 0x0044(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_141;                                // 0x0045(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_142;                                // 0x0048(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_143;                                 // 0x0050(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_144;                               // 0x0054(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_145;                              // 0x0058(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_146;                               // 0x0084(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_147;                                // 0x0088(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_148;                                // 0x008C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_149;                                // 0x0098(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_150;                                  // 0x00A0(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_151;                                // 0x00A8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_152;                                // 0x00A9(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_153;                                // 0x00AA(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AB[0x5];                                       // 0x00AB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_154;                               // 0x00B0(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_155;                                // 0x00C0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_156;                              // 0x00C8(0x0020)(BlueprintVisible, NoDestructor)
	int32                                         __IntProperty_157;                                 // 0x00E8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_158;                                // 0x00EC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_159;                                // 0x00F4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_160;                              // 0x0100(0x0020)(BlueprintVisible, NoDestructor)
	ERefPoseType                                  __ByteProperty_161;                                // 0x0120(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0128(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x01A8(0x0018)()
};
static_assert(alignof(TABP_StandSneak_BowAttack::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on TABP_StandSneak_BowAttack::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(TABP_StandSneak_BowAttack::FAnimBlueprintGeneratedConstantData) == 0x0001C0, "Wrong size on TABP_StandSneak_BowAttack::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(TABP_StandSneak_BowAttack::FAnimBlueprintGeneratedConstantData, __NameProperty_135) == 0x000004, "Member 'TABP_StandSneak_BowAttack::FAnimBlueprintGeneratedConstantData::__NameProperty_135' has a wrong offset!");
static_assert(offsetof(TABP_StandSneak_BowAttack::FAnimBlueprintGeneratedConstantData, __NameProperty_136) == 0x00000C, "Member 'TABP_StandSneak_BowAttack::FAnimBlueprintGeneratedConstantData::__NameProperty_136' has a wrong offset!");
static_assert(offsetof(TABP_StandSneak_BowAttack::FAnimBlueprintGeneratedConstantData, __NameProperty_137) == 0x000014, "Member 'TABP_StandSneak_BowAttack::FAnimBlueprintGeneratedConstantData::__NameProperty_137' has a wrong offset!");
static_assert(offsetof(TABP_StandSneak_BowAttack::FAnimBlueprintGeneratedConstantData, __StructProperty_138) == 0x000020, "Member 'TABP_StandSneak_BowAttack::FAnimBlueprintGeneratedConstantData::__StructProperty_138' has a wrong offset!");
static_assert(offsetof(TABP_StandSneak_BowAttack::FAnimBlueprintGeneratedConstantData, __IntProperty_139) == 0x000040, "Member 'TABP_StandSneak_BowAttack::FAnimBlueprintGeneratedConstantData::__IntProperty_139' has a wrong offset!");
static_assert(offsetof(TABP_StandSneak_BowAttack::FAnimBlueprintGeneratedConstantData, __BoolProperty_140) == 0x000044, "Member 'TABP_StandSneak_BowAttack::FAnimBlueprintGeneratedConstantData::__BoolProperty_140' has a wrong offset!");
static_assert(offsetof(TABP_StandSneak_BowAttack::FAnimBlueprintGeneratedConstantData, __EnumProperty_141) == 0x000045, "Member 'TABP_StandSneak_BowAttack::FAnimBlueprintGeneratedConstantData::__EnumProperty_141' has a wrong offset!");
static_assert(offsetof(TABP_StandSneak_BowAttack::FAnimBlueprintGeneratedConstantData, __NameProperty_142) == 0x000048, "Member 'TABP_StandSneak_BowAttack::FAnimBlueprintGeneratedConstantData::__NameProperty_142' has a wrong offset!");
static_assert(offsetof(TABP_StandSneak_BowAttack::FAnimBlueprintGeneratedConstantData, __IntProperty_143) == 0x000050, "Member 'TABP_StandSneak_BowAttack::FAnimBlueprintGeneratedConstantData::__IntProperty_143' has a wrong offset!");
static_assert(offsetof(TABP_StandSneak_BowAttack::FAnimBlueprintGeneratedConstantData, __FloatProperty_144) == 0x000054, "Member 'TABP_StandSneak_BowAttack::FAnimBlueprintGeneratedConstantData::__FloatProperty_144' has a wrong offset!");
static_assert(offsetof(TABP_StandSneak_BowAttack::FAnimBlueprintGeneratedConstantData, __StructProperty_145) == 0x000058, "Member 'TABP_StandSneak_BowAttack::FAnimBlueprintGeneratedConstantData::__StructProperty_145' has a wrong offset!");
static_assert(offsetof(TABP_StandSneak_BowAttack::FAnimBlueprintGeneratedConstantData, __FloatProperty_146) == 0x000084, "Member 'TABP_StandSneak_BowAttack::FAnimBlueprintGeneratedConstantData::__FloatProperty_146' has a wrong offset!");
static_assert(offsetof(TABP_StandSneak_BowAttack::FAnimBlueprintGeneratedConstantData, __EnumProperty_147) == 0x000088, "Member 'TABP_StandSneak_BowAttack::FAnimBlueprintGeneratedConstantData::__EnumProperty_147' has a wrong offset!");
static_assert(offsetof(TABP_StandSneak_BowAttack::FAnimBlueprintGeneratedConstantData, __NameProperty_148) == 0x00008C, "Member 'TABP_StandSneak_BowAttack::FAnimBlueprintGeneratedConstantData::__NameProperty_148' has a wrong offset!");
static_assert(offsetof(TABP_StandSneak_BowAttack::FAnimBlueprintGeneratedConstantData, __BlendProfile_149) == 0x000098, "Member 'TABP_StandSneak_BowAttack::FAnimBlueprintGeneratedConstantData::__BlendProfile_149' has a wrong offset!");
static_assert(offsetof(TABP_StandSneak_BowAttack::FAnimBlueprintGeneratedConstantData, __CurveFloat_150) == 0x0000A0, "Member 'TABP_StandSneak_BowAttack::FAnimBlueprintGeneratedConstantData::__CurveFloat_150' has a wrong offset!");
static_assert(offsetof(TABP_StandSneak_BowAttack::FAnimBlueprintGeneratedConstantData, __BoolProperty_151) == 0x0000A8, "Member 'TABP_StandSneak_BowAttack::FAnimBlueprintGeneratedConstantData::__BoolProperty_151' has a wrong offset!");
static_assert(offsetof(TABP_StandSneak_BowAttack::FAnimBlueprintGeneratedConstantData, __EnumProperty_152) == 0x0000A9, "Member 'TABP_StandSneak_BowAttack::FAnimBlueprintGeneratedConstantData::__EnumProperty_152' has a wrong offset!");
static_assert(offsetof(TABP_StandSneak_BowAttack::FAnimBlueprintGeneratedConstantData, __EnumProperty_153) == 0x0000AA, "Member 'TABP_StandSneak_BowAttack::FAnimBlueprintGeneratedConstantData::__EnumProperty_153' has a wrong offset!");
static_assert(offsetof(TABP_StandSneak_BowAttack::FAnimBlueprintGeneratedConstantData, __ArrayProperty_154) == 0x0000B0, "Member 'TABP_StandSneak_BowAttack::FAnimBlueprintGeneratedConstantData::__ArrayProperty_154' has a wrong offset!");
static_assert(offsetof(TABP_StandSneak_BowAttack::FAnimBlueprintGeneratedConstantData, __NameProperty_155) == 0x0000C0, "Member 'TABP_StandSneak_BowAttack::FAnimBlueprintGeneratedConstantData::__NameProperty_155' has a wrong offset!");
static_assert(offsetof(TABP_StandSneak_BowAttack::FAnimBlueprintGeneratedConstantData, __StructProperty_156) == 0x0000C8, "Member 'TABP_StandSneak_BowAttack::FAnimBlueprintGeneratedConstantData::__StructProperty_156' has a wrong offset!");
static_assert(offsetof(TABP_StandSneak_BowAttack::FAnimBlueprintGeneratedConstantData, __IntProperty_157) == 0x0000E8, "Member 'TABP_StandSneak_BowAttack::FAnimBlueprintGeneratedConstantData::__IntProperty_157' has a wrong offset!");
static_assert(offsetof(TABP_StandSneak_BowAttack::FAnimBlueprintGeneratedConstantData, __NameProperty_158) == 0x0000EC, "Member 'TABP_StandSneak_BowAttack::FAnimBlueprintGeneratedConstantData::__NameProperty_158' has a wrong offset!");
static_assert(offsetof(TABP_StandSneak_BowAttack::FAnimBlueprintGeneratedConstantData, __NameProperty_159) == 0x0000F4, "Member 'TABP_StandSneak_BowAttack::FAnimBlueprintGeneratedConstantData::__NameProperty_159' has a wrong offset!");
static_assert(offsetof(TABP_StandSneak_BowAttack::FAnimBlueprintGeneratedConstantData, __StructProperty_160) == 0x000100, "Member 'TABP_StandSneak_BowAttack::FAnimBlueprintGeneratedConstantData::__StructProperty_160' has a wrong offset!");
static_assert(offsetof(TABP_StandSneak_BowAttack::FAnimBlueprintGeneratedConstantData, __ByteProperty_161) == 0x000120, "Member 'TABP_StandSneak_BowAttack::FAnimBlueprintGeneratedConstantData::__ByteProperty_161' has a wrong offset!");
static_assert(offsetof(TABP_StandSneak_BowAttack::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000128, "Member 'TABP_StandSneak_BowAttack::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(TABP_StandSneak_BowAttack::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0001A8, "Member 'TABP_StandSneak_BowAttack::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct TABP_StandSneak_BowAttack.TABP_StandSneak_BowAttack_C.AnimBlueprintGeneratedMutableData
// 0x001B (0x001C - 0x0001)
struct TABP_StandSneak_BowAttack::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_0;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_1;                                  // 0x000C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_2;                                  // 0x000D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_3;                                 // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_4;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_5;                                  // 0x0018(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TABP_StandSneak_BowAttack::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on TABP_StandSneak_BowAttack::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(TABP_StandSneak_BowAttack::FAnimBlueprintGeneratedMutableData) == 0x00001C, "Wrong size on TABP_StandSneak_BowAttack::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(TABP_StandSneak_BowAttack::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'TABP_StandSneak_BowAttack::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");
static_assert(offsetof(TABP_StandSneak_BowAttack::FAnimBlueprintGeneratedMutableData, __FloatProperty_0) == 0x000008, "Member 'TABP_StandSneak_BowAttack::FAnimBlueprintGeneratedMutableData::__FloatProperty_0' has a wrong offset!");
static_assert(offsetof(TABP_StandSneak_BowAttack::FAnimBlueprintGeneratedMutableData, __BoolProperty_1) == 0x00000C, "Member 'TABP_StandSneak_BowAttack::FAnimBlueprintGeneratedMutableData::__BoolProperty_1' has a wrong offset!");
static_assert(offsetof(TABP_StandSneak_BowAttack::FAnimBlueprintGeneratedMutableData, __BoolProperty_2) == 0x00000D, "Member 'TABP_StandSneak_BowAttack::FAnimBlueprintGeneratedMutableData::__BoolProperty_2' has a wrong offset!");
static_assert(offsetof(TABP_StandSneak_BowAttack::FAnimBlueprintGeneratedMutableData, __FloatProperty_3) == 0x000010, "Member 'TABP_StandSneak_BowAttack::FAnimBlueprintGeneratedMutableData::__FloatProperty_3' has a wrong offset!");
static_assert(offsetof(TABP_StandSneak_BowAttack::FAnimBlueprintGeneratedMutableData, __FloatProperty_4) == 0x000014, "Member 'TABP_StandSneak_BowAttack::FAnimBlueprintGeneratedMutableData::__FloatProperty_4' has a wrong offset!");
static_assert(offsetof(TABP_StandSneak_BowAttack::FAnimBlueprintGeneratedMutableData, __BoolProperty_5) == 0x000018, "Member 'TABP_StandSneak_BowAttack::FAnimBlueprintGeneratedMutableData::__BoolProperty_5' has a wrong offset!");

}

