#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TABP_Stagger_Swim

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Altar_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass TABP_Stagger_Swim.TABP_Stagger_Swim_C
// 0x0120 (0x04F0 - 0x03D0)
class UTABP_Stagger_Swim_C final : public UVStaggerSwimCharacterAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x03D8(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x03E0(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x03E8(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0408(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x04C0(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x04E0(0x0010)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_TABP_Stagger_Swim(int32 EntryPoint);
	void StaggerLayer(const struct FPoseLink& InPose, struct FPoseLink* StaggerLayer_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TABP_Stagger_Swim_C">();
	}
	static class UTABP_Stagger_Swim_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTABP_Stagger_Swim_C>();
	}
};
static_assert(alignof(UTABP_Stagger_Swim_C) == 0x000010, "Wrong alignment on UTABP_Stagger_Swim_C");
static_assert(sizeof(UTABP_Stagger_Swim_C) == 0x0004F0, "Wrong size on UTABP_Stagger_Swim_C");
static_assert(offsetof(UTABP_Stagger_Swim_C, UberGraphFrame) == 0x0003D0, "Member 'UTABP_Stagger_Swim_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTABP_Stagger_Swim_C, AnimBlueprintExtension_PropertyAccess) == 0x0003D8, "Member 'UTABP_Stagger_Swim_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UTABP_Stagger_Swim_C, AnimBlueprintExtension_Base) == 0x0003E0, "Member 'UTABP_Stagger_Swim_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UTABP_Stagger_Swim_C, AnimGraphNode_Root_1) == 0x0003E8, "Member 'UTABP_Stagger_Swim_C::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(UTABP_Stagger_Swim_C, AnimGraphNode_LinkedInputPose) == 0x000408, "Member 'UTABP_Stagger_Swim_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UTABP_Stagger_Swim_C, AnimGraphNode_Root) == 0x0004C0, "Member 'UTABP_Stagger_Swim_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UTABP_Stagger_Swim_C, AnimGraphNode_LocalRefPose) == 0x0004E0, "Member 'UTABP_Stagger_Swim_C::AnimGraphNode_LocalRefPose' has a wrong offset!");

}

