#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIActiveSpellEffectData

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass UIActiveSpellEffectData.UIActiveSpellEffectData_C
// 0x0018 (0x0040 - 0x0028)
class UUIActiveSpellEffectData_C final : public UObject
{
public:
	class UTexture2D*                             Icon;                                              // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        Progress;                                          // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          OldItem;                                           // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIActiveSpellEffectData_C">();
	}
	static class UUIActiveSpellEffectData_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIActiveSpellEffectData_C>();
	}
};
static_assert(alignof(UUIActiveSpellEffectData_C) == 0x000008, "Wrong alignment on UUIActiveSpellEffectData_C");
static_assert(sizeof(UUIActiveSpellEffectData_C) == 0x000040, "Wrong size on UUIActiveSpellEffectData_C");
static_assert(offsetof(UUIActiveSpellEffectData_C, Icon) == 0x000028, "Member 'UUIActiveSpellEffectData_C::Icon' has a wrong offset!");
static_assert(offsetof(UUIActiveSpellEffectData_C, Progress) == 0x000030, "Member 'UUIActiveSpellEffectData_C::Progress' has a wrong offset!");
static_assert(offsetof(UUIActiveSpellEffectData_C, OldItem) == 0x000038, "Member 'UUIActiveSpellEffectData_C::OldItem' has a wrong offset!");

}

