#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WaveFoamSimComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Water_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WaveFoamSimComponent.WaveFoamSimComponent_C.ExecuteUbergraph_WaveFoamSimComponent
// 0x0120 (0x0120 - 0x0000)
struct WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 CallFunc_PingPong_Height_Read_RT;                  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 CallFunc_PingPong_Height_Write_RT;                 // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 K2Node_Select_Default;                             // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue_1;             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 K2Node_Select_Default_1;                           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue_2;             // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 K2Node_Select_Default_2;                           // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 K2Node_Select_Default_3;                           // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Res;                            // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_WorldSize;                      // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Fading;                         // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_TimeBias;                       // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterBody*                             K2Node_CustomEvent_WaterBody;                      // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UShallowWaterSimComponent_C*            K2Node_CustomEvent_ShallowWater;                   // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWaterBodyComponent*                    CallFunc_GetWaterBodyComponent_ReturnValue;        // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWaterWavesBase*                        CallFunc_GetWaterWaves_ReturnValue;                // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGerstnerWaterWaves*                    K2Node_DynamicCast_AsGerstner_Water_Waves;         // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x00AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AE[0x2];                                       // 0x00AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_2;    // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x00BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 CallFunc_CreateRenderTarget2D_ReturnValue;         // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_4;          // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CB[0x5];                                       // 0x00CB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 CallFunc_CreateRenderTarget2D_ReturnValue_1;       // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_5;          // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_6;          // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DB[0x5];                                       // 0x00DB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 CallFunc_CreateRenderTarget2D_ReturnValue_2;       // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_7;          // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_8;          // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x00EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x00EB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x00FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FE[0x2];                                       // 0x00FE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_2; // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast; // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent) == 0x000008, "Wrong alignment on WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent");
static_assert(sizeof(WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent) == 0x000120, "Wrong size on WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent");
static_assert(offsetof(WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent, EntryPoint) == 0x000000, "Member 'WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent, Temp_bool_Variable) == 0x000004, "Member 'WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent, CallFunc_PingPong_Height_Read_RT) == 0x000008, "Member 'WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent::CallFunc_PingPong_Height_Read_RT' has a wrong offset!");
static_assert(offsetof(WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent, CallFunc_PingPong_Height_Write_RT) == 0x000010, "Member 'WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent::CallFunc_PingPong_Height_Write_RT' has a wrong offset!");
static_assert(offsetof(WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent, Temp_bool_Variable_1) == 0x000018, "Member 'WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent, Temp_bool_Variable_2) == 0x00001A, "Member 'WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent, Temp_bool_Variable_3) == 0x00001B, "Member 'WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent, CallFunc_MakeLiteralByte_ReturnValue) == 0x00001C, "Member 'WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent, CallFunc_IsValid_ReturnValue_1) == 0x00001D, "Member 'WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent, CallFunc_Percent_IntInt_ReturnValue) == 0x000020, "Member 'WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000024, "Member 'WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000025, "Member 'WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent, K2Node_Select_Default) == 0x000028, "Member 'WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent, CallFunc_Percent_IntInt_ReturnValue_1) == 0x000030, "Member 'WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent::CallFunc_Percent_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000034, "Member 'WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000035, "Member 'WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent, K2Node_Select_Default_1) == 0x000038, "Member 'WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent, CallFunc_Percent_IntInt_ReturnValue_2) == 0x000040, "Member 'WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent::CallFunc_Percent_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x000044, "Member 'WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent, K2Node_Select_Default_2) == 0x000048, "Member 'WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent, K2Node_Select_Default_3) == 0x000050, "Member 'WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent, K2Node_CustomEvent_Res) == 0x000058, "Member 'WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent::K2Node_CustomEvent_Res' has a wrong offset!");
static_assert(offsetof(WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent, K2Node_CustomEvent_WorldSize) == 0x000060, "Member 'WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent::K2Node_CustomEvent_WorldSize' has a wrong offset!");
static_assert(offsetof(WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent, K2Node_CustomEvent_Fading) == 0x000068, "Member 'WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent::K2Node_CustomEvent_Fading' has a wrong offset!");
static_assert(offsetof(WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent, K2Node_CustomEvent_TimeBias) == 0x000070, "Member 'WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent::K2Node_CustomEvent_TimeBias' has a wrong offset!");
static_assert(offsetof(WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent, K2Node_CustomEvent_WaterBody) == 0x000078, "Member 'WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent::K2Node_CustomEvent_WaterBody' has a wrong offset!");
static_assert(offsetof(WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent, K2Node_CustomEvent_ShallowWater) == 0x000080, "Member 'WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent::K2Node_CustomEvent_ShallowWater' has a wrong offset!");
static_assert(offsetof(WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent, CallFunc_IsValid_ReturnValue_2) == 0x000088, "Member 'WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent, CallFunc_GetWaterBodyComponent_ReturnValue) == 0x000090, "Member 'WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent::CallFunc_GetWaterBodyComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent, CallFunc_GetWaterWaves_ReturnValue) == 0x000098, "Member 'WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent::CallFunc_GetWaterWaves_ReturnValue' has a wrong offset!");
static_assert(offsetof(WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent, K2Node_DynamicCast_AsGerstner_Water_Waves) == 0x0000A0, "Member 'WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent::K2Node_DynamicCast_AsGerstner_Water_Waves' has a wrong offset!");
static_assert(offsetof(WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent, K2Node_DynamicCast_bSuccess) == 0x0000A8, "Member 'WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x0000A9, "Member 'WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent, CallFunc_IsValid_ReturnValue_3) == 0x0000AA, "Member 'WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000AB, "Member 'WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent, CallFunc_IsValid_ReturnValue_4) == 0x0000AC, "Member 'WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x0000AD, "Member 'WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0000B0, "Member 'WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent, CallFunc_IsValid_ReturnValue_5) == 0x0000B8, "Member 'WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent, CallFunc_EqualEqual_ObjectObject_ReturnValue_2) == 0x0000B9, "Member 'WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent::CallFunc_EqualEqual_ObjectObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent, CallFunc_IsValid_ReturnValue_6) == 0x0000BA, "Member 'WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent, CallFunc_IsValid_ReturnValue_7) == 0x0000BB, "Member 'WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent, CallFunc_IsValid_ReturnValue_8) == 0x0000BC, "Member 'WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent, CallFunc_CreateRenderTarget2D_ReturnValue) == 0x0000C0, "Member 'WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent::CallFunc_CreateRenderTarget2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent, CallFunc_EqualEqual_IntInt_ReturnValue_3) == 0x0000C8, "Member 'WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent::CallFunc_EqualEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent, CallFunc_EqualEqual_IntInt_ReturnValue_4) == 0x0000C9, "Member 'WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent::CallFunc_EqualEqual_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent, CallFunc_BooleanAND_ReturnValue) == 0x0000CA, "Member 'WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent, CallFunc_CreateRenderTarget2D_ReturnValue_1) == 0x0000D0, "Member 'WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent::CallFunc_CreateRenderTarget2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent, CallFunc_EqualEqual_IntInt_ReturnValue_5) == 0x0000D8, "Member 'WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent::CallFunc_EqualEqual_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent, CallFunc_EqualEqual_IntInt_ReturnValue_6) == 0x0000D9, "Member 'WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent::CallFunc_EqualEqual_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent, CallFunc_BooleanAND_ReturnValue_1) == 0x0000DA, "Member 'WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent, CallFunc_CreateRenderTarget2D_ReturnValue_2) == 0x0000E0, "Member 'WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent::CallFunc_CreateRenderTarget2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent, CallFunc_EqualEqual_IntInt_ReturnValue_7) == 0x0000E8, "Member 'WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent::CallFunc_EqualEqual_IntInt_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent, CallFunc_EqualEqual_IntInt_ReturnValue_8) == 0x0000E9, "Member 'WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent::CallFunc_EqualEqual_IntInt_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent, CallFunc_IsValid_ReturnValue_9) == 0x0000EA, "Member 'WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent, CallFunc_BooleanAND_ReturnValue_2) == 0x0000EB, "Member 'WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent, CallFunc_Add_IntInt_ReturnValue) == 0x0000EC, "Member 'WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0000F0, "Member 'WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent, Temp_int_Variable) == 0x0000F8, "Member 'WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x0000FC, "Member 'WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent, CallFunc_MakeLiteralByte_ReturnValue_5) == 0x0000FD, "Member 'WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent::CallFunc_MakeLiteralByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000100, "Member 'WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent, CallFunc_CreateDynamicMaterialInstance_ReturnValue_2) == 0x000108, "Member 'WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent::CallFunc_CreateDynamicMaterialInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000110, "Member 'WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x000114, "Member 'WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent, CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast) == 0x000118, "Member 'WaveFoamSimComponent_C_ExecuteUbergraph_WaveFoamSimComponent::CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast' has a wrong offset!");

// Function WaveFoamSimComponent.WaveFoamSimComponent_C.InitializeWaveFoamSim
// 0x0030 (0x0030 - 0x0000)
struct WaveFoamSimComponent_C_InitializeWaveFoamSim final
{
public:
	int32                                         res_0;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        WorldSize;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Fading;                                            // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TimeBias;                                          // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterBody*                             WaterBody;                                         // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UShallowWaterSimComponent_C*            ShallowWater_0;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WaveFoamSimComponent_C_InitializeWaveFoamSim) == 0x000008, "Wrong alignment on WaveFoamSimComponent_C_InitializeWaveFoamSim");
static_assert(sizeof(WaveFoamSimComponent_C_InitializeWaveFoamSim) == 0x000030, "Wrong size on WaveFoamSimComponent_C_InitializeWaveFoamSim");
static_assert(offsetof(WaveFoamSimComponent_C_InitializeWaveFoamSim, res_0) == 0x000000, "Member 'WaveFoamSimComponent_C_InitializeWaveFoamSim::res_0' has a wrong offset!");
static_assert(offsetof(WaveFoamSimComponent_C_InitializeWaveFoamSim, WorldSize) == 0x000008, "Member 'WaveFoamSimComponent_C_InitializeWaveFoamSim::WorldSize' has a wrong offset!");
static_assert(offsetof(WaveFoamSimComponent_C_InitializeWaveFoamSim, Fading) == 0x000010, "Member 'WaveFoamSimComponent_C_InitializeWaveFoamSim::Fading' has a wrong offset!");
static_assert(offsetof(WaveFoamSimComponent_C_InitializeWaveFoamSim, TimeBias) == 0x000018, "Member 'WaveFoamSimComponent_C_InitializeWaveFoamSim::TimeBias' has a wrong offset!");
static_assert(offsetof(WaveFoamSimComponent_C_InitializeWaveFoamSim, WaterBody) == 0x000020, "Member 'WaveFoamSimComponent_C_InitializeWaveFoamSim::WaterBody' has a wrong offset!");
static_assert(offsetof(WaveFoamSimComponent_C_InitializeWaveFoamSim, ShallowWater_0) == 0x000028, "Member 'WaveFoamSimComponent_C_InitializeWaveFoamSim::ShallowWater_0' has a wrong offset!");

// Function WaveFoamSimComponent.WaveFoamSimComponent_C.Render Waves to RT
// 0x00F8 (0x00F8 - 0x0000)
struct WaveFoamSimComponent_C_Render_Waves_to_RT final
{
public:
	TArray<struct FGerstnerWave>                  NewParam;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGerstnerWave                          CallFunc_Array_Get_Item;                           // 0x0018(0x0048)(NoDestructor)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue;         // 0x00A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor_1;                   // 0x00BC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvas*                                CallFunc_BeginDrawCanvasToRenderTarget_Canvas;     // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_BeginDrawCanvasToRenderTarget_Size;       // 0x00D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDrawToRenderTargetContext             CallFunc_BeginDrawCanvasToRenderTarget_Context;    // 0x00E8(0x0008)(NoDestructor)
	int32                                         CallFunc_Min_ReturnValue;                          // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WaveFoamSimComponent_C_Render_Waves_to_RT) == 0x000008, "Wrong alignment on WaveFoamSimComponent_C_Render_Waves_to_RT");
static_assert(sizeof(WaveFoamSimComponent_C_Render_Waves_to_RT) == 0x0000F8, "Wrong size on WaveFoamSimComponent_C_Render_Waves_to_RT");
static_assert(offsetof(WaveFoamSimComponent_C_Render_Waves_to_RT, NewParam) == 0x000000, "Member 'WaveFoamSimComponent_C_Render_Waves_to_RT::NewParam' has a wrong offset!");
static_assert(offsetof(WaveFoamSimComponent_C_Render_Waves_to_RT, Temp_int_Variable) == 0x000010, "Member 'WaveFoamSimComponent_C_Render_Waves_to_RT::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WaveFoamSimComponent_C_Render_Waves_to_RT, CallFunc_Array_LastIndex_ReturnValue) == 0x000014, "Member 'WaveFoamSimComponent_C_Render_Waves_to_RT::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
