#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModernTopStats

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Altar_structs.hpp"


namespace SDK::Params
{

// Function WBP_ModernTopStats.WBP_ModernTopStats_C.ExecuteUbergraph_WBP_ModernTopStats
// 0x000C (0x000C - 0x0000)
struct WBP_ModernTopStats_C_ExecuteUbergraph_WBP_ModernTopStats final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsMenuMode;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernTopStats_C_ExecuteUbergraph_WBP_ModernTopStats) == 0x000004, "Wrong alignment on WBP_ModernTopStats_C_ExecuteUbergraph_WBP_ModernTopStats");
static_assert(sizeof(WBP_ModernTopStats_C_ExecuteUbergraph_WBP_ModernTopStats) == 0x00000C, "Wrong size on WBP_ModernTopStats_C_ExecuteUbergraph_WBP_ModernTopStats");
static_assert(offsetof(WBP_ModernTopStats_C_ExecuteUbergraph_WBP_ModernTopStats, EntryPoint) == 0x000000, "Member 'WBP_ModernTopStats_C_ExecuteUbergraph_WBP_ModernTopStats::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ModernTopStats_C_ExecuteUbergraph_WBP_ModernTopStats, K2Node_CustomEvent_bIsMenuMode) == 0x000004, "Member 'WBP_ModernTopStats_C_ExecuteUbergraph_WBP_ModernTopStats::K2Node_CustomEvent_bIsMenuMode' has a wrong offset!");
static_assert(offsetof(WBP_ModernTopStats_C_ExecuteUbergraph_WBP_ModernTopStats, Temp_bool_Variable) == 0x000005, "Member 'WBP_ModernTopStats_C_ExecuteUbergraph_WBP_ModernTopStats::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernTopStats_C_ExecuteUbergraph_WBP_ModernTopStats, Temp_byte_Variable) == 0x000006, "Member 'WBP_ModernTopStats_C_ExecuteUbergraph_WBP_ModernTopStats::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernTopStats_C_ExecuteUbergraph_WBP_ModernTopStats, Temp_byte_Variable_1) == 0x000007, "Member 'WBP_ModernTopStats_C_ExecuteUbergraph_WBP_ModernTopStats::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernTopStats_C_ExecuteUbergraph_WBP_ModernTopStats, K2Node_Select_Default) == 0x000008, "Member 'WBP_ModernTopStats_C_ExecuteUbergraph_WBP_ModernTopStats::K2Node_Select_Default' has a wrong offset!");

// Function WBP_ModernTopStats.WBP_ModernTopStats_C.FadeNPCOut
// 0x0008 (0x0008 - 0x0000)
struct WBP_ModernTopStats_C_FadeNPCOut final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernTopStats_C_FadeNPCOut) == 0x000008, "Wrong alignment on WBP_ModernTopStats_C_FadeNPCOut");
static_assert(sizeof(WBP_ModernTopStats_C_FadeNPCOut) == 0x000008, "Wrong size on WBP_ModernTopStats_C_FadeNPCOut");
static_assert(offsetof(WBP_ModernTopStats_C_FadeNPCOut, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'WBP_ModernTopStats_C_FadeNPCOut::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_ModernTopStats.WBP_ModernTopStats_C.HandleNPCVisibility
// 0x0010 (0x0010 - 0x0000)
struct WBP_ModernTopStats_C_HandleNPCVisibility final
{
public:
	bool                                          InNewVisibility;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernTopStats_C_HandleNPCVisibility) == 0x000008, "Wrong alignment on WBP_ModernTopStats_C_HandleNPCVisibility");
static_assert(sizeof(WBP_ModernTopStats_C_HandleNPCVisibility) == 0x000010, "Wrong size on WBP_ModernTopStats_C_HandleNPCVisibility");
static_assert(offsetof(WBP_ModernTopStats_C_HandleNPCVisibility, InNewVisibility) == 0x000000, "Member 'WBP_ModernTopStats_C_HandleNPCVisibility::InNewVisibility' has a wrong offset!");
static_assert(offsetof(WBP_ModernTopStats_C_HandleNPCVisibility, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'WBP_ModernTopStats_C_HandleNPCVisibility::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernTopStats_C_HandleNPCVisibility, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_ModernTopStats_C_HandleNPCVisibility::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_ModernTopStats.WBP_ModernTopStats_C.SetBossVisual
// 0x0009 (0x0009 - 0x0000)
struct WBP_ModernTopStats_C_SetBossVisual final
{
public:
	bool                                          bIsBoss;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernTopStats_C_SetBossVisual) == 0x000001, "Wrong alignment on WBP_ModernTopStats_C_SetBossVisual");
static_assert(sizeof(WBP_ModernTopStats_C_SetBossVisual) == 0x000009, "Wrong size on WBP_ModernTopStats_C_SetBossVisual");
static_assert(offsetof(WBP_ModernTopStats_C_SetBossVisual, bIsBoss) == 0x000000, "Member 'WBP_ModernTopStats_C_SetBossVisual::bIsBoss' has a wrong offset!");
static_assert(offsetof(WBP_ModernTopStats_C_SetBossVisual, Temp_bool_Variable) == 0x000001, "Member 'WBP_ModernTopStats_C_SetBossVisual::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernTopStats_C_SetBossVisual, Temp_byte_Variable) == 0x000002, "Member 'WBP_ModernTopStats_C_SetBossVisual::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernTopStats_C_SetBossVisual, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_ModernTopStats_C_SetBossVisual::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernTopStats_C_SetBossVisual, Temp_bool_Variable_1) == 0x000004, "Member 'WBP_ModernTopStats_C_SetBossVisual::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernTopStats_C_SetBossVisual, Temp_byte_Variable_2) == 0x000005, "Member 'WBP_ModernTopStats_C_SetBossVisual::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ModernTopStats_C_SetBossVisual, Temp_byte_Variable_3) == 0x000006, "Member 'WBP_ModernTopStats_C_SetBossVisual::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_ModernTopStats_C_SetBossVisual, K2Node_Select_Default) == 0x000007, "Member 'WBP_ModernTopStats_C_SetBossVisual::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_ModernTopStats_C_SetBossVisual, K2Node_Select_Default_1) == 0x000008, "Member 'WBP_ModernTopStats_C_SetBossVisual::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_ModernTopStats.WBP_ModernTopStats_C.SetBreathVisibility
// 0x0028 (0x0028 - 0x0000)
struct WBP_ModernTopStats_C_SetBreathVisibility final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AVOblivionPlayerCharacter*              LocalPlayer;                                       // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue_1;        // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernTopStats_C_SetBreathVisibility) == 0x000008, "Wrong alignment on WBP_ModernTopStats_C_SetBreathVisibility");
static_assert(sizeof(WBP_ModernTopStats_C_SetBreathVisibility) == 0x000028, "Wrong size on WBP_ModernTopStats_C_SetBreathVisibility");
static_assert(offsetof(WBP_ModernTopStats_C_SetBreathVisibility, InVisibility) == 0x000000, "Member 'WBP_ModernTopStats_C_SetBreathVisibility::InVisibility' has a wrong offset!");
static_assert(offsetof(WBP_ModernTopStats_C_SetBreathVisibility, LocalPlayer) == 0x000008, "Member 'WBP_ModernTopStats_C_SetBreathVisibility::LocalPlayer' has a wrong offset!");
static_assert(offsetof(WBP_ModernTopStats_C_SetBreathVisibility, CallFunc_GetOwningPlayerPawn_ReturnValue) == 0x000010, "Member 'WBP_ModernTopStats_C_SetBreathVisibility::CallFunc_GetOwningPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernTopStats_C_SetBreathVisibility, CallFunc_GetOwningPlayerPawn_ReturnValue_1) == 0x000018, "Member 'WBP_ModernTopStats_C_SetBreathVisibility::CallFunc_GetOwningPlayerPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernTopStats_C_SetBreathVisibility, K2Node_SwitchEnum_CmpSuccess) == 0x000020, "Member 'WBP_ModernTopStats_C_SetBreathVisibility::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_ModernTopStats.WBP_ModernTopStats_C.SetEnemyOverlayVisibility
// 0x0005 (0x0005 - 0x0000)
struct WBP_ModernTopStats_C_SetEnemyOverlayVisibility final
{
public:
	bool                                          InVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernTopStats_C_SetEnemyOverlayVisibility) == 0x000001, "Wrong alignment on WBP_ModernTopStats_C_SetEnemyOverlayVisibility");
static_assert(sizeof(WBP_ModernTopStats_C_SetEnemyOverlayVisibility) == 0x000005, "Wrong size on WBP_ModernTopStats_C_SetEnemyOverlayVisibility");
static_assert(offsetof(WBP_ModernTopStats_C_SetEnemyOverlayVisibility, InVisibility) == 0x000000, "Member 'WBP_ModernTopStats_C_SetEnemyOverlayVisibility::InVisibility' has a wrong offset!");
static_assert(offsetof(WBP_ModernTopStats_C_SetEnemyOverlayVisibility, Temp_bool_Variable) == 0x000001, "Member 'WBP_ModernTopStats_C_SetEnemyOverlayVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernTopStats_C_SetEnemyOverlayVisibility, Temp_byte_Variable) == 0x000002, "Member 'WBP_ModernTopStats_C_SetEnemyOverlayVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernTopStats_C_SetEnemyOverlayVisibility, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_ModernTopStats_C_SetEnemyOverlayVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernTopStats_C_SetEnemyOverlayVisibility, K2Node_Select_Default) == 0x000004, "Member 'WBP_ModernTopStats_C_SetEnemyOverlayVisibility::K2Node_Select_Default' has a wrong offset!");

// Function WBP_ModernTopStats.WBP_ModernTopStats_C.ToggleMenuMode
// 0x0001 (0x0001 - 0x0000)
struct WBP_ModernTopStats_C_ToggleMenuMode final
{
public:
	bool                                          bIsMenuMode;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernTopStats_C_ToggleMenuMode) == 0x000001, "Wrong alignment on WBP_ModernTopStats_C_ToggleMenuMode");
static_assert(sizeof(WBP_ModernTopStats_C_ToggleMenuMode) == 0x000001, "Wrong size on WBP_ModernTopStats_C_ToggleMenuMode");
static_assert(offsetof(WBP_ModernTopStats_C_ToggleMenuMode, bIsMenuMode) == 0x000000, "Member 'WBP_ModernTopStats_C_ToggleMenuMode::bIsMenuMode' has a wrong offset!");

// Function WBP_ModernTopStats.WBP_ModernTopStats_C.UpdateBossVisual
// 0x0038 (0x0038 - 0x0000)
struct WBP_ModernTopStats_C_UpdateBossVisual final
{
public:
	class UVTESObjectRefComponent*                Local_VTESObjectRefComponent;                      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVBossCategory                                CallFunc_GetBossTag_ReturnValue;                   // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AVAltarPlayerController*                K2Node_DynamicCast_AsVAltar_Player_Controller;     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AVOblivionPlayerCharacter*              CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVTESObjectRefComponent*                CallFunc_GetLastHitObjectRefComponent_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernTopStats_C_UpdateBossVisual) == 0x000008, "Wrong alignment on WBP_ModernTopStats_C_UpdateBossVisual");
static_assert(sizeof(WBP_ModernTopStats_C_UpdateBossVisual) == 0x000038, "Wrong size on WBP_ModernTopStats_C_UpdateBossVisual");
static_assert(offsetof(WBP_ModernTopStats_C_UpdateBossVisual, Local_VTESObjectRefComponent) == 0x000000, "Member 'WBP_ModernTopStats_C_UpdateBossVisual::Local_VTESObjectRefComponent' has a wrong offset!");
static_assert(offsetof(WBP_ModernTopStats_C_UpdateBossVisual, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WBP_ModernTopStats_C_UpdateBossVisual::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernTopStats_C_UpdateBossVisual, CallFunc_GetBossTag_ReturnValue) == 0x000009, "Member 'WBP_ModernTopStats_C_UpdateBossVisual::CallFunc_GetBossTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernTopStats_C_UpdateBossVisual, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x00000A, "Member 'WBP_ModernTopStats_C_UpdateBossVisual::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernTopStats_C_UpdateBossVisual, CallFunc_GetOwningPlayer_ReturnValue) == 0x000010, "Member 'WBP_ModernTopStats_C_UpdateBossVisual::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernTopStats_C_UpdateBossVisual, K2Node_DynamicCast_AsVAltar_Player_Controller) == 0x000018, "Member 'WBP_ModernTopStats_C_UpdateBossVisual::K2Node_DynamicCast_AsVAltar_Player_Controller' has a wrong offset!");
static_assert(offsetof(WBP_ModernTopStats_C_UpdateBossVisual, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_ModernTopStats_C_UpdateBossVisual::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ModernTopStats_C_UpdateBossVisual, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000028, "Member 'WBP_ModernTopStats_C_UpdateBossVisual::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernTopStats_C_UpdateBossVisual, CallFunc_GetLastHitObjectRefComponent_ReturnValue) == 0x000030, "Member 'WBP_ModernTopStats_C_UpdateBossVisual::CallFunc_GetLastHitObjectRefComponent_ReturnValue' has a wrong offset!");

// Function WBP_ModernTopStats.WBP_ModernTopStats_C.UpdateEnemyHealth
// 0x0030 (0x0030 - 0x0000)
struct WBP_ModernTopStats_C_UpdateEnemyHealth final
{
public:
	struct FLegacyReticleEnemyHealthProperties    InProperties;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	float                                         Local_RealProgress;                                // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_Local_RealProgress_ImplicitCast; // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SetProgress_InProgress_ImplicitCast;      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernTopStats_C_UpdateEnemyHealth) == 0x000008, "Wrong alignment on WBP_ModernTopStats_C_UpdateEnemyHealth");
static_assert(sizeof(WBP_ModernTopStats_C_UpdateEnemyHealth) == 0x000030, "Wrong size on WBP_ModernTopStats_C_UpdateEnemyHealth");
static_assert(offsetof(WBP_ModernTopStats_C_UpdateEnemyHealth, InProperties) == 0x000000, "Member 'WBP_ModernTopStats_C_UpdateEnemyHealth::InProperties' has a wrong offset!");
static_assert(offsetof(WBP_ModernTopStats_C_UpdateEnemyHealth, Local_RealProgress) == 0x000008, "Member 'WBP_ModernTopStats_C_UpdateEnemyHealth::Local_RealProgress' has a wrong offset!");
static_assert(offsetof(WBP_ModernTopStats_C_UpdateEnemyHealth, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000010, "Member 'WBP_ModernTopStats_C_UpdateEnemyHealth::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernTopStats_C_UpdateEnemyHealth, CallFunc_Subtract_DoubleDouble_B_ImplicitCast) == 0x000018, "Member 'WBP_ModernTopStats_C_UpdateEnemyHealth::CallFunc_Subtract_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_ModernTopStats_C_UpdateEnemyHealth, K2Node_VariableSet_Local_RealProgress_ImplicitCast) == 0x000020, "Member 'WBP_ModernTopStats_C_UpdateEnemyHealth::K2Node_VariableSet_Local_RealProgress_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_ModernTopStats_C_UpdateEnemyHealth, CallFunc_SetProgress_InProgress_ImplicitCast) == 0x000028, "Member 'WBP_ModernTopStats_C_UpdateEnemyHealth::CallFunc_SetProgress_InProgress_ImplicitCast' has a wrong offset!");

// Function WBP_ModernTopStats.WBP_ModernTopStats_C.UpdateNPCName
// 0x0020 (0x0020 - 0x0000)
struct WBP_ModernTopStats_C_UpdateNPCName final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernTopStats_C_UpdateNPCName) == 0x000008, "Wrong alignment on WBP_ModernTopStats_C_UpdateNPCName");
static_assert(sizeof(WBP_ModernTopStats_C_UpdateNPCName) == 0x000020, "Wrong size on WBP_ModernTopStats_C_UpdateNPCName");
static_assert(offsetof(WBP_ModernTopStats_C_UpdateNPCName, InText) == 0x000000, "Member 'WBP_ModernTopStats_C_UpdateNPCName::InText' has a wrong offset!");
static_assert(offsetof(WBP_ModernTopStats_C_UpdateNPCName, Temp_bool_Variable) == 0x000018, "Member 'WBP_ModernTopStats_C_UpdateNPCName::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernTopStats_C_UpdateNPCName, Temp_byte_Variable) == 0x000019, "Member 'WBP_ModernTopStats_C_UpdateNPCName::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernTopStats_C_UpdateNPCName, Temp_byte_Variable_1) == 0x00001A, "Member 'WBP_ModernTopStats_C_UpdateNPCName::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernTopStats_C_UpdateNPCName, CallFunc_TextIsEmpty_ReturnValue) == 0x00001B, "Member 'WBP_ModernTopStats_C_UpdateNPCName::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernTopStats_C_UpdateNPCName, K2Node_Select_Default) == 0x00001C, "Member 'WBP_ModernTopStats_C_UpdateNPCName::K2Node_Select_Default' has a wrong offset!");

}

