#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Modern_Menu_Player_Footer

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "CommonInput_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Modern_Menu_Player_Footer.WBP_Modern_Menu_Player_Footer_C
// 0x0030 (0x0318 - 0x02E8)
class UWBP_Modern_Menu_Player_Footer_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVFooterViewModel*                      VFooterViewModel;                                  // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         BA_Box;                                            // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Modern_Menu_Player_BoundAction_C*  Player_Bound_Action;                               // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UWBP_Modern_Menu_Player_BoundAction_C*> BoundActionOnFooter;                        // 0x0308(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void AddInputHint(class UInputAction* New_IA, bool bShouldHideWithKeyboard, bool bShouldHideWithGamepad, const class FText& OverrideName);
	void AddInputHintWithIMC(class UInputAction* New_IA, class UInputMappingContext* NewIMC, bool bShouldHideWithKeyboard, bool bShouldHideWithGamepad, const class FText& OverrideName);
	void Clear_Footer();
	void Construct();
	void ExecuteUbergraph_WBP_Modern_Menu_Player_Footer(int32 EntryPoint);
	void Get_Bound_Action_Widget(class UInputAction* Input_Action, class UWBP_Modern_Menu_Player_BoundAction_C** Widget);
	void On_Input_Method_Changed(ECommonInputType NewInputType);
	void On_Toggle_Input_Visibility(bool bInIsVisible);
	void OnHoldInputCancel(class UInputAction* InputAction);
	void OnHoldInputStart(class UInputAction* InputAction);
	void PluginCompliance(bool bPluginCompliance);
	void UpdateInputActionDescription(const struct FFooterInputActionDescription& NewInputActionDescription);
	void UpdateInputActionVisibility(const struct FFooterInputActionVisibility& NewInputActionVisibility);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Modern_Menu_Player_Footer_C">();
	}
	static class UWBP_Modern_Menu_Player_Footer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Modern_Menu_Player_Footer_C>();
	}
};
static_assert(alignof(UWBP_Modern_Menu_Player_Footer_C) == 0x000008, "Wrong alignment on UWBP_Modern_Menu_Player_Footer_C");
static_assert(sizeof(UWBP_Modern_Menu_Player_Footer_C) == 0x000318, "Wrong size on UWBP_Modern_Menu_Player_Footer_C");
static_assert(offsetof(UWBP_Modern_Menu_Player_Footer_C, UberGraphFrame) == 0x0002E8, "Member 'UWBP_Modern_Menu_Player_Footer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Menu_Player_Footer_C, VFooterViewModel) == 0x0002F0, "Member 'UWBP_Modern_Menu_Player_Footer_C::VFooterViewModel' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Menu_Player_Footer_C, BA_Box) == 0x0002F8, "Member 'UWBP_Modern_Menu_Player_Footer_C::BA_Box' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Menu_Player_Footer_C, Player_Bound_Action) == 0x000300, "Member 'UWBP_Modern_Menu_Player_Footer_C::Player_Bound_Action' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Menu_Player_Footer_C, BoundActionOnFooter) == 0x000308, "Member 'UWBP_Modern_Menu_Player_Footer_C::BoundActionOnFooter' has a wrong offset!");

}

