#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LegacyMenu_MapPopup

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Altar_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_LegacyMenu_MapPopup.WBP_LegacyMenu_MapPopup_C
// 0x0030 (0x04F8 - 0x04C8)
class UWBP_LegacyMenu_MapPopup_C final : public UVAltarWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             MapWorldIcontext;                                  // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsIconOnLeft;                                      // 0x04D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D9[0x7];                                      // 0x04D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Text;                                              // 0x04E0(0x0018)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_WBP_LegacyMenu_MapPopup(int32 EntryPoint);
	void OnSynchronizeProperties();
	void SetIsIconOnLeft(bool IsIconOnLeft_0);
	void SetText(const class FText& Text_0);
	void SynchronizeProperties();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_LegacyMenu_MapPopup_C">();
	}
	static class UWBP_LegacyMenu_MapPopup_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_LegacyMenu_MapPopup_C>();
	}
};
static_assert(alignof(UWBP_LegacyMenu_MapPopup_C) == 0x000008, "Wrong alignment on UWBP_LegacyMenu_MapPopup_C");
static_assert(sizeof(UWBP_LegacyMenu_MapPopup_C) == 0x0004F8, "Wrong size on UWBP_LegacyMenu_MapPopup_C");
static_assert(offsetof(UWBP_LegacyMenu_MapPopup_C, UberGraphFrame) == 0x0004C8, "Member 'UWBP_LegacyMenu_MapPopup_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_LegacyMenu_MapPopup_C, MapWorldIcontext) == 0x0004D0, "Member 'UWBP_LegacyMenu_MapPopup_C::MapWorldIcontext' has a wrong offset!");
static_assert(offsetof(UWBP_LegacyMenu_MapPopup_C, IsIconOnLeft) == 0x0004D8, "Member 'UWBP_LegacyMenu_MapPopup_C::IsIconOnLeft' has a wrong offset!");
static_assert(offsetof(UWBP_LegacyMenu_MapPopup_C, Text) == 0x0004E0, "Member 'UWBP_LegacyMenu_MapPopup_C::Text' has a wrong offset!");

}

