#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModernMenu_Help

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "CommonInput_structs.hpp"
#include "Altar_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ModernMenu_Help.WBP_ModernMenu_Help_C
// 0x00E0 (0x05F0 - 0x0510)
class UWBP_ModernMenu_Help_C final : public UVModernHelpMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0510(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVFooterViewModel*                      VFooterViewModel;                                  // 0x0518(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UVHelpMenuViewModel*                    VHelpMenuViewModel;                                // 0x0520(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       EntriesFadeInOut;                                  // 0x0528(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ListFadeInOut;                                     // 0x0530(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HelpSlideRight;                                    // 0x0538(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HelpSlideLeft;                                     // 0x0540(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HelpFadeinOut;                                     // 0x0548(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UVModernScrollBox*                      DescriptionScrollBox;                              // 0x0550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModernMenu_HelpEntryMedia_C*       DetailMedia;                                       // 0x0558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AltarTextBlock_C*                  DetailName;                                        // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVModernScrollBox*                      DetailScroll;                                      // 0x0568(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AltarTextBlock_C*                  DetailsIndex;                                      // 0x0570(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AltarRichTextBlock_C*              DetailText;                                        // 0x0578(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AltarRichTextBlock_C*              EntryDescription;                                  // 0x0580(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModernMenu_HelpEntryMedia_C*       EntryMedia;                                        // 0x0588(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AltarTextBlock_C*                  EntryName;                                         // 0x0590(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               help_rightbackground_ornament;                     // 0x0598(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ListView_Help_C*                   ListEntries;                                       // 0x05A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           ListRight;                                         // 0x05A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Modes;                                             // 0x05B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModernPrefab_Button_C*             NextButton;                                        // 0x05B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModernPrefab_Button_C*             PreviousButton;                                    // 0x05C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModernPrefab_Button_C*             ReadMoreButton;                                    // 0x05C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DetailsScrollMaterial;                             // 0x05D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        DetailScrollSpeed;                                 // 0x05D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DescriptionScrollMaterial;                         // 0x05E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UHelpMenuListEntryData*                 As_Help_Menu_List_Entry_Data;                      // 0x05E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_ModernMenu_Help_ListView_K2Node_ComponentBoundEvent_0_OnItemClicked__DelegateSignature(class UObject* SelectedItem);
	void BndEvt__WBP_ModernMenu_Help_ListView_K2Node_ComponentBoundEvent_1_OnItemSelected__DelegateSignature(class UObject* Item);
	void BndEvt__WBP_ModernMenu_Help_NextButton_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_ModernMenu_Help_PreviousButton_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_ModernMenu_Help_ReadMoreButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BP_OnActivated();
	void BP_OnDeactivated();
	void BP_OnTirggeringActionCommited();
	bool CanDoOneMoreStep(bool Forward);
	void Construct();
	void DoScroll(double ScrollDeltaRaw, class UVModernScrollBox* ScrollBoxTarget);
	void ExecuteUbergraph_WBP_ModernMenu_Help(int32 EntryPoint);
	void FadeInOutMenu(bool bIsVisible, bool bFromLeft, bool bInstant);
	void Handle_Input_Scrolling(double In_Scroll_Delta_Raw);
	void HandleSectionWhenNavigatingFromDetailsPanel(bool Forward);
	void InitializeDetails();
	void InpActEvt_IA_UI_Generic_NavigateDown_K2Node_EnhancedInputActionEvent_0(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_Generic_NavigateUp_K2Node_EnhancedInputActionEvent_1(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_Specific_HelpMenu_More_K2Node_EnhancedInputActionEvent_3(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_Specific_HelpMenu_Prev_K2Node_EnhancedInputActionEvent_4(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_Specific_HelpMenu_ScrollDetails_K2Node_EnhancedInputActionEvent_2(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void LoadHelpMenu();
	void MenuFadeInOut(bool InIsVisible, bool InIsFromLeft, bool InInstant);
	void NavigateEntryFromMoreDetailsPanel(bool Forward, bool* DidOneStep);
	void NavigateToNextOrPrevEntryInList(bool Forward);
	void On_Input_Method_Changed(ECommonInputType bNewInputType);
	void OnDataSelectionToggled();
	void OnFocus();
	void OnListEntriesUpdated(const TArray<class UHelpMenuListEntryData*>& InListData);
	void OnNavigateEntry(class UHelpMenuListEntryData* Entry);
	void PopulateListDetail();
	void SetInputForFooter(class UWBP_Modern_Menu_Player_Footer_C* Footer);
	void Show_More();
	bool ShowLess();
	void UnloadHelpMenu();
	void UpdateFocus();
	void UpdateFooter(class UHelpMenuListEntryData* SelectedEntry);
	void UpdateListEntryAnimation(const class UObject* Item);
	void UpdateListEntryAnimationInstant(const class UObject* Item);
	void UpdateViewMode(int32 Index_0);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ModernMenu_Help_C">();
	}
	static class UWBP_ModernMenu_Help_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ModernMenu_Help_C>();
	}
};
static_assert(alignof(UWBP_ModernMenu_Help_C) == 0x000008, "Wrong alignment on UWBP_ModernMenu_Help_C");
static_assert(sizeof(UWBP_ModernMenu_Help_C) == 0x0005F0, "Wrong size on UWBP_ModernMenu_Help_C");
static_assert(offsetof(UWBP_ModernMenu_Help_C, UberGraphFrame) == 0x000510, "Member 'UWBP_ModernMenu_Help_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_Help_C, VFooterViewModel) == 0x000518, "Member 'UWBP_ModernMenu_Help_C::VFooterViewModel' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_Help_C, VHelpMenuViewModel) == 0x000520, "Member 'UWBP_ModernMenu_Help_C::VHelpMenuViewModel' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_Help_C, EntriesFadeInOut) == 0x000528, "Member 'UWBP_ModernMenu_Help_C::EntriesFadeInOut' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_Help_C, ListFadeInOut) == 0x000530, "Member 'UWBP_ModernMenu_Help_C::ListFadeInOut' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_Help_C, HelpSlideRight) == 0x000538, "Member 'UWBP_ModernMenu_Help_C::HelpSlideRight' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_Help_C, HelpSlideLeft) == 0x000540, "Member 'UWBP_ModernMenu_Help_C::HelpSlideLeft' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_Help_C, HelpFadeinOut) == 0x000548, "Member 'UWBP_ModernMenu_Help_C::HelpFadeinOut' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_Help_C, DescriptionScrollBox) == 0x000550, "Member 'UWBP_ModernMenu_Help_C::DescriptionScrollBox' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_Help_C, DetailMedia) == 0x000558, "Member 'UWBP_ModernMenu_Help_C::DetailMedia' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_Help_C, DetailName) == 0x000560, "Member 'UWBP_ModernMenu_Help_C::DetailName' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_Help_C, DetailScroll) == 0x000568, "Member 'UWBP_ModernMenu_Help_C::DetailScroll' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_Help_C, DetailsIndex) == 0x000570, "Member 'UWBP_ModernMenu_Help_C::DetailsIndex' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_Help_C, DetailText) == 0x000578, "Member 'UWBP_ModernMenu_Help_C::DetailText' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_Help_C, EntryDescription) == 0x000580, "Member 'UWBP_ModernMenu_Help_C::EntryDescription' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_Help_C, EntryMedia) == 0x000588, "Member 'UWBP_ModernMenu_Help_C::EntryMedia' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_Help_C, EntryName) == 0x000590, "Member 'UWBP_ModernMenu_Help_C::EntryName' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_Help_C, help_rightbackground_ornament) == 0x000598, "Member 'UWBP_ModernMenu_Help_C::help_rightbackground_ornament' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_Help_C, ListEntries) == 0x0005A0, "Member 'UWBP_ModernMenu_Help_C::ListEntries' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_Help_C, ListRight) == 0x0005A8, "Member 'UWBP_ModernMenu_Help_C::ListRight' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_Help_C, Modes) == 0x0005B0, "Member 'UWBP_ModernMenu_Help_C::Modes' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_Help_C, NextButton) == 0x0005B8, "Member 'UWBP_ModernMenu_Help_C::NextButton' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_Help_C, PreviousButton) == 0x0005C0, "Member 'UWBP_ModernMenu_Help_C::PreviousButton' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_Help_C, ReadMoreButton) == 0x0005C8, "Member 'UWBP_ModernMenu_Help_C::ReadMoreButton' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_Help_C, DetailsScrollMaterial) == 0x0005D0, "Member 'UWBP_ModernMenu_Help_C::DetailsScrollMaterial' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_Help_C, DetailScrollSpeed) == 0x0005D8, "Member 'UWBP_ModernMenu_Help_C::DetailScrollSpeed' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_Help_C, DescriptionScrollMaterial) == 0x0005E0, "Member 'UWBP_ModernMenu_Help_C::DescriptionScrollMaterial' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_Help_C, As_Help_Menu_List_Entry_Data) == 0x0005E8, "Member 'UWBP_ModernMenu_Help_C::As_Help_Menu_List_Entry_Data' has a wrong offset!");

}

