#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MainMenu_Button_Wrapper

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Altar_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MainMenu_Button_Wrapper.WBP_MainMenu_Button_Wrapper_C
// 0x0040 (0x0508 - 0x04C8)
class UWBP_MainMenu_Button_Wrapper_C final : public UVAltarWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_MainMenu_Button_C*                 WBP_MainMenu_Button;                               // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UCommonButtonBase* Button)> OnClick;                         // 0x04D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FText                                   ButtonText;                                        // 0x04E8(0x0018)(Edit, BlueprintVisible)
	bool                                          IsAllowedToNavigate;                               // 0x0500(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetIsEnable(bool InIsEnable);
	void SetButtonText(const class FText& NewText);
	void PreConstruct(bool IsDesignTime);
	void OnFocus();
	bool GetIsEnable();
	void BndEvt__WBP_MainMenu_Button_Wrapper_WBP_MainMenu_Button_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void ExecuteUbergraph_WBP_MainMenu_Button_Wrapper(int32 EntryPoint);
	void Construct();

	bool IsNavigable() const;
	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MainMenu_Button_Wrapper_C">();
	}
	static class UWBP_MainMenu_Button_Wrapper_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MainMenu_Button_Wrapper_C>();
	}
};
static_assert(alignof(UWBP_MainMenu_Button_Wrapper_C) == 0x000008, "Wrong alignment on UWBP_MainMenu_Button_Wrapper_C");
static_assert(sizeof(UWBP_MainMenu_Button_Wrapper_C) == 0x000508, "Wrong size on UWBP_MainMenu_Button_Wrapper_C");
static_assert(offsetof(UWBP_MainMenu_Button_Wrapper_C, UberGraphFrame) == 0x0004C8, "Member 'UWBP_MainMenu_Button_Wrapper_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Button_Wrapper_C, WBP_MainMenu_Button) == 0x0004D0, "Member 'UWBP_MainMenu_Button_Wrapper_C::WBP_MainMenu_Button' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Button_Wrapper_C, OnClick) == 0x0004D8, "Member 'UWBP_MainMenu_Button_Wrapper_C::OnClick' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Button_Wrapper_C, ButtonText) == 0x0004E8, "Member 'UWBP_MainMenu_Button_Wrapper_C::ButtonText' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Button_Wrapper_C, IsAllowedToNavigate) == 0x000500, "Member 'UWBP_MainMenu_Button_Wrapper_C::IsAllowedToNavigate' has a wrong offset!");

}

