#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_AltarBinkMediaPlayer

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "Altar_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_AltarBinkMediaPlayer.WBP_AltarBinkMediaPlayer_C
// 0x0038 (0x03D8 - 0x03A0)
class UWBP_AltarBinkMediaPlayer_C final : public UVAltarBinkMediaPlayer
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOutSubtitle;                                   // 0x03A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeInSubtitle;                                    // 0x03B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BlackBackground;                                   // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               SubtitleOverlay;                                   // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AltarTextBlock_C*                  SubtitleText;                                      // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          NeedBlackBox;                                      // 0x03D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void StartSubtitleFadeOut();
	void PreConstruct(bool IsDesignTime);
	void OnStopCurrentSubtitle();
	void OnStartNextSubtitle(const class FText& SubtitleText_0);
	void ExecuteUbergraph_WBP_AltarBinkMediaPlayer(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_AltarBinkMediaPlayer_C">();
	}
	static class UWBP_AltarBinkMediaPlayer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_AltarBinkMediaPlayer_C>();
	}
};
static_assert(alignof(UWBP_AltarBinkMediaPlayer_C) == 0x000008, "Wrong alignment on UWBP_AltarBinkMediaPlayer_C");
static_assert(sizeof(UWBP_AltarBinkMediaPlayer_C) == 0x0003D8, "Wrong size on UWBP_AltarBinkMediaPlayer_C");
static_assert(offsetof(UWBP_AltarBinkMediaPlayer_C, UberGraphFrame) == 0x0003A0, "Member 'UWBP_AltarBinkMediaPlayer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_AltarBinkMediaPlayer_C, FadeOutSubtitle) == 0x0003A8, "Member 'UWBP_AltarBinkMediaPlayer_C::FadeOutSubtitle' has a wrong offset!");
static_assert(offsetof(UWBP_AltarBinkMediaPlayer_C, FadeInSubtitle) == 0x0003B0, "Member 'UWBP_AltarBinkMediaPlayer_C::FadeInSubtitle' has a wrong offset!");
static_assert(offsetof(UWBP_AltarBinkMediaPlayer_C, BlackBackground) == 0x0003B8, "Member 'UWBP_AltarBinkMediaPlayer_C::BlackBackground' has a wrong offset!");
static_assert(offsetof(UWBP_AltarBinkMediaPlayer_C, SubtitleOverlay) == 0x0003C0, "Member 'UWBP_AltarBinkMediaPlayer_C::SubtitleOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_AltarBinkMediaPlayer_C, SubtitleText) == 0x0003C8, "Member 'UWBP_AltarBinkMediaPlayer_C::SubtitleText' has a wrong offset!");
static_assert(offsetof(UWBP_AltarBinkMediaPlayer_C, NeedBlackBox) == 0x0003D0, "Member 'UWBP_AltarBinkMediaPlayer_C::NeedBlackBox' has a wrong offset!");

}

