#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Modern_Settings_StepsBox

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "Engine_structs.hpp"
#include "Altar_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Modern_Settings_StepsBox.WBP_Modern_Settings_StepsBox_C
// 0x0080 (0x0340 - 0x02C0)
class UWBP_Modern_Settings_StepsBox_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USizeBox*                               ButtonSizeBox;                                     // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox;                                     // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                MouseButton;                                       // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AltarTextBlock_C*                  StepLabel;                                         // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<struct FModernSettingSingleCommand>    StepsData;                                         // 0x02E8(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	int32                                         CurrentIndex;                                      // 0x02F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_2FC[0x4];                                      // 0x02FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(int32 StepIndex, const class FString& Value)> OnStepSelected;      // 0x0300(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FMargin                                ButtonPadding;                                     // 0x0310(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        ButtonMaxHeight;                                   // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWBP_Modern_Settings_Step_C*>    Steps;                                             // 0x0328(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                          LockState;                                         // 0x0338(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateLockState(bool NewLockState);
	void SelectSteps(int32 NewIndex, bool bDoIgnoreBroadcast);
	void PopulateSteps(int32 StartIndex, TArray<struct FModernSettingSingleCommand>& NewStepData);
	void OnUnfocus();
	void OnFocus();
	void PreConstruct(bool IsDesignTime);
	void GetCurrentValue(class FString* Value);
	void GetCurrentIndex(int32* Value);
	void ExecuteUbergraph_WBP_Modern_Settings_StepsBox(int32 EntryPoint);
	void BndEvt__WBP_Modern_VideoSettings_StepsBox_MouseButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Modern_Settings_StepsBox_C">();
	}
	static class UWBP_Modern_Settings_StepsBox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Modern_Settings_StepsBox_C>();
	}
};
static_assert(alignof(UWBP_Modern_Settings_StepsBox_C) == 0x000008, "Wrong alignment on UWBP_Modern_Settings_StepsBox_C");
static_assert(sizeof(UWBP_Modern_Settings_StepsBox_C) == 0x000340, "Wrong size on UWBP_Modern_Settings_StepsBox_C");
static_assert(offsetof(UWBP_Modern_Settings_StepsBox_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_Modern_Settings_StepsBox_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_StepsBox_C, ButtonSizeBox) == 0x0002C8, "Member 'UWBP_Modern_Settings_StepsBox_C::ButtonSizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_StepsBox_C, HorizontalBox) == 0x0002D0, "Member 'UWBP_Modern_Settings_StepsBox_C::HorizontalBox' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_StepsBox_C, MouseButton) == 0x0002D8, "Member 'UWBP_Modern_Settings_StepsBox_C::MouseButton' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_StepsBox_C, StepLabel) == 0x0002E0, "Member 'UWBP_Modern_Settings_StepsBox_C::StepLabel' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_StepsBox_C, StepsData) == 0x0002E8, "Member 'UWBP_Modern_Settings_StepsBox_C::StepsData' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_StepsBox_C, CurrentIndex) == 0x0002F8, "Member 'UWBP_Modern_Settings_StepsBox_C::CurrentIndex' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_StepsBox_C, OnStepSelected) == 0x000300, "Member 'UWBP_Modern_Settings_StepsBox_C::OnStepSelected' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_StepsBox_C, ButtonPadding) == 0x000310, "Member 'UWBP_Modern_Settings_StepsBox_C::ButtonPadding' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_StepsBox_C, ButtonMaxHeight) == 0x000320, "Member 'UWBP_Modern_Settings_StepsBox_C::ButtonMaxHeight' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_StepsBox_C, Steps) == 0x000328, "Member 'UWBP_Modern_Settings_StepsBox_C::Steps' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_StepsBox_C, LockState) == 0x000338, "Member 'UWBP_Modern_Settings_StepsBox_C::LockState' has a wrong offset!");

}

