#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Graphics_TogglerOnOff

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Altar_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Graphics_TogglerOnOff.WBP_Graphics_TogglerOnOff_C
// 0x0020 (0x0520 - 0x0500)
class UWBP_Graphics_TogglerOnOff_C final : public UVDebugGraphicsSettingWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0500(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_OFF;                                        // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_ON;                                         // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             RowLabel_Text;                                     // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__WBP_Graphics_TogglerOnOff_Button_OFF_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__WBP_Graphics_TogglerOnOff_Button_ON_K2Node_ComponentBoundEvent_1_OnButtonPressedEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_WBP_Graphics_TogglerOnOff(int32 EntryPoint);
	void HDRSwitch(bool Off, bool On);
	void OnRefresh();
	void Refresh();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Graphics_TogglerOnOff_C">();
	}
	static class UWBP_Graphics_TogglerOnOff_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Graphics_TogglerOnOff_C>();
	}
};
static_assert(alignof(UWBP_Graphics_TogglerOnOff_C) == 0x000008, "Wrong alignment on UWBP_Graphics_TogglerOnOff_C");
static_assert(sizeof(UWBP_Graphics_TogglerOnOff_C) == 0x000520, "Wrong size on UWBP_Graphics_TogglerOnOff_C");
static_assert(offsetof(UWBP_Graphics_TogglerOnOff_C, UberGraphFrame) == 0x000500, "Member 'UWBP_Graphics_TogglerOnOff_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Graphics_TogglerOnOff_C, Button_OFF) == 0x000508, "Member 'UWBP_Graphics_TogglerOnOff_C::Button_OFF' has a wrong offset!");
static_assert(offsetof(UWBP_Graphics_TogglerOnOff_C, Button_ON) == 0x000510, "Member 'UWBP_Graphics_TogglerOnOff_C::Button_ON' has a wrong offset!");
static_assert(offsetof(UWBP_Graphics_TogglerOnOff_C, RowLabel_Text) == 0x000518, "Member 'UWBP_Graphics_TogglerOnOff_C::RowLabel_Text' has a wrong offset!");

}

