#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModernMenu_Loading

#include "Basic.hpp"

#include "Altar_structs.hpp"
#include "Altar_classes.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ModernMenu_Loading.WBP_ModernMenu_Loading_C
// 0x00D8 (0x05C0 - 0x04E8)
class UWBP_ModernMenu_Loading_C final : public UVLoadingScreen
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVLoadingScreenViewModel*               VLoadingScreenViewModel;                           // 0x04F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeOut;                                           // 0x04F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeIn;                                            // 0x0500(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       LoadIconAnimation;                                 // 0x0508(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 LoadingScreenIcon;                                 // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               LoadingScreenMainImage;                            // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               LoadingScreenShadowVignette;                       // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AltarTextBlock_C*                  LoadingScreenTooltip;                              // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               PlayerCanLevelUpIcon;                              // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               PlayerDataShadow;                                  // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         PlayerInfosHorizontalBox;                          // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AltarTextBlock_C*                  PlayerLevelNumber;                                 // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AltarTextBlock_C*                  PlayerLevelText;                                   // 0x0550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AltarTextBlock_C*                  PlayerNameText;                                    // 0x0558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               WBP_OriginalImageTile;                             // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDataTable*                             LoadingText_DT;                                    // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             LoadingImage_DT;                                   // 0x0570(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<struct FHintData>                      Hints;                                             // 0x0578(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        TimeBetweenLoadingScreenHints;                     // 0x0588(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           PeriodicHintTimerHandle;                           // 0x0590(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FLoadScreenPlayerData                  Player_Data;                                       // 0x0598(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	ELoadingScreenType                            Current_Loading_Screen_Type;                       // 0x05B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ApplyVignetteVisibility();
	void BeginRemoveLoadingScreen();
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WBP_ModernMenu_Loading(int32 EntryPoint);
	void InitializePlayerDataFromSaveData();
	void OnInitialized();
	void PluginCompliance(bool NewParam);
	void SetHint();
	void SetLoadingScreenType(ELoadingScreenType NewLoadingScreenType);
	void SetLoadingTexture();
	void UpdateLoadingScreenHints(TArray<struct FHintData>& Hints_0);
	void UpdatePlayerData(const struct FLoadScreenPlayerData& InNewPlayerData);
	void UpdatePlayerDataFromPairedData(const struct FLoadScreenPlayerData& InNewPlayerData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ModernMenu_Loading_C">();
	}
	static class UWBP_ModernMenu_Loading_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ModernMenu_Loading_C>();
	}
};
static_assert(alignof(UWBP_ModernMenu_Loading_C) == 0x000008, "Wrong alignment on UWBP_ModernMenu_Loading_C");
static_assert(sizeof(UWBP_ModernMenu_Loading_C) == 0x0005C0, "Wrong size on UWBP_ModernMenu_Loading_C");
static_assert(offsetof(UWBP_ModernMenu_Loading_C, UberGraphFrame) == 0x0004E8, "Member 'UWBP_ModernMenu_Loading_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_Loading_C, VLoadingScreenViewModel) == 0x0004F0, "Member 'UWBP_ModernMenu_Loading_C::VLoadingScreenViewModel' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_Loading_C, FadeOut) == 0x0004F8, "Member 'UWBP_ModernMenu_Loading_C::FadeOut' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_Loading_C, FadeIn) == 0x000500, "Member 'UWBP_ModernMenu_Loading_C::FadeIn' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_Loading_C, LoadIconAnimation) == 0x000508, "Member 'UWBP_ModernMenu_Loading_C::LoadIconAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_Loading_C, LoadingScreenIcon) == 0x000510, "Member 'UWBP_ModernMenu_Loading_C::LoadingScreenIcon' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_Loading_C, LoadingScreenMainImage) == 0x000518, "Member 'UWBP_ModernMenu_Loading_C::LoadingScreenMainImage' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_Loading_C, LoadingScreenShadowVignette) == 0x000520, "Member 'UWBP_ModernMenu_Loading_C::LoadingScreenShadowVignette' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_Loading_C, LoadingScreenTooltip) == 0x000528, "Member 'UWBP_ModernMenu_Loading_C::LoadingScreenTooltip' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_Loading_C, PlayerCanLevelUpIcon) == 0x000530, "Member 'UWBP_ModernMenu_Loading_C::PlayerCanLevelUpIcon' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_Loading_C, PlayerDataShadow) == 0x000538, "Member 'UWBP_ModernMenu_Loading_C::PlayerDataShadow' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_Loading_C, PlayerInfosHorizontalBox) == 0x000540, "Member 'UWBP_ModernMenu_Loading_C::PlayerInfosHorizontalBox' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_Loading_C, PlayerLevelNumber) == 0x000548, "Member 'UWBP_ModernMenu_Loading_C::PlayerLevelNumber' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_Loading_C, PlayerLevelText) == 0x000550, "Member 'UWBP_ModernMenu_Loading_C::PlayerLevelText' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_Loading_C, PlayerNameText) == 0x000558, "Member 'UWBP_ModernMenu_Loading_C::PlayerNameText' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_Loading_C, WBP_OriginalImageTile) == 0x000560, "Member 'UWBP_ModernMenu_Loading_C::WBP_OriginalImageTile' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_Loading_C, LoadingText_DT) == 0x000568, "Member 'UWBP_ModernMenu_Loading_C::LoadingText_DT' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_Loading_C, LoadingImage_DT) == 0x000570, "Member 'UWBP_ModernMenu_Loading_C::LoadingImage_DT' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_Loading_C, Hints) == 0x000578, "Member 'UWBP_ModernMenu_Loading_C::Hints' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_Loading_C, TimeBetweenLoadingScreenHints) == 0x000588, "Member 'UWBP_ModernMenu_Loading_C::TimeBetweenLoadingScreenHints' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_Loading_C, PeriodicHintTimerHandle) == 0x000590, "Member 'UWBP_ModernMenu_Loading_C::PeriodicHintTimerHandle' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_Loading_C, Player_Data) == 0x000598, "Member 'UWBP_ModernMenu_Loading_C::Player_Data' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_Loading_C, Current_Loading_Screen_Type) == 0x0005B8, "Member 'UWBP_ModernMenu_Loading_C::Current_Loading_Screen_Type' has a wrong offset!");

}

