#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_OptionsMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Altar_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_OptionsMenu.WBP_OptionsMenu_1_C
// 0x0078 (0x0568 - 0x04F0)
class UWBP_OptionsMenu_1_C final : public UVLegacySettingsMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                apply_button;                                      // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                audio_button;                                      // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Background;                                        // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Background_Border;                                 // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Background_Content;                                // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Background_Sub;                                    // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                control_button;                                    // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                gameplay_button;                                   // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                graphics_button;                                   // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                reset_button;                                      // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                return_button;                                     // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USlider*                                Slider_Opacity;                                    // 0x0550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GraphicsPanel_C*                   WBP_GraphicsPanelNew;                              // 0x0558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher;                                    // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__WBP_OptionsMenu_audio_button_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_OptionsMenu_control_button_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_OptionsMenu_gameplay_button_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_OptionsMenu_graphics_button_K2Node_ComponentBoundEvent_5_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_OptionsMenu_return_button_K2Node_ComponentBoundEvent_6_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_WBP_OptionsMenu_1(int32 EntryPoint);
	void On_Opacity_Slider_Change(float Value);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_OptionsMenu_1_C">();
	}
	static class UWBP_OptionsMenu_1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_OptionsMenu_1_C>();
	}
};
static_assert(alignof(UWBP_OptionsMenu_1_C) == 0x000008, "Wrong alignment on UWBP_OptionsMenu_1_C");
static_assert(sizeof(UWBP_OptionsMenu_1_C) == 0x000568, "Wrong size on UWBP_OptionsMenu_1_C");
static_assert(offsetof(UWBP_OptionsMenu_1_C, UberGraphFrame) == 0x0004F0, "Member 'UWBP_OptionsMenu_1_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_OptionsMenu_1_C, apply_button) == 0x0004F8, "Member 'UWBP_OptionsMenu_1_C::apply_button' has a wrong offset!");
static_assert(offsetof(UWBP_OptionsMenu_1_C, audio_button) == 0x000500, "Member 'UWBP_OptionsMenu_1_C::audio_button' has a wrong offset!");
static_assert(offsetof(UWBP_OptionsMenu_1_C, Background) == 0x000508, "Member 'UWBP_OptionsMenu_1_C::Background' has a wrong offset!");
static_assert(offsetof(UWBP_OptionsMenu_1_C, Background_Border) == 0x000510, "Member 'UWBP_OptionsMenu_1_C::Background_Border' has a wrong offset!");
static_assert(offsetof(UWBP_OptionsMenu_1_C, Background_Content) == 0x000518, "Member 'UWBP_OptionsMenu_1_C::Background_Content' has a wrong offset!");
static_assert(offsetof(UWBP_OptionsMenu_1_C, Background_Sub) == 0x000520, "Member 'UWBP_OptionsMenu_1_C::Background_Sub' has a wrong offset!");
static_assert(offsetof(UWBP_OptionsMenu_1_C, control_button) == 0x000528, "Member 'UWBP_OptionsMenu_1_C::control_button' has a wrong offset!");
static_assert(offsetof(UWBP_OptionsMenu_1_C, gameplay_button) == 0x000530, "Member 'UWBP_OptionsMenu_1_C::gameplay_button' has a wrong offset!");
static_assert(offsetof(UWBP_OptionsMenu_1_C, graphics_button) == 0x000538, "Member 'UWBP_OptionsMenu_1_C::graphics_button' has a wrong offset!");
static_assert(offsetof(UWBP_OptionsMenu_1_C, reset_button) == 0x000540, "Member 'UWBP_OptionsMenu_1_C::reset_button' has a wrong offset!");
static_assert(offsetof(UWBP_OptionsMenu_1_C, return_button) == 0x000548, "Member 'UWBP_OptionsMenu_1_C::return_button' has a wrong offset!");
static_assert(offsetof(UWBP_OptionsMenu_1_C, Slider_Opacity) == 0x000550, "Member 'UWBP_OptionsMenu_1_C::Slider_Opacity' has a wrong offset!");
static_assert(offsetof(UWBP_OptionsMenu_1_C, WBP_GraphicsPanelNew) == 0x000558, "Member 'UWBP_OptionsMenu_1_C::WBP_GraphicsPanelNew' has a wrong offset!");
static_assert(offsetof(UWBP_OptionsMenu_1_C, WidgetSwitcher) == 0x000560, "Member 'UWBP_OptionsMenu_1_C::WidgetSwitcher' has a wrong offset!");

// WidgetBlueprintGeneratedClass WBP_OptionsMenu.WBP_OptionsMenu_C
// 0x0080 (0x0570 - 0x04F0)
class UWBP_OptionsMenu_C final : public UVLegacySettingsMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                apply_button;                                      // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                audio_button;                                      // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Background;                                        // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Background_Border;                                 // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Background_Content;                                // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Background_Sub;                                    // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                control_button;                                    // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                gameplay_button;                                   // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                graphics_button;                                   // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                reset_button;                                      // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                return_button;                                     // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USlider*                                Slider_Opacity;                                    // 0x0550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GraphicsPanel_C*                   WBP_GraphicsPanelNew;                              // 0x0558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher;                                    // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          CachedShowMouseCursor;                             // 0x0568(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_OptionsMenu_apply_button_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_OptionsMenu_audio_button_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_OptionsMenu_control_button_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_OptionsMenu_gameplay_button_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_OptionsMenu_graphics_button_K2Node_ComponentBoundEvent_5_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_OptionsMenu_return_button_K2Node_ComponentBoundEvent_6_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_WBP_OptionsMenu(int32 EntryPoint);
	void On_Opacity_Slider_Change(float Value);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_OptionsMenu_C">();
	}
	static class UWBP_OptionsMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_OptionsMenu_C>();
	}
};
static_assert(alignof(UWBP_OptionsMenu_C) == 0x000008, "Wrong alignment on UWBP_OptionsMenu_C");
static_assert(sizeof(UWBP_OptionsMenu_C) == 0x000570, "Wrong size on UWBP_OptionsMenu_C");
static_assert(offsetof(UWBP_OptionsMenu_C, UberGraphFrame) == 0x0004F0, "Member 'UWBP_OptionsMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_OptionsMenu_C, apply_button) == 0x0004F8, "Member 'UWBP_OptionsMenu_C::apply_button' has a wrong offset!");
static_assert(offsetof(UWBP_OptionsMenu_C, audio_button) == 0x000500, "Member 'UWBP_OptionsMenu_C::audio_button' has a wrong offset!");
static_assert(offsetof(UWBP_OptionsMenu_C, Background) == 0x000508, "Member 'UWBP_OptionsMenu_C::Background' has a wrong offset!");
static_assert(offsetof(UWBP_OptionsMenu_C, Background_Border) == 0x000510, "Member 'UWBP_OptionsMenu_C::Background_Border' has a wrong offset!");
static_assert(offsetof(UWBP_OptionsMenu_C, Background_Content) == 0x000518, "Member 'UWBP_OptionsMenu_C::Background_Content' has a wrong offset!");
static_assert(offsetof(UWBP_OptionsMenu_C, Background_Sub) == 0x000520, "Member 'UWBP_OptionsMenu_C::Background_Sub' has a wrong offset!");
static_assert(offsetof(UWBP_OptionsMenu_C, control_button) == 0x000528, "Member 'UWBP_OptionsMenu_C::control_button' has a wrong offset!");
static_assert(offsetof(UWBP_OptionsMenu_C, gameplay_button) == 0x000530, "Member 'UWBP_OptionsMenu_C::gameplay_button' has a wrong offset!");
static_assert(offsetof(UWBP_OptionsMenu_C, graphics_button) == 0x000538, "Member 'UWBP_OptionsMenu_C::graphics_button' has a wrong offset!");
static_assert(offsetof(UWBP_OptionsMenu_C, reset_button) == 0x000540, "Member 'UWBP_OptionsMenu_C::reset_button' has a wrong offset!");
static_assert(offsetof(UWBP_OptionsMenu_C, return_button) == 0x000548, "Member 'UWBP_OptionsMenu_C::return_button' has a wrong offset!");
static_assert(offsetof(UWBP_OptionsMenu_C, Slider_Opacity) == 0x000550, "Member 'UWBP_OptionsMenu_C::Slider_Opacity' has a wrong offset!");
static_assert(offsetof(UWBP_OptionsMenu_C, WBP_GraphicsPanelNew) == 0x000558, "Member 'UWBP_OptionsMenu_C::WBP_GraphicsPanelNew' has a wrong offset!");
static_assert(offsetof(UWBP_OptionsMenu_C, WidgetSwitcher) == 0x000560, "Member 'UWBP_OptionsMenu_C::WidgetSwitcher' has a wrong offset!");
static_assert(offsetof(UWBP_OptionsMenu_C, CachedShowMouseCursor) == 0x000568, "Member 'UWBP_OptionsMenu_C::CachedShowMouseCursor' has a wrong offset!");

}

