#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModernHud_Info

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "Altar_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ModernHud_Info.WBP_ModernHud_Info_C
// 0x0158 (0x0440 - 0x02E8)
class UWBP_ModernHud_Info_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVHUDReticleViewModel*                  VHUDReticleViewModel;                              // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UVHUDInfoViewModel*                     VHUDInfoViewModel;                                 // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeOut;                                           // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeIn;                                            // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UAnimatableRetainerBox*                 AnimatableRetainerBox;                             // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModernHud_InfoIcon_C*              ARMOR;                                             // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Background_Image;                                  // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Modern_Menu_Player_BoundAction_C*  BoundAction;                                       // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Content;                                           // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModernHud_InfoIcon_C*              Damage;                                            // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AltarTextBlock_C*                  EmptyText;                                         // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModernHud_InfoIcon_C*              Health;                                            // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         hudinfo_icons_horizontalbox;                       // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AltarTextBlock_C*                  InfoText;                                          // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModernHud_InfoIcon_C*              LOCK;                                              // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModernHud_InfoIcon_C*              Quantity;                                          // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModernHud_InfoIcon_C*              Uses;                                              // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModernHud_InfoIcon_C*              Value;                                             // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModernHud_InfoIcon_C*              Weight;                                            // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           TelekinesisColour;                                 // 0x0388(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           NonTelekenesisColour;                              // 0x0398(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsShown;                                          // 0x03A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A9[0x7];                                      // 0x03A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 DoorToDestinationLocKey;                           // 0x03B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FName                                   AltarStaticTextStringTableName;                    // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           IllegalColor;                                      // 0x03C8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            IllegalTextColor;                                  // 0x03D8(0x0014)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	struct FSlateColor                            NormalTextColor;                                   // 0x03EC(0x0014)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	struct FLinearColor                           NormalColor;                                       // 0x0400(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 EmptyContainerLocKey;                              // 0x0410(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FLegacyActionProperties                CachedCurrentAction;                               // 0x0420(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void Construct();
	void ExecuteUbergraph_WBP_ModernHud_Info(int32 EntryPoint);
	void GetAtlasIndexFromGamepadEnum(ELegacyXboxFloatingHintButton InHint, int32* Index_0);
	void SetIconTextColour(const struct FLinearColor& Colour);
	void SetIllegalColor(bool& InIsIllegal);
	void ShowHide(bool InShow);
	void Update_Action_Properties(const struct FLegacyActionProperties& InAction);
	void UpdateAction(const struct FLegacyActionProperties& InAction);
	void UpdateEmpty(bool bIsEmpty);
	void UpdateIconProperties(const struct FLegacyIconProperties& InProperties);
	void UpdateIconsProperties(const TMap<ELegacyHudInfoIcon, struct FLegacyIconProperties>& InIcons);
	void UpdateIsIllegal(bool InIllegal);
	void UpdateIsTelekinesisActive(bool Inactive);
	void UpdateTargedItemName(const class FText& InName);
	void UpdateTargetedDoorDestinationName(const class FText& InName);

	void GetIconWidget(uint8 Icon, class UWBP_ModernHud_InfoIcon_C** Widget) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ModernHud_Info_C">();
	}
	static class UWBP_ModernHud_Info_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ModernHud_Info_C>();
	}
};
static_assert(alignof(UWBP_ModernHud_Info_C) == 0x000008, "Wrong alignment on UWBP_ModernHud_Info_C");
static_assert(sizeof(UWBP_ModernHud_Info_C) == 0x000440, "Wrong size on UWBP_ModernHud_Info_C");
static_assert(offsetof(UWBP_ModernHud_Info_C, UberGraphFrame) == 0x0002E8, "Member 'UWBP_ModernHud_Info_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_Info_C, VHUDReticleViewModel) == 0x0002F0, "Member 'UWBP_ModernHud_Info_C::VHUDReticleViewModel' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_Info_C, VHUDInfoViewModel) == 0x0002F8, "Member 'UWBP_ModernHud_Info_C::VHUDInfoViewModel' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_Info_C, FadeOut) == 0x000300, "Member 'UWBP_ModernHud_Info_C::FadeOut' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_Info_C, FadeIn) == 0x000308, "Member 'UWBP_ModernHud_Info_C::FadeIn' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_Info_C, AnimatableRetainerBox) == 0x000310, "Member 'UWBP_ModernHud_Info_C::AnimatableRetainerBox' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_Info_C, ARMOR) == 0x000318, "Member 'UWBP_ModernHud_Info_C::ARMOR' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_Info_C, Background_Image) == 0x000320, "Member 'UWBP_ModernHud_Info_C::Background_Image' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_Info_C, BoundAction) == 0x000328, "Member 'UWBP_ModernHud_Info_C::BoundAction' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_Info_C, Content) == 0x000330, "Member 'UWBP_ModernHud_Info_C::Content' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_Info_C, Damage) == 0x000338, "Member 'UWBP_ModernHud_Info_C::Damage' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_Info_C, EmptyText) == 0x000340, "Member 'UWBP_ModernHud_Info_C::EmptyText' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_Info_C, Health) == 0x000348, "Member 'UWBP_ModernHud_Info_C::Health' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_Info_C, hudinfo_icons_horizontalbox) == 0x000350, "Member 'UWBP_ModernHud_Info_C::hudinfo_icons_horizontalbox' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_Info_C, InfoText) == 0x000358, "Member 'UWBP_ModernHud_Info_C::InfoText' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_Info_C, LOCK) == 0x000360, "Member 'UWBP_ModernHud_Info_C::LOCK' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_Info_C, Quantity) == 0x000368, "Member 'UWBP_ModernHud_Info_C::Quantity' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_Info_C, Uses) == 0x000370, "Member 'UWBP_ModernHud_Info_C::Uses' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_Info_C, Value) == 0x000378, "Member 'UWBP_ModernHud_Info_C::Value' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_Info_C, Weight) == 0x000380, "Member 'UWBP_ModernHud_Info_C::Weight' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_Info_C, TelekinesisColour) == 0x000388, "Member 'UWBP_ModernHud_Info_C::TelekinesisColour' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_Info_C, NonTelekenesisColour) == 0x000398, "Member 'UWBP_ModernHud_Info_C::NonTelekenesisColour' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_Info_C, bIsShown) == 0x0003A8, "Member 'UWBP_ModernHud_Info_C::bIsShown' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_Info_C, DoorToDestinationLocKey) == 0x0003B0, "Member 'UWBP_ModernHud_Info_C::DoorToDestinationLocKey' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_Info_C, AltarStaticTextStringTableName) == 0x0003C0, "Member 'UWBP_ModernHud_Info_C::AltarStaticTextStringTableName' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_Info_C, IllegalColor) == 0x0003C8, "Member 'UWBP_ModernHud_Info_C::IllegalColor' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_Info_C, IllegalTextColor) == 0x0003D8, "Member 'UWBP_ModernHud_Info_C::IllegalTextColor' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_Info_C, NormalTextColor) == 0x0003EC, "Member 'UWBP_ModernHud_Info_C::NormalTextColor' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_Info_C, NormalColor) == 0x000400, "Member 'UWBP_ModernHud_Info_C::NormalColor' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_Info_C, EmptyContainerLocKey) == 0x000410, "Member 'UWBP_ModernHud_Info_C::EmptyContainerLocKey' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_Info_C, CachedCurrentAction) == 0x000420, "Member 'UWBP_ModernHud_Info_C::CachedCurrentAction' has a wrong offset!");

}

