#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModernMenu_Dialog

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CommonInput_structs.hpp"
#include "Altar_structs.hpp"


namespace SDK::Params
{

// Function WBP_ModernMenu_Dialog.WBP_ModernMenu_Dialog_C.BndEvt__WBP_LegacyMenu_Dialog_dialog_buttons_K2Node_ComponentBoundEvent_10_OnIconButtonClicked__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_ModernMenu_Dialog_C_BndEvt__WBP_LegacyMenu_Dialog_dialog_buttons_K2Node_ComponentBoundEvent_10_OnIconButtonClicked__DelegateSignature final
{
public:
	ELegacyDialogButton                           DialogButton;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_Dialog_C_BndEvt__WBP_LegacyMenu_Dialog_dialog_buttons_K2Node_ComponentBoundEvent_10_OnIconButtonClicked__DelegateSignature) == 0x000001, "Wrong alignment on WBP_ModernMenu_Dialog_C_BndEvt__WBP_LegacyMenu_Dialog_dialog_buttons_K2Node_ComponentBoundEvent_10_OnIconButtonClicked__DelegateSignature");
static_assert(sizeof(WBP_ModernMenu_Dialog_C_BndEvt__WBP_LegacyMenu_Dialog_dialog_buttons_K2Node_ComponentBoundEvent_10_OnIconButtonClicked__DelegateSignature) == 0x000001, "Wrong size on WBP_ModernMenu_Dialog_C_BndEvt__WBP_LegacyMenu_Dialog_dialog_buttons_K2Node_ComponentBoundEvent_10_OnIconButtonClicked__DelegateSignature");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_BndEvt__WBP_LegacyMenu_Dialog_dialog_buttons_K2Node_ComponentBoundEvent_10_OnIconButtonClicked__DelegateSignature, DialogButton) == 0x000000, "Member 'WBP_ModernMenu_Dialog_C_BndEvt__WBP_LegacyMenu_Dialog_dialog_buttons_K2Node_ComponentBoundEvent_10_OnIconButtonClicked__DelegateSignature::DialogButton' has a wrong offset!");

// Function WBP_ModernMenu_Dialog.WBP_ModernMenu_Dialog_C.BndEvt__WBP_LegacyMenu_Dialog_dialog_skip_button_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ModernMenu_Dialog_C_BndEvt__WBP_LegacyMenu_Dialog_dialog_skip_button_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_Dialog_C_BndEvt__WBP_LegacyMenu_Dialog_dialog_skip_button_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ModernMenu_Dialog_C_BndEvt__WBP_LegacyMenu_Dialog_dialog_skip_button_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_ModernMenu_Dialog_C_BndEvt__WBP_LegacyMenu_Dialog_dialog_skip_button_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_ModernMenu_Dialog_C_BndEvt__WBP_LegacyMenu_Dialog_dialog_skip_button_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_BndEvt__WBP_LegacyMenu_Dialog_dialog_skip_button_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_ModernMenu_Dialog_C_BndEvt__WBP_LegacyMenu_Dialog_dialog_skip_button_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_ModernMenu_Dialog.WBP_ModernMenu_Dialog_C.BP_OnHandleBackAction
// 0x0004 (0x0004 - 0x0000)
struct WBP_ModernMenu_Dialog_C_BP_OnHandleBackAction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue_1;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_Dialog_C_BP_OnHandleBackAction) == 0x000001, "Wrong alignment on WBP_ModernMenu_Dialog_C_BP_OnHandleBackAction");
static_assert(sizeof(WBP_ModernMenu_Dialog_C_BP_OnHandleBackAction) == 0x000004, "Wrong size on WBP_ModernMenu_Dialog_C_BP_OnHandleBackAction");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_BP_OnHandleBackAction, ReturnValue) == 0x000000, "Member 'WBP_ModernMenu_Dialog_C_BP_OnHandleBackAction::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_BP_OnHandleBackAction, CallFunc_IsVisible_ReturnValue) == 0x000001, "Member 'WBP_ModernMenu_Dialog_C_BP_OnHandleBackAction::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_BP_OnHandleBackAction, CallFunc_IsVisible_ReturnValue_1) == 0x000002, "Member 'WBP_ModernMenu_Dialog_C_BP_OnHandleBackAction::CallFunc_IsVisible_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_BP_OnHandleBackAction, CallFunc_BooleanAND_ReturnValue) == 0x000003, "Member 'WBP_ModernMenu_Dialog_C_BP_OnHandleBackAction::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_ModernMenu_Dialog.WBP_ModernMenu_Dialog_C.CreateDialogWidget
// 0x01A8 (0x01A8 - 0x0000)
struct WBP_ModernMenu_Dialog_C_CreateDialogWidget final
{
public:
	TArray<struct FResponsesData>                 ResponsesData;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         Local_ResponseIndex;                               // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ModernMenu_DialogButtonEntry_C*    Local_DialogButtonEntry;                           // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FResponsesData                         Local_ResponseData;                                // 0x0020(0x0020)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UScrollBox*                             CallFunc_GetScrollBox_ReturnValue;                 // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0060(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ModernMenu_DialogButtonEntry_C*    CallFunc_Create_ReturnValue;                       // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScrollBox*                             CallFunc_GetScrollBox_ReturnValue_1;               // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue_1;             // 0x0098(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWBP_ModernMenu_DialogEntry_C*          K2Node_DynamicCast_AsWBP_Modern_Menu_Dialog_Entry; // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item_1;                         // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetButtonText_ReturnValue;                // 0x00C0(0x0018)()
	class UWBP_ModernMenu_DialogEntry_C*          K2Node_DynamicCast_AsWBP_Modern_Menu_Dialog_Entry_1; // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetButtonText_ReturnValue_1;              // 0x00F8(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_125[0x3];                                      // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetButtonText_ReturnValue_2;              // 0x0140(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_2;          // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0168(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonButtonBase* Button)> K2Node_CreateDelegate_OutputDelegate;           // 0x0170(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FResponsesData                         CallFunc_Array_Get_Item_2;                         // 0x0180(0x0020)()
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_Dialog_C_CreateDialogWidget) == 0x000008, "Wrong alignment on WBP_ModernMenu_Dialog_C_CreateDialogWidget");
static_assert(sizeof(WBP_ModernMenu_Dialog_C_CreateDialogWidget) == 0x0001A8, "Wrong size on WBP_ModernMenu_Dialog_C_CreateDialogWidget");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_CreateDialogWidget, ResponsesData) == 0x000000, "Member 'WBP_ModernMenu_Dialog_C_CreateDialogWidget::ResponsesData' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_CreateDialogWidget, Local_ResponseIndex) == 0x000010, "Member 'WBP_ModernMenu_Dialog_C_CreateDialogWidget::Local_ResponseIndex' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_CreateDialogWidget, Local_DialogButtonEntry) == 0x000018, "Member 'WBP_ModernMenu_Dialog_C_CreateDialogWidget::Local_DialogButtonEntry' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_CreateDialogWidget, Local_ResponseData) == 0x000020, "Member 'WBP_ModernMenu_Dialog_C_CreateDialogWidget::Local_ResponseData' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_CreateDialogWidget, Temp_int_Array_Index_Variable) == 0x000040, "Member 'WBP_ModernMenu_Dialog_C_CreateDialogWidget::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_CreateDialogWidget, Temp_int_Loop_Counter_Variable) == 0x000044, "Member 'WBP_ModernMenu_Dialog_C_CreateDialogWidget::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_CreateDialogWidget, CallFunc_Add_IntInt_ReturnValue) == 0x000048, "Member 'WBP_ModernMenu_Dialog_C_CreateDialogWidget::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_CreateDialogWidget, Temp_int_Loop_Counter_Variable_1) == 0x00004C, "Member 'WBP_ModernMenu_Dialog_C_CreateDialogWidget::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_CreateDialogWidget, CallFunc_Add_IntInt_ReturnValue_1) == 0x000050, "Member 'WBP_ModernMenu_Dialog_C_CreateDialogWidget::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_CreateDialogWidget, CallFunc_GetScrollBox_ReturnValue) == 0x000058, "Member 'WBP_ModernMenu_Dialog_C_CreateDialogWidget::CallFunc_GetScrollBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_CreateDialogWidget, CallFunc_GetAllChildren_ReturnValue) == 0x000060, "Member 'WBP_ModernMenu_Dialog_C_CreateDialogWidget::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_CreateDialogWidget, CallFunc_Array_Length_ReturnValue) == 0x000070, "Member 'WBP_ModernMenu_Dialog_C_CreateDialogWidget::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_CreateDialogWidget, CallFunc_Create_ReturnValue) == 0x000078, "Member 'WBP_ModernMenu_Dialog_C_CreateDialogWidget::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_CreateDialogWidget, CallFunc_Less_IntInt_ReturnValue) == 0x000080, "Member 'WBP_ModernMenu_Dialog_C_CreateDialogWidget::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_CreateDialogWidget, Temp_int_Array_Index_Variable_1) == 0x000084, "Member 'WBP_ModernMenu_Dialog_C_CreateDialogWidget::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_CreateDialogWidget, CallFunc_GetScrollBox_ReturnValue_1) == 0x000088, "Member 'WBP_ModernMenu_Dialog_C_CreateDialogWidget::CallFunc_GetScrollBox_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_CreateDialogWidget, CallFunc_Array_Get_Item) == 0x000090, "Member 'WBP_ModernMenu_Dialog_C_CreateDialogWidget::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_CreateDialogWidget, CallFunc_GetAllChildren_ReturnValue_1) == 0x000098, "Member 'WBP_ModernMenu_Dialog_C_CreateDialogWidget::CallFunc_GetAllChildren_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_CreateDialogWidget, K2Node_DynamicCast_AsWBP_Modern_Menu_Dialog_Entry) == 0x0000A8, "Member 'WBP_ModernMenu_Dialog_C_CreateDialogWidget::K2Node_DynamicCast_AsWBP_Modern_Menu_Dialog_Entry' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_CreateDialogWidget, K2Node_DynamicCast_bSuccess) == 0x0000B0, "Member 'WBP_ModernMenu_Dialog_C_CreateDialogWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_CreateDialogWidget, CallFunc_Array_Get_Item_1) == 0x0000B8, "Member 'WBP_ModernMenu_Dialog_C_CreateDialogWidget::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_CreateDialogWidget, CallFunc_GetButtonText_ReturnValue) == 0x0000C0, "Member 'WBP_ModernMenu_Dialog_C_CreateDialogWidget::CallFunc_GetButtonText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_CreateDialogWidget, K2Node_DynamicCast_AsWBP_Modern_Menu_Dialog_Entry_1) == 0x0000D8, "Member 'WBP_ModernMenu_Dialog_C_CreateDialogWidget::K2Node_DynamicCast_AsWBP_Modern_Menu_Dialog_Entry_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_CreateDialogWidget, K2Node_DynamicCast_bSuccess_1) == 0x0000E0, "Member 'WBP_ModernMenu_Dialog_C_CreateDialogWidget::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_CreateDialogWidget, CallFunc_Conv_TextToString_ReturnValue) == 0x0000E8, "Member 'WBP_ModernMenu_Dialog_C_CreateDialogWidget::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_CreateDialogWidget, CallFunc_GetButtonText_ReturnValue_1) == 0x0000F8, "Member 'WBP_ModernMenu_Dialog_C_CreateDialogWidget::CallFunc_GetButtonText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_CreateDialogWidget, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000110, "Member 'WBP_ModernMenu_Dialog_C_CreateDialogWidget::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_CreateDialogWidget, CallFunc_Array_Length_ReturnValue_1) == 0x000120, "Member 'WBP_ModernMenu_Dialog_C_CreateDialogWidget::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_CreateDialogWidget, CallFunc_Less_IntInt_ReturnValue_1) == 0x000124, "Member 'WBP_ModernMenu_Dialog_C_CreateDialogWidget::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_CreateDialogWidget, Temp_int_Loop_Counter_Variable_2) == 0x000128, "Member 'WBP_ModernMenu_Dialog_C_CreateDialogWidget::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_CreateDialogWidget, CallFunc_Add_IntInt_ReturnValue_2) == 0x00012C, "Member 'WBP_ModernMenu_Dialog_C_CreateDialogWidget::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_CreateDialogWidget, Temp_int_Array_Index_Variable_2) == 0x000130, "Member 'WBP_ModernMenu_Dialog_C_CreateDialogWidget::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_CreateDialogWidget, CallFunc_Array_Length_ReturnValue_2) == 0x000134, "Member 'WBP_ModernMenu_Dialog_C_CreateDialogWidget::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_CreateDialogWidget, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000138, "Member 'WBP_ModernMenu_Dialog_C_CreateDialogWidget::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_CreateDialogWidget, CallFunc_GetButtonText_ReturnValue_2) == 0x000140, "Member 'WBP_ModernMenu_Dialog_C_CreateDialogWidget::CallFunc_GetButtonText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_CreateDialogWidget, CallFunc_Conv_TextToString_ReturnValue_2) == 0x000158, "Member 'WBP_ModernMenu_Dialog_C_CreateDialogWidget::CallFunc_Conv_TextToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_CreateDialogWidget, CallFunc_AddChild_ReturnValue) == 0x000168, "Member 'WBP_ModernMenu_Dialog_C_CreateDialogWidget::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_CreateDialogWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000170, "Member 'WBP_ModernMenu_Dialog_C_CreateDialogWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_CreateDialogWidget, CallFunc_Array_Get_Item_2) == 0x000180, "Member 'WBP_ModernMenu_Dialog_C_CreateDialogWidget::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_CreateDialogWidget, CallFunc_Array_Length_ReturnValue_3) == 0x0001A0, "Member 'WBP_ModernMenu_Dialog_C_CreateDialogWidget::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_CreateDialogWidget, CallFunc_Less_IntInt_ReturnValue_2) == 0x0001A4, "Member 'WBP_ModernMenu_Dialog_C_CreateDialogWidget::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");

// Function WBP_ModernMenu_Dialog.WBP_ModernMenu_Dialog_C.ExecuteUbergraph_WBP_ModernMenu_Dialog
// 0x0230 (0x0230 - 0x0000)
struct WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FResponsesData>                 K2Node_CustomEvent_NewParam;                       // 0x0018(0x0010)(ConstParm, ReferenceParm)
	class UVViewModelBase*                        K2Node_Event_ViewModelRef;                         // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVDialogueMenuViewModel*                K2Node_DynamicCast_AsVDialogue_Menu_View_Model;    // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_NewParam_1;                     // 0x0040(0x0018)()
	bool                                          K2Node_CustomEvent_NewParam_2;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_NewParam_3;                     // 0x0060(0x0018)()
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue; // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FLegacyDialogMenuButtonVisibility      K2Node_CustomEvent_NewParam_4;                     // 0x0088(0x0010)()
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate_1;          // 0x0098(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              K2Node_CustomEvent_NewInputType;                   // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AA[0x6];                                       // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UScrollBox*                             CallFunc_GetScrollBox_ReturnValue;                 // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ELegacyDialogButton                           K2Node_ComponentBoundEvent_DialogButton;           // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA[0x6];                                       // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UScrollBox*                             CallFunc_GetScrollBox_ReturnValue_1;               // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFooterInputActionDescription          K2Node_MakeStruct_FooterInputActionDescription;    // 0x00E8(0x0020)()
	class UVUINavigationGlobalSubsystem*          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFooterInputActionDescription          K2Node_MakeStruct_FooterInputActionDescription_1;  // 0x0110(0x0020)()
	TScriptInterface<class IVEnhancedInputNavigable> CallFunc_NavigateToWidget_Widget_CastInput;     // 0x0130(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSubtitleVisibilityCVarSettings_ReturnValue; // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0142(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue_1;                  // 0x0143(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue_2;                  // 0x0145(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_146[0x2];                                      // 0x0146(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFooterInputActionVisibility           K2Node_MakeStruct_FooterInputActionVisibility;     // 0x0148(0x0010)(NoDestructor)
	class UVUINavigationGlobalSubsystem*          CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue_3;                  // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_162[0x6];                                      // 0x0162(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFooterInputActionVisibility           K2Node_MakeStruct_FooterInputActionVisibility_1;   // 0x0168(0x0010)(NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x017A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17B[0x5];                                      // 0x017B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IVEnhancedInputNavigable> CallFunc_NavigateToWidget_Widget_CastInput_1;   // 0x0180(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue_4;                  // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_192[0x6];                                      // 0x0192(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVUINavigationGlobalSubsystem*          CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVUINavigationGlobalSubsystem*          CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IVEnhancedInputNavigable> CallFunc_NavigateToWidget_Widget_CastInput_2;   // 0x01C0(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TScriptInterface<class IVEnhancedInputNavigable> CallFunc_NavigateToWidget_Widget_CastInput_3;   // 0x01D0(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable;                                // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x01EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x01ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EE[0x2];                                      // 0x01EE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable_1;                              // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_2;                              // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue_1;         // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FA[0x2];                                      // 0x01FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue_1;                 // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_3;                              // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              Temp_byte_Variable_2;                              // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_CustomEvent_Button;                         // 0x0210(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_1;                           // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x021C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog) == 0x000008, "Wrong alignment on WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog");
static_assert(sizeof(WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog) == 0x000230, "Wrong size on WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog, EntryPoint) == 0x000000, "Member 'WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog, K2Node_CustomEvent_NewParam) == 0x000018, "Member 'WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog::K2Node_CustomEvent_NewParam' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog, K2Node_Event_ViewModelRef) == 0x000028, "Member 'WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog::K2Node_Event_ViewModelRef' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog, K2Node_DynamicCast_AsVDialogue_Menu_View_Model) == 0x000030, "Member 'WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog::K2Node_DynamicCast_AsVDialogue_Menu_View_Model' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog, K2Node_CustomEvent_NewParam_1) == 0x000040, "Member 'WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog::K2Node_CustomEvent_NewParam_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog, K2Node_CustomEvent_NewParam_2) == 0x000058, "Member 'WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog::K2Node_CustomEvent_NewParam_2' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog, K2Node_CustomEvent_NewParam_3) == 0x000060, "Member 'WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog::K2Node_CustomEvent_NewParam_3' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog, CallFunc_GetPlayerController_ReturnValue) == 0x000078, "Member 'WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog, CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue) == 0x000080, "Member 'WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog::CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog, K2Node_CustomEvent_NewParam_4) == 0x000088, "Member 'WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog::K2Node_CustomEvent_NewParam_4' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog, K2Node_CreateDelegate_OutputDelegate_1) == 0x000098, "Member 'WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog, K2Node_CustomEvent_NewInputType) == 0x0000A8, "Member 'WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog::K2Node_CustomEvent_NewInputType' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x0000A9, "Member 'WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog, CallFunc_GetScrollBox_ReturnValue) == 0x0000B0, "Member 'WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog::CallFunc_GetScrollBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog, K2Node_ComponentBoundEvent_DialogButton) == 0x0000B8, "Member 'WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog::K2Node_ComponentBoundEvent_DialogButton' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog, K2Node_SwitchEnum_CmpSuccess) == 0x0000B9, "Member 'WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog, CallFunc_GetDynamicMaterial_ReturnValue) == 0x0000C0, "Member 'WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog, CallFunc_IsValid_ReturnValue) == 0x0000C8, "Member 'WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog, CallFunc_GetScrollBox_ReturnValue_1) == 0x0000D0, "Member 'WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog::CallFunc_GetScrollBox_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog, CallFunc_IsValid_ReturnValue_1) == 0x0000D8, "Member 'WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x0000E0, "Member 'WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog, K2Node_MakeStruct_FooterInputActionDescription) == 0x0000E8, "Member 'WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog::K2Node_MakeStruct_FooterInputActionDescription' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000108, "Member 'WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog, K2Node_MakeStruct_FooterInputActionDescription_1) == 0x000110, "Member 'WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog::K2Node_MakeStruct_FooterInputActionDescription_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog, CallFunc_NavigateToWidget_Widget_CastInput) == 0x000130, "Member 'WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog::CallFunc_NavigateToWidget_Widget_CastInput' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog, CallFunc_IsValid_ReturnValue_2) == 0x000140, "Member 'WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog, CallFunc_GetSubtitleVisibilityCVarSettings_ReturnValue) == 0x000141, "Member 'WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog::CallFunc_GetSubtitleVisibilityCVarSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog, CallFunc_IsVisible_ReturnValue) == 0x000142, "Member 'WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog, CallFunc_IsVisible_ReturnValue_1) == 0x000143, "Member 'WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog::CallFunc_IsVisible_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog, CallFunc_BooleanAND_ReturnValue) == 0x000144, "Member 'WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog, CallFunc_IsVisible_ReturnValue_2) == 0x000145, "Member 'WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog::CallFunc_IsVisible_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog, K2Node_MakeStruct_FooterInputActionVisibility) == 0x000148, "Member 'WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog::K2Node_MakeStruct_FooterInputActionVisibility' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000158, "Member 'WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog, CallFunc_IsVisible_ReturnValue_3) == 0x000160, "Member 'WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog::CallFunc_IsVisible_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog, CallFunc_BooleanAND_ReturnValue_1) == 0x000161, "Member 'WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog, K2Node_MakeStruct_FooterInputActionVisibility_1) == 0x000168, "Member 'WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog::K2Node_MakeStruct_FooterInputActionVisibility_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog, Temp_byte_Variable) == 0x000178, "Member 'WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog, Temp_byte_Variable_1) == 0x000179, "Member 'WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog, Temp_bool_Variable) == 0x00017A, "Member 'WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog, CallFunc_NavigateToWidget_Widget_CastInput_1) == 0x000180, "Member 'WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog::CallFunc_NavigateToWidget_Widget_CastInput_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog, K2Node_Select_Default) == 0x000190, "Member 'WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog, CallFunc_IsVisible_ReturnValue_4) == 0x000191, "Member 'WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog::CallFunc_IsVisible_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog, CallFunc_PlayAnimation_ReturnValue) == 0x000198, "Member 'WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog, CallFunc_PlayAnimation_ReturnValue_1) == 0x0001A0, "Member 'WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x0001A8, "Member 'WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog, CallFunc_PlayAnimation_ReturnValue_2) == 0x0001B0, "Member 'WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog, CallFunc_GetGameInstanceSubsystem_ReturnValue_3) == 0x0001B8, "Member 'WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog::CallFunc_GetGameInstanceSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog, CallFunc_NavigateToWidget_Widget_CastInput_2) == 0x0001C0, "Member 'WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog::CallFunc_NavigateToWidget_Widget_CastInput_2' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog, CallFunc_NavigateToWidget_Widget_CastInput_3) == 0x0001D0, "Member 'WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog::CallFunc_NavigateToWidget_Widget_CastInput_3' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog, K2Node_ComponentBoundEvent_Button) == 0x0001E0, "Member 'WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog, Temp_real_Variable) == 0x0001E8, "Member 'WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog, CallFunc_GetVisibility_ReturnValue) == 0x0001EC, "Member 'WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog::CallFunc_GetVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0001ED, "Member 'WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog, Temp_real_Variable_1) == 0x0001F0, "Member 'WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog, Temp_real_Variable_2) == 0x0001F4, "Member 'WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog, CallFunc_IsAnimationPlaying_ReturnValue) == 0x0001F8, "Member 'WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog, CallFunc_IsAnimationPlaying_ReturnValue_1) == 0x0001F9, "Member 'WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog::CallFunc_IsAnimationPlaying_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog, CallFunc_GetEndTime_ReturnValue) == 0x0001FC, "Member 'WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog, CallFunc_GetEndTime_ReturnValue_1) == 0x000200, "Member 'WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog::CallFunc_GetEndTime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog, Temp_real_Variable_3) == 0x000204, "Member 'WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog, Temp_byte_Variable_2) == 0x000208, "Member 'WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog, K2Node_CustomEvent_Button) == 0x000210, "Member 'WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog::K2Node_CustomEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog, K2Node_Select_Default_1) == 0x000218, "Member 'WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog, K2Node_CreateDelegate_OutputDelegate_2) == 0x00021C, "Member 'WBP_ModernMenu_Dialog_C_ExecuteUbergraph_WBP_ModernMenu_Dialog::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");

// Function WBP_ModernMenu_Dialog.WBP_ModernMenu_Dialog_C.FocusLastDialogElement
// 0x0008 (0x0008 - 0x0000)
struct WBP_ModernMenu_Dialog_C_FocusLastDialogElement final
{
public:
	int32                                         CallFunc_GetSize_ReturnValue;                      // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_Dialog_C_FocusLastDialogElement) == 0x000004, "Wrong alignment on WBP_ModernMenu_Dialog_C_FocusLastDialogElement");
static_assert(sizeof(WBP_ModernMenu_Dialog_C_FocusLastDialogElement) == 0x000008, "Wrong size on WBP_ModernMenu_Dialog_C_FocusLastDialogElement");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_FocusLastDialogElement, CallFunc_GetSize_ReturnValue) == 0x000000, "Member 'WBP_ModernMenu_Dialog_C_FocusLastDialogElement::CallFunc_GetSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_FocusLastDialogElement, CallFunc_Subtract_IntInt_ReturnValue) == 0x000004, "Member 'WBP_ModernMenu_Dialog_C_FocusLastDialogElement::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_ModernMenu_Dialog.WBP_ModernMenu_Dialog_C.MenuFadeInOut
// 0x0010 (0x0010 - 0x0000)
struct WBP_ModernMenu_Dialog_C_MenuFadeInOut final
{
public:
	bool                                          InIsVisible;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_Dialog_C_MenuFadeInOut) == 0x000008, "Wrong alignment on WBP_ModernMenu_Dialog_C_MenuFadeInOut");
static_assert(sizeof(WBP_ModernMenu_Dialog_C_MenuFadeInOut) == 0x000010, "Wrong size on WBP_ModernMenu_Dialog_C_MenuFadeInOut");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_MenuFadeInOut, InIsVisible) == 0x000000, "Member 'WBP_ModernMenu_Dialog_C_MenuFadeInOut::InIsVisible' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_MenuFadeInOut, Temp_bool_Variable) == 0x000001, "Member 'WBP_ModernMenu_Dialog_C_MenuFadeInOut::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_MenuFadeInOut, Temp_byte_Variable) == 0x000002, "Member 'WBP_ModernMenu_Dialog_C_MenuFadeInOut::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_MenuFadeInOut, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_ModernMenu_Dialog_C_MenuFadeInOut::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Dialog_C_MenuFadeInOut, K2Node_Select_Default) == 0x000004, "Member 'WBP_ModernMenu_Dialog_C_MenuFadeInOut::K2Node_Select_Default' has a wrong offset!");
