#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PairedPawnProcedureDebugInfo

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PairedPawnProcedureDebugInfo.WBP_PairedPawnProcedureDebugInfo_C
// 0x0090 (0x0350 - 0x02C0)
class UWBP_PairedPawnProcedureDebugInfo_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVerticalBox*                           ActivateProcedureDebug;                            // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Background;                                        // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           FollowProcedureDebug;                              // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_PackageType;                                  // 0x02E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_PackageType_1;                                // 0x02E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_PackageType_2;                                // 0x02F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_PackageType_3;                                // 0x02F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_PawnName;                                     // 0x0300(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_PawnName_1;                                   // 0x0308(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_PawnName_2;                                   // 0x0310(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_PawnName_3;                                   // 0x0318(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_ProcedureType_2;                              // 0x0320(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           TravelProcedureDebug;                              // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           UseItemProcedureDebug;                             // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class AVPairedPawnAIController*               LinkedAIController;                                // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	TArray<class UVerticalBox*>                   Categories;                                        // 0x0340(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	class FText ActivateRadiusBinding();
	class FText ActivateTargetNameBinding();
	void Construct();
	void ExecuteUbergraph_WBP_PairedPawnProcedureDebugInfo(int32 EntryPoint);
	class FText FollowDistanceBinding();
	class FText FollowTargetNameBinding();
	class FText TravelAcceptanceRadiusBinding();
	class FText TravelTargetNameBinding();
	class FText UseItemTargetNameBinding();
	class FText UseItemUsageCountBinding();
	class FText UseItemUsageRadiusBinding();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PairedPawnProcedureDebugInfo_C">();
	}
	static class UWBP_PairedPawnProcedureDebugInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PairedPawnProcedureDebugInfo_C>();
	}
};
static_assert(alignof(UWBP_PairedPawnProcedureDebugInfo_C) == 0x000008, "Wrong alignment on UWBP_PairedPawnProcedureDebugInfo_C");
static_assert(sizeof(UWBP_PairedPawnProcedureDebugInfo_C) == 0x000350, "Wrong size on UWBP_PairedPawnProcedureDebugInfo_C");
static_assert(offsetof(UWBP_PairedPawnProcedureDebugInfo_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_PairedPawnProcedureDebugInfo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PairedPawnProcedureDebugInfo_C, ActivateProcedureDebug) == 0x0002C8, "Member 'UWBP_PairedPawnProcedureDebugInfo_C::ActivateProcedureDebug' has a wrong offset!");
static_assert(offsetof(UWBP_PairedPawnProcedureDebugInfo_C, Background) == 0x0002D0, "Member 'UWBP_PairedPawnProcedureDebugInfo_C::Background' has a wrong offset!");
static_assert(offsetof(UWBP_PairedPawnProcedureDebugInfo_C, FollowProcedureDebug) == 0x0002D8, "Member 'UWBP_PairedPawnProcedureDebugInfo_C::FollowProcedureDebug' has a wrong offset!");
static_assert(offsetof(UWBP_PairedPawnProcedureDebugInfo_C, Text_PackageType) == 0x0002E0, "Member 'UWBP_PairedPawnProcedureDebugInfo_C::Text_PackageType' has a wrong offset!");
static_assert(offsetof(UWBP_PairedPawnProcedureDebugInfo_C, Text_PackageType_1) == 0x0002E8, "Member 'UWBP_PairedPawnProcedureDebugInfo_C::Text_PackageType_1' has a wrong offset!");
static_assert(offsetof(UWBP_PairedPawnProcedureDebugInfo_C, Text_PackageType_2) == 0x0002F0, "Member 'UWBP_PairedPawnProcedureDebugInfo_C::Text_PackageType_2' has a wrong offset!");
static_assert(offsetof(UWBP_PairedPawnProcedureDebugInfo_C, Text_PackageType_3) == 0x0002F8, "Member 'UWBP_PairedPawnProcedureDebugInfo_C::Text_PackageType_3' has a wrong offset!");
static_assert(offsetof(UWBP_PairedPawnProcedureDebugInfo_C, Text_PawnName) == 0x000300, "Member 'UWBP_PairedPawnProcedureDebugInfo_C::Text_PawnName' has a wrong offset!");
static_assert(offsetof(UWBP_PairedPawnProcedureDebugInfo_C, Text_PawnName_1) == 0x000308, "Member 'UWBP_PairedPawnProcedureDebugInfo_C::Text_PawnName_1' has a wrong offset!");
static_assert(offsetof(UWBP_PairedPawnProcedureDebugInfo_C, Text_PawnName_2) == 0x000310, "Member 'UWBP_PairedPawnProcedureDebugInfo_C::Text_PawnName_2' has a wrong offset!");
static_assert(offsetof(UWBP_PairedPawnProcedureDebugInfo_C, Text_PawnName_3) == 0x000318, "Member 'UWBP_PairedPawnProcedureDebugInfo_C::Text_PawnName_3' has a wrong offset!");
static_assert(offsetof(UWBP_PairedPawnProcedureDebugInfo_C, Text_ProcedureType_2) == 0x000320, "Member 'UWBP_PairedPawnProcedureDebugInfo_C::Text_ProcedureType_2' has a wrong offset!");
static_assert(offsetof(UWBP_PairedPawnProcedureDebugInfo_C, TravelProcedureDebug) == 0x000328, "Member 'UWBP_PairedPawnProcedureDebugInfo_C::TravelProcedureDebug' has a wrong offset!");
static_assert(offsetof(UWBP_PairedPawnProcedureDebugInfo_C, UseItemProcedureDebug) == 0x000330, "Member 'UWBP_PairedPawnProcedureDebugInfo_C::UseItemProcedureDebug' has a wrong offset!");
static_assert(offsetof(UWBP_PairedPawnProcedureDebugInfo_C, LinkedAIController) == 0x000338, "Member 'UWBP_PairedPawnProcedureDebugInfo_C::LinkedAIController' has a wrong offset!");
static_assert(offsetof(UWBP_PairedPawnProcedureDebugInfo_C, Categories) == 0x000340, "Member 'UWBP_PairedPawnProcedureDebugInfo_C::Categories' has a wrong offset!");

}

