#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Graphic_Resolutions

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Altar_structs.hpp"
#include "Altar_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Graphic_Resolutions.WBP_Graphic_Resolutions_C
// 0x0040 (0x0540 - 0x0500)
class UWBP_Graphic_Resolutions_C final : public UVDebugGraphicsSettingWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0500(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UComboBoxString*                        ComboItem;                                         // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             txt_label;                                         // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<struct FOriginalVideoOption>           ResolutionOptions;                                 // 0x0518(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         DefaultResolutionIndex;                            // 0x0528(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52C[0x4];                                      // 0x052C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         DefaultResolutionCMD;                              // 0x0530(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void Construct();
	void ExecuteUbergraph_WBP_Graphic_Resolutions(int32 EntryPoint);
	void OnRefresh();
	void OnResolutionChange(const class FString& SelectedItem, ESelectInfo SelectionType);
	void Prepare_Supported_Resolution_Options(TArray<struct FOriginalVideoOption>* ResolutionOptions_0);
	void Refresh();
	void Update_Resolution_in_Game_User_Settings(const class FString& Option_Label);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Graphic_Resolutions_C">();
	}
	static class UWBP_Graphic_Resolutions_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Graphic_Resolutions_C>();
	}
};
static_assert(alignof(UWBP_Graphic_Resolutions_C) == 0x000008, "Wrong alignment on UWBP_Graphic_Resolutions_C");
static_assert(sizeof(UWBP_Graphic_Resolutions_C) == 0x000540, "Wrong size on UWBP_Graphic_Resolutions_C");
static_assert(offsetof(UWBP_Graphic_Resolutions_C, UberGraphFrame) == 0x000500, "Member 'UWBP_Graphic_Resolutions_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Graphic_Resolutions_C, ComboItem) == 0x000508, "Member 'UWBP_Graphic_Resolutions_C::ComboItem' has a wrong offset!");
static_assert(offsetof(UWBP_Graphic_Resolutions_C, txt_label) == 0x000510, "Member 'UWBP_Graphic_Resolutions_C::txt_label' has a wrong offset!");
static_assert(offsetof(UWBP_Graphic_Resolutions_C, ResolutionOptions) == 0x000518, "Member 'UWBP_Graphic_Resolutions_C::ResolutionOptions' has a wrong offset!");
static_assert(offsetof(UWBP_Graphic_Resolutions_C, DefaultResolutionIndex) == 0x000528, "Member 'UWBP_Graphic_Resolutions_C::DefaultResolutionIndex' has a wrong offset!");
static_assert(offsetof(UWBP_Graphic_Resolutions_C, DefaultResolutionCMD) == 0x000530, "Member 'UWBP_Graphic_Resolutions_C::DefaultResolutionCMD' has a wrong offset!");

}

