#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModernHud_StatusBarEnemy

#include "Basic.hpp"

#include "Altar_structs.hpp"


namespace SDK::Params
{

// Function WBP_ModernHud_StatusBarEnemy.WBP_ModernHud_StatusBarEnemy_C.ExecuteUbergraph_WBP_ModernHud_StatusBarEnemy
// 0x0098 (0x0098 - 0x0000)
struct WBP_ModernHud_StatusBarEnemy_C_ExecuteUbergraph_WBP_ModernHud_StatusBarEnemy final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UVTESObjectRefComponent* OldRef, class UVTESObjectRefComponent* NewRef)> K2Node_CreateDelegate_OutputDelegate; // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EVActorValues ActorValue, float PreviousBaseValue, float PreviousModifiedValue, float NewBaseValue, float NewModifiedValue)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AVAltarPlayerController*                K2Node_DynamicCast_AsVAltar_Player_Controller;     // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVTESObjectRefComponent*                K2Node_CustomEvent_OldRef;                         // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVTESObjectRefComponent*                K2Node_CustomEvent_NewRef;                         // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AVOblivionPlayerCharacter*              CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EVActorValues                                 K2Node_CustomEvent_ActorValue;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_PreviousBaseValue;              // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_PreviousModifiedValue;          // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_NewBaseValue;                   // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_NewModifiedValue;               // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_TriggerFatigue_MaxFatigue_ImplicitCast;   // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_TriggerFatigue_NewFatigue_ImplicitCast;   // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_StatusBarEnemy_C_ExecuteUbergraph_WBP_ModernHud_StatusBarEnemy) == 0x000008, "Wrong alignment on WBP_ModernHud_StatusBarEnemy_C_ExecuteUbergraph_WBP_ModernHud_StatusBarEnemy");
static_assert(sizeof(WBP_ModernHud_StatusBarEnemy_C_ExecuteUbergraph_WBP_ModernHud_StatusBarEnemy) == 0x000098, "Wrong size on WBP_ModernHud_StatusBarEnemy_C_ExecuteUbergraph_WBP_ModernHud_StatusBarEnemy");
static_assert(offsetof(WBP_ModernHud_StatusBarEnemy_C_ExecuteUbergraph_WBP_ModernHud_StatusBarEnemy, EntryPoint) == 0x000000, "Member 'WBP_ModernHud_StatusBarEnemy_C_ExecuteUbergraph_WBP_ModernHud_StatusBarEnemy::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBarEnemy_C_ExecuteUbergraph_WBP_ModernHud_StatusBarEnemy, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_ModernHud_StatusBarEnemy_C_ExecuteUbergraph_WBP_ModernHud_StatusBarEnemy::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBarEnemy_C_ExecuteUbergraph_WBP_ModernHud_StatusBarEnemy, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'WBP_ModernHud_StatusBarEnemy_C_ExecuteUbergraph_WBP_ModernHud_StatusBarEnemy::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBarEnemy_C_ExecuteUbergraph_WBP_ModernHud_StatusBarEnemy, CallFunc_PlayAnimation_ReturnValue) == 0x000028, "Member 'WBP_ModernHud_StatusBarEnemy_C_ExecuteUbergraph_WBP_ModernHud_StatusBarEnemy::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBarEnemy_C_ExecuteUbergraph_WBP_ModernHud_StatusBarEnemy, K2Node_Event_IsDesignTime) == 0x000030, "Member 'WBP_ModernHud_StatusBarEnemy_C_ExecuteUbergraph_WBP_ModernHud_StatusBarEnemy::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBarEnemy_C_ExecuteUbergraph_WBP_ModernHud_StatusBarEnemy, CallFunc_PlayAnimation_ReturnValue_1) == 0x000038, "Member 'WBP_ModernHud_StatusBarEnemy_C_ExecuteUbergraph_WBP_ModernHud_StatusBarEnemy::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBarEnemy_C_ExecuteUbergraph_WBP_ModernHud_StatusBarEnemy, CallFunc_GetOwningPlayer_ReturnValue) == 0x000040, "Member 'WBP_ModernHud_StatusBarEnemy_C_ExecuteUbergraph_WBP_ModernHud_StatusBarEnemy::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBarEnemy_C_ExecuteUbergraph_WBP_ModernHud_StatusBarEnemy, K2Node_DynamicCast_AsVAltar_Player_Controller) == 0x000048, "Member 'WBP_ModernHud_StatusBarEnemy_C_ExecuteUbergraph_WBP_ModernHud_StatusBarEnemy::K2Node_DynamicCast_AsVAltar_Player_Controller' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBarEnemy_C_ExecuteUbergraph_WBP_ModernHud_StatusBarEnemy, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'WBP_ModernHud_StatusBarEnemy_C_ExecuteUbergraph_WBP_ModernHud_StatusBarEnemy::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBarEnemy_C_ExecuteUbergraph_WBP_ModernHud_StatusBarEnemy, K2Node_CustomEvent_OldRef) == 0x000058, "Member 'WBP_ModernHud_StatusBarEnemy_C_ExecuteUbergraph_WBP_ModernHud_StatusBarEnemy::K2Node_CustomEvent_OldRef' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBarEnemy_C_ExecuteUbergraph_WBP_ModernHud_StatusBarEnemy, K2Node_CustomEvent_NewRef) == 0x000060, "Member 'WBP_ModernHud_StatusBarEnemy_C_ExecuteUbergraph_WBP_ModernHud_StatusBarEnemy::K2Node_CustomEvent_NewRef' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBarEnemy_C_ExecuteUbergraph_WBP_ModernHud_StatusBarEnemy, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000068, "Member 'WBP_ModernHud_StatusBarEnemy_C_ExecuteUbergraph_WBP_ModernHud_StatusBarEnemy::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBarEnemy_C_ExecuteUbergraph_WBP_ModernHud_StatusBarEnemy, K2Node_CustomEvent_ActorValue) == 0x000070, "Member 'WBP_ModernHud_StatusBarEnemy_C_ExecuteUbergraph_WBP_ModernHud_StatusBarEnemy::K2Node_CustomEvent_ActorValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBarEnemy_C_ExecuteUbergraph_WBP_ModernHud_StatusBarEnemy, K2Node_CustomEvent_PreviousBaseValue) == 0x000074, "Member 'WBP_ModernHud_StatusBarEnemy_C_ExecuteUbergraph_WBP_ModernHud_StatusBarEnemy::K2Node_CustomEvent_PreviousBaseValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBarEnemy_C_ExecuteUbergraph_WBP_ModernHud_StatusBarEnemy, K2Node_CustomEvent_PreviousModifiedValue) == 0x000078, "Member 'WBP_ModernHud_StatusBarEnemy_C_ExecuteUbergraph_WBP_ModernHud_StatusBarEnemy::K2Node_CustomEvent_PreviousModifiedValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBarEnemy_C_ExecuteUbergraph_WBP_ModernHud_StatusBarEnemy, K2Node_CustomEvent_NewBaseValue) == 0x00007C, "Member 'WBP_ModernHud_StatusBarEnemy_C_ExecuteUbergraph_WBP_ModernHud_StatusBarEnemy::K2Node_CustomEvent_NewBaseValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBarEnemy_C_ExecuteUbergraph_WBP_ModernHud_StatusBarEnemy, K2Node_CustomEvent_NewModifiedValue) == 0x000080, "Member 'WBP_ModernHud_StatusBarEnemy_C_ExecuteUbergraph_WBP_ModernHud_StatusBarEnemy::K2Node_CustomEvent_NewModifiedValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBarEnemy_C_ExecuteUbergraph_WBP_ModernHud_StatusBarEnemy, CallFunc_TriggerFatigue_MaxFatigue_ImplicitCast) == 0x000088, "Member 'WBP_ModernHud_StatusBarEnemy_C_ExecuteUbergraph_WBP_ModernHud_StatusBarEnemy::CallFunc_TriggerFatigue_MaxFatigue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBarEnemy_C_ExecuteUbergraph_WBP_ModernHud_StatusBarEnemy, CallFunc_TriggerFatigue_NewFatigue_ImplicitCast) == 0x000090, "Member 'WBP_ModernHud_StatusBarEnemy_C_ExecuteUbergraph_WBP_ModernHud_StatusBarEnemy::CallFunc_TriggerFatigue_NewFatigue_ImplicitCast' has a wrong offset!");

// Function WBP_ModernHud_StatusBarEnemy.WBP_ModernHud_StatusBarEnemy_C.OnFatigueChange
// 0x0014 (0x0014 - 0x0000)
struct WBP_ModernHud_StatusBarEnemy_C_OnFatigueChange final
{
public:
	EVActorValues                                 ActorValue;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PreviousBaseValue;                                 // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PreviousModifiedValue;                             // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NewBaseValue;                                      // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NewModifiedValue;                                  // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_StatusBarEnemy_C_OnFatigueChange) == 0x000004, "Wrong alignment on WBP_ModernHud_StatusBarEnemy_C_OnFatigueChange");
static_assert(sizeof(WBP_ModernHud_StatusBarEnemy_C_OnFatigueChange) == 0x000014, "Wrong size on WBP_ModernHud_StatusBarEnemy_C_OnFatigueChange");
static_assert(offsetof(WBP_ModernHud_StatusBarEnemy_C_OnFatigueChange, ActorValue) == 0x000000, "Member 'WBP_ModernHud_StatusBarEnemy_C_OnFatigueChange::ActorValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBarEnemy_C_OnFatigueChange, PreviousBaseValue) == 0x000004, "Member 'WBP_ModernHud_StatusBarEnemy_C_OnFatigueChange::PreviousBaseValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBarEnemy_C_OnFatigueChange, PreviousModifiedValue) == 0x000008, "Member 'WBP_ModernHud_StatusBarEnemy_C_OnFatigueChange::PreviousModifiedValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBarEnemy_C_OnFatigueChange, NewBaseValue) == 0x00000C, "Member 'WBP_ModernHud_StatusBarEnemy_C_OnFatigueChange::NewBaseValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBarEnemy_C_OnFatigueChange, NewModifiedValue) == 0x000010, "Member 'WBP_ModernHud_StatusBarEnemy_C_OnFatigueChange::NewModifiedValue' has a wrong offset!");

// Function WBP_ModernHud_StatusBarEnemy.WBP_ModernHud_StatusBarEnemy_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_ModernHud_StatusBarEnemy_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_StatusBarEnemy_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_ModernHud_StatusBarEnemy_C_PreConstruct");
static_assert(sizeof(WBP_ModernHud_StatusBarEnemy_C_PreConstruct) == 0x000001, "Wrong size on WBP_ModernHud_StatusBarEnemy_C_PreConstruct");
static_assert(offsetof(WBP_ModernHud_StatusBarEnemy_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_ModernHud_StatusBarEnemy_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_ModernHud_StatusBarEnemy.WBP_ModernHud_StatusBarEnemy_C.RefComponentChanged
// 0x0010 (0x0010 - 0x0000)
struct WBP_ModernHud_StatusBarEnemy_C_RefComponentChanged final
{
public:
	class UVTESObjectRefComponent*                OldRef;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVTESObjectRefComponent*                NewRef;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_StatusBarEnemy_C_RefComponentChanged) == 0x000008, "Wrong alignment on WBP_ModernHud_StatusBarEnemy_C_RefComponentChanged");
static_assert(sizeof(WBP_ModernHud_StatusBarEnemy_C_RefComponentChanged) == 0x000010, "Wrong size on WBP_ModernHud_StatusBarEnemy_C_RefComponentChanged");
static_assert(offsetof(WBP_ModernHud_StatusBarEnemy_C_RefComponentChanged, OldRef) == 0x000000, "Member 'WBP_ModernHud_StatusBarEnemy_C_RefComponentChanged::OldRef' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBarEnemy_C_RefComponentChanged, NewRef) == 0x000008, "Member 'WBP_ModernHud_StatusBarEnemy_C_RefComponentChanged::NewRef' has a wrong offset!");

// Function WBP_ModernHud_StatusBarEnemy.WBP_ModernHud_StatusBarEnemy_C.SetImmediateProgress
// 0x0020 (0x0020 - 0x0000)
struct WBP_ModernHud_StatusBarEnemy_C_SetImmediateProgress final
{
public:
	double                                        In_Progress;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               LocalDynamicMaterial;                              // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_StatusBarEnemy_C_SetImmediateProgress) == 0x000008, "Wrong alignment on WBP_ModernHud_StatusBarEnemy_C_SetImmediateProgress");
static_assert(sizeof(WBP_ModernHud_StatusBarEnemy_C_SetImmediateProgress) == 0x000020, "Wrong size on WBP_ModernHud_StatusBarEnemy_C_SetImmediateProgress");
static_assert(offsetof(WBP_ModernHud_StatusBarEnemy_C_SetImmediateProgress, In_Progress) == 0x000000, "Member 'WBP_ModernHud_StatusBarEnemy_C_SetImmediateProgress::In_Progress' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBarEnemy_C_SetImmediateProgress, LocalDynamicMaterial) == 0x000008, "Member 'WBP_ModernHud_StatusBarEnemy_C_SetImmediateProgress::LocalDynamicMaterial' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBarEnemy_C_SetImmediateProgress, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000010, "Member 'WBP_ModernHud_StatusBarEnemy_C_SetImmediateProgress::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBarEnemy_C_SetImmediateProgress, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000018, "Member 'WBP_ModernHud_StatusBarEnemy_C_SetImmediateProgress::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBarEnemy_C_SetImmediateProgress, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x00001C, "Member 'WBP_ModernHud_StatusBarEnemy_C_SetImmediateProgress::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");

// Function WBP_ModernHud_StatusBarEnemy.WBP_ModernHud_StatusBarEnemy_C.SetProgress
// 0x0040 (0x0040 - 0x0000)
struct WBP_ModernHud_StatusBarEnemy_C_SetProgress final
{
public:
	double                                        InProgress;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPreview;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               Local_DynamicMaterial;                             // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_StatusBarEnemy_C_SetProgress) == 0x000008, "Wrong alignment on WBP_ModernHud_StatusBarEnemy_C_SetProgress");
static_assert(sizeof(WBP_ModernHud_StatusBarEnemy_C_SetProgress) == 0x000040, "Wrong size on WBP_ModernHud_StatusBarEnemy_C_SetProgress");
static_assert(offsetof(WBP_ModernHud_StatusBarEnemy_C_SetProgress, InProgress) == 0x000000, "Member 'WBP_ModernHud_StatusBarEnemy_C_SetProgress::InProgress' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBarEnemy_C_SetProgress, IsPreview) == 0x000008, "Member 'WBP_ModernHud_StatusBarEnemy_C_SetProgress::IsPreview' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBarEnemy_C_SetProgress, Local_DynamicMaterial) == 0x000010, "Member 'WBP_ModernHud_StatusBarEnemy_C_SetProgress::Local_DynamicMaterial' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBarEnemy_C_SetProgress, CallFunc_PlayAnimationForward_ReturnValue) == 0x000018, "Member 'WBP_ModernHud_StatusBarEnemy_C_SetProgress::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBarEnemy_C_SetProgress, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000020, "Member 'WBP_ModernHud_StatusBarEnemy_C_SetProgress::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBarEnemy_C_SetProgress, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000028, "Member 'WBP_ModernHud_StatusBarEnemy_C_SetProgress::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBarEnemy_C_SetProgress, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000030, "Member 'WBP_ModernHud_StatusBarEnemy_C_SetProgress::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBarEnemy_C_SetProgress, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000038, "Member 'WBP_ModernHud_StatusBarEnemy_C_SetProgress::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBarEnemy_C_SetProgress, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x00003C, "Member 'WBP_ModernHud_StatusBarEnemy_C_SetProgress::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");

// Function WBP_ModernHud_StatusBarEnemy.WBP_ModernHud_StatusBarEnemy_C.ToggleBlinking
// 0x0018 (0x0018 - 0x0000)
struct WBP_ModernHud_StatusBarEnemy_C_ToggleBlinking final
{
public:
	bool                                          bOn;                                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_StatusBarEnemy_C_ToggleBlinking) == 0x000008, "Wrong alignment on WBP_ModernHud_StatusBarEnemy_C_ToggleBlinking");
static_assert(sizeof(WBP_ModernHud_StatusBarEnemy_C_ToggleBlinking) == 0x000018, "Wrong size on WBP_ModernHud_StatusBarEnemy_C_ToggleBlinking");
static_assert(offsetof(WBP_ModernHud_StatusBarEnemy_C_ToggleBlinking, bOn) == 0x000000, "Member 'WBP_ModernHud_StatusBarEnemy_C_ToggleBlinking::bOn' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBarEnemy_C_ToggleBlinking, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000008, "Member 'WBP_ModernHud_StatusBarEnemy_C_ToggleBlinking::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBarEnemy_C_ToggleBlinking, CallFunc_PlayAnimationForward_ReturnValue) == 0x000010, "Member 'WBP_ModernHud_StatusBarEnemy_C_ToggleBlinking::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function WBP_ModernHud_StatusBarEnemy.WBP_ModernHud_StatusBarEnemy_C.TriggerBlinking
// 0x0008 (0x0008 - 0x0000)
struct WBP_ModernHud_StatusBarEnemy_C_TriggerBlinking final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_StatusBarEnemy_C_TriggerBlinking) == 0x000008, "Wrong alignment on WBP_ModernHud_StatusBarEnemy_C_TriggerBlinking");
static_assert(sizeof(WBP_ModernHud_StatusBarEnemy_C_TriggerBlinking) == 0x000008, "Wrong size on WBP_ModernHud_StatusBarEnemy_C_TriggerBlinking");
static_assert(offsetof(WBP_ModernHud_StatusBarEnemy_C_TriggerBlinking, CallFunc_PlayAnimationForward_ReturnValue) == 0x000000, "Member 'WBP_ModernHud_StatusBarEnemy_C_TriggerBlinking::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function WBP_ModernHud_StatusBarEnemy.WBP_ModernHud_StatusBarEnemy_C.TriggerFatigue
// 0x0038 (0x0038 - 0x0000)
struct WBP_ModernHud_StatusBarEnemy_C_TriggerFatigue final
{
public:
	double                                        NewFatigue;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxFatigue;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Local_IsFatigued;                                  // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_StatusBarEnemy_C_TriggerFatigue) == 0x000008, "Wrong alignment on WBP_ModernHud_StatusBarEnemy_C_TriggerFatigue");
static_assert(sizeof(WBP_ModernHud_StatusBarEnemy_C_TriggerFatigue) == 0x000038, "Wrong size on WBP_ModernHud_StatusBarEnemy_C_TriggerFatigue");
static_assert(offsetof(WBP_ModernHud_StatusBarEnemy_C_TriggerFatigue, NewFatigue) == 0x000000, "Member 'WBP_ModernHud_StatusBarEnemy_C_TriggerFatigue::NewFatigue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBarEnemy_C_TriggerFatigue, MaxFatigue) == 0x000008, "Member 'WBP_ModernHud_StatusBarEnemy_C_TriggerFatigue::MaxFatigue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBarEnemy_C_TriggerFatigue, Local_IsFatigued) == 0x000010, "Member 'WBP_ModernHud_StatusBarEnemy_C_TriggerFatigue::Local_IsFatigued' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBarEnemy_C_TriggerFatigue, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000018, "Member 'WBP_ModernHud_StatusBarEnemy_C_TriggerFatigue::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBarEnemy_C_TriggerFatigue, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000020, "Member 'WBP_ModernHud_StatusBarEnemy_C_TriggerFatigue::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBarEnemy_C_TriggerFatigue, CallFunc_PlayAnimation_ReturnValue) == 0x000028, "Member 'WBP_ModernHud_StatusBarEnemy_C_TriggerFatigue::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBarEnemy_C_TriggerFatigue, CallFunc_Not_PreBool_ReturnValue) == 0x000030, "Member 'WBP_ModernHud_StatusBarEnemy_C_TriggerFatigue::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBarEnemy_C_TriggerFatigue, CallFunc_BooleanAND_ReturnValue) == 0x000031, "Member 'WBP_ModernHud_StatusBarEnemy_C_TriggerFatigue::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBarEnemy_C_TriggerFatigue, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000032, "Member 'WBP_ModernHud_StatusBarEnemy_C_TriggerFatigue::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");

// Function WBP_ModernHud_StatusBarEnemy.WBP_ModernHud_StatusBarEnemy_C.UpdateActorValueTarget
// 0x0058 (0x0058 - 0x0000)
struct WBP_ModernHud_StatusBarEnemy_C_UpdateActorValueTarget final
{
public:
	class UVTESObjectRefComponent*                OldRef;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVTESObjectRefComponent*                NewRef;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EVActorValues ActorValue, float PreviousBaseValue, float PreviousModifiedValue, float NewBaseValue, float NewModifiedValue)> EventCallback; // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UVActorValuesPairingComponent*          CallFunc_GetComponentByClass_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UVActorValuesPairingComponent*          CallFunc_GetComponentByClass_ReturnValue_1;        // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_StatusBarEnemy_C_UpdateActorValueTarget) == 0x000008, "Wrong alignment on WBP_ModernHud_StatusBarEnemy_C_UpdateActorValueTarget");
static_assert(sizeof(WBP_ModernHud_StatusBarEnemy_C_UpdateActorValueTarget) == 0x000058, "Wrong size on WBP_ModernHud_StatusBarEnemy_C_UpdateActorValueTarget");
static_assert(offsetof(WBP_ModernHud_StatusBarEnemy_C_UpdateActorValueTarget, OldRef) == 0x000000, "Member 'WBP_ModernHud_StatusBarEnemy_C_UpdateActorValueTarget::OldRef' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBarEnemy_C_UpdateActorValueTarget, NewRef) == 0x000008, "Member 'WBP_ModernHud_StatusBarEnemy_C_UpdateActorValueTarget::NewRef' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBarEnemy_C_UpdateActorValueTarget, EventCallback) == 0x000010, "Member 'WBP_ModernHud_StatusBarEnemy_C_UpdateActorValueTarget::EventCallback' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBarEnemy_C_UpdateActorValueTarget, CallFunc_GetOwner_ReturnValue) == 0x000020, "Member 'WBP_ModernHud_StatusBarEnemy_C_UpdateActorValueTarget::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBarEnemy_C_UpdateActorValueTarget, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'WBP_ModernHud_StatusBarEnemy_C_UpdateActorValueTarget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBarEnemy_C_UpdateActorValueTarget, CallFunc_IsValid_ReturnValue_1) == 0x000029, "Member 'WBP_ModernHud_StatusBarEnemy_C_UpdateActorValueTarget::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBarEnemy_C_UpdateActorValueTarget, CallFunc_GetComponentByClass_ReturnValue) == 0x000030, "Member 'WBP_ModernHud_StatusBarEnemy_C_UpdateActorValueTarget::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBarEnemy_C_UpdateActorValueTarget, CallFunc_GetOwner_ReturnValue_1) == 0x000038, "Member 'WBP_ModernHud_StatusBarEnemy_C_UpdateActorValueTarget::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBarEnemy_C_UpdateActorValueTarget, CallFunc_IsValid_ReturnValue_2) == 0x000040, "Member 'WBP_ModernHud_StatusBarEnemy_C_UpdateActorValueTarget::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBarEnemy_C_UpdateActorValueTarget, CallFunc_IsValid_ReturnValue_3) == 0x000041, "Member 'WBP_ModernHud_StatusBarEnemy_C_UpdateActorValueTarget::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBarEnemy_C_UpdateActorValueTarget, CallFunc_GetComponentByClass_ReturnValue_1) == 0x000048, "Member 'WBP_ModernHud_StatusBarEnemy_C_UpdateActorValueTarget::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBarEnemy_C_UpdateActorValueTarget, CallFunc_IsValid_ReturnValue_4) == 0x000050, "Member 'WBP_ModernHud_StatusBarEnemy_C_UpdateActorValueTarget::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBarEnemy_C_UpdateActorValueTarget, CallFunc_IsValid_ReturnValue_5) == 0x000051, "Member 'WBP_ModernHud_StatusBarEnemy_C_UpdateActorValueTarget::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");

// Function WBP_ModernHud_StatusBarEnemy.WBP_ModernHud_StatusBarEnemy_C.GetProgress
// 0x0008 (0x0008 - 0x0000)
struct WBP_ModernHud_StatusBarEnemy_C_GetProgress final
{
public:
	double                                        Progress_0;                                        // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_StatusBarEnemy_C_GetProgress) == 0x000008, "Wrong alignment on WBP_ModernHud_StatusBarEnemy_C_GetProgress");
static_assert(sizeof(WBP_ModernHud_StatusBarEnemy_C_GetProgress) == 0x000008, "Wrong size on WBP_ModernHud_StatusBarEnemy_C_GetProgress");
static_assert(offsetof(WBP_ModernHud_StatusBarEnemy_C_GetProgress, Progress_0) == 0x000000, "Member 'WBP_ModernHud_StatusBarEnemy_C_GetProgress::Progress_0' has a wrong offset!");

}

