#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LegacyPrefab_PageTab

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "Altar_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_LegacyPrefab_PageTab.WBP_LegacyPrefab_PageTab_C
// 0x0030 (0x05F0 - 0x05C0)
class UWBP_LegacyPrefab_PageTab_C final : public UVLegacyPageTab
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                page_tab_button;                                   // 0x05C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               page_tab_icon;                                     // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               page_tab_selection_off;                            // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               page_tab_selection_on;                             // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__WBP_LegacyPrefab_PageTab_page_tab_button_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void ExecuteUbergraph_WBP_LegacyPrefab_PageTab(int32 EntryPoint);
	void OnIconUpdated();
	void OnSynchronizeProperties();
	void SetSelected(bool Condition);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_LegacyPrefab_PageTab_C">();
	}
	static class UWBP_LegacyPrefab_PageTab_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_LegacyPrefab_PageTab_C>();
	}
};
static_assert(alignof(UWBP_LegacyPrefab_PageTab_C) == 0x000010, "Wrong alignment on UWBP_LegacyPrefab_PageTab_C");
static_assert(sizeof(UWBP_LegacyPrefab_PageTab_C) == 0x0005F0, "Wrong size on UWBP_LegacyPrefab_PageTab_C");
static_assert(offsetof(UWBP_LegacyPrefab_PageTab_C, UberGraphFrame) == 0x0005C0, "Member 'UWBP_LegacyPrefab_PageTab_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_LegacyPrefab_PageTab_C, page_tab_button) == 0x0005C8, "Member 'UWBP_LegacyPrefab_PageTab_C::page_tab_button' has a wrong offset!");
static_assert(offsetof(UWBP_LegacyPrefab_PageTab_C, page_tab_icon) == 0x0005D0, "Member 'UWBP_LegacyPrefab_PageTab_C::page_tab_icon' has a wrong offset!");
static_assert(offsetof(UWBP_LegacyPrefab_PageTab_C, page_tab_selection_off) == 0x0005D8, "Member 'UWBP_LegacyPrefab_PageTab_C::page_tab_selection_off' has a wrong offset!");
static_assert(offsetof(UWBP_LegacyPrefab_PageTab_C, page_tab_selection_on) == 0x0005E0, "Member 'UWBP_LegacyPrefab_PageTab_C::page_tab_selection_on' has a wrong offset!");

}

