#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Modern_SettingsMenu_ValidationPopup

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "Altar_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Modern_SettingsMenu_ValidationPopup.WBP_Modern_SettingsMenu_ValidationPopup_C
// 0x00C8 (0x0590 - 0x04C8)
class UWBP_Modern_SettingsMenu_ValidationPopup_C final : public UVAltarWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       PopupFadeInOut;                                    // 0x04D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_ModernPrefab_Button_C*             Button_0;                                          // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModernPrefab_Button_C*             Button_1;                                          // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModernPrefab_Button_C*             Button_2;                                          // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AltarTextBlock_C*                  message_text;                                      // 0x04F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AltarTextBlock_C*                  TitleText;                                         // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(int32 ButtonIndex, bool ShouldQuitOnClose, bool ShouldChangeSettingsPageOnClose, int32 SettingsPage)> OnPopupQuit; // 0x0500(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FText                                   Title;                                             // 0x0510(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FText                                   Message;                                           // 0x0528(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FText                                   Button1Text;                                       // 0x0540(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FText                                   Button2Text;                                       // 0x0558(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FText                                   Button3Text;                                       // 0x0570(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	bool                                          ShouldQuitOnClose;                                 // 0x0588(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          ShouldChangeSettingsTabOnClose;                    // 0x0589(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_58A[0x2];                                      // 0x058A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SettingsTab;                                       // 0x058C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void PreConstruct(bool IsDesignTime);
	void MenuFadeInOut(bool InIsVisible, double* AnimationTime);
	void InpActEvt_IA_UI_Specific_SettingMenu_Popup_Special_K2Node_EnhancedInputActionEvent_0(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InitPopup(const class FText& NewTitle, const class FText& NewMessage, const class FText& NewButton1Text, const class FText& NewButton2Text, const class FText& NewButton3Text);
	void ExecuteUbergraph_WBP_Modern_SettingsMenu_ValidationPopup(int32 EntryPoint);
	void Construct();
	void BP_OnTirggeringActionCommited();
	bool BP_OnHandleBackAction();
	void BP_OnActivated();
	void BndEvt__WBP_Modern_SettingsMenu_ValidationPopup_Button_3_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_Modern_SettingsMenu_ValidationPopup_Button_2_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_Modern_SettingsMenu_ValidationPopup_Button_1_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BindActions();

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Modern_SettingsMenu_ValidationPopup_C">();
	}
	static class UWBP_Modern_SettingsMenu_ValidationPopup_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Modern_SettingsMenu_ValidationPopup_C>();
	}
};
static_assert(alignof(UWBP_Modern_SettingsMenu_ValidationPopup_C) == 0x000008, "Wrong alignment on UWBP_Modern_SettingsMenu_ValidationPopup_C");
static_assert(sizeof(UWBP_Modern_SettingsMenu_ValidationPopup_C) == 0x000590, "Wrong size on UWBP_Modern_SettingsMenu_ValidationPopup_C");
static_assert(offsetof(UWBP_Modern_SettingsMenu_ValidationPopup_C, UberGraphFrame) == 0x0004C8, "Member 'UWBP_Modern_SettingsMenu_ValidationPopup_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_SettingsMenu_ValidationPopup_C, PopupFadeInOut) == 0x0004D0, "Member 'UWBP_Modern_SettingsMenu_ValidationPopup_C::PopupFadeInOut' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_SettingsMenu_ValidationPopup_C, Button_0) == 0x0004D8, "Member 'UWBP_Modern_SettingsMenu_ValidationPopup_C::Button_0' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_SettingsMenu_ValidationPopup_C, Button_1) == 0x0004E0, "Member 'UWBP_Modern_SettingsMenu_ValidationPopup_C::Button_1' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_SettingsMenu_ValidationPopup_C, Button_2) == 0x0004E8, "Member 'UWBP_Modern_SettingsMenu_ValidationPopup_C::Button_2' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_SettingsMenu_ValidationPopup_C, message_text) == 0x0004F0, "Member 'UWBP_Modern_SettingsMenu_ValidationPopup_C::message_text' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_SettingsMenu_ValidationPopup_C, TitleText) == 0x0004F8, "Member 'UWBP_Modern_SettingsMenu_ValidationPopup_C::TitleText' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_SettingsMenu_ValidationPopup_C, OnPopupQuit) == 0x000500, "Member 'UWBP_Modern_SettingsMenu_ValidationPopup_C::OnPopupQuit' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_SettingsMenu_ValidationPopup_C, Title) == 0x000510, "Member 'UWBP_Modern_SettingsMenu_ValidationPopup_C::Title' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_SettingsMenu_ValidationPopup_C, Message) == 0x000528, "Member 'UWBP_Modern_SettingsMenu_ValidationPopup_C::Message' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_SettingsMenu_ValidationPopup_C, Button1Text) == 0x000540, "Member 'UWBP_Modern_SettingsMenu_ValidationPopup_C::Button1Text' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_SettingsMenu_ValidationPopup_C, Button2Text) == 0x000558, "Member 'UWBP_Modern_SettingsMenu_ValidationPopup_C::Button2Text' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_SettingsMenu_ValidationPopup_C, Button3Text) == 0x000570, "Member 'UWBP_Modern_SettingsMenu_ValidationPopup_C::Button3Text' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_SettingsMenu_ValidationPopup_C, ShouldQuitOnClose) == 0x000588, "Member 'UWBP_Modern_SettingsMenu_ValidationPopup_C::ShouldQuitOnClose' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_SettingsMenu_ValidationPopup_C, ShouldChangeSettingsTabOnClose) == 0x000589, "Member 'UWBP_Modern_SettingsMenu_ValidationPopup_C::ShouldChangeSettingsTabOnClose' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_SettingsMenu_ValidationPopup_C, SettingsTab) == 0x00058C, "Member 'UWBP_Modern_SettingsMenu_ValidationPopup_C::SettingsTab' has a wrong offset!");

}

