#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Modern_SettingsMenu

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "EnhancedInput_structs.hpp"
#include "Altar_structs.hpp"


namespace SDK::Params
{

// Function WBP_Modern_SettingsMenu.WBP_Modern_SettingsMenu_C.AddSwitchTabIMC
// 0x0038 (0x0038 - 0x0000)
struct WBP_Modern_SettingsMenu_C_AddSwitchTabIMC final
{
public:
	struct FModifyContextOptions                  Temp_struct_Variable;                              // 0x0000(0x0001)(ConstParm, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UEnhancedInputLocalPlayerSubsystem*     CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IEnhancedInputSubsystemInterface> CallFunc_AddMappingContext_self_CastInput; // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_SettingsMenu_C_AddSwitchTabIMC) == 0x000008, "Wrong alignment on WBP_Modern_SettingsMenu_C_AddSwitchTabIMC");
static_assert(sizeof(WBP_Modern_SettingsMenu_C_AddSwitchTabIMC) == 0x000038, "Wrong size on WBP_Modern_SettingsMenu_C_AddSwitchTabIMC");
static_assert(offsetof(WBP_Modern_SettingsMenu_C_AddSwitchTabIMC, Temp_struct_Variable) == 0x000000, "Member 'WBP_Modern_SettingsMenu_C_AddSwitchTabIMC::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_C_AddSwitchTabIMC, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'WBP_Modern_SettingsMenu_C_AddSwitchTabIMC::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_C_AddSwitchTabIMC, CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue) == 0x000010, "Member 'WBP_Modern_SettingsMenu_C_AddSwitchTabIMC::CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_C_AddSwitchTabIMC, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x000018, "Member 'WBP_Modern_SettingsMenu_C_AddSwitchTabIMC::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_C_AddSwitchTabIMC, CallFunc_AddMappingContext_self_CastInput) == 0x000020, "Member 'WBP_Modern_SettingsMenu_C_AddSwitchTabIMC::CallFunc_AddMappingContext_self_CastInput' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_C_AddSwitchTabIMC, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'WBP_Modern_SettingsMenu_C_AddSwitchTabIMC::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_Modern_SettingsMenu.WBP_Modern_SettingsMenu_C.BindAllEvents
// 0x0090 (0x0090 - 0x0000)
struct WBP_Modern_SettingsMenu_C_BindAllEvents final
{
public:
	TDelegate<void(class UVNavigableInputKeySelector* Target, bool NewState)> K2Node_CreateDelegate_OutputDelegate; // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVSettingsGlobalSubsystem*              CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool NewLockState)>            K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVSettingsGlobalSubsystem*              CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FText& PopupText, int32 ModIndex)> K2Node_CreateDelegate_OutputDelegate_2; // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVRebindGlobalSubsystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UVModernRebindSettingWidget* ChangedRebind)> K2Node_CreateDelegate_OutputDelegate_3; // 0x0048(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVSettingsGlobalSubsystem*              CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UVModernSettingWidget* ChangedSettings)> K2Node_CreateDelegate_OutputDelegate_4; // 0x0060(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVSettingsGlobalSubsystem*              CallFunc_GetGameInstanceSubsystem_ReturnValue_4;   // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UVModernSettingWidget* ChangedSettings)> K2Node_CreateDelegate_OutputDelegate_5; // 0x0078(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVRebindGlobalSubsystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue_5;   // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_SettingsMenu_C_BindAllEvents) == 0x000008, "Wrong alignment on WBP_Modern_SettingsMenu_C_BindAllEvents");
static_assert(sizeof(WBP_Modern_SettingsMenu_C_BindAllEvents) == 0x000090, "Wrong size on WBP_Modern_SettingsMenu_C_BindAllEvents");
static_assert(offsetof(WBP_Modern_SettingsMenu_C_BindAllEvents, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_Modern_SettingsMenu_C_BindAllEvents::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_C_BindAllEvents, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000010, "Member 'WBP_Modern_SettingsMenu_C_BindAllEvents::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_C_BindAllEvents, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'WBP_Modern_SettingsMenu_C_BindAllEvents::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_C_BindAllEvents, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000028, "Member 'WBP_Modern_SettingsMenu_C_BindAllEvents::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_C_BindAllEvents, K2Node_CreateDelegate_OutputDelegate_2) == 0x000030, "Member 'WBP_Modern_SettingsMenu_C_BindAllEvents::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_C_BindAllEvents, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x000040, "Member 'WBP_Modern_SettingsMenu_C_BindAllEvents::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_C_BindAllEvents, K2Node_CreateDelegate_OutputDelegate_3) == 0x000048, "Member 'WBP_Modern_SettingsMenu_C_BindAllEvents::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_C_BindAllEvents, CallFunc_GetGameInstanceSubsystem_ReturnValue_3) == 0x000058, "Member 'WBP_Modern_SettingsMenu_C_BindAllEvents::CallFunc_GetGameInstanceSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_C_BindAllEvents, K2Node_CreateDelegate_OutputDelegate_4) == 0x000060, "Member 'WBP_Modern_SettingsMenu_C_BindAllEvents::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_C_BindAllEvents, CallFunc_GetGameInstanceSubsystem_ReturnValue_4) == 0x000070, "Member 'WBP_Modern_SettingsMenu_C_BindAllEvents::CallFunc_GetGameInstanceSubsystem_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_C_BindAllEvents, K2Node_CreateDelegate_OutputDelegate_5) == 0x000078, "Member 'WBP_Modern_SettingsMenu_C_BindAllEvents::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_C_BindAllEvents, CallFunc_GetGameInstanceSubsystem_ReturnValue_5) == 0x000088, "Member 'WBP_Modern_SettingsMenu_C_BindAllEvents::CallFunc_GetGameInstanceSubsystem_ReturnValue_5' has a wrong offset!");

// Function WBP_Modern_SettingsMenu.WBP_Modern_SettingsMenu_C.BndEvt__WBP_Modern_SettingsMenu_Header_K2Node_ComponentBoundEvent_0_IndexSelected__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_Modern_SettingsMenu_C_BndEvt__WBP_Modern_SettingsMenu_Header_K2Node_ComponentBoundEvent_0_IndexSelected__DelegateSignature final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_SettingsMenu_C_BndEvt__WBP_Modern_SettingsMenu_Header_K2Node_ComponentBoundEvent_0_IndexSelected__DelegateSignature) == 0x000004, "Wrong alignment on WBP_Modern_SettingsMenu_C_BndEvt__WBP_Modern_SettingsMenu_Header_K2Node_ComponentBoundEvent_0_IndexSelected__DelegateSignature");
static_assert(sizeof(WBP_Modern_SettingsMenu_C_BndEvt__WBP_Modern_SettingsMenu_Header_K2Node_ComponentBoundEvent_0_IndexSelected__DelegateSignature) == 0x000004, "Wrong size on WBP_Modern_SettingsMenu_C_BndEvt__WBP_Modern_SettingsMenu_Header_K2Node_ComponentBoundEvent_0_IndexSelected__DelegateSignature");
static_assert(offsetof(WBP_Modern_SettingsMenu_C_BndEvt__WBP_Modern_SettingsMenu_Header_K2Node_ComponentBoundEvent_0_IndexSelected__DelegateSignature, Index_0) == 0x000000, "Member 'WBP_Modern_SettingsMenu_C_BndEvt__WBP_Modern_SettingsMenu_Header_K2Node_ComponentBoundEvent_0_IndexSelected__DelegateSignature::Index_0' has a wrong offset!");

// Function WBP_Modern_SettingsMenu.WBP_Modern_SettingsMenu_C.BndEvt__WBP_Modern_SettingsMenu_PageSwitcher_K2Node_ComponentBoundEvent_1_OnSettingItemHoverred__DelegateSignature
// 0x0138 (0x0138 - 0x0000)
struct WBP_Modern_SettingsMenu_C_BndEvt__WBP_Modern_SettingsMenu_PageSwitcher_K2Node_ComponentBoundEvent_1_OnSettingItemHoverred__DelegateSignature final
{
public:
	struct FModernSettingTableRow                 SettingData;                                       // 0x0000(0x0138)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Modern_SettingsMenu_C_BndEvt__WBP_Modern_SettingsMenu_PageSwitcher_K2Node_ComponentBoundEvent_1_OnSettingItemHoverred__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Modern_SettingsMenu_C_BndEvt__WBP_Modern_SettingsMenu_PageSwitcher_K2Node_ComponentBoundEvent_1_OnSettingItemHoverred__DelegateSignature");
static_assert(sizeof(WBP_Modern_SettingsMenu_C_BndEvt__WBP_Modern_SettingsMenu_PageSwitcher_K2Node_ComponentBoundEvent_1_OnSettingItemHoverred__DelegateSignature) == 0x000138, "Wrong size on WBP_Modern_SettingsMenu_C_BndEvt__WBP_Modern_SettingsMenu_PageSwitcher_K2Node_ComponentBoundEvent_1_OnSettingItemHoverred__DelegateSignature");
static_assert(offsetof(WBP_Modern_SettingsMenu_C_BndEvt__WBP_Modern_SettingsMenu_PageSwitcher_K2Node_ComponentBoundEvent_1_OnSettingItemHoverred__DelegateSignature, SettingData) == 0x000000, "Member 'WBP_Modern_SettingsMenu_C_BndEvt__WBP_Modern_SettingsMenu_PageSwitcher_K2Node_ComponentBoundEvent_1_OnSettingItemHoverred__DelegateSignature::SettingData' has a wrong offset!");

// Function WBP_Modern_SettingsMenu.WBP_Modern_SettingsMenu_C.BndEvt__WBP_Modern_SettingsMenu_PageSwitcher_K2Node_ComponentBoundEvent_3_OnSwitcherChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_Modern_SettingsMenu_C_BndEvt__WBP_Modern_SettingsMenu_PageSwitcher_K2Node_ComponentBoundEvent_3_OnSwitcherChanged__DelegateSignature final
{
public:
	class UWidget*                                NewWidget;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         NewIndex;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_SettingsMenu_C_BndEvt__WBP_Modern_SettingsMenu_PageSwitcher_K2Node_ComponentBoundEvent_3_OnSwitcherChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Modern_SettingsMenu_C_BndEvt__WBP_Modern_SettingsMenu_PageSwitcher_K2Node_ComponentBoundEvent_3_OnSwitcherChanged__DelegateSignature");
static_assert(sizeof(WBP_Modern_SettingsMenu_C_BndEvt__WBP_Modern_SettingsMenu_PageSwitcher_K2Node_ComponentBoundEvent_3_OnSwitcherChanged__DelegateSignature) == 0x000010, "Wrong size on WBP_Modern_SettingsMenu_C_BndEvt__WBP_Modern_SettingsMenu_PageSwitcher_K2Node_ComponentBoundEvent_3_OnSwitcherChanged__DelegateSignature");
static_assert(offsetof(WBP_Modern_SettingsMenu_C_BndEvt__WBP_Modern_SettingsMenu_PageSwitcher_K2Node_ComponentBoundEvent_3_OnSwitcherChanged__DelegateSignature, NewWidget) == 0x000000, "Member 'WBP_Modern_SettingsMenu_C_BndEvt__WBP_Modern_SettingsMenu_PageSwitcher_K2Node_ComponentBoundEvent_3_OnSwitcherChanged__DelegateSignature::NewWidget' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_C_BndEvt__WBP_Modern_SettingsMenu_PageSwitcher_K2Node_ComponentBoundEvent_3_OnSwitcherChanged__DelegateSignature, NewIndex) == 0x000008, "Member 'WBP_Modern_SettingsMenu_C_BndEvt__WBP_Modern_SettingsMenu_PageSwitcher_K2Node_ComponentBoundEvent_3_OnSwitcherChanged__DelegateSignature::NewIndex' has a wrong offset!");

// Function WBP_Modern_SettingsMenu.WBP_Modern_SettingsMenu_C.BP_OnHandleBackAction
// 0x0001 (0x0001 - 0x0000)
struct WBP_Modern_SettingsMenu_C_BP_OnHandleBackAction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_SettingsMenu_C_BP_OnHandleBackAction) == 0x000001, "Wrong alignment on WBP_Modern_SettingsMenu_C_BP_OnHandleBackAction");
static_assert(sizeof(WBP_Modern_SettingsMenu_C_BP_OnHandleBackAction) == 0x000001, "Wrong size on WBP_Modern_SettingsMenu_C_BP_OnHandleBackAction");
static_assert(offsetof(WBP_Modern_SettingsMenu_C_BP_OnHandleBackAction, ReturnValue) == 0x000000, "Member 'WBP_Modern_SettingsMenu_C_BP_OnHandleBackAction::ReturnValue' has a wrong offset!");

// Function WBP_Modern_SettingsMenu.WBP_Modern_SettingsMenu_C.CanInteractWithSettings
// 0x0030 (0x0030 - 0x0000)
struct WBP_Modern_SettingsMenu_C_CanInteractWithSettings final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVUINavigationGlobalSubsystem*          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesHavePopup_Value;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IVEnhancedInputNavigable> CallFunc_IsWidgetInTopMostFocusedStack_Widget_CastInput; // 0x0018(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsWidgetInTopMostFocusedStack_ReturnValue; // 0x0028(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_SettingsMenu_C_CanInteractWithSettings) == 0x000008, "Wrong alignment on WBP_Modern_SettingsMenu_C_CanInteractWithSettings");
static_assert(sizeof(WBP_Modern_SettingsMenu_C_CanInteractWithSettings) == 0x000030, "Wrong size on WBP_Modern_SettingsMenu_C_CanInteractWithSettings");
static_assert(offsetof(WBP_Modern_SettingsMenu_C_CanInteractWithSettings, Value) == 0x000000, "Member 'WBP_Modern_SettingsMenu_C_CanInteractWithSettings::Value' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_C_CanInteractWithSettings, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'WBP_Modern_SettingsMenu_C_CanInteractWithSettings::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_C_CanInteractWithSettings, CallFunc_DoesHavePopup_Value) == 0x000010, "Member 'WBP_Modern_SettingsMenu_C_CanInteractWithSettings::CallFunc_DoesHavePopup_Value' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_C_CanInteractWithSettings, CallFunc_IsWidgetInTopMostFocusedStack_Widget_CastInput) == 0x000018, "Member 'WBP_Modern_SettingsMenu_C_CanInteractWithSettings::CallFunc_IsWidgetInTopMostFocusedStack_Widget_CastInput' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_C_CanInteractWithSettings, CallFunc_IsWidgetInTopMostFocusedStack_ReturnValue) == 0x000028, "Member 'WBP_Modern_SettingsMenu_C_CanInteractWithSettings::CallFunc_IsWidgetInTopMostFocusedStack_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_C_CanInteractWithSettings, CallFunc_Not_PreBool_ReturnValue) == 0x000029, "Member 'WBP_Modern_SettingsMenu_C_CanInteractWithSettings::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_C_CanInteractWithSettings, CallFunc_BooleanAND_ReturnValue) == 0x00002A, "Member 'WBP_Modern_SettingsMenu_C_CanInteractWithSettings::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_Modern_SettingsMenu.WBP_Modern_SettingsMenu_C.CanSwitchTab
// 0x0028 (0x0028 - 0x0000)
struct WBP_Modern_SettingsMenu_C_CanSwitchTab final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesHavePopup_Value;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNavigationAllowed_IsAllowed;            // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVUINavigationGlobalSubsystem*          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IVEnhancedInputNavigable> CallFunc_IsWidgetInTopMostFocusedStack_Widget_CastInput; // 0x0010(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsWidgetInTopMostFocusedStack_ReturnValue; // 0x0020(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_SettingsMenu_C_CanSwitchTab) == 0x000008, "Wrong alignment on WBP_Modern_SettingsMenu_C_CanSwitchTab");
static_assert(sizeof(WBP_Modern_SettingsMenu_C_CanSwitchTab) == 0x000028, "Wrong size on WBP_Modern_SettingsMenu_C_CanSwitchTab");
static_assert(offsetof(WBP_Modern_SettingsMenu_C_CanSwitchTab, ReturnValue) == 0x000000, "Member 'WBP_Modern_SettingsMenu_C_CanSwitchTab::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_C_CanSwitchTab, CallFunc_DoesHavePopup_Value) == 0x000001, "Member 'WBP_Modern_SettingsMenu_C_CanSwitchTab::CallFunc_DoesHavePopup_Value' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_C_CanSwitchTab, CallFunc_IsNavigationAllowed_IsAllowed) == 0x000002, "Member 'WBP_Modern_SettingsMenu_C_CanSwitchTab::CallFunc_IsNavigationAllowed_IsAllowed' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_C_CanSwitchTab, CallFunc_Not_PreBool_ReturnValue) == 0x000003, "Member 'WBP_Modern_SettingsMenu_C_CanSwitchTab::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_C_CanSwitchTab, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'WBP_Modern_SettingsMenu_C_CanSwitchTab::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_C_CanSwitchTab, CallFunc_IsWidgetInTopMostFocusedStack_Widget_CastInput) == 0x000010, "Member 'WBP_Modern_SettingsMenu_C_CanSwitchTab::CallFunc_IsWidgetInTopMostFocusedStack_Widget_CastInput' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_C_CanSwitchTab, CallFunc_IsWidgetInTopMostFocusedStack_ReturnValue) == 0x000020, "Member 'WBP_Modern_SettingsMenu_C_CanSwitchTab::CallFunc_IsWidgetInTopMostFocusedStack_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_C_CanSwitchTab, CallFunc_BooleanAND_ReturnValue) == 0x000021, "Member 'WBP_Modern_SettingsMenu_C_CanSwitchTab::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_C_CanSwitchTab, CallFunc_BooleanAND_ReturnValue_1) == 0x000022, "Member 'WBP_Modern_SettingsMenu_C_CanSwitchTab::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function WBP_Modern_SettingsMenu.WBP_Modern_SettingsMenu_C.ClearExternalFooter
// 0x0001 (0x0001 - 0x0000)
struct WBP_Modern_SettingsMenu_C_ClearExternalFooter final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_SettingsMenu_C_ClearExternalFooter) == 0x000001, "Wrong alignment on WBP_Modern_SettingsMenu_C_ClearExternalFooter");
static_assert(sizeof(WBP_Modern_SettingsMenu_C_ClearExternalFooter) == 0x000001, "Wrong size on WBP_Modern_SettingsMenu_C_ClearExternalFooter");
static_assert(offsetof(WBP_Modern_SettingsMenu_C_ClearExternalFooter, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'WBP_Modern_SettingsMenu_C_ClearExternalFooter::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_Modern_SettingsMenu.WBP_Modern_SettingsMenu_C.CloseSettingsSaveLoadPopup
// 0x0060 (0x0060 - 0x0000)
struct WBP_Modern_SettingsMenu_C_CloseSettingsSaveLoadPopup final
{
public:
	int32                                         ButtonIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Local_PopupModIndex;                               // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVNavigableActivatableWidgetBase*       CallFunc_GetWidgetToNavigate_Widget;               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVNavigableActivatableWidgetBase*       CallFunc_GetWidgetToNavigate_Widget_1;             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVUINavigationGlobalSubsystem*          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IVEnhancedInputNavigable> CallFunc_NavigateToWidget_Widget_CastInput;     // 0x0028(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess_1;                 // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVUINavigationGlobalSubsystem*          CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IVEnhancedInputNavigable> CallFunc_NavigateToWidget_Widget_CastInput_1;   // 0x0048(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_SettingsMenu_C_CloseSettingsSaveLoadPopup) == 0x000008, "Wrong alignment on WBP_Modern_SettingsMenu_C_CloseSettingsSaveLoadPopup");
static_assert(sizeof(WBP_Modern_SettingsMenu_C_CloseSettingsSaveLoadPopup) == 0x000060, "Wrong size on WBP_Modern_SettingsMenu_C_CloseSettingsSaveLoadPopup");
static_assert(offsetof(WBP_Modern_SettingsMenu_C_CloseSettingsSaveLoadPopup, ButtonIndex) == 0x000000, "Member 'WBP_Modern_SettingsMenu_C_CloseSettingsSaveLoadPopup::ButtonIndex' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_C_CloseSettingsSaveLoadPopup, Local_PopupModIndex) == 0x000004, "Member 'WBP_Modern_SettingsMenu_C_CloseSettingsSaveLoadPopup::Local_PopupModIndex' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_C_CloseSettingsSaveLoadPopup, CallFunc_GetWidgetToNavigate_Widget) == 0x000008, "Member 'WBP_Modern_SettingsMenu_C_CloseSettingsSaveLoadPopup::CallFunc_GetWidgetToNavigate_Widget' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_C_CloseSettingsSaveLoadPopup, CallFunc_GetWidgetToNavigate_Widget_1) == 0x000010, "Member 'WBP_Modern_SettingsMenu_C_CloseSettingsSaveLoadPopup::CallFunc_GetWidgetToNavigate_Widget_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_C_CloseSettingsSaveLoadPopup, K2Node_SwitchInteger_CmpSuccess) == 0x000018, "Member 'WBP_Modern_SettingsMenu_C_CloseSettingsSaveLoadPopup::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_C_CloseSettingsSaveLoadPopup, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000020, "Member 'WBP_Modern_SettingsMenu_C_CloseSettingsSaveLoadPopup::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_C_CloseSettingsSaveLoadPopup, CallFunc_NavigateToWidget_Widget_CastInput) == 0x000028, "Member 'WBP_Modern_SettingsMenu_C_CloseSettingsSaveLoadPopup::CallFunc_NavigateToWidget_Widget_CastInput' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_C_CloseSettingsSaveLoadPopup, K2Node_SwitchInteger_CmpSuccess_1) == 0x000038, "Member 'WBP_Modern_SettingsMenu_C_CloseSettingsSaveLoadPopup::K2Node_SwitchInteger_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_C_CloseSettingsSaveLoadPopup, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000040, "Member 'WBP_Modern_SettingsMenu_C_CloseSettingsSaveLoadPopup::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_C_CloseSettingsSaveLoadPopup, CallFunc_NavigateToWidget_Widget_CastInput_1) == 0x000048, "Member 'WBP_Modern_SettingsMenu_C_CloseSettingsSaveLoadPopup::CallFunc_NavigateToWidget_Widget_CastInput_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_C_CloseSettingsSaveLoadPopup, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'WBP_Modern_SettingsMenu_C_CloseSettingsSaveLoadPopup::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_Modern_SettingsMenu.WBP_Modern_SettingsMenu_C.CloseSettingsTimedPopup
// 0x0030 (0x0030 - 0x0000)
struct WBP_Modern_SettingsMenu_C_CloseSettingsTimedPopup final
{
public:
	int32                                         ButtonIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVNavigableActivatableWidgetBase*       CallFunc_GetWidgetToNavigate_Widget;               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVUINavigationGlobalSubsystem*          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IVEnhancedInputNavigable> CallFunc_NavigateToWidget_Widget_CastInput;     // 0x0018(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_SettingsMenu_C_CloseSettingsTimedPopup) == 0x000008, "Wrong alignment on WBP_Modern_SettingsMenu_C_CloseSettingsTimedPopup");
static_assert(sizeof(WBP_Modern_SettingsMenu_C_CloseSettingsTimedPopup) == 0x000030, "Wrong size on WBP_Modern_SettingsMenu_C_CloseSettingsTimedPopup");
static_assert(offsetof(WBP_Modern_SettingsMenu_C_CloseSettingsTimedPopup, ButtonIndex) == 0x000000, "Member 'WBP_Modern_SettingsMenu_C_CloseSettingsTimedPopup::ButtonIndex' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_C_CloseSettingsTimedPopup, CallFunc_GetWidgetToNavigate_Widget) == 0x000008, "Member 'WBP_Modern_SettingsMenu_C_CloseSettingsTimedPopup::CallFunc_GetWidgetToNavigate_Widget' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_C_CloseSettingsTimedPopup, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000010, "Member 'WBP_Modern_SettingsMenu_C_CloseSettingsTimedPopup::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_C_CloseSettingsTimedPopup, CallFunc_NavigateToWidget_Widget_CastInput) == 0x000018, "Member 'WBP_Modern_SettingsMenu_C_CloseSettingsTimedPopup::CallFunc_NavigateToWidget_Widget_CastInput' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_C_CloseSettingsTimedPopup, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'WBP_Modern_SettingsMenu_C_CloseSettingsTimedPopup::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_C_CloseSettingsTimedPopup, K2Node_SwitchInteger_CmpSuccess) == 0x000029, "Member 'WBP_Modern_SettingsMenu_C_CloseSettingsTimedPopup::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function WBP_Modern_SettingsMenu.WBP_Modern_SettingsMenu_C.CloseSettingsValidationPopup
// 0x0038 (0x0038 - 0x0000)
struct WBP_Modern_SettingsMenu_C_CloseSettingsValidationPopup final
{
public:
	int32                                         ButtonIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldQuitOnClose;                                 // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldChangeSettingsPageOnClose;                   // 0x0005(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SettingsPage;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVNavigableActivatableWidgetBase*       CallFunc_GetWidgetToNavigate_Widget;               // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVUINavigationGlobalSubsystem*          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IVEnhancedInputNavigable> CallFunc_NavigateToWidget_Widget_CastInput;     // 0x0020(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_SettingsMenu_C_CloseSettingsValidationPopup) == 0x000008, "Wrong alignment on WBP_Modern_SettingsMenu_C_CloseSettingsValidationPopup");
static_assert(sizeof(WBP_Modern_SettingsMenu_C_CloseSettingsValidationPopup) == 0x000038, "Wrong size on WBP_Modern_SettingsMenu_C_CloseSettingsValidationPopup");
static_assert(offsetof(WBP_Modern_SettingsMenu_C_CloseSettingsValidationPopup, ButtonIndex) == 0x000000, "Member 'WBP_Modern_SettingsMenu_C_CloseSettingsValidationPopup::ButtonIndex' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_C_CloseSettingsValidationPopup, ShouldQuitOnClose) == 0x000004, "Member 'WBP_Modern_SettingsMenu_C_CloseSettingsValidationPopup::ShouldQuitOnClose' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_C_CloseSettingsValidationPopup, ShouldChangeSettingsPageOnClose) == 0x000005, "Member 'WBP_Modern_SettingsMenu_C_CloseSettingsValidationPopup::ShouldChangeSettingsPageOnClose' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_C_CloseSettingsValidationPopup, SettingsPage) == 0x000008, "Member 'WBP_Modern_SettingsMenu_C_CloseSettingsValidationPopup::SettingsPage' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_C_CloseSettingsValidationPopup, CallFunc_GetWidgetToNavigate_Widget) == 0x000010, "Member 'WBP_Modern_SettingsMenu_C_CloseSettingsValidationPopup::CallFunc_GetWidgetToNavigate_Widget' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_C_CloseSettingsValidationPopup, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000018, "Member 'WBP_Modern_SettingsMenu_C_CloseSettingsValidationPopup::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_C_CloseSettingsValidationPopup, CallFunc_NavigateToWidget_Widget_CastInput) == 0x000020, "Member 'WBP_Modern_SettingsMenu_C_CloseSettingsValidationPopup::CallFunc_NavigateToWidget_Widget_CastInput' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_C_CloseSettingsValidationPopup, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'WBP_Modern_SettingsMenu_C_CloseSettingsValidationPopup::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_C_CloseSettingsValidationPopup, K2Node_SwitchInteger_CmpSuccess) == 0x000031, "Member 'WBP_Modern_SettingsMenu_C_CloseSettingsValidationPopup::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function WBP_Modern_SettingsMenu.WBP_Modern_SettingsMenu_C.CREATEDELEGATE_PROXYFUNCTION_0
// 0x0020 (0x0020 - 0x0000)
struct WBP_Modern_SettingsMenu_C_CREATEDELEGATE_PROXYFUNCTION_0 final
{
public:
	class FText                                   PopupText;                                         // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         ModIndex;                                          // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_SettingsMenu_C_CREATEDELEGATE_PROXYFUNCTION_0) == 0x000008, "Wrong alignment on WBP_Modern_SettingsMenu_C_CREATEDELEGATE_PROXYFUNCTION_0");
static_assert(sizeof(WBP_Modern_SettingsMenu_C_CREATEDELEGATE_PROXYFUNCTION_0) == 0x000020, "Wrong size on WBP_Modern_SettingsMenu_C_CREATEDELEGATE_PROXYFUNCTION_0");
static_assert(offsetof(WBP_Modern_SettingsMenu_C_CREATEDELEGATE_PROXYFUNCTION_0, PopupText) == 0x000000, "Member 'WBP_Modern_SettingsMenu_C_CREATEDELEGATE_PROXYFUNCTION_0::PopupText' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_C_CREATEDELEGATE_PROXYFUNCTION_0, ModIndex) == 0x000018, "Member 'WBP_Modern_SettingsMenu_C_CREATEDELEGATE_PROXYFUNCTION_0::ModIndex' has a wrong offset!");

// Function WBP_Modern_SettingsMenu.WBP_Modern_SettingsMenu_C.CREATEDELEGATE_PROXYFUNCTION_1
// 0x0020 (0x0020 - 0x0000)
struct WBP_Modern_SettingsMenu_C_CREATEDELEGATE_PROXYFUNCTION_1 final
{
public:
	class FText                                   PopupText;                                         // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         ModIndex;                                          // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_SettingsMenu_C_CREATEDELEGATE_PROXYFUNCTION_1) == 0x000008, "Wrong alignment on WBP_Modern_SettingsMenu_C_CREATEDELEGATE_PROXYFUNCTION_1");
static_assert(sizeof(WBP_Modern_SettingsMenu_C_CREATEDELEGATE_PROXYFUNCTION_1) == 0x000020, "Wrong size on WBP_Modern_SettingsMenu_C_CREATEDELEGATE_PROXYFUNCTION_1");
static_assert(offsetof(WBP_Modern_SettingsMenu_C_CREATEDELEGATE_PROXYFUNCTION_1, PopupText) == 0x000000, "Member 'WBP_Modern_SettingsMenu_C_CREATEDELEGATE_PROXYFUNCTION_1::PopupText' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_C_CREATEDELEGATE_PROXYFUNCTION_1, ModIndex) == 0x000018, "Member 'WBP_Modern_SettingsMenu_C_CREATEDELEGATE_PROXYFUNCTION_1::ModIndex' has a wrong offset!");

// Function WBP_Modern_SettingsMenu.WBP_Modern_SettingsMenu_C.DoesHavePopup
// 0x0006 (0x0006 - 0x0000)
struct WBP_Modern_SettingsMenu_C_DoesHavePopup final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_SettingsMenu_C_DoesHavePopup) == 0x000001, "Wrong alignment on WBP_Modern_SettingsMenu_C_DoesHavePopup");
static_assert(sizeof(WBP_Modern_SettingsMenu_C_DoesHavePopup) == 0x000006, "Wrong size on WBP_Modern_SettingsMenu_C_DoesHavePopup");
static_assert(offsetof(WBP_Modern_SettingsMenu_C_DoesHavePopup, Value) == 0x000000, "Member 'WBP_Modern_SettingsMenu_C_DoesHavePopup::Value' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_C_DoesHavePopup, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'WBP_Modern_SettingsMenu_C_DoesHavePopup::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_C_DoesHavePopup, CallFunc_IsValid_ReturnValue_1) == 0x000002, "Member 'WBP_Modern_SettingsMenu_C_DoesHavePopup::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_C_DoesHavePopup, CallFunc_IsValid_ReturnValue_2) == 0x000003, "Member 'WBP_Modern_SettingsMenu_C_DoesHavePopup::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_C_DoesHavePopup, CallFunc_BooleanOR_ReturnValue) == 0x000004, "Member 'WBP_Modern_SettingsMenu_C_DoesHavePopup::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_C_DoesHavePopup, CallFunc_BooleanOR_ReturnValue_1) == 0x000005, "Member 'WBP_Modern_SettingsMenu_C_DoesHavePopup::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");

// Function WBP_Modern_SettingsMenu.WBP_Modern_SettingsMenu_C.ExecuteUbergraph_WBP_Modern_SettingsMenu
// 0x0550 (0x0550 - 0x0000)
struct WBP_Modern_SettingsMenu_C_ExecuteUbergraph_WBP_Modern_SettingsMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_5;     // 0x0008(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_5;     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_5;   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_5;    // 0x0030(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_4;     // 0x0038(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_4;     // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_4;   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_4;    // 0x0060(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue;  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_1; // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_3;     // 0x0070(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_3;     // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_3;   // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_3;    // 0x0098(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_2;     // 0x00A0(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_2;     // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_2;   // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_2;    // 0x00C8(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_2; // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_3; // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D2[0x6];                                       // 0x00D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           Temp_object_Variable;                              // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable;                                // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_0;                              // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2;                              // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3;                              // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1_dup;                              // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_1_0;                            // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1_1;                            // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1_2;                            // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1_3;                            // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_1;     // 0x0138(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_1;     // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_1;   // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_1;    // 0x0160(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable_1;                            // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_4; // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_2_dup;                              // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3_dup;                              // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2_0;                            // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3_0;                            // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue;       // 0x01A0(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime;       // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime;     // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction;      // 0x01C8(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_5; // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           Temp_object_Variable_2;                            // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_4;                              // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_4_0;                            // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_5;                              // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_5_0;                            // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0209(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x020A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20B[0x5];                                      // 0x020B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_6;                              // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGameRunningOnSSD_ReturnValue;           // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_7;                              // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FModernSettingTableRow                 K2Node_ComponentBoundEvent_SettingData;            // 0x0228(0x0138)()
	class UWidget*                                K2Node_ComponentBoundEvent_NewWidget;              // 0x0360(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_NewIndex;               // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36C[0x4];                                      // 0x036C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVModernSettingWidget*                  K2Node_CustomEvent_ChangedSettings_1;              // 0x0370(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVModernSettingWidget*                  K2Node_CustomEvent_ChangedSettings;                // 0x0378(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0380(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_384[0x4];                                      // 0x0384(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           Temp_object_Variable_3;                            // 0x0388(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_7;     // 0x0390(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_7;     // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_7;   // 0x03B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_7;    // 0x03B8(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAltarWidget*                          K2Node_CustomEvent_Popup;                          // 0x03C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_7_0;                            // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_6_0;                            // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_6; // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x03D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DA[0x6];                                      // 0x03DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UVModernRebindSettingWidget*            K2Node_CustomEvent_ChangedRebind;                  // 0x03E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue_1;            // 0x03E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x03EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
