#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ObivionDebug

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "Engine_structs.hpp"
#include "E_OblivionDebugAnchoringPosition_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ObivionDebug.WBP_ObivionDebug_C
// 0x00E8 (0x03A8 - 0x02C0)
class UWBP_ObivionDebug_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                One00P;                                            // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Two5P;                                             // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Three3P;                                           // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Five0P;                                            // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                AnchorLeftBottom;                                  // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                AnchorLeftUp;                                      // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                AnchorRightBottom;                                 // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                AnchorRightUp;                                     // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           AnchorsPad;                                        // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           HelpPanel;                                         // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                HideShowWindow;                                    // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_501;                                         // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           MainCanvasPanel;                                   // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               MainOverlay;                                       // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                MainTexBorder;                                     // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 OblivionMainTex;                                   // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ShowAnchors;                                       // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ShowHelpPanel;                                     // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ShowHideAll;                                       // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAnalogSlider*                          TextureAlphaSlider;                                // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAnalogSlider*                          TextureScaleSlider;                                // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ToggleUI;                                          // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsOblivionMainTexInstancied;                       // 0x0378(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_379[0x7];                                      // 0x0379(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        AnchorsPadOpacityVal;                              // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowAll;                                           // 0x0388(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_389[0x7];                                      // 0x0389(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CanvasSize;                                        // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_OblivionDebugAnchoringPosition              CanvasAnchorsMode;                                 // 0x0398(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_399[0x7];                                      // 0x0399(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USG_OblivionDebugToolPreferences_C*     SaveGameToolPreferences;                           // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, NoDestructor, HasGetValueTypeHash)

public:
	void UpdatePreferences();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void ShowHideAllFunc();
	void SetTexMainAlpha(double Value);
	void SetAnchorRightUp();
	void SetAnchorRightBottom();
	void SetAnchorLeftUp();
	void SetAnchorLeftBottom();
	void OnInitialized();
	void InpActEvt_Ctrl_Alt_Two_K2Node_InputKeyEvent_7(const struct FKey& Key);
	void InpActEvt_Ctrl_Alt_Three_K2Node_InputKeyEvent_5(const struct FKey& Key);
	void InpActEvt_Ctrl_Alt_Six_K2Node_InputKeyEvent_1(const struct FKey& Key);
	void InpActEvt_Ctrl_Alt_One_K2Node_InputKeyEvent_10(const struct FKey& Key);
	void InpActEvt_Ctrl_Alt_NumPadTwo_K2Node_InputKeyEvent_8(const struct FKey& Key);
	void InpActEvt_Ctrl_Alt_NumPadThree_K2Node_InputKeyEvent_6(const struct FKey& Key);
	void InpActEvt_Ctrl_Alt_NumPadSix_K2Node_InputKeyEvent_0(const struct FKey& Key);
	void InpActEvt_Ctrl_Alt_NumPadOne_K2Node_InputKeyEvent_9(const struct FKey& Key);
	void InpActEvt_Ctrl_Alt_NumPadFour_K2Node_InputKeyEvent_4(const struct FKey& Key);
	void InpActEvt_Ctrl_Alt_NumPadFive_K2Node_InputKeyEvent_2(const struct FKey& Key);
	void InpActEvt_Ctrl_Alt_Four_K2Node_InputKeyEvent_3(const struct FKey& Key);
	void ExecuteUbergraph_WBP_ObivionDebug(int32 EntryPoint);
	void Construct();
	void BndEvt__WBP_ObivionDebug_ToggleUI_K2Node_ComponentBoundEvent_16_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_ObivionDebug_TextureScaleSlider_K2Node_ComponentBoundEvent_12_OnMouseCaptureEndEvent__DelegateSignature();
	void BndEvt__WBP_ObivionDebug_ShowHideAll_K2Node_ComponentBoundEvent_7_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_ObivionDebug_ShowHelpPanel_K2Node_ComponentBoundEvent_14_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_ObivionDebug_ShowHelpPanel_K2Node_ComponentBoundEvent_13_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_ObivionDebug_ShowAnchors_K2Node_ComponentBoundEvent_6_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_ObivionDebug_HideShowWindow_K2Node_ComponentBoundEvent_5_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_ObivionDebug_Button_80_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_ObivionDebug_AnchorRightUp_K2Node_ComponentBoundEvent_9_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_ObivionDebug_AnchorRightBottom_K2Node_ComponentBoundEvent_11_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_ObivionDebug_AnchorLeftUp_K2Node_ComponentBoundEvent_8_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_ObivionDebug_AnchorLeftBottom_K2Node_ComponentBoundEvent_10_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_ObivionDebug_AnalogSlider_186_K2Node_ComponentBoundEvent_3_OnFloatValueChangedEvent__DelegateSignature(float Value);
	void BndEvt__WBP_ObivionDebug_50P_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_ObivionDebug_33P_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_ObivionDebug_25P_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ObivionDebug_C">();
	}
	static class UWBP_ObivionDebug_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ObivionDebug_C>();
	}
};
static_assert(alignof(UWBP_ObivionDebug_C) == 0x000008, "Wrong alignment on UWBP_ObivionDebug_C");
static_assert(sizeof(UWBP_ObivionDebug_C) == 0x0003A8, "Wrong size on UWBP_ObivionDebug_C");
static_assert(offsetof(UWBP_ObivionDebug_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_ObivionDebug_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ObivionDebug_C, One00P) == 0x0002C8, "Member 'UWBP_ObivionDebug_C::One00P' has a wrong offset!");
static_assert(offsetof(UWBP_ObivionDebug_C, Two5P) == 0x0002D0, "Member 'UWBP_ObivionDebug_C::Two5P' has a wrong offset!");
static_assert(offsetof(UWBP_ObivionDebug_C, Three3P) == 0x0002D8, "Member 'UWBP_ObivionDebug_C::Three3P' has a wrong offset!");
static_assert(offsetof(UWBP_ObivionDebug_C, Five0P) == 0x0002E0, "Member 'UWBP_ObivionDebug_C::Five0P' has a wrong offset!");
static_assert(offsetof(UWBP_ObivionDebug_C, AnchorLeftBottom) == 0x0002E8, "Member 'UWBP_ObivionDebug_C::AnchorLeftBottom' has a wrong offset!");
static_assert(offsetof(UWBP_ObivionDebug_C, AnchorLeftUp) == 0x0002F0, "Member 'UWBP_ObivionDebug_C::AnchorLeftUp' has a wrong offset!");
static_assert(offsetof(UWBP_ObivionDebug_C, AnchorRightBottom) == 0x0002F8, "Member 'UWBP_ObivionDebug_C::AnchorRightBottom' has a wrong offset!");
static_assert(offsetof(UWBP_ObivionDebug_C, AnchorRightUp) == 0x000300, "Member 'UWBP_ObivionDebug_C::AnchorRightUp' has a wrong offset!");
static_assert(offsetof(UWBP_ObivionDebug_C, AnchorsPad) == 0x000308, "Member 'UWBP_ObivionDebug_C::AnchorsPad' has a wrong offset!");
static_assert(offsetof(UWBP_ObivionDebug_C, HelpPanel) == 0x000310, "Member 'UWBP_ObivionDebug_C::HelpPanel' has a wrong offset!");
static_assert(offsetof(UWBP_ObivionDebug_C, HideShowWindow) == 0x000318, "Member 'UWBP_ObivionDebug_C::HideShowWindow' has a wrong offset!");
static_assert(offsetof(UWBP_ObivionDebug_C, Image_501) == 0x000320, "Member 'UWBP_ObivionDebug_C::Image_501' has a wrong offset!");
static_assert(offsetof(UWBP_ObivionDebug_C, MainCanvasPanel) == 0x000328, "Member 'UWBP_ObivionDebug_C::MainCanvasPanel' has a wrong offset!");
static_assert(offsetof(UWBP_ObivionDebug_C, MainOverlay) == 0x000330, "Member 'UWBP_ObivionDebug_C::MainOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_ObivionDebug_C, MainTexBorder) == 0x000338, "Member 'UWBP_ObivionDebug_C::MainTexBorder' has a wrong offset!");
static_assert(offsetof(UWBP_ObivionDebug_C, OblivionMainTex) == 0x000340, "Member 'UWBP_ObivionDebug_C::OblivionMainTex' has a wrong offset!");
static_assert(offsetof(UWBP_ObivionDebug_C, ShowAnchors) == 0x000348, "Member 'UWBP_ObivionDebug_C::ShowAnchors' has a wrong offset!");
static_assert(offsetof(UWBP_ObivionDebug_C, ShowHelpPanel) == 0x000350, "Member 'UWBP_ObivionDebug_C::ShowHelpPanel' has a wrong offset!");
static_assert(offsetof(UWBP_ObivionDebug_C, ShowHideAll) == 0x000358, "Member 'UWBP_ObivionDebug_C::ShowHideAll' has a wrong offset!");
static_assert(offsetof(UWBP_ObivionDebug_C, TextureAlphaSlider) == 0x000360, "Member 'UWBP_ObivionDebug_C::TextureAlphaSlider' has a wrong offset!");
static_assert(offsetof(UWBP_ObivionDebug_C, TextureScaleSlider) == 0x000368, "Member 'UWBP_ObivionDebug_C::TextureScaleSlider' has a wrong offset!");
static_assert(offsetof(UWBP_ObivionDebug_C, ToggleUI) == 0x000370, "Member 'UWBP_ObivionDebug_C::ToggleUI' has a wrong offset!");
static_assert(offsetof(UWBP_ObivionDebug_C, IsOblivionMainTexInstancied) == 0x000378, "Member 'UWBP_ObivionDebug_C::IsOblivionMainTexInstancied' has a wrong offset!");
static_assert(offsetof(UWBP_ObivionDebug_C, AnchorsPadOpacityVal) == 0x000380, "Member 'UWBP_ObivionDebug_C::AnchorsPadOpacityVal' has a wrong offset!");
static_assert(offsetof(UWBP_ObivionDebug_C, ShowAll) == 0x000388, "Member 'UWBP_ObivionDebug_C::ShowAll' has a wrong offset!");
static_assert(offsetof(UWBP_ObivionDebug_C, CanvasSize) == 0x000390, "Member 'UWBP_ObivionDebug_C::CanvasSize' has a wrong offset!");
static_assert(offsetof(UWBP_ObivionDebug_C, CanvasAnchorsMode) == 0x000398, "Member 'UWBP_ObivionDebug_C::CanvasAnchorsMode' has a wrong offset!");
static_assert(offsetof(UWBP_ObivionDebug_C, SaveGameToolPreferences) == 0x0003A0, "Member 'UWBP_ObivionDebug_C::SaveGameToolPreferences' has a wrong offset!");

}

