#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModernMenu_DialogButtonRow

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "Altar_structs.hpp"
#include "Altar_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ModernMenu_DialogButtonRow.WBP_ModernMenu_DialogButtonRow_C
// 0x0080 (0x0548 - 0x04C8)
class UWBP_ModernMenu_DialogButtonRow_C final : public UVAltarDialogButtonListWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_Modern_Menu_Dialog_Button_C*       dialog_barter;                                     // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         dialog_button_layout;                              // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Modern_Menu_Dialog_Button_C*       dialog_goodbye;                                    // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Modern_Menu_Dialog_Button_C*       dialog_persuade;                                   // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Modern_Menu_Dialog_Button_C*       Dialog_Recharge;                                   // 0x04F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Modern_Menu_Dialog_Button_C*       Dialog_Repair;                                     // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Modern_Menu_Dialog_Button_C*       dialog_spell_buy;                                  // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Modern_Menu_Dialog_Button_C*       Dialog_Training;                                   // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(ELegacyDialogButton DialogButton)> OnIconButtonClicked;            // 0x0510(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         CurrentFocusButtonIndex;                           // 0x0520(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_524[0x4];                                      // 0x0524(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnNavigationUp;                                    // 0x0528(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnNavigationDown;                                  // 0x0538(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BindEventOnButtonFocus();
	void BndEvt__WBP_ModernMenu_DialogButtonRow_dialog_barter_K2Node_ComponentBoundEvent_8_OnButtonClicked__DelegateSignature();
	void BndEvt__WBP_ModernMenu_DialogButtonRow_dialog_goodbye_K2Node_ComponentBoundEvent_13_OnButtonClicked__DelegateSignature();
	void BndEvt__WBP_ModernMenu_DialogButtonRow_dialog_persuade_K2Node_ComponentBoundEvent_4_OnButtonClicked__DelegateSignature();
	void BndEvt__WBP_ModernMenu_DialogButtonRow_dialog_recharge_K2Node_ComponentBoundEvent_12_OnButtonClicked__DelegateSignature();
	void BndEvt__WBP_ModernMenu_DialogButtonRow_dialog_repair_K2Node_ComponentBoundEvent_10_OnButtonClicked__DelegateSignature();
	void BndEvt__WBP_ModernMenu_DialogButtonRow_dialog_spell_buy_K2Node_ComponentBoundEvent_9_OnButtonClicked__DelegateSignature();
	void BndEvt__WBP_ModernMenu_DialogButtonRow_dialog_training_K2Node_ComponentBoundEvent_11_OnButtonClicked__DelegateSignature();
	void BP_OnNavigateDown();
	void BP_OnNavigateUp();
	void Construct();
	void ExecuteUbergraph_WBP_ModernMenu_DialogButtonRow(int32 EntryPoint);
	void FindFirstNavigableButton(class UWBP_Modern_Menu_Dialog_Button_C** WidgetToFocus);
	void FindNavigableButton(class UWBP_Modern_Menu_Dialog_Button_C** WidgetToFocus);
	void FindNextNavigableButton();
	void FindPreviousNavigableButton();
	void OnDialogButtonFocus(class UWBP_Modern_Menu_Dialog_Button_C* NewCurrentFocusButton);
	void OnFocus();
	void SetIconButtonVisibility(const struct FLegacyDialogMenuButtonVisibility& ButtonVisibility);

	class UWidget* BP_GetDesiredFocusTarget() const;
	bool IsNavigable() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ModernMenu_DialogButtonRow_C">();
	}
	static class UWBP_ModernMenu_DialogButtonRow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ModernMenu_DialogButtonRow_C>();
	}
};
static_assert(alignof(UWBP_ModernMenu_DialogButtonRow_C) == 0x000008, "Wrong alignment on UWBP_ModernMenu_DialogButtonRow_C");
static_assert(sizeof(UWBP_ModernMenu_DialogButtonRow_C) == 0x000548, "Wrong size on UWBP_ModernMenu_DialogButtonRow_C");
static_assert(offsetof(UWBP_ModernMenu_DialogButtonRow_C, UberGraphFrame) == 0x0004C8, "Member 'UWBP_ModernMenu_DialogButtonRow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_DialogButtonRow_C, dialog_barter) == 0x0004D0, "Member 'UWBP_ModernMenu_DialogButtonRow_C::dialog_barter' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_DialogButtonRow_C, dialog_button_layout) == 0x0004D8, "Member 'UWBP_ModernMenu_DialogButtonRow_C::dialog_button_layout' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_DialogButtonRow_C, dialog_goodbye) == 0x0004E0, "Member 'UWBP_ModernMenu_DialogButtonRow_C::dialog_goodbye' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_DialogButtonRow_C, dialog_persuade) == 0x0004E8, "Member 'UWBP_ModernMenu_DialogButtonRow_C::dialog_persuade' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_DialogButtonRow_C, Dialog_Recharge) == 0x0004F0, "Member 'UWBP_ModernMenu_DialogButtonRow_C::Dialog_Recharge' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_DialogButtonRow_C, Dialog_Repair) == 0x0004F8, "Member 'UWBP_ModernMenu_DialogButtonRow_C::Dialog_Repair' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_DialogButtonRow_C, dialog_spell_buy) == 0x000500, "Member 'UWBP_ModernMenu_DialogButtonRow_C::dialog_spell_buy' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_DialogButtonRow_C, Dialog_Training) == 0x000508, "Member 'UWBP_ModernMenu_DialogButtonRow_C::Dialog_Training' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_DialogButtonRow_C, OnIconButtonClicked) == 0x000510, "Member 'UWBP_ModernMenu_DialogButtonRow_C::OnIconButtonClicked' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_DialogButtonRow_C, CurrentFocusButtonIndex) == 0x000520, "Member 'UWBP_ModernMenu_DialogButtonRow_C::CurrentFocusButtonIndex' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_DialogButtonRow_C, OnNavigationUp) == 0x000528, "Member 'UWBP_ModernMenu_DialogButtonRow_C::OnNavigationUp' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_DialogButtonRow_C, OnNavigationDown) == 0x000538, "Member 'UWBP_ModernMenu_DialogButtonRow_C::OnNavigationDown' has a wrong offset!");

}

