#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LegacyMenu_Added_Effects_List

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Altar_structs.hpp"
#include "Altar_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_LegacyMenu_Added_Effects_List.WBP_LegacyMenu_Added_Effects_List_C
// 0x0040 (0x0508 - 0x04C8)
class UWBP_LegacyMenu_Added_Effects_List_C final : public UVAltarWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVAddedEffectsListViewModel*            VAddedEffectsListViewModel;                        // 0x04D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_NavigableScrollBox_SigilStoneMenu_C* NavigableEffectList;                             // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(const struct FModernEffectItemData& ItemClicked)> OnItemClicked;   // 0x04E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bEntryShouldCollapsedOnUnfocus;                    // 0x04F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bScrollWithRS;                                     // 0x04F1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F2[0x6];                                      // 0x04F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(int32 NumOfEntries)> OnListUpdated;                                // 0x04F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void Construct();
	void CreateEffectItemList(const TArray<struct FModernEffectItemData>& NewItems);
	void DoScroll(double ScrollDelta);
	void ExecuteUbergraph_WBP_LegacyMenu_Added_Effects_List(int32 EntryPoint);
	void OnFocus();
	void OnItemListClick(const struct FModernEffectItemData& EffectItemProperty);
	void UpdateListView(const TArray<struct FModernEffectItemData>& NewItems);

	class UWidget* BP_GetDesiredFocusTarget() const;
	bool IsNavigatable() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_LegacyMenu_Added_Effects_List_C">();
	}
	static class UWBP_LegacyMenu_Added_Effects_List_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_LegacyMenu_Added_Effects_List_C>();
	}
};
static_assert(alignof(UWBP_LegacyMenu_Added_Effects_List_C) == 0x000008, "Wrong alignment on UWBP_LegacyMenu_Added_Effects_List_C");
static_assert(sizeof(UWBP_LegacyMenu_Added_Effects_List_C) == 0x000508, "Wrong size on UWBP_LegacyMenu_Added_Effects_List_C");
static_assert(offsetof(UWBP_LegacyMenu_Added_Effects_List_C, UberGraphFrame) == 0x0004C8, "Member 'UWBP_LegacyMenu_Added_Effects_List_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_LegacyMenu_Added_Effects_List_C, VAddedEffectsListViewModel) == 0x0004D0, "Member 'UWBP_LegacyMenu_Added_Effects_List_C::VAddedEffectsListViewModel' has a wrong offset!");
static_assert(offsetof(UWBP_LegacyMenu_Added_Effects_List_C, NavigableEffectList) == 0x0004D8, "Member 'UWBP_LegacyMenu_Added_Effects_List_C::NavigableEffectList' has a wrong offset!");
static_assert(offsetof(UWBP_LegacyMenu_Added_Effects_List_C, OnItemClicked) == 0x0004E0, "Member 'UWBP_LegacyMenu_Added_Effects_List_C::OnItemClicked' has a wrong offset!");
static_assert(offsetof(UWBP_LegacyMenu_Added_Effects_List_C, bEntryShouldCollapsedOnUnfocus) == 0x0004F0, "Member 'UWBP_LegacyMenu_Added_Effects_List_C::bEntryShouldCollapsedOnUnfocus' has a wrong offset!");
static_assert(offsetof(UWBP_LegacyMenu_Added_Effects_List_C, bScrollWithRS) == 0x0004F1, "Member 'UWBP_LegacyMenu_Added_Effects_List_C::bScrollWithRS' has a wrong offset!");
static_assert(offsetof(UWBP_LegacyMenu_Added_Effects_List_C, OnListUpdated) == 0x0004F8, "Member 'UWBP_LegacyMenu_Added_Effects_List_C::OnListUpdated' has a wrong offset!");

}

