#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModernHud_Main

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Altar_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_ModernHud_Main.WBP_ModernHud_Main_C.Create Hostile Data
// 0x0148 (0x0148 - 0x0000)
struct WBP_ModernHud_Main_C_Create_Hostile_Data final
{
public:
	TArray<struct FHostileData>                   HostileData;                                       // 0x0000(0x0010)(Parm, OutParm)
	TArray<struct FHostileData>                   Local_HostileData;                                 // 0x0010(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetOwningPlayerCameraManager_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AVPairedPawn*>                   CallFunc_Set_ToArray_Result;                       // 0x0078(0x0010)(ReferenceParm)
	class AVPairedPawn*                           CallFunc_Array_Get_Item;                           // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x00C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_NormalizedDeltaRotator_ReturnValue;       // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakRotator_Roll;                        // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue_1;        // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x0110(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Set_IsNotEmpty_ReturnValue;               // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHostileData                           K2Node_MakeStruct_HostileData;                     // 0x0134(0x0008)(NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Distance_ImplicitCast;           // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_Main_C_Create_Hostile_Data) == 0x000008, "Wrong alignment on WBP_ModernHud_Main_C_Create_Hostile_Data");
static_assert(sizeof(WBP_ModernHud_Main_C_Create_Hostile_Data) == 0x000148, "Wrong size on WBP_ModernHud_Main_C_Create_Hostile_Data");
static_assert(offsetof(WBP_ModernHud_Main_C_Create_Hostile_Data, HostileData) == 0x000000, "Member 'WBP_ModernHud_Main_C_Create_Hostile_Data::HostileData' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_Create_Hostile_Data, Local_HostileData) == 0x000010, "Member 'WBP_ModernHud_Main_C_Create_Hostile_Data::Local_HostileData' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_Create_Hostile_Data, Temp_int_Array_Index_Variable) == 0x000020, "Member 'WBP_ModernHud_Main_C_Create_Hostile_Data::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_Create_Hostile_Data, CallFunc_GetOwningPlayerCameraManager_ReturnValue) == 0x000028, "Member 'WBP_ModernHud_Main_C_Create_Hostile_Data::CallFunc_GetOwningPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_Create_Hostile_Data, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000030, "Member 'WBP_ModernHud_Main_C_Create_Hostile_Data::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_Create_Hostile_Data, Temp_int_Loop_Counter_Variable) == 0x000048, "Member 'WBP_ModernHud_Main_C_Create_Hostile_Data::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_Create_Hostile_Data, CallFunc_GetOwningPlayerPawn_ReturnValue) == 0x000050, "Member 'WBP_ModernHud_Main_C_Create_Hostile_Data::CallFunc_GetOwningPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_Create_Hostile_Data, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000058, "Member 'WBP_ModernHud_Main_C_Create_Hostile_Data::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_Create_Hostile_Data, CallFunc_Add_IntInt_ReturnValue) == 0x000070, "Member 'WBP_ModernHud_Main_C_Create_Hostile_Data::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_Create_Hostile_Data, CallFunc_Set_ToArray_Result) == 0x000078, "Member 'WBP_ModernHud_Main_C_Create_Hostile_Data::CallFunc_Set_ToArray_Result' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_Create_Hostile_Data, CallFunc_Array_Get_Item) == 0x000088, "Member 'WBP_ModernHud_Main_C_Create_Hostile_Data::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_Create_Hostile_Data, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000090, "Member 'WBP_ModernHud_Main_C_Create_Hostile_Data::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_Create_Hostile_Data, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x0000A8, "Member 'WBP_ModernHud_Main_C_Create_Hostile_Data::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_Create_Hostile_Data, CallFunc_FindLookAtRotation_ReturnValue) == 0x0000C0, "Member 'WBP_ModernHud_Main_C_Create_Hostile_Data::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_Create_Hostile_Data, CallFunc_Array_Length_ReturnValue) == 0x0000D8, "Member 'WBP_ModernHud_Main_C_Create_Hostile_Data::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_Create_Hostile_Data, CallFunc_NormalizedDeltaRotator_ReturnValue) == 0x0000E0, "Member 'WBP_ModernHud_Main_C_Create_Hostile_Data::CallFunc_NormalizedDeltaRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_Create_Hostile_Data, CallFunc_Less_IntInt_ReturnValue) == 0x0000F8, "Member 'WBP_ModernHud_Main_C_Create_Hostile_Data::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_Create_Hostile_Data, CallFunc_BreakRotator_Roll) == 0x0000FC, "Member 'WBP_ModernHud_Main_C_Create_Hostile_Data::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_Create_Hostile_Data, CallFunc_BreakRotator_Pitch) == 0x000100, "Member 'WBP_ModernHud_Main_C_Create_Hostile_Data::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_Create_Hostile_Data, CallFunc_BreakRotator_Yaw) == 0x000104, "Member 'WBP_ModernHud_Main_C_Create_Hostile_Data::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_Create_Hostile_Data, CallFunc_GetOwningPlayerPawn_ReturnValue_1) == 0x000108, "Member 'WBP_ModernHud_Main_C_Create_Hostile_Data::CallFunc_GetOwningPlayerPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_Create_Hostile_Data, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x000110, "Member 'WBP_ModernHud_Main_C_Create_Hostile_Data::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_Create_Hostile_Data, CallFunc_Vector_Distance_ReturnValue) == 0x000128, "Member 'WBP_ModernHud_Main_C_Create_Hostile_Data::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_Create_Hostile_Data, CallFunc_Set_IsNotEmpty_ReturnValue) == 0x000130, "Member 'WBP_ModernHud_Main_C_Create_Hostile_Data::CallFunc_Set_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_Create_Hostile_Data, K2Node_MakeStruct_HostileData) == 0x000134, "Member 'WBP_ModernHud_Main_C_Create_Hostile_Data::K2Node_MakeStruct_HostileData' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_Create_Hostile_Data, CallFunc_Array_Add_ReturnValue) == 0x00013C, "Member 'WBP_ModernHud_Main_C_Create_Hostile_Data::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_Create_Hostile_Data, K2Node_MakeStruct_Distance_ImplicitCast) == 0x000140, "Member 'WBP_ModernHud_Main_C_Create_Hostile_Data::K2Node_MakeStruct_Distance_ImplicitCast' has a wrong offset!");

// Function WBP_ModernHud_Main.WBP_ModernHud_Main_C.ExecuteUbergraph_WBP_ModernHud_Main
// 0x0180 (0x0180 - 0x0000)
struct WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCompassIconMarker>             K2Node_CustomEvent_CompassIconMarkersList;         // 0x0008(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_NewParam;                       // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<double>                                K2Node_CustomEvent_NewParam_1;                     // 0x0020(0x0010)(ConstParm, ReferenceParm)
	TArray<class UTexture2D*>                     K2Node_CustomEvent_NewParam_2;                     // 0x0030(0x0010)(ConstParm, ReferenceParm)
	double                                        K2Node_CustomEvent_NewParam_3;                     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_NewParam_4;                     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_NewParam_5;                     // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_NewParam_6;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_InAmmo;                         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_InHealth;                       // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_CustomEvent_NewParam_7;                     // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_InStatus;                       // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_CustomEvent_InTexture;                      // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FHostileData>                   K2Node_CustomEvent_HostileData;                    // 0x0090(0x0010)(ConstParm, ReferenceParm)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x00A0(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FHostileData>                   CallFunc_Create_Hostile_Data_HostileData;          // 0x00E8(0x0010)(ReferenceParm)
	class AVAltarPlayerController*                K2Node_DynamicCast_AsVAltar_Player_Controller;     // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_In_Direction;                   // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVAltarUISubsystem*                     CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAltarUISubsystem*                     CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAltarUISubsystem*                     CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHUDVisible_ReturnValue;                 // 0x0130(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable;                                // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0132(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_1;                              // 0x0133(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bIsHidden)>               K2Node_CreateDelegate_OutputDelegate;              // 0x0134(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          K2Node_Select_Default;                             // 0x0145(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_146[0x2];                                      // 0x0146(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsOverencumbered;              // 0x0152(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0153(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_155[0x3];                                      // 0x0155(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0158(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0168(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_On_Heading_Updated_Value_ImplicitCast;    // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main) == 0x000008, "Wrong alignment on WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main");
static_assert(sizeof(WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main) == 0x000180, "Wrong size on WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main");
static_assert(offsetof(WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main, EntryPoint) == 0x000000, "Member 'WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main, K2Node_CustomEvent_CompassIconMarkersList) == 0x000008, "Member 'WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main::K2Node_CustomEvent_CompassIconMarkersList' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main, CallFunc_Not_PreBool_ReturnValue) == 0x000018, "Member 'WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main, K2Node_CustomEvent_NewParam) == 0x000019, "Member 'WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main::K2Node_CustomEvent_NewParam' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main, K2Node_CustomEvent_NewParam_1) == 0x000020, "Member 'WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main::K2Node_CustomEvent_NewParam_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main, K2Node_CustomEvent_NewParam_2) == 0x000030, "Member 'WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main::K2Node_CustomEvent_NewParam_2' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main, K2Node_CustomEvent_NewParam_3) == 0x000040, "Member 'WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main::K2Node_CustomEvent_NewParam_3' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main, K2Node_CustomEvent_NewParam_4) == 0x000048, "Member 'WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main::K2Node_CustomEvent_NewParam_4' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main, K2Node_CustomEvent_NewParam_5) == 0x000050, "Member 'WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main::K2Node_CustomEvent_NewParam_5' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main, K2Node_CustomEvent_NewParam_6) == 0x000058, "Member 'WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main::K2Node_CustomEvent_NewParam_6' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main, K2Node_CustomEvent_InAmmo) == 0x000060, "Member 'WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main::K2Node_CustomEvent_InAmmo' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main, CallFunc_FTrunc_ReturnValue) == 0x000068, "Member 'WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main, K2Node_CustomEvent_InHealth) == 0x000070, "Member 'WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main::K2Node_CustomEvent_InHealth' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main, K2Node_CustomEvent_NewParam_7) == 0x000078, "Member 'WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main::K2Node_CustomEvent_NewParam_7' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main, K2Node_CustomEvent_InStatus) == 0x000080, "Member 'WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main::K2Node_CustomEvent_InStatus' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main, K2Node_CustomEvent_InTexture) == 0x000088, "Member 'WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main::K2Node_CustomEvent_InTexture' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main, K2Node_CustomEvent_HostileData) == 0x000090, "Member 'WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main::K2Node_CustomEvent_HostileData' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main, K2Node_Event_MyGeometry) == 0x0000A0, "Member 'WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main, K2Node_Event_InDeltaTime) == 0x0000D8, "Member 'WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main, CallFunc_GetOwningPlayer_ReturnValue) == 0x0000E0, "Member 'WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main, CallFunc_Create_Hostile_Data_HostileData) == 0x0000E8, "Member 'WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main::CallFunc_Create_Hostile_Data_HostileData' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main, K2Node_DynamicCast_AsVAltar_Player_Controller) == 0x0000F8, "Member 'WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main::K2Node_DynamicCast_AsVAltar_Player_Controller' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main, K2Node_DynamicCast_bSuccess) == 0x000100, "Member 'WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main, K2Node_CustomEvent_In_Direction) == 0x000108, "Member 'WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main::K2Node_CustomEvent_In_Direction' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000110, "Member 'WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main, CallFunc_IsValid_ReturnValue) == 0x000118, "Member 'WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000120, "Member 'WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x000128, "Member 'WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main, CallFunc_IsHUDVisible_ReturnValue) == 0x000130, "Member 'WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main::CallFunc_IsHUDVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main, Temp_byte_Variable) == 0x000131, "Member 'WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main, CallFunc_BooleanAND_ReturnValue) == 0x000132, "Member 'WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main, Temp_byte_Variable_1) == 0x000133, "Member 'WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main, K2Node_CreateDelegate_OutputDelegate) == 0x000134, "Member 'WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main, Temp_bool_Variable) == 0x000144, "Member 'WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main, K2Node_Select_Default) == 0x000145, "Member 'WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main, CallFunc_PlayAnimation_ReturnValue) == 0x000148, "Member 'WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main, Temp_byte_Variable_2) == 0x000150, "Member 'WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main, Temp_byte_Variable_3) == 0x000151, "Member 'WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main, K2Node_CustomEvent_bIsOverencumbered) == 0x000152, "Member 'WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main::K2Node_CustomEvent_bIsOverencumbered' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main, Temp_bool_Variable_1) == 0x000153, "Member 'WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main, K2Node_Select_Default_1) == 0x000154, "Member 'WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main, K2Node_CreateDelegate_OutputDelegate_1) == 0x000158, "Member 'WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main, K2Node_CreateDelegate_OutputDelegate_2) == 0x000168, "Member 'WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main, CallFunc_On_Heading_Updated_Value_ImplicitCast) == 0x000178, "Member 'WBP_ModernHud_Main_C_ExecuteUbergraph_WBP_ModernHud_Main::CallFunc_On_Heading_Updated_Value_ImplicitCast' has a wrong offset!");

// Function WBP_ModernHud_Main.WBP_ModernHud_Main_C.FadePlayerBar
// 0x0048 (0x0048 - 0x0000)
struct WBP_ModernHud_Main_C_FadePlayerBar final
{
public:
	class UWBP_ModernHud_StatusBar_C*             StatusBar;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bLocalShouldHide;                                  // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        LocalFadeInPlayRate;                               // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LocalFadeOutDelay;                                 // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetProgress_Progress;                     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_Main_C_FadePlayerBar) == 0x000008, "Wrong alignment on WBP_ModernHud_Main_C_FadePlayerBar");
static_assert(sizeof(WBP_ModernHud_Main_C_FadePlayerBar) == 0x000048, "Wrong size on WBP_ModernHud_Main_C_FadePlayerBar");
static_assert(offsetof(WBP_ModernHud_Main_C_FadePlayerBar, StatusBar) == 0x000000, "Member 'WBP_ModernHud_Main_C_FadePlayerBar::StatusBar' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_FadePlayerBar, bLocalShouldHide) == 0x000008, "Member 'WBP_ModernHud_Main_C_FadePlayerBar::bLocalShouldHide' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_FadePlayerBar, LocalFadeInPlayRate) == 0x000010, "Member 'WBP_ModernHud_Main_C_FadePlayerBar::LocalFadeInPlayRate' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_FadePlayerBar, LocalFadeOutDelay) == 0x000018, "Member 'WBP_ModernHud_Main_C_FadePlayerBar::LocalFadeOutDelay' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_FadePlayerBar, CallFunc_Not_PreBool_ReturnValue) == 0x000020, "Member 'WBP_ModernHud_Main_C_FadePlayerBar::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_FadePlayerBar, CallFunc_GetProgress_Progress) == 0x000028, "Member 'WBP_ModernHud_Main_C_FadePlayerBar::CallFunc_GetProgress_Progress' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_FadePlayerBar, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000030, "Member 'WBP_ModernHud_Main_C_FadePlayerBar::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_FadePlayerBar, CallFunc_SelectFloat_ReturnValue) == 0x000038, "Member 'WBP_ModernHud_Main_C_FadePlayerBar::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_FadePlayerBar, CallFunc_SelectFloat_ReturnValue_1) == 0x000040, "Member 'WBP_ModernHud_Main_C_FadePlayerBar::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");

// Function WBP_ModernHud_Main.WBP_ModernHud_Main_C.FadePlayerBars
// 0x0060 (0x0060 - 0x0000)
struct WBP_ModernHud_Main_C_FadePlayerBars final
{
public:
	double                                        FadeInPlayRate;                                    // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FadeOutDelay;                                      // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldHide;                                        // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue_2;                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_3;                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_4;                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue_5;                // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldHidePlayerBars_ReturnValue;         // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_Main_C_FadePlayerBars) == 0x000008, "Wrong alignment on WBP_ModernHud_Main_C_FadePlayerBars");
static_assert(sizeof(WBP_ModernHud_Main_C_FadePlayerBars) == 0x000060, "Wrong size on WBP_ModernHud_Main_C_FadePlayerBars");
static_assert(offsetof(WBP_ModernHud_Main_C_FadePlayerBars, FadeInPlayRate) == 0x000000, "Member 'WBP_ModernHud_Main_C_FadePlayerBars::FadeInPlayRate' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_FadePlayerBars, FadeOutDelay) == 0x000008, "Member 'WBP_ModernHud_Main_C_FadePlayerBars::FadeOutDelay' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_FadePlayerBars, ShouldHide) == 0x000010, "Member 'WBP_ModernHud_Main_C_FadePlayerBars::ShouldHide' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_FadePlayerBars, CallFunc_SelectFloat_ReturnValue) == 0x000018, "Member 'WBP_ModernHud_Main_C_FadePlayerBars::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_FadePlayerBars, CallFunc_SelectFloat_ReturnValue_1) == 0x000020, "Member 'WBP_ModernHud_Main_C_FadePlayerBars::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_FadePlayerBars, CallFunc_Not_PreBool_ReturnValue) == 0x000028, "Member 'WBP_ModernHud_Main_C_FadePlayerBars::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_FadePlayerBars, CallFunc_SelectFloat_ReturnValue_2) == 0x000030, "Member 'WBP_ModernHud_Main_C_FadePlayerBars::CallFunc_SelectFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_FadePlayerBars, CallFunc_SelectFloat_ReturnValue_3) == 0x000038, "Member 'WBP_ModernHud_Main_C_FadePlayerBars::CallFunc_SelectFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_FadePlayerBars, CallFunc_SelectFloat_ReturnValue_4) == 0x000040, "Member 'WBP_ModernHud_Main_C_FadePlayerBars::CallFunc_SelectFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_FadePlayerBars, CallFunc_Not_PreBool_ReturnValue_1) == 0x000048, "Member 'WBP_ModernHud_Main_C_FadePlayerBars::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_FadePlayerBars, CallFunc_SelectFloat_ReturnValue_5) == 0x000050, "Member 'WBP_ModernHud_Main_C_FadePlayerBars::CallFunc_SelectFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_FadePlayerBars, CallFunc_Not_PreBool_ReturnValue_2) == 0x000058, "Member 'WBP_ModernHud_Main_C_FadePlayerBars::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_FadePlayerBars, CallFunc_ShouldHidePlayerBars_ReturnValue) == 0x000059, "Member 'WBP_ModernHud_Main_C_FadePlayerBars::CallFunc_ShouldHidePlayerBars_ReturnValue' has a wrong offset!");

// Function WBP_ModernHud_Main.WBP_ModernHud_Main_C.On Toggle HUD Visibility
// 0x0005 (0x0005 - 0x0000)
struct WBP_ModernHud_Main_C_On_Toggle_HUD_Visibility final
{
public:
	bool                                          bInIsVisible;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_Main_C_On_Toggle_HUD_Visibility) == 0x000001, "Wrong alignment on WBP_ModernHud_Main_C_On_Toggle_HUD_Visibility");
static_assert(sizeof(WBP_ModernHud_Main_C_On_Toggle_HUD_Visibility) == 0x000005, "Wrong size on WBP_ModernHud_Main_C_On_Toggle_HUD_Visibility");
static_assert(offsetof(WBP_ModernHud_Main_C_On_Toggle_HUD_Visibility, bInIsVisible) == 0x000000, "Member 'WBP_ModernHud_Main_C_On_Toggle_HUD_Visibility::bInIsVisible' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_On_Toggle_HUD_Visibility, Temp_bool_Variable) == 0x000001, "Member 'WBP_ModernHud_Main_C_On_Toggle_HUD_Visibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_On_Toggle_HUD_Visibility, Temp_byte_Variable) == 0x000002, "Member 'WBP_ModernHud_Main_C_On_Toggle_HUD_Visibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_On_Toggle_HUD_Visibility, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_ModernHud_Main_C_On_Toggle_HUD_Visibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_On_Toggle_HUD_Visibility, K2Node_Select_Default) == 0x000004, "Member 'WBP_ModernHud_Main_C_On_Toggle_HUD_Visibility::K2Node_Select_Default' has a wrong offset!");

// Function WBP_ModernHud_Main.WBP_ModernHud_Main_C.PlayBracketAnimation
// 0x000C (0x000C - 0x0000)
struct WBP_ModernHud_Main_C_PlayBracketAnimation final
{
public:
	int32                                         TargetMenu;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Local_Target_Menu;                                 // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_Main_C_PlayBracketAnimation) == 0x000004, "Wrong alignment on WBP_ModernHud_Main_C_PlayBracketAnimation");
static_assert(sizeof(WBP_ModernHud_Main_C_PlayBracketAnimation) == 0x00000C, "Wrong size on WBP_ModernHud_Main_C_PlayBracketAnimation");
static_assert(offsetof(WBP_ModernHud_Main_C_PlayBracketAnimation, TargetMenu) == 0x000000, "Member 'WBP_ModernHud_Main_C_PlayBracketAnimation::TargetMenu' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_PlayBracketAnimation, Local_Target_Menu) == 0x000004, "Member 'WBP_ModernHud_Main_C_PlayBracketAnimation::Local_Target_Menu' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_PlayBracketAnimation, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000008, "Member 'WBP_ModernHud_Main_C_PlayBracketAnimation::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_PlayBracketAnimation, CallFunc_Greater_IntInt_ReturnValue) == 0x000009, "Member 'WBP_ModernHud_Main_C_PlayBracketAnimation::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_ModernHud_Main.WBP_ModernHud_Main_C.ShouldHidePlayerBars
// 0x0030 (0x0030 - 0x0000)
struct WBP_ModernHud_Main_C_ShouldHidePlayerBars final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetProgress_Progress;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetProgress_Progress_1;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1;  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetProgress_Progress_2;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_2;  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_Main_C_ShouldHidePlayerBars) == 0x000008, "Wrong alignment on WBP_ModernHud_Main_C_ShouldHidePlayerBars");
static_assert(sizeof(WBP_ModernHud_Main_C_ShouldHidePlayerBars) == 0x000030, "Wrong size on WBP_ModernHud_Main_C_ShouldHidePlayerBars");
static_assert(offsetof(WBP_ModernHud_Main_C_ShouldHidePlayerBars, ReturnValue) == 0x000000, "Member 'WBP_ModernHud_Main_C_ShouldHidePlayerBars::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_ShouldHidePlayerBars, CallFunc_GetProgress_Progress) == 0x000008, "Member 'WBP_ModernHud_Main_C_ShouldHidePlayerBars::CallFunc_GetProgress_Progress' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_ShouldHidePlayerBars, CallFunc_GetProgress_Progress_1) == 0x000010, "Member 'WBP_ModernHud_Main_C_ShouldHidePlayerBars::CallFunc_GetProgress_Progress_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_ShouldHidePlayerBars, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000018, "Member 'WBP_ModernHud_Main_C_ShouldHidePlayerBars::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_ShouldHidePlayerBars, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1) == 0x000019, "Member 'WBP_ModernHud_Main_C_ShouldHidePlayerBars::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_ShouldHidePlayerBars, CallFunc_GetProgress_Progress_2) == 0x000020, "Member 'WBP_ModernHud_Main_C_ShouldHidePlayerBars::CallFunc_GetProgress_Progress_2' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_ShouldHidePlayerBars, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_2) == 0x000028, "Member 'WBP_ModernHud_Main_C_ShouldHidePlayerBars::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_ShouldHidePlayerBars, CallFunc_BooleanAND_ReturnValue) == 0x000029, "Member 'WBP_ModernHud_Main_C_ShouldHidePlayerBars::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_ShouldHidePlayerBars, CallFunc_BooleanAND_ReturnValue_1) == 0x00002A, "Member 'WBP_ModernHud_Main_C_ShouldHidePlayerBars::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function WBP_ModernHud_Main.WBP_ModernHud_Main_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_ModernHud_Main_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_Main_C_Tick) == 0x000004, "Wrong alignment on WBP_ModernHud_Main_C_Tick");
static_assert(sizeof(WBP_ModernHud_Main_C_Tick) == 0x00003C, "Wrong size on WBP_ModernHud_Main_C_Tick");
static_assert(offsetof(WBP_ModernHud_Main_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_ModernHud_Main_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Main_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_ModernHud_Main_C_Tick::InDeltaTime' has a wrong offset!");

// Function WBP_ModernHud_Main.WBP_ModernHud_Main_C.Update Active Effect Icons
// 0x0010 (0x0010 - 0x0000)
struct WBP_ModernHud_Main_C_Update_Active_Effect_Icons final
{
public:
	TArray<class UTexture2D*>                     NewParam;                                          // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_ModernHud_Main_C_Update_Active_Effect_Icons) == 0x000008, "Wrong alignment on WBP_ModernHud_Main_C_Update_Active_Effect_Icons");
static_assert(sizeof(WBP_ModernHud_Main_C_Update_Active_Effect_Icons) == 0x000010, "Wrong size on WBP_ModernHud_Main_C_Update_Active_Effect_Icons");
static_assert(offsetof(WBP_ModernHud_Main_C_Update_Active_Effect_Icons, NewParam) == 0x000000, "Member 'WBP_ModernHud_Main_C_Update_Active_Effect_Icons::NewParam' has a wrong offset!");

// Function WBP_ModernHud_Main.WBP_ModernHud_Main_C.Update Active Effects Time Left
// 0x0010 (0x0010 - 0x0000)
struct WBP_ModernHud_Main_C_Update_Active_Effects_Time_Left final
{
public:
	TArray<double>                                NewParam;                                          // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_ModernHud_Main_C_Update_Active_Effects_Time_Left) == 0x000008, "Wrong alignment on WBP_ModernHud_Main_C_Update_Active_Effects_Time_Left");
static_assert(sizeof(WBP_ModernHud_Main_C_Update_Active_Effects_Time_Left) == 0x000010, "Wrong size on WBP_ModernHud_Main_C_Update_Active_Effects_Time_Left");
static_assert(offsetof(WBP_ModernHud_Main_C_Update_Active_Effects_Time_Left, NewParam) == 0x000000, "Member 'WBP_ModernHud_Main_C_Update_Active_Effects_Time_Left::NewParam' has a wrong offset!");

// Function WBP_ModernHud_Main.WBP_ModernHud_Main_C.Update Broken Apparel Indicator Visibility
// 0x0002 (0x0002 - 0x0000)
struct WBP_ModernHud_Main_C_Update_Broken_Apparel_Indicator_Visibility final
{
public:
	struct FModernApparelData                     InApparelData;                                     // 0x0000(0x0002)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_ModernHud_Main_C_Update_Broken_Apparel_Indicator_Visibility) == 0x000001, "Wrong alignment on WBP_ModernHud_Main_C_Update_Broken_Apparel_Indicator_Visibility");
static_assert(sizeof(WBP_ModernHud_Main_C_Update_Broken_Apparel_Indicator_Visibility) == 0x000002, "Wrong size on WBP_ModernHud_Main_C_Update_Broken_Apparel_Indicator_Visibility");
static_assert(offsetof(WBP_ModernHud_Main_C_Update_Broken_Apparel_Indicator_Visibility, InApparelData) == 0x000000, "Member 'WBP_ModernHud_Main_C_Update_Broken_Apparel_Indicator_Visibility::InApparelData' has a wrong offset!");

// Function WBP_ModernHud_Main.WBP_ModernHud_Main_C.Update CanBeCast
// 0x0001 (0x0001 - 0x0000)
struct WBP_ModernHud_Main_C_Update_CanBeCast final
{
public:
	bool                                          NewParam;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_Main_C_Update_CanBeCast) == 0x000001, "Wrong alignment on WBP_ModernHud_Main_C_Update_CanBeCast");
static_assert(sizeof(WBP_ModernHud_Main_C_Update_CanBeCast) == 0x000001, "Wrong size on WBP_ModernHud_Main_C_Update_CanBeCast");
static_assert(offsetof(WBP_ModernHud_Main_C_Update_CanBeCast, NewParam) == 0x000000, "Member 'WBP_ModernHud_Main_C_Update_CanBeCast::NewParam' has a wrong offset!");

// Function WBP_ModernHud_Main.WBP_ModernHud_Main_C.Update Compass Direction Value
// 0x0008 (0x0008 - 0x0000)
struct WBP_ModernHud_Main_C_Update_Compass_Direction_Value final
{
public:
	double                                        In_Direction;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_Main_C_Update_Compass_Direction_Value) == 0x000008, "Wrong alignment on WBP_ModernHud_Main_C_Update_Compass_Direction_Value");
static_assert(sizeof(WBP_ModernHud_Main_C_Update_Compass_Direction_Value) == 0x000008, "Wrong size on WBP_ModernHud_Main_C_Update_Compass_Direction_Value");
static_assert(offsetof(WBP_ModernHud_Main_C_Update_Compass_Direction_Value, In_Direction) == 0x000000, "Member 'WBP_ModernHud_Main_C_Update_Compass_Direction_Value::In_Direction' has a wrong offset!");

// Function WBP_ModernHud_Main.WBP_ModernHud_Main_C.Update Fatigue Bar Value
// 0x0008 (0x0008 - 0x0000)
struct WBP_ModernHud_Main_C_Update_Fatigue_Bar_Value final
{
public:
	double                                        NewParam;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_Main_C_Update_Fatigue_Bar_Value) == 0x000008, "Wrong alignment on WBP_ModernHud_Main_C_Update_Fatigue_Bar_Value");
static_assert(sizeof(WBP_ModernHud_Main_C_Update_Fatigue_Bar_Value) == 0x000008, "Wrong size on WBP_ModernHud_Main_C_Update_Fatigue_Bar_Value");
static_assert(offsetof(WBP_ModernHud_Main_C_Update_Fatigue_Bar_Value, NewParam) == 0x000000, "Member 'WBP_ModernHud_Main_C_Update_Fatigue_Bar_Value::NewParam' has a wrong offset!");

// Function WBP_ModernHud_Main.WBP_ModernHud_Main_C.Update Health Bar Value
// 0x0008 (0x0008 - 0x0000)
struct WBP_ModernHud_Main_C_Update_Health_Bar_Value final
{
public:
	double                                        NewParam;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_Main_C_Update_Health_Bar_Value) == 0x000008, "Wrong alignment on WBP_ModernHud_Main_C_Update_Health_Bar_Value");
static_assert(sizeof(WBP_ModernHud_Main_C_Update_Health_Bar_Value) == 0x000008, "Wrong size on WBP_ModernHud_Main_C_Update_Health_Bar_Value");
static_assert(offsetof(WBP_ModernHud_Main_C_Update_Health_Bar_Value, NewParam) == 0x000000, "Member 'WBP_ModernHud_Main_C_Update_Health_Bar_Value::NewParam' has a wrong offset!");

