#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Modern_Settings_ComboBoxWidget

#include "Basic.hpp"

#include "Altar_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_Modern_Settings_ComboBoxWidget.WBP_Modern_Settings_ComboBoxWidget_C.BndEvt__WBP_Modern_Settings_ComboBoxWidget_ComboBox_K2Node_ComponentBoundEvent_1_OnStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_Modern_Settings_ComboBoxWidget_C_BndEvt__WBP_Modern_Settings_ComboBoxWidget_ComboBox_K2Node_ComponentBoundEvent_1_OnStateChanged__DelegateSignature final
{
public:
	bool                                          IsOpen;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Settings_ComboBoxWidget_C_BndEvt__WBP_Modern_Settings_ComboBoxWidget_ComboBox_K2Node_ComponentBoundEvent_1_OnStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on WBP_Modern_Settings_ComboBoxWidget_C_BndEvt__WBP_Modern_Settings_ComboBoxWidget_ComboBox_K2Node_ComponentBoundEvent_1_OnStateChanged__DelegateSignature");
static_assert(sizeof(WBP_Modern_Settings_ComboBoxWidget_C_BndEvt__WBP_Modern_Settings_ComboBoxWidget_ComboBox_K2Node_ComponentBoundEvent_1_OnStateChanged__DelegateSignature) == 0x000001, "Wrong size on WBP_Modern_Settings_ComboBoxWidget_C_BndEvt__WBP_Modern_Settings_ComboBoxWidget_ComboBox_K2Node_ComponentBoundEvent_1_OnStateChanged__DelegateSignature");
static_assert(offsetof(WBP_Modern_Settings_ComboBoxWidget_C_BndEvt__WBP_Modern_Settings_ComboBoxWidget_ComboBox_K2Node_ComponentBoundEvent_1_OnStateChanged__DelegateSignature, IsOpen) == 0x000000, "Member 'WBP_Modern_Settings_ComboBoxWidget_C_BndEvt__WBP_Modern_Settings_ComboBoxWidget_ComboBox_K2Node_ComponentBoundEvent_1_OnStateChanged__DelegateSignature::IsOpen' has a wrong offset!");

// Function WBP_Modern_Settings_ComboBoxWidget.WBP_Modern_Settings_ComboBoxWidget_C.BP_OnHandleBackAction
// 0x0002 (0x0002 - 0x0000)
struct WBP_Modern_Settings_ComboBoxWidget_C_BP_OnHandleBackAction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsOpen_IsOpen;                         // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Settings_ComboBoxWidget_C_BP_OnHandleBackAction) == 0x000001, "Wrong alignment on WBP_Modern_Settings_ComboBoxWidget_C_BP_OnHandleBackAction");
static_assert(sizeof(WBP_Modern_Settings_ComboBoxWidget_C_BP_OnHandleBackAction) == 0x000002, "Wrong size on WBP_Modern_Settings_ComboBoxWidget_C_BP_OnHandleBackAction");
static_assert(offsetof(WBP_Modern_Settings_ComboBoxWidget_C_BP_OnHandleBackAction, ReturnValue) == 0x000000, "Member 'WBP_Modern_Settings_ComboBoxWidget_C_BP_OnHandleBackAction::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBoxWidget_C_BP_OnHandleBackAction, CallFunc_GetIsOpen_IsOpen) == 0x000001, "Member 'WBP_Modern_Settings_ComboBoxWidget_C_BP_OnHandleBackAction::CallFunc_GetIsOpen_IsOpen' has a wrong offset!");

// Function WBP_Modern_Settings_ComboBoxWidget.WBP_Modern_Settings_ComboBoxWidget_C.ExecuteUbergraph_WBP_Modern_Settings_ComboBoxWidget
// 0x0480 (0x0480 - 0x0000)
struct WBP_Modern_Settings_ComboBoxWidget_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBoxWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Index;                  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_ComponentBoundEvent_Value;                  // 0x0008(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FModernSettingTableRow                 CallFunc_GetSettingRow_ReturnValue;                // 0x0038(0x0138)(ConstParm)
	float                                         K2Node_Event_Value;                                // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FModernSettingTableRow                 CallFunc_GetSettingRow_ReturnValue_1;              // 0x0178(0x0138)(ConstParm)
	struct FModernSettingTableRow                 K2Node_Event_NewSettingRow;                        // 0x02B0(0x0138)(ConstParm)
	bool                                          K2Node_ComponentBoundEvent_IsOpen;                 // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x03E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x03EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EB[0x5];                                      // 0x03EB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UVUINavigationGlobalSubsystem*          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x03F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IVEnhancedInputNavigable> K2Node_CustomEvent_NewTopMostFocusedWidget;     // 0x03F8(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TDelegate<void(const TScriptInterface<class IVEnhancedInputNavigable>& NewTopMostFocusedWidget)> K2Node_CreateDelegate_OutputDelegate; // 0x0408(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_InterfaceToObject_ReturnValue;       // 0x0418(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVUINavigationGlobalSubsystem*          CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0420(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFromTree_IsFromTree;                    // 0x0428(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0429(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42A[0x2];                                      // 0x042A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const TScriptInterface<class IVEnhancedInputNavigable>& NewTopMostFocusedWidget)> K2Node_CreateDelegate_OutputDelegate_1; // 0x042C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsOpen_IsOpen;                         // 0x043C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x043D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43E[0x2];                                      // 0x043E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UVUINavigationGlobalSubsystem*          CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0440(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVUINavigationGlobalSubsystem*          CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x0448(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IVEnhancedInputNavigable> CallFunc_NavigateToWidget_Widget_CastInput;     // 0x0450(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TScriptInterface<class IVEnhancedInputNavigable> CallFunc_NavigateToWidget_Widget_CastInput_1;   // 0x0460(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsOpen_IsOpen_1;                       // 0x0470(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_471[0x3];                                      // 0x0471(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_ApplyNewValue_WidgetValue_ImplicitCast;   // 0x0474(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FTrunc_A_ImplicitCast;                    // 0x0478(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Settings_ComboBoxWidget_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBoxWidget) == 0x000008, "Wrong alignment on WBP_Modern_Settings_ComboBoxWidget_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBoxWidget");
static_assert(sizeof(WBP_Modern_Settings_ComboBoxWidget_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBoxWidget) == 0x000480, "Wrong size on WBP_Modern_Settings_ComboBoxWidget_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBoxWidget");
static_assert(offsetof(WBP_Modern_Settings_ComboBoxWidget_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBoxWidget, EntryPoint) == 0x000000, "Member 'WBP_Modern_Settings_ComboBoxWidget_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBoxWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBoxWidget_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBoxWidget, K2Node_ComponentBoundEvent_Index) == 0x000004, "Member 'WBP_Modern_Settings_ComboBoxWidget_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBoxWidget::K2Node_ComponentBoundEvent_Index' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBoxWidget_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBoxWidget, K2Node_ComponentBoundEvent_Value) == 0x000008, "Member 'WBP_Modern_Settings_ComboBoxWidget_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBoxWidget::K2Node_ComponentBoundEvent_Value' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBoxWidget_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBoxWidget, CallFunc_Conv_TextToString_ReturnValue) == 0x000020, "Member 'WBP_Modern_Settings_ComboBoxWidget_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBoxWidget::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBoxWidget_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBoxWidget, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000030, "Member 'WBP_Modern_Settings_ComboBoxWidget_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBoxWidget::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBoxWidget_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBoxWidget, CallFunc_GetSettingRow_ReturnValue) == 0x000038, "Member 'WBP_Modern_Settings_ComboBoxWidget_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBoxWidget::CallFunc_GetSettingRow_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBoxWidget_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBoxWidget, K2Node_Event_Value) == 0x000170, "Member 'WBP_Modern_Settings_ComboBoxWidget_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBoxWidget::K2Node_Event_Value' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBoxWidget_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBoxWidget, CallFunc_FTrunc_ReturnValue) == 0x000174, "Member 'WBP_Modern_Settings_ComboBoxWidget_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBoxWidget::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBoxWidget_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBoxWidget, CallFunc_GetSettingRow_ReturnValue_1) == 0x000178, "Member 'WBP_Modern_Settings_ComboBoxWidget_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBoxWidget::CallFunc_GetSettingRow_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBoxWidget_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBoxWidget, K2Node_Event_NewSettingRow) == 0x0002B0, "Member 'WBP_Modern_Settings_ComboBoxWidget_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBoxWidget::K2Node_Event_NewSettingRow' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBoxWidget_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBoxWidget, K2Node_ComponentBoundEvent_IsOpen) == 0x0003E8, "Member 'WBP_Modern_Settings_ComboBoxWidget_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBoxWidget::K2Node_ComponentBoundEvent_IsOpen' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBoxWidget_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBoxWidget, CallFunc_Not_PreBool_ReturnValue) == 0x0003E9, "Member 'WBP_Modern_Settings_ComboBoxWidget_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBoxWidget::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBoxWidget_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBoxWidget, K2Node_Event_IsDesignTime) == 0x0003EA, "Member 'WBP_Modern_Settings_ComboBoxWidget_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBoxWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBoxWidget_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBoxWidget, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x0003F0, "Member 'WBP_Modern_Settings_ComboBoxWidget_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBoxWidget::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBoxWidget_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBoxWidget, K2Node_CustomEvent_NewTopMostFocusedWidget) == 0x0003F8, "Member 'WBP_Modern_Settings_ComboBoxWidget_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBoxWidget::K2Node_CustomEvent_NewTopMostFocusedWidget' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBoxWidget_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBoxWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000408, "Member 'WBP_Modern_Settings_ComboBoxWidget_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBoxWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBoxWidget_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBoxWidget, CallFunc_Conv_InterfaceToObject_ReturnValue) == 0x000418, "Member 'WBP_Modern_Settings_ComboBoxWidget_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBoxWidget::CallFunc_Conv_InterfaceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBoxWidget_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBoxWidget, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000420, "Member 'WBP_Modern_Settings_ComboBoxWidget_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBoxWidget::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBoxWidget_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBoxWidget, CallFunc_IsFromTree_IsFromTree) == 0x000428, "Member 'WBP_Modern_Settings_ComboBoxWidget_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBoxWidget::CallFunc_IsFromTree_IsFromTree' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBoxWidget_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBoxWidget, CallFunc_Not_PreBool_ReturnValue_1) == 0x000429, "Member 'WBP_Modern_Settings_ComboBoxWidget_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBoxWidget::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBoxWidget_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBoxWidget, K2Node_CreateDelegate_OutputDelegate_1) == 0x00042C, "Member 'WBP_Modern_Settings_ComboBoxWidget_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBoxWidget::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBoxWidget_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBoxWidget, CallFunc_GetIsOpen_IsOpen) == 0x00043C, "Member 'WBP_Modern_Settings_ComboBoxWidget_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBoxWidget::CallFunc_GetIsOpen_IsOpen' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBoxWidget_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBoxWidget, CallFunc_BooleanAND_ReturnValue) == 0x00043D, "Member 'WBP_Modern_Settings_ComboBoxWidget_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBoxWidget::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBoxWidget_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBoxWidget, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x000440, "Member 'WBP_Modern_Settings_ComboBoxWidget_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBoxWidget::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBoxWidget_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBoxWidget, CallFunc_GetGameInstanceSubsystem_ReturnValue_3) == 0x000448, "Member 'WBP_Modern_Settings_ComboBoxWidget_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBoxWidget::CallFunc_GetGameInstanceSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBoxWidget_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBoxWidget, CallFunc_NavigateToWidget_Widget_CastInput) == 0x000450, "Member 'WBP_Modern_Settings_ComboBoxWidget_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBoxWidget::CallFunc_NavigateToWidget_Widget_CastInput' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBoxWidget_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBoxWidget, CallFunc_NavigateToWidget_Widget_CastInput_1) == 0x000460, "Member 'WBP_Modern_Settings_ComboBoxWidget_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBoxWidget::CallFunc_NavigateToWidget_Widget_CastInput_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBoxWidget_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBoxWidget, CallFunc_GetIsOpen_IsOpen_1) == 0x000470, "Member 'WBP_Modern_Settings_ComboBoxWidget_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBoxWidget::CallFunc_GetIsOpen_IsOpen_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBoxWidget_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBoxWidget, CallFunc_ApplyNewValue_WidgetValue_ImplicitCast) == 0x000474, "Member 'WBP_Modern_Settings_ComboBoxWidget_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBoxWidget::CallFunc_ApplyNewValue_WidgetValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBoxWidget_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBoxWidget, CallFunc_FTrunc_A_ImplicitCast) == 0x000478, "Member 'WBP_Modern_Settings_ComboBoxWidget_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBoxWidget::CallFunc_FTrunc_A_ImplicitCast' has a wrong offset!");

// Function WBP_Modern_Settings_ComboBoxWidget.WBP_Modern_Settings_ComboBoxWidget_C.FillComboBox
// 0x01A0 (0x01A0 - 0x0000)
struct WBP_Modern_Settings_ComboBoxWidget_C_FillComboBox final
{
public:
	class FText                                   Local_CurrentLabel;                                // 0x0000(0x0018)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FModernSettingTableRow                 CallFunc_GetSettingRow_ReturnValue;                // 0x0028(0x0138)(ConstParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FModernSettingSingleCommand            CallFunc_Array_Get_Item;                           // 0x0168(0x0030)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Settings_ComboBoxWidget_C_FillComboBox) == 0x000008, "Wrong alignment on WBP_Modern_Settings_ComboBoxWidget_C_FillComboBox");
static_assert(sizeof(WBP_Modern_Settings_ComboBoxWidget_C_FillComboBox) == 0x0001A0, "Wrong size on WBP_Modern_Settings_ComboBoxWidget_C_FillComboBox");
static_assert(offsetof(WBP_Modern_Settings_ComboBoxWidget_C_FillComboBox, Local_CurrentLabel) == 0x000000, "Member 'WBP_Modern_Settings_ComboBoxWidget_C_FillComboBox::Local_CurrentLabel' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBoxWidget_C_FillComboBox, Temp_int_Array_Index_Variable) == 0x000018, "Member 'WBP_Modern_Settings_ComboBoxWidget_C_FillComboBox::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBoxWidget_C_FillComboBox, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'WBP_Modern_Settings_ComboBoxWidget_C_FillComboBox::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBoxWidget_C_FillComboBox, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'WBP_Modern_Settings_ComboBoxWidget_C_FillComboBox::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBoxWidget_C_FillComboBox, CallFunc_GetSettingRow_ReturnValue) == 0x000028, "Member 'WBP_Modern_Settings_ComboBoxWidget_C_FillComboBox::CallFunc_GetSettingRow_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBoxWidget_C_FillComboBox, CallFunc_Array_Length_ReturnValue) == 0x000160, "Member 'WBP_Modern_Settings_ComboBoxWidget_C_FillComboBox::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBoxWidget_C_FillComboBox, CallFunc_Array_Get_Item) == 0x000168, "Member 'WBP_Modern_Settings_ComboBoxWidget_C_FillComboBox::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBoxWidget_C_FillComboBox, CallFunc_Less_IntInt_ReturnValue) == 0x000198, "Member 'WBP_Modern_Settings_ComboBoxWidget_C_FillComboBox::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_Modern_Settings_ComboBoxWidget.WBP_Modern_Settings_ComboBoxWidget_C.InitializeWidget
// 0x0160 (0x0160 - 0x0000)
struct WBP_Modern_Settings_ComboBoxWidget_C_InitializeWidget final
{
public:
	struct FModernSettingTableRow                 CallFunc_GetSettingRow_ReturnValue;                // 0x0000(0x0138)(ConstParm)
	float                                         CallFunc_GetCurrentWidgetValue_ReturnValue;        // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_145[0x3];                                      // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 Index, class FText Value)> K2Node_CreateDelegate_OutputDelegate;            // 0x0148(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FTrunc_A_ImplicitCast;                    // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Settings_ComboBoxWidget_C_InitializeWidget) == 0x000008, "Wrong alignment on WBP_Modern_Settings_ComboBoxWidget_C_InitializeWidget");
static_assert(sizeof(WBP_Modern_Settings_ComboBoxWidget_C_InitializeWidget) == 0x000160, "Wrong size on WBP_Modern_Settings_ComboBoxWidget_C_InitializeWidget");
static_assert(offsetof(WBP_Modern_Settings_ComboBoxWidget_C_InitializeWidget, CallFunc_GetSettingRow_ReturnValue) == 0x000000, "Member 'WBP_Modern_Settings_ComboBoxWidget_C_InitializeWidget::CallFunc_GetSettingRow_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBoxWidget_C_InitializeWidget, CallFunc_GetCurrentWidgetValue_ReturnValue) == 0x000138, "Member 'WBP_Modern_Settings_ComboBoxWidget_C_InitializeWidget::CallFunc_GetCurrentWidgetValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBoxWidget_C_InitializeWidget, CallFunc_FTrunc_ReturnValue) == 0x00013C, "Member 'WBP_Modern_Settings_ComboBoxWidget_C_InitializeWidget::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBoxWidget_C_InitializeWidget, CallFunc_Array_Length_ReturnValue) == 0x000140, "Member 'WBP_Modern_Settings_ComboBoxWidget_C_InitializeWidget::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBoxWidget_C_InitializeWidget, CallFunc_Greater_IntInt_ReturnValue) == 0x000144, "Member 'WBP_Modern_Settings_ComboBoxWidget_C_InitializeWidget::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBoxWidget_C_InitializeWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000148, "Member 'WBP_Modern_Settings_ComboBoxWidget_C_InitializeWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBoxWidget_C_InitializeWidget, CallFunc_FTrunc_A_ImplicitCast) == 0x000158, "Member 'WBP_Modern_Settings_ComboBoxWidget_C_InitializeWidget::CallFunc_FTrunc_A_ImplicitCast' has a wrong offset!");

// Function WBP_Modern_Settings_ComboBoxWidget.WBP_Modern_Settings_ComboBoxWidget_C.IsFromTree
// 0x0020 (0x0020 - 0x0000)
struct WBP_Modern_Settings_ComboBoxWidget_C_IsFromTree final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFromTree_0;                                      // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Modern_Settings_ComboBox_ListView_C* CallFunc_GetListRef_ListView;                    // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_2;    // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Settings_ComboBoxWidget_C_IsFromTree) == 0x000008, "Wrong alignment on WBP_Modern_Settings_ComboBoxWidget_C_IsFromTree");
static_assert(sizeof(WBP_Modern_Settings_ComboBoxWidget_C_IsFromTree) == 0x000020, "Wrong size on WBP_Modern_Settings_ComboBoxWidget_C_IsFromTree");
static_assert(offsetof(WBP_Modern_Settings_ComboBoxWidget_C_IsFromTree, Object) == 0x000000, "Member 'WBP_Modern_Settings_ComboBoxWidget_C_IsFromTree::Object' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBoxWidget_C_IsFromTree, IsFromTree_0) == 0x000008, "Member 'WBP_Modern_Settings_ComboBoxWidget_C_IsFromTree::IsFromTree_0' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBoxWidget_C_IsFromTree, CallFunc_GetListRef_ListView) == 0x000010, "Member 'WBP_Modern_Settings_ComboBoxWidget_C_IsFromTree::CallFunc_GetListRef_ListView' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBoxWidget_C_IsFromTree, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000018, "Member 'WBP_Modern_Settings_ComboBoxWidget_C_IsFromTree::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBoxWidget_C_IsFromTree, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x000019, "Member 'WBP_Modern_Settings_ComboBoxWidget_C_IsFromTree::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBoxWidget_C_IsFromTree, CallFunc_EqualEqual_ObjectObject_ReturnValue_2) == 0x00001A, "Member 'WBP_Modern_Settings_ComboBoxWidget_C_IsFromTree::CallFunc_EqualEqual_ObjectObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBoxWidget_C_IsFromTree, CallFunc_BooleanOR_ReturnValue) == 0x00001B, "Member 'WBP_Modern_Settings_ComboBoxWidget_C_IsFromTree::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBoxWidget_C_IsFromTree, CallFunc_BooleanOR_ReturnValue_1) == 0x00001C, "Member 'WBP_Modern_Settings_ComboBoxWidget_C_IsFromTree::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");

// Function WBP_Modern_Settings_ComboBoxWidget.WBP_Modern_Settings_ComboBoxWidget_C.OnNewTopMostWidgetFocusedDelegate
// 0x0010 (0x0010 - 0x0000)
struct WBP_Modern_Settings_ComboBoxWidget_C_OnNewTopMostWidgetFocusedDelegate final
{
public:
	TScriptInterface<class IVEnhancedInputNavigable> NewTopMostFocusedWidget;                        // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Settings_ComboBoxWidget_C_OnNewTopMostWidgetFocusedDelegate) == 0x000008, "Wrong alignment on WBP_Modern_Settings_ComboBoxWidget_C_OnNewTopMostWidgetFocusedDelegate");
static_assert(sizeof(WBP_Modern_Settings_ComboBoxWidget_C_OnNewTopMostWidgetFocusedDelegate) == 0x000010, "Wrong size on WBP_Modern_Settings_ComboBoxWidget_C_OnNewTopMostWidgetFocusedDelegate");
static_assert(offsetof(WBP_Modern_Settings_ComboBoxWidget_C_OnNewTopMostWidgetFocusedDelegate, NewTopMostFocusedWidget) == 0x000000, "Member 'WBP_Modern_Settings_ComboBoxWidget_C_OnNewTopMostWidgetFocusedDelegate::NewTopMostFocusedWidget' has a wrong offset!");

// Function WBP_Modern_Settings_ComboBoxWidget.WBP_Modern_Settings_ComboBoxWidget_C.OnRefreshWidgetRequested
// 0x0004 (0x0004 - 0x0000)
struct WBP_Modern_Settings_ComboBoxWidget_C_OnRefreshWidgetRequested final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Settings_ComboBoxWidget_C_OnRefreshWidgetRequested) == 0x000004, "Wrong alignment on WBP_Modern_Settings_ComboBoxWidget_C_OnRefreshWidgetRequested");
static_assert(sizeof(WBP_Modern_Settings_ComboBoxWidget_C_OnRefreshWidgetRequested) == 0x000004, "Wrong size on WBP_Modern_Settings_ComboBoxWidget_C_OnRefreshWidgetRequested");
static_assert(offsetof(WBP_Modern_Settings_ComboBoxWidget_C_OnRefreshWidgetRequested, Value) == 0x000000, "Member 'WBP_Modern_Settings_ComboBoxWidget_C_OnRefreshWidgetRequested::Value' has a wrong offset!");

// Function WBP_Modern_Settings_ComboBoxWidget.WBP_Modern_Settings_ComboBoxWidget_C.OnSelectionChanged
// 0x0020 (0x0020 - 0x0000)
struct WBP_Modern_Settings_ComboBoxWidget_C_OnSelectionChanged final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Value;                                             // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Modern_Settings_ComboBoxWidget_C_OnSelectionChanged) == 0x000008, "Wrong alignment on WBP_Modern_Settings_ComboBoxWidget_C_OnSelectionChanged");
static_assert(sizeof(WBP_Modern_Settings_ComboBoxWidget_C_OnSelectionChanged) == 0x000020, "Wrong size on WBP_Modern_Settings_ComboBoxWidget_C_OnSelectionChanged");
static_assert(offsetof(WBP_Modern_Settings_ComboBoxWidget_C_OnSelectionChanged, Index_0) == 0x000000, "Member 'WBP_Modern_Settings_ComboBoxWidget_C_OnSelectionChanged::Index_0' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBoxWidget_C_OnSelectionChanged, Value) == 0x000008, "Member 'WBP_Modern_Settings_ComboBoxWidget_C_OnSelectionChanged::Value' has a wrong offset!");

// Function WBP_Modern_Settings_ComboBoxWidget.WBP_Modern_Settings_ComboBoxWidget_C.OnSettingChanged
// 0x0138 (0x0138 - 0x0000)
struct WBP_Modern_Settings_ComboBoxWidget_C_OnSettingChanged final
{
public:
	struct FModernSettingTableRow                 NewSettingRow;                                     // 0x0000(0x0138)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_Modern_Settings_ComboBoxWidget_C_OnSettingChanged) == 0x000008, "Wrong alignment on WBP_Modern_Settings_ComboBoxWidget_C_OnSettingChanged");
static_assert(sizeof(WBP_Modern_Settings_ComboBoxWidget_C_OnSettingChanged) == 0x000138, "Wrong size on WBP_Modern_Settings_ComboBoxWidget_C_OnSettingChanged");
static_assert(offsetof(WBP_Modern_Settings_ComboBoxWidget_C_OnSettingChanged, NewSettingRow) == 0x000000, "Member 'WBP_Modern_Settings_ComboBoxWidget_C_OnSettingChanged::NewSettingRow' has a wrong offset!");

// Function WBP_Modern_Settings_ComboBoxWidget.WBP_Modern_Settings_ComboBoxWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Modern_Settings_ComboBoxWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Settings_ComboBoxWidget_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_Modern_Settings_ComboBoxWidget_C_PreConstruct");
static_assert(sizeof(WBP_Modern_Settings_ComboBoxWidget_C_PreConstruct) == 0x000001, "Wrong size on WBP_Modern_Settings_ComboBoxWidget_C_PreConstruct");
static_assert(offsetof(WBP_Modern_Settings_ComboBoxWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_Modern_Settings_ComboBoxWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_Modern_Settings_ComboBoxWidget.WBP_Modern_Settings_ComboBoxWidget_C.UpdateResolutionInGameUserSettings
// 0x0188 (0x0188 - 0x0000)
struct WBP_Modern_Settings_ComboBoxWidget_C_UpdateResolutionInGameUserSettings final
{
public:
	class FString                                 OptionLabel;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	struct FModernSettingTableRow                 CallFunc_GetSettingRow_ReturnValue;                // 0x0010(0x0138)(ConstParm)
	class FString                                 CallFunc_Split_LeftS;                              // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_RightS;                             // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Split_ReturnValue;                        // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x3];                                      // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_StringToInt_ReturnValue;             // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x3];                                      // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_StringToInt_ReturnValue_1;           // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              K2Node_MakeStruct_IntPoint;                        // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Settings_ComboBoxWidget_C_UpdateResolutionInGameUserSettings) == 0x000008, "Wrong alignment on WBP_Modern_Settings_ComboBoxWidget_C_UpdateResolutionInGameUserSettings");
static_assert(sizeof(WBP_Modern_Settings_ComboBoxWidget_C_UpdateResolutionInGameUserSettings) == 0x000188, "Wrong size on WBP_Modern_Settings_ComboBoxWidget_C_UpdateResolutionInGameUserSettings");
static_assert(offsetof(WBP_Modern_Settings_ComboBoxWidget_C_UpdateResolutionInGameUserSettings, OptionLabel) == 0x000000, "Member 'WBP_Modern_Settings_ComboBoxWidget_C_UpdateResolutionInGameUserSettings::OptionLabel' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBoxWidget_C_UpdateResolutionInGameUserSettings, CallFunc_GetSettingRow_ReturnValue) == 0x000010, "Member 'WBP_Modern_Settings_ComboBoxWidget_C_UpdateResolutionInGameUserSettings::CallFunc_GetSettingRow_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBoxWidget_C_UpdateResolutionInGameUserSettings, CallFunc_Split_LeftS) == 0x000148, "Member 'WBP_Modern_Settings_ComboBoxWidget_C_UpdateResolutionInGameUserSettings::CallFunc_Split_LeftS' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBoxWidget_C_UpdateResolutionInGameUserSettings, CallFunc_Split_RightS) == 0x000158, "Member 'WBP_Modern_Settings_ComboBoxWidget_C_UpdateResolutionInGameUserSettings::CallFunc_Split_RightS' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBoxWidget_C_UpdateResolutionInGameUserSettings, CallFunc_Split_ReturnValue) == 0x000168, "Member 'WBP_Modern_Settings_ComboBoxWidget_C_UpdateResolutionInGameUserSettings::CallFunc_Split_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBoxWidget_C_UpdateResolutionInGameUserSettings, CallFunc_Conv_StringToInt_ReturnValue) == 0x00016C, "Member 'WBP_Modern_Settings_ComboBoxWidget_C_UpdateResolutionInGameUserSettings::CallFunc_Conv_StringToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBoxWidget_C_UpdateResolutionInGameUserSettings, K2Node_SwitchEnum_CmpSuccess) == 0x000170, "Member 'WBP_Modern_Settings_ComboBoxWidget_C_UpdateResolutionInGameUserSettings::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBoxWidget_C_UpdateResolutionInGameUserSettings, CallFunc_Conv_StringToInt_ReturnValue_1) == 0x000174, "Member 'WBP_Modern_Settings_ComboBoxWidget_C_UpdateResolutionInGameUserSettings::CallFunc_Conv_StringToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBoxWidget_C_UpdateResolutionInGameUserSettings, CallFunc_GetGameUserSettings_ReturnValue) == 0x000178, "Member 'WBP_Modern_Settings_ComboBoxWidget_C_UpdateResolutionInGameUserSettings::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBoxWidget_C_UpdateResolutionInGameUserSettings, K2Node_MakeStruct_IntPoint) == 0x000180, "Member 'WBP_Modern_Settings_ComboBoxWidget_C_UpdateResolutionInGameUserSettings::K2Node_MakeStruct_IntPoint' has a wrong offset!");

// Function WBP_Modern_Settings_ComboBoxWidget.WBP_Modern_Settings_ComboBoxWidget_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct WBP_Modern_Settings_ComboBoxWidget_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Settings_ComboBoxWidget_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_Modern_Settings_ComboBoxWidget_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_Modern_Settings_ComboBoxWidget_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong size on WBP_Modern_Settings_ComboBoxWidget_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_Modern_Settings_ComboBoxWidget_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_Modern_Settings_ComboBoxWidget_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");

}

