#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModernMenu_Magic_FilterIcon

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CommonInput_structs.hpp"
#include "Altar_structs.hpp"


namespace SDK::Params
{

// Function WBP_ModernMenu_Magic_FilterIcon.WBP_ModernMenu_Magic_FilterIcon_C.ExecuteUbergraph_WBP_ModernMenu_Magic_FilterIcon
// 0x0018 (0x0018 - 0x0000)
struct WBP_ModernMenu_Magic_FilterIcon_C_ExecuteUbergraph_WBP_ModernMenu_Magic_FilterIcon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_Magic_FilterIcon_C_ExecuteUbergraph_WBP_ModernMenu_Magic_FilterIcon) == 0x000008, "Wrong alignment on WBP_ModernMenu_Magic_FilterIcon_C_ExecuteUbergraph_WBP_ModernMenu_Magic_FilterIcon");
static_assert(sizeof(WBP_ModernMenu_Magic_FilterIcon_C_ExecuteUbergraph_WBP_ModernMenu_Magic_FilterIcon) == 0x000018, "Wrong size on WBP_ModernMenu_Magic_FilterIcon_C_ExecuteUbergraph_WBP_ModernMenu_Magic_FilterIcon");
static_assert(offsetof(WBP_ModernMenu_Magic_FilterIcon_C_ExecuteUbergraph_WBP_ModernMenu_Magic_FilterIcon, EntryPoint) == 0x000000, "Member 'WBP_ModernMenu_Magic_FilterIcon_C_ExecuteUbergraph_WBP_ModernMenu_Magic_FilterIcon::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Magic_FilterIcon_C_ExecuteUbergraph_WBP_ModernMenu_Magic_FilterIcon, CallFunc_Not_PreBool_ReturnValue) == 0x000004, "Member 'WBP_ModernMenu_Magic_FilterIcon_C_ExecuteUbergraph_WBP_ModernMenu_Magic_FilterIcon::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Magic_FilterIcon_C_ExecuteUbergraph_WBP_ModernMenu_Magic_FilterIcon, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000008, "Member 'WBP_ModernMenu_Magic_FilterIcon_C_ExecuteUbergraph_WBP_ModernMenu_Magic_FilterIcon::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Magic_FilterIcon_C_ExecuteUbergraph_WBP_ModernMenu_Magic_FilterIcon, CallFunc_GetCurrentInputType_ReturnValue) == 0x000010, "Member 'WBP_ModernMenu_Magic_FilterIcon_C_ExecuteUbergraph_WBP_ModernMenu_Magic_FilterIcon::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Magic_FilterIcon_C_ExecuteUbergraph_WBP_ModernMenu_Magic_FilterIcon, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000011, "Member 'WBP_ModernMenu_Magic_FilterIcon_C_ExecuteUbergraph_WBP_ModernMenu_Magic_FilterIcon::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Magic_FilterIcon_C_ExecuteUbergraph_WBP_ModernMenu_Magic_FilterIcon, CallFunc_Not_PreBool_ReturnValue_1) == 0x000012, "Member 'WBP_ModernMenu_Magic_FilterIcon_C_ExecuteUbergraph_WBP_ModernMenu_Magic_FilterIcon::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");

// Function WBP_ModernMenu_Magic_FilterIcon.WBP_ModernMenu_Magic_FilterIcon_C.HideArrows
// 0x0004 (0x0004 - 0x0000)
struct WBP_ModernMenu_Magic_FilterIcon_C_HideArrows final
{
public:
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue_1;              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_Magic_FilterIcon_C_HideArrows) == 0x000001, "Wrong alignment on WBP_ModernMenu_Magic_FilterIcon_C_HideArrows");
static_assert(sizeof(WBP_ModernMenu_Magic_FilterIcon_C_HideArrows) == 0x000004, "Wrong size on WBP_ModernMenu_Magic_FilterIcon_C_HideArrows");
static_assert(offsetof(WBP_ModernMenu_Magic_FilterIcon_C_HideArrows, CallFunc_GetVisibility_ReturnValue) == 0x000000, "Member 'WBP_ModernMenu_Magic_FilterIcon_C_HideArrows::CallFunc_GetVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Magic_FilterIcon_C_HideArrows, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000001, "Member 'WBP_ModernMenu_Magic_FilterIcon_C_HideArrows::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Magic_FilterIcon_C_HideArrows, CallFunc_GetVisibility_ReturnValue_1) == 0x000002, "Member 'WBP_ModernMenu_Magic_FilterIcon_C_HideArrows::CallFunc_GetVisibility_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Magic_FilterIcon_C_HideArrows, CallFunc_NotEqual_ByteByte_ReturnValue_1) == 0x000003, "Member 'WBP_ModernMenu_Magic_FilterIcon_C_HideArrows::CallFunc_NotEqual_ByteByte_ReturnValue_1' has a wrong offset!");

// Function WBP_ModernMenu_Magic_FilterIcon.WBP_ModernMenu_Magic_FilterIcon_C.InitializeFilterIcon
// 0x09B0 (0x09B0 - 0x0000)
struct WBP_ModernMenu_Magic_FilterIcon_C_InitializeFilterIcon final
{
public:
	class UWBP_ModernMenu_Magic_Filters_C*        AssociatedFilter;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FModernMagicFilterTableRow             Design;                                            // 0x0010(0x09A0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_ModernMenu_Magic_FilterIcon_C_InitializeFilterIcon) == 0x000010, "Wrong alignment on WBP_ModernMenu_Magic_FilterIcon_C_InitializeFilterIcon");
static_assert(sizeof(WBP_ModernMenu_Magic_FilterIcon_C_InitializeFilterIcon) == 0x0009B0, "Wrong size on WBP_ModernMenu_Magic_FilterIcon_C_InitializeFilterIcon");
static_assert(offsetof(WBP_ModernMenu_Magic_FilterIcon_C_InitializeFilterIcon, AssociatedFilter) == 0x000000, "Member 'WBP_ModernMenu_Magic_FilterIcon_C_InitializeFilterIcon::AssociatedFilter' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Magic_FilterIcon_C_InitializeFilterIcon, Design) == 0x000010, "Member 'WBP_ModernMenu_Magic_FilterIcon_C_InitializeFilterIcon::Design' has a wrong offset!");

// Function WBP_ModernMenu_Magic_FilterIcon.WBP_ModernMenu_Magic_FilterIcon_C.SetIsReversed
// 0x0005 (0x0005 - 0x0000)
struct WBP_ModernMenu_Magic_FilterIcon_C_SetIsReversed final
{
public:
	bool                                          IsReversed;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue_1;              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_Magic_FilterIcon_C_SetIsReversed) == 0x000001, "Wrong alignment on WBP_ModernMenu_Magic_FilterIcon_C_SetIsReversed");
static_assert(sizeof(WBP_ModernMenu_Magic_FilterIcon_C_SetIsReversed) == 0x000005, "Wrong size on WBP_ModernMenu_Magic_FilterIcon_C_SetIsReversed");
static_assert(offsetof(WBP_ModernMenu_Magic_FilterIcon_C_SetIsReversed, IsReversed) == 0x000000, "Member 'WBP_ModernMenu_Magic_FilterIcon_C_SetIsReversed::IsReversed' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Magic_FilterIcon_C_SetIsReversed, CallFunc_GetVisibility_ReturnValue) == 0x000001, "Member 'WBP_ModernMenu_Magic_FilterIcon_C_SetIsReversed::CallFunc_GetVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Magic_FilterIcon_C_SetIsReversed, CallFunc_GetVisibility_ReturnValue_1) == 0x000002, "Member 'WBP_ModernMenu_Magic_FilterIcon_C_SetIsReversed::CallFunc_GetVisibility_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Magic_FilterIcon_C_SetIsReversed, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000003, "Member 'WBP_ModernMenu_Magic_FilterIcon_C_SetIsReversed::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Magic_FilterIcon_C_SetIsReversed, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000004, "Member 'WBP_ModernMenu_Magic_FilterIcon_C_SetIsReversed::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");

// Function WBP_ModernMenu_Magic_FilterIcon.WBP_ModernMenu_Magic_FilterIcon_C.SwapArrows
// 0x0002 (0x0002 - 0x0000)
struct WBP_ModernMenu_Magic_FilterIcon_C_SwapArrows final
{
public:
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_Magic_FilterIcon_C_SwapArrows) == 0x000001, "Wrong alignment on WBP_ModernMenu_Magic_FilterIcon_C_SwapArrows");
static_assert(sizeof(WBP_ModernMenu_Magic_FilterIcon_C_SwapArrows) == 0x000002, "Wrong size on WBP_ModernMenu_Magic_FilterIcon_C_SwapArrows");
static_assert(offsetof(WBP_ModernMenu_Magic_FilterIcon_C_SwapArrows, CallFunc_GetVisibility_ReturnValue) == 0x000000, "Member 'WBP_ModernMenu_Magic_FilterIcon_C_SwapArrows::CallFunc_GetVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Magic_FilterIcon_C_SwapArrows, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000001, "Member 'WBP_ModernMenu_Magic_FilterIcon_C_SwapArrows::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function WBP_ModernMenu_Magic_FilterIcon.WBP_ModernMenu_Magic_FilterIcon_C.Toggle Activated State
// 0x0002 (0x0002 - 0x0000)
struct WBP_ModernMenu_Magic_FilterIcon_C_Toggle_Activated_State final
{
public:
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_Magic_FilterIcon_C_Toggle_Activated_State) == 0x000001, "Wrong alignment on WBP_ModernMenu_Magic_FilterIcon_C_Toggle_Activated_State");
static_assert(sizeof(WBP_ModernMenu_Magic_FilterIcon_C_Toggle_Activated_State) == 0x000002, "Wrong size on WBP_ModernMenu_Magic_FilterIcon_C_Toggle_Activated_State");
static_assert(offsetof(WBP_ModernMenu_Magic_FilterIcon_C_Toggle_Activated_State, CallFunc_GetVisibility_ReturnValue) == 0x000000, "Member 'WBP_ModernMenu_Magic_FilterIcon_C_Toggle_Activated_State::CallFunc_GetVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Magic_FilterIcon_C_Toggle_Activated_State, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000001, "Member 'WBP_ModernMenu_Magic_FilterIcon_C_Toggle_Activated_State::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function WBP_ModernMenu_Magic_FilterIcon.WBP_ModernMenu_Magic_FilterIcon_C.UpdateDesign
// 0x0028 (0x0028 - 0x0000)
struct WBP_ModernMenu_Magic_FilterIcon_C_UpdateDesign final
{
public:
	bool                                          ActivatedState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector2D_X;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue_1;              // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_Magic_FilterIcon_C_UpdateDesign) == 0x000008, "Wrong alignment on WBP_ModernMenu_Magic_FilterIcon_C_UpdateDesign");
static_assert(sizeof(WBP_ModernMenu_Magic_FilterIcon_C_UpdateDesign) == 0x000028, "Wrong size on WBP_ModernMenu_Magic_FilterIcon_C_UpdateDesign");
static_assert(offsetof(WBP_ModernMenu_Magic_FilterIcon_C_UpdateDesign, ActivatedState) == 0x000000, "Member 'WBP_ModernMenu_Magic_FilterIcon_C_UpdateDesign::ActivatedState' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Magic_FilterIcon_C_UpdateDesign, Temp_byte_Variable) == 0x000001, "Member 'WBP_ModernMenu_Magic_FilterIcon_C_UpdateDesign::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Magic_FilterIcon_C_UpdateDesign, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_ModernMenu_Magic_FilterIcon_C_UpdateDesign::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Magic_FilterIcon_C_UpdateDesign, CallFunc_BreakVector2D_X) == 0x000008, "Member 'WBP_ModernMenu_Magic_FilterIcon_C_UpdateDesign::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Magic_FilterIcon_C_UpdateDesign, CallFunc_BreakVector2D_Y) == 0x000010, "Member 'WBP_ModernMenu_Magic_FilterIcon_C_UpdateDesign::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Magic_FilterIcon_C_UpdateDesign, CallFunc_FTrunc_ReturnValue) == 0x000018, "Member 'WBP_ModernMenu_Magic_FilterIcon_C_UpdateDesign::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Magic_FilterIcon_C_UpdateDesign, CallFunc_FTrunc_ReturnValue_1) == 0x00001C, "Member 'WBP_ModernMenu_Magic_FilterIcon_C_UpdateDesign::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Magic_FilterIcon_C_UpdateDesign, CallFunc_GetVisibility_ReturnValue) == 0x000020, "Member 'WBP_ModernMenu_Magic_FilterIcon_C_UpdateDesign::CallFunc_GetVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Magic_FilterIcon_C_UpdateDesign, CallFunc_GetVisibility_ReturnValue_1) == 0x000021, "Member 'WBP_ModernMenu_Magic_FilterIcon_C_UpdateDesign::CallFunc_GetVisibility_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Magic_FilterIcon_C_UpdateDesign, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000022, "Member 'WBP_ModernMenu_Magic_FilterIcon_C_UpdateDesign::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Magic_FilterIcon_C_UpdateDesign, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000023, "Member 'WBP_ModernMenu_Magic_FilterIcon_C_UpdateDesign::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Magic_FilterIcon_C_UpdateDesign, Temp_bool_Variable) == 0x000024, "Member 'WBP_ModernMenu_Magic_FilterIcon_C_UpdateDesign::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Magic_FilterIcon_C_UpdateDesign, CallFunc_BooleanAND_ReturnValue) == 0x000025, "Member 'WBP_ModernMenu_Magic_FilterIcon_C_UpdateDesign::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Magic_FilterIcon_C_UpdateDesign, K2Node_Select_Default) == 0x000026, "Member 'WBP_ModernMenu_Magic_FilterIcon_C_UpdateDesign::K2Node_Select_Default' has a wrong offset!");

}

