#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Modern_QuestHistoryCarouselEntry

#include "Basic.hpp"

#include "CommonInput_structs.hpp"
#include "SlateCore_structs.hpp"
#include "EnhancedInput_structs.hpp"


namespace SDK::Params
{

// Function WBP_Modern_QuestHistoryCarouselEntry.WBP_Modern_QuestHistoryCarouselEntry_C.BndEvt__WBP_Modern_QuestHistoryCarouselEntry_HitBox_K2Node_ComponentBoundEvent_1_MouseEventDelegate__DelegateSignature
// 0x00B8 (0x00B8 - 0x0000)
struct WBP_Modern_QuestHistoryCarouselEntry_C_BndEvt__WBP_Modern_QuestHistoryCarouselEntry_HitBox_K2Node_ComponentBoundEvent_1_MouseEventDelegate__DelegateSignature final
{
public:
	class UUserWidget*                            Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              InGeometry;                                        // 0x0008(0x0038)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          InMouseEvent;                                      // 0x0040(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_Modern_QuestHistoryCarouselEntry_C_BndEvt__WBP_Modern_QuestHistoryCarouselEntry_HitBox_K2Node_ComponentBoundEvent_1_MouseEventDelegate__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Modern_QuestHistoryCarouselEntry_C_BndEvt__WBP_Modern_QuestHistoryCarouselEntry_HitBox_K2Node_ComponentBoundEvent_1_MouseEventDelegate__DelegateSignature");
static_assert(sizeof(WBP_Modern_QuestHistoryCarouselEntry_C_BndEvt__WBP_Modern_QuestHistoryCarouselEntry_HitBox_K2Node_ComponentBoundEvent_1_MouseEventDelegate__DelegateSignature) == 0x0000B8, "Wrong size on WBP_Modern_QuestHistoryCarouselEntry_C_BndEvt__WBP_Modern_QuestHistoryCarouselEntry_HitBox_K2Node_ComponentBoundEvent_1_MouseEventDelegate__DelegateSignature");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_BndEvt__WBP_Modern_QuestHistoryCarouselEntry_HitBox_K2Node_ComponentBoundEvent_1_MouseEventDelegate__DelegateSignature, Target) == 0x000000, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_BndEvt__WBP_Modern_QuestHistoryCarouselEntry_HitBox_K2Node_ComponentBoundEvent_1_MouseEventDelegate__DelegateSignature::Target' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_BndEvt__WBP_Modern_QuestHistoryCarouselEntry_HitBox_K2Node_ComponentBoundEvent_1_MouseEventDelegate__DelegateSignature, InGeometry) == 0x000008, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_BndEvt__WBP_Modern_QuestHistoryCarouselEntry_HitBox_K2Node_ComponentBoundEvent_1_MouseEventDelegate__DelegateSignature::InGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_BndEvt__WBP_Modern_QuestHistoryCarouselEntry_HitBox_K2Node_ComponentBoundEvent_1_MouseEventDelegate__DelegateSignature, InMouseEvent) == 0x000040, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_BndEvt__WBP_Modern_QuestHistoryCarouselEntry_HitBox_K2Node_ComponentBoundEvent_1_MouseEventDelegate__DelegateSignature::InMouseEvent' has a wrong offset!");

// Function WBP_Modern_QuestHistoryCarouselEntry.WBP_Modern_QuestHistoryCarouselEntry_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_Modern_QuestHistoryCarouselEntry_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected_0;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_QuestHistoryCarouselEntry_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong alignment on WBP_Modern_QuestHistoryCarouselEntry_C_BP_OnItemSelectionChanged");
static_assert(sizeof(WBP_Modern_QuestHistoryCarouselEntry_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong size on WBP_Modern_QuestHistoryCarouselEntry_C_BP_OnItemSelectionChanged");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_BP_OnItemSelectionChanged, bIsSelected_0) == 0x000000, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_BP_OnItemSelectionChanged::bIsSelected_0' has a wrong offset!");

// Function WBP_Modern_QuestHistoryCarouselEntry.WBP_Modern_QuestHistoryCarouselEntry_C.ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry
// 0x02B0 (0x02B0 - 0x0000)
struct WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_ComponentBoundEvent_Target;                 // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_ComponentBoundEvent_InGeometry;             // 0x0020(0x0038)(ConstParm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_ComponentBoundEvent_InMouseEvent;           // 0x0058(0x0078)(ConstParm)
	double                                        Temp_real_Variable;                                // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue; // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate;            // 0x00E8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_1;                              // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVLegacyMapMenuQuestCarouselItem*       K2Node_DynamicCast_AsVLegacy_Map_Menu_Quest_Carousel_Item; // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12A[0x6];                                      // 0x012A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default;                             // 0x0130(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UListViewBase*                          CallFunc_GetOwningListView_ReturnValue;            // 0x0138(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UListView*                              K2Node_DynamicCast_AsList_View;                    // 0x0140(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14A[0x6];                                      // 0x014A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAltarUISubsystem*                     CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_158[0x8];                                      // 0x0158(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_TryGetBrushFromKey_OutBrush;              // 0x0160(0x00D0)()
	int32                                         CallFunc_GetIndexForItem_ReturnValue;              // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               K2Node_DynamicCast_AsTexture;                      // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_2;                              // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetIndexForItem_ReturnValue_1;            // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_254[0x4];                                      // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           Temp_object_Variable;                              // 0x0258(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue;       // 0x0260(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime;       // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime;     // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction;      // 0x0288(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2_0;                            // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1_0;                            // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_InputActionValueToAxis1D_ReturnValue; // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry) == 0x000010, "Wrong alignment on WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry");
static_assert(sizeof(WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry) == 0x0002B0, "Wrong size on WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry, EntryPoint) == 0x000000, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry, Temp_bool_Variable) == 0x000004, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000008, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry, CallFunc_GetCurrentInputType_ReturnValue) == 0x000010, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry, K2Node_ComponentBoundEvent_Target) == 0x000018, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry::K2Node_ComponentBoundEvent_Target' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry, K2Node_ComponentBoundEvent_InGeometry) == 0x000020, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry::K2Node_ComponentBoundEvent_InGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry, K2Node_ComponentBoundEvent_InMouseEvent) == 0x000058, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry::K2Node_ComponentBoundEvent_InMouseEvent' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry, Temp_real_Variable) == 0x0000D0, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry, CallFunc_GetPlayerController_ReturnValue) == 0x0000D8, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry, CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue) == 0x0000E0, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry::CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry, K2Node_CreateDelegate_OutputDelegate) == 0x0000E8, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry, K2Node_Event_IsDesignTime) == 0x0000F8, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry, Temp_real_Variable_1) == 0x000100, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry, K2Node_Event_ListItemObject) == 0x000108, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry::K2Node_Event_ListItemObject' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry, K2Node_DynamicCast_AsVLegacy_Map_Menu_Quest_Carousel_Item) == 0x000110, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry::K2Node_DynamicCast_AsVLegacy_Map_Menu_Quest_Carousel_Item' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry, K2Node_DynamicCast_bSuccess) == 0x000118, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000120, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry, K2Node_Event_bIsSelected) == 0x000128, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry::K2Node_Event_bIsSelected' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry, CallFunc_Not_PreBool_ReturnValue) == 0x000129, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry, K2Node_Select_Default) == 0x000130, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry, CallFunc_GetOwningListView_ReturnValue) == 0x000138, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry::CallFunc_GetOwningListView_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry, K2Node_DynamicCast_AsList_View) == 0x000140, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry::K2Node_DynamicCast_AsList_View' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry, K2Node_DynamicCast_bSuccess_1) == 0x000148, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry, CallFunc_IsValid_ReturnValue) == 0x000149, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000150, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry, CallFunc_TryGetBrushFromKey_OutBrush) == 0x000160, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry::CallFunc_TryGetBrushFromKey_OutBrush' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry, CallFunc_GetIndexForItem_ReturnValue) == 0x000230, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry::CallFunc_GetIndexForItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry, K2Node_DynamicCast_AsTexture) == 0x000238, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry::K2Node_DynamicCast_AsTexture' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry, K2Node_DynamicCast_bSuccess_2) == 0x000240, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry, Temp_real_Variable_2) == 0x000248, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry, CallFunc_GetIndexForItem_ReturnValue_1) == 0x000250, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry::CallFunc_GetIndexForItem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry, Temp_object_Variable) == 0x000258, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry, K2Node_EnhancedInputActionEvent_ActionValue) == 0x000260, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry::K2Node_EnhancedInputActionEvent_ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry, K2Node_EnhancedInputActionEvent_ElapsedTime) == 0x000280, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry::K2Node_EnhancedInputActionEvent_ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry, K2Node_EnhancedInputActionEvent_TriggeredTime) == 0x000284, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry::K2Node_EnhancedInputActionEvent_TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry, K2Node_EnhancedInputActionEvent_SourceAction) == 0x000288, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry::K2Node_EnhancedInputActionEvent_SourceAction' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry, Temp_real_Variable_2_0) == 0x000290, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry::Temp_real_Variable_2_0' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry, Temp_real_Variable_1_0) == 0x000298, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry::Temp_real_Variable_1_0' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry, CallFunc_Conv_InputActionValueToAxis1D_ReturnValue) == 0x0002A0, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry::CallFunc_Conv_InputActionValueToAxis1D_ReturnValue' has a wrong offset!");

// Function WBP_Modern_QuestHistoryCarouselEntry.WBP_Modern_QuestHistoryCarouselEntry_C.InpActEvt_IA_UI_Specific_QuestMenu_ScrollHistoric_K2Node_EnhancedInputActionEvent_0
// 0x0030 (0x0030 - 0x0000)
struct WBP_Modern_QuestHistoryCarouselEntry_C_InpActEvt_IA_UI_Specific_QuestMenu_ScrollHistoric_K2Node_EnhancedInputActionEvent_0 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_QuestHistoryCarouselEntry_C_InpActEvt_IA_UI_Specific_QuestMenu_ScrollHistoric_K2Node_EnhancedInputActionEvent_0) == 0x000008, "Wrong alignment on WBP_Modern_QuestHistoryCarouselEntry_C_InpActEvt_IA_UI_Specific_QuestMenu_ScrollHistoric_K2Node_EnhancedInputActionEvent_0");
static_assert(sizeof(WBP_Modern_QuestHistoryCarouselEntry_C_InpActEvt_IA_UI_Specific_QuestMenu_ScrollHistoric_K2Node_EnhancedInputActionEvent_0) == 0x000030, "Wrong size on WBP_Modern_QuestHistoryCarouselEntry_C_InpActEvt_IA_UI_Specific_QuestMenu_ScrollHistoric_K2Node_EnhancedInputActionEvent_0");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_InpActEvt_IA_UI_Specific_QuestMenu_ScrollHistoric_K2Node_EnhancedInputActionEvent_0, ActionValue) == 0x000000, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_InpActEvt_IA_UI_Specific_QuestMenu_ScrollHistoric_K2Node_EnhancedInputActionEvent_0::ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_InpActEvt_IA_UI_Specific_QuestMenu_ScrollHistoric_K2Node_EnhancedInputActionEvent_0, ElapsedTime) == 0x000020, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_InpActEvt_IA_UI_Specific_QuestMenu_ScrollHistoric_K2Node_EnhancedInputActionEvent_0::ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_InpActEvt_IA_UI_Specific_QuestMenu_ScrollHistoric_K2Node_EnhancedInputActionEvent_0, TriggeredTime) == 0x000024, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_InpActEvt_IA_UI_Specific_QuestMenu_ScrollHistoric_K2Node_EnhancedInputActionEvent_0::TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_InpActEvt_IA_UI_Specific_QuestMenu_ScrollHistoric_K2Node_EnhancedInputActionEvent_0, SourceAction) == 0x000028, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_InpActEvt_IA_UI_Specific_QuestMenu_ScrollHistoric_K2Node_EnhancedInputActionEvent_0::SourceAction' has a wrong offset!");

// Function WBP_Modern_QuestHistoryCarouselEntry.WBP_Modern_QuestHistoryCarouselEntry_C.OnInputMethodChange
// 0x0028 (0x0028 - 0x0000)
struct WBP_Modern_QuestHistoryCarouselEntry_C_OnInputMethodChange final
{
public:
	ECommonInputType                              NewInputType;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_2;                              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_3;                              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue_1;                // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_QuestHistoryCarouselEntry_C_OnInputMethodChange) == 0x000008, "Wrong alignment on WBP_Modern_QuestHistoryCarouselEntry_C_OnInputMethodChange");
static_assert(sizeof(WBP_Modern_QuestHistoryCarouselEntry_C_OnInputMethodChange) == 0x000028, "Wrong size on WBP_Modern_QuestHistoryCarouselEntry_C_OnInputMethodChange");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_OnInputMethodChange, NewInputType) == 0x000000, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_OnInputMethodChange::NewInputType' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_OnInputMethodChange, Temp_byte_Variable) == 0x000001, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_OnInputMethodChange::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_OnInputMethodChange, Temp_real_Variable) == 0x000004, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_OnInputMethodChange::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_OnInputMethodChange, Temp_real_Variable_1) == 0x000008, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_OnInputMethodChange::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_OnInputMethodChange, Temp_real_Variable_2) == 0x00000C, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_OnInputMethodChange::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_OnInputMethodChange, Temp_real_Variable_3) == 0x000010, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_OnInputMethodChange::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_OnInputMethodChange, CallFunc_TextIsEmpty_ReturnValue) == 0x000014, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_OnInputMethodChange::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_OnInputMethodChange, CallFunc_Not_PreBool_ReturnValue) == 0x000015, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_OnInputMethodChange::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_OnInputMethodChange, CallFunc_TextIsEmpty_ReturnValue_1) == 0x000016, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_OnInputMethodChange::CallFunc_TextIsEmpty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_OnInputMethodChange, CallFunc_Not_PreBool_ReturnValue_1) == 0x000017, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_OnInputMethodChange::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_OnInputMethodChange, CallFunc_BooleanAND_ReturnValue) == 0x000018, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_OnInputMethodChange::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_OnInputMethodChange, K2Node_SwitchEnum_CmpSuccess) == 0x000019, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_OnInputMethodChange::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_OnInputMethodChange, K2Node_Select_Default) == 0x00001C, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_OnInputMethodChange::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_OnInputMethodChange, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000020, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_OnInputMethodChange::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function WBP_Modern_QuestHistoryCarouselEntry.WBP_Modern_QuestHistoryCarouselEntry_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct WBP_Modern_QuestHistoryCarouselEntry_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_QuestHistoryCarouselEntry_C_OnListItemObjectSet) == 0x000008, "Wrong alignment on WBP_Modern_QuestHistoryCarouselEntry_C_OnListItemObjectSet");
static_assert(sizeof(WBP_Modern_QuestHistoryCarouselEntry_C_OnListItemObjectSet) == 0x000008, "Wrong size on WBP_Modern_QuestHistoryCarouselEntry_C_OnListItemObjectSet");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_OnListItemObjectSet, ListItemObject) == 0x000000, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_OnListItemObjectSet::ListItemObject' has a wrong offset!");

// Function WBP_Modern_QuestHistoryCarouselEntry.WBP_Modern_QuestHistoryCarouselEntry_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Modern_QuestHistoryCarouselEntry_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_QuestHistoryCarouselEntry_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_Modern_QuestHistoryCarouselEntry_C_PreConstruct");
static_assert(sizeof(WBP_Modern_QuestHistoryCarouselEntry_C_PreConstruct) == 0x000001, "Wrong size on WBP_Modern_QuestHistoryCarouselEntry_C_PreConstruct");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_Modern_QuestHistoryCarouselEntry.WBP_Modern_QuestHistoryCarouselEntry_C.ScrollBody
// 0x0048 (0x0048 - 0x0000)
struct WBP_Modern_QuestHistoryCarouselEntry_C_ScrollBody final
{
public:
	double                                        ScrollDelta;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Local_NewOffset;                                   // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScrollOffsetOfEnd_ReturnValue;         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScrollOffset_ReturnValue;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_Max_ImplicitCast;                  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScrollOffset_NewScrollOffset_ImplicitCast; // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_QuestHistoryCarouselEntry_C_ScrollBody) == 0x000008, "Wrong alignment on WBP_Modern_QuestHistoryCarouselEntry_C_ScrollBody");
static_assert(sizeof(WBP_Modern_QuestHistoryCarouselEntry_C_ScrollBody) == 0x000048, "Wrong size on WBP_Modern_QuestHistoryCarouselEntry_C_ScrollBody");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_ScrollBody, ScrollDelta) == 0x000000, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_ScrollBody::ScrollDelta' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_ScrollBody, Local_NewOffset) == 0x000008, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_ScrollBody::Local_NewOffset' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_ScrollBody, CallFunc_GetScrollOffsetOfEnd_ReturnValue) == 0x000010, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_ScrollBody::CallFunc_GetScrollOffsetOfEnd_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_ScrollBody, CallFunc_GetScrollOffset_ReturnValue) == 0x000014, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_ScrollBody::CallFunc_GetScrollOffset_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_ScrollBody, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000018, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_ScrollBody::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_ScrollBody, CallFunc_FClamp_ReturnValue) == 0x000020, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_ScrollBody::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_ScrollBody, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000028, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_ScrollBody::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_ScrollBody, CallFunc_FClamp_Max_ImplicitCast) == 0x000030, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_ScrollBody::CallFunc_FClamp_Max_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_ScrollBody, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000038, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_ScrollBody::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_ScrollBody, CallFunc_SetScrollOffset_NewScrollOffset_ImplicitCast) == 0x000040, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_ScrollBody::CallFunc_SetScrollOffset_NewScrollOffset_ImplicitCast' has a wrong offset!");

// Function WBP_Modern_QuestHistoryCarouselEntry.WBP_Modern_QuestHistoryCarouselEntry_C.UpdateBackgroundIndicator
// 0x0008 (0x0008 - 0x0000)
struct WBP_Modern_QuestHistoryCarouselEntry_C_UpdateBackgroundIndicator final
{
public:
	bool                                          NewBackgroundState;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast;  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_QuestHistoryCarouselEntry_C_UpdateBackgroundIndicator) == 0x000004, "Wrong alignment on WBP_Modern_QuestHistoryCarouselEntry_C_UpdateBackgroundIndicator");
static_assert(sizeof(WBP_Modern_QuestHistoryCarouselEntry_C_UpdateBackgroundIndicator) == 0x000008, "Wrong size on WBP_Modern_QuestHistoryCarouselEntry_C_UpdateBackgroundIndicator");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_UpdateBackgroundIndicator, NewBackgroundState) == 0x000000, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_UpdateBackgroundIndicator::NewBackgroundState' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_UpdateBackgroundIndicator, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast) == 0x000004, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_UpdateBackgroundIndicator::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast' has a wrong offset!");

// Function WBP_Modern_QuestHistoryCarouselEntry.WBP_Modern_QuestHistoryCarouselEntry_C.UpdateBoldness
// 0x00B8 (0x00B8 - 0x0000)
struct WBP_Modern_QuestHistoryCarouselEntry_C_UpdateBoldness final
{
public:
	bool                                          NewIsFocus;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         K2Node_Select_Default;                             // 0x0008(0x0058)(HasGetValueTypeHash)
	struct FSlateFontInfo                         K2Node_Select_Default_1;                           // 0x0060(0x0058)(HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_QuestHistoryCarouselEntry_C_UpdateBoldness) == 0x000008, "Wrong alignment on WBP_Modern_QuestHistoryCarouselEntry_C_UpdateBoldness");
static_assert(sizeof(WBP_Modern_QuestHistoryCarouselEntry_C_UpdateBoldness) == 0x0000B8, "Wrong size on WBP_Modern_QuestHistoryCarouselEntry_C_UpdateBoldness");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_UpdateBoldness, NewIsFocus) == 0x000000, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_UpdateBoldness::NewIsFocus' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_UpdateBoldness, Temp_bool_Variable) == 0x000001, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_UpdateBoldness::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_UpdateBoldness, Temp_bool_Variable_1) == 0x000002, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_UpdateBoldness::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_UpdateBoldness, K2Node_Select_Default) == 0x000008, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_UpdateBoldness::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_UpdateBoldness, K2Node_Select_Default_1) == 0x000060, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_UpdateBoldness::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_Modern_QuestHistoryCarouselEntry.WBP_Modern_QuestHistoryCarouselEntry_C.UpdateEntry
// 0x0002 (0x0002 - 0x0000)
struct WBP_Modern_QuestHistoryCarouselEntry_C_UpdateEntry final
{
public:
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_QuestHistoryCarouselEntry_C_UpdateEntry) == 0x000001, "Wrong alignment on WBP_Modern_QuestHistoryCarouselEntry_C_UpdateEntry");
static_assert(sizeof(WBP_Modern_QuestHistoryCarouselEntry_C_UpdateEntry) == 0x000002, "Wrong size on WBP_Modern_QuestHistoryCarouselEntry_C_UpdateEntry");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_UpdateEntry, CallFunc_Not_PreBool_ReturnValue) == 0x000000, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_UpdateEntry::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_UpdateEntry, CallFunc_Not_PreBool_ReturnValue_1) == 0x000001, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_UpdateEntry::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");

// Function WBP_Modern_QuestHistoryCarouselEntry.WBP_Modern_QuestHistoryCarouselEntry_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct WBP_Modern_QuestHistoryCarouselEntry_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_QuestHistoryCarouselEntry_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_Modern_QuestHistoryCarouselEntry_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_Modern_QuestHistoryCarouselEntry_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong size on WBP_Modern_QuestHistoryCarouselEntry_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_Modern_QuestHistoryCarouselEntry_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_Modern_QuestHistoryCarouselEntry_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");

}

