#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PhysicsControllableEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Altar_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PhysicsControllableEntry.WBP_PhysicsControllableEntry_C
// 0x0018 (0x02E8 - 0x02D0)
class UWBP_PhysicsControllableEntry_C final : public UNavigationListviewEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 BackgroundImage;                                   // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PhysicsControllableNameText;                       // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void ExecuteUbergraph_WBP_PhysicsControllableEntry(int32 EntryPoint);
	void OnListItemObjectSet(class UObject* ListItemObject);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PhysicsControllableEntry_C">();
	}
	static class UWBP_PhysicsControllableEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PhysicsControllableEntry_C>();
	}
};
static_assert(alignof(UWBP_PhysicsControllableEntry_C) == 0x000008, "Wrong alignment on UWBP_PhysicsControllableEntry_C");
static_assert(sizeof(UWBP_PhysicsControllableEntry_C) == 0x0002E8, "Wrong size on UWBP_PhysicsControllableEntry_C");
static_assert(offsetof(UWBP_PhysicsControllableEntry_C, UberGraphFrame) == 0x0002D0, "Member 'UWBP_PhysicsControllableEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PhysicsControllableEntry_C, BackgroundImage) == 0x0002D8, "Member 'UWBP_PhysicsControllableEntry_C::BackgroundImage' has a wrong offset!");
static_assert(offsetof(UWBP_PhysicsControllableEntry_C, PhysicsControllableNameText) == 0x0002E0, "Member 'UWBP_PhysicsControllableEntry_C::PhysicsControllableNameText' has a wrong offset!");

}

