#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Modern_Menu_Player_Header

#include "Basic.hpp"

#include "Altar_structs.hpp"


namespace SDK::Params
{

// Function WBP_Modern_Menu_Player_Header.WBP_Modern_Menu_Player_Header_C.Binding
// 0x0018 (0x0018 - 0x0000)
struct WBP_Modern_Menu_Player_Header_C_Binding final
{
public:
	TDelegate<void(class UVNavigableInputKeySelector* Target, bool NewState)> K2Node_CreateDelegate_OutputDelegate; // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVRebindGlobalSubsystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Menu_Player_Header_C_Binding) == 0x000008, "Wrong alignment on WBP_Modern_Menu_Player_Header_C_Binding");
static_assert(sizeof(WBP_Modern_Menu_Player_Header_C_Binding) == 0x000018, "Wrong size on WBP_Modern_Menu_Player_Header_C_Binding");
static_assert(offsetof(WBP_Modern_Menu_Player_Header_C_Binding, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_Modern_Menu_Player_Header_C_Binding::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Header_C_Binding, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000010, "Member 'WBP_Modern_Menu_Player_Header_C_Binding::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");

// Function WBP_Modern_Menu_Player_Header.WBP_Modern_Menu_Player_Header_C.BndEvt__WBP_Modern_Menu_Player_Header_character_tab_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Modern_Menu_Player_Header_C_BndEvt__WBP_Modern_Menu_Player_Header_character_tab_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Menu_Player_Header_C_BndEvt__WBP_Modern_Menu_Player_Header_character_tab_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Modern_Menu_Player_Header_C_BndEvt__WBP_Modern_Menu_Player_Header_character_tab_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_Modern_Menu_Player_Header_C_BndEvt__WBP_Modern_Menu_Player_Header_character_tab_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Modern_Menu_Player_Header_C_BndEvt__WBP_Modern_Menu_Player_Header_character_tab_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_Modern_Menu_Player_Header_C_BndEvt__WBP_Modern_Menu_Player_Header_character_tab_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_Modern_Menu_Player_Header_C_BndEvt__WBP_Modern_Menu_Player_Header_character_tab_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_Modern_Menu_Player_Header.WBP_Modern_Menu_Player_Header_C.BndEvt__WBP_Modern_Menu_Player_Header_codex_tab_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Modern_Menu_Player_Header_C_BndEvt__WBP_Modern_Menu_Player_Header_codex_tab_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Menu_Player_Header_C_BndEvt__WBP_Modern_Menu_Player_Header_codex_tab_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Modern_Menu_Player_Header_C_BndEvt__WBP_Modern_Menu_Player_Header_codex_tab_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_Modern_Menu_Player_Header_C_BndEvt__WBP_Modern_Menu_Player_Header_codex_tab_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Modern_Menu_Player_Header_C_BndEvt__WBP_Modern_Menu_Player_Header_codex_tab_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_Modern_Menu_Player_Header_C_BndEvt__WBP_Modern_Menu_Player_Header_codex_tab_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_Modern_Menu_Player_Header_C_BndEvt__WBP_Modern_Menu_Player_Header_codex_tab_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_Modern_Menu_Player_Header.WBP_Modern_Menu_Player_Header_C.BndEvt__WBP_Modern_Menu_Player_Header_inventory_tab_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Modern_Menu_Player_Header_C_BndEvt__WBP_Modern_Menu_Player_Header_inventory_tab_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Menu_Player_Header_C_BndEvt__WBP_Modern_Menu_Player_Header_inventory_tab_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Modern_Menu_Player_Header_C_BndEvt__WBP_Modern_Menu_Player_Header_inventory_tab_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_Modern_Menu_Player_Header_C_BndEvt__WBP_Modern_Menu_Player_Header_inventory_tab_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Modern_Menu_Player_Header_C_BndEvt__WBP_Modern_Menu_Player_Header_inventory_tab_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_Modern_Menu_Player_Header_C_BndEvt__WBP_Modern_Menu_Player_Header_inventory_tab_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_Modern_Menu_Player_Header_C_BndEvt__WBP_Modern_Menu_Player_Header_inventory_tab_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_Modern_Menu_Player_Header.WBP_Modern_Menu_Player_Header_C.BndEvt__WBP_Modern_Menu_Player_Header_magic_tab_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Modern_Menu_Player_Header_C_BndEvt__WBP_Modern_Menu_Player_Header_magic_tab_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Menu_Player_Header_C_BndEvt__WBP_Modern_Menu_Player_Header_magic_tab_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Modern_Menu_Player_Header_C_BndEvt__WBP_Modern_Menu_Player_Header_magic_tab_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_Modern_Menu_Player_Header_C_BndEvt__WBP_Modern_Menu_Player_Header_magic_tab_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Modern_Menu_Player_Header_C_BndEvt__WBP_Modern_Menu_Player_Header_magic_tab_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_Modern_Menu_Player_Header_C_BndEvt__WBP_Modern_Menu_Player_Header_magic_tab_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_Modern_Menu_Player_Header_C_BndEvt__WBP_Modern_Menu_Player_Header_magic_tab_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_Modern_Menu_Player_Header.WBP_Modern_Menu_Player_Header_C.BndEvt__WBP_Modern_Menu_Player_Header_map_tab_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Modern_Menu_Player_Header_C_BndEvt__WBP_Modern_Menu_Player_Header_map_tab_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Menu_Player_Header_C_BndEvt__WBP_Modern_Menu_Player_Header_map_tab_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Modern_Menu_Player_Header_C_BndEvt__WBP_Modern_Menu_Player_Header_map_tab_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_Modern_Menu_Player_Header_C_BndEvt__WBP_Modern_Menu_Player_Header_map_tab_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Modern_Menu_Player_Header_C_BndEvt__WBP_Modern_Menu_Player_Header_map_tab_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_Modern_Menu_Player_Header_C_BndEvt__WBP_Modern_Menu_Player_Header_map_tab_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_Modern_Menu_Player_Header_C_BndEvt__WBP_Modern_Menu_Player_Header_map_tab_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_Modern_Menu_Player_Header.WBP_Modern_Menu_Player_Header_C.BndEvt__WBP_Modern_Menu_Player_Header_quest_tab_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Modern_Menu_Player_Header_C_BndEvt__WBP_Modern_Menu_Player_Header_quest_tab_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Menu_Player_Header_C_BndEvt__WBP_Modern_Menu_Player_Header_quest_tab_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Modern_Menu_Player_Header_C_BndEvt__WBP_Modern_Menu_Player_Header_quest_tab_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_Modern_Menu_Player_Header_C_BndEvt__WBP_Modern_Menu_Player_Header_quest_tab_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Modern_Menu_Player_Header_C_BndEvt__WBP_Modern_Menu_Player_Header_quest_tab_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_Modern_Menu_Player_Header_C_BndEvt__WBP_Modern_Menu_Player_Header_quest_tab_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_Modern_Menu_Player_Header_C_BndEvt__WBP_Modern_Menu_Player_Header_quest_tab_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_Modern_Menu_Player_Header.WBP_Modern_Menu_Player_Header_C.BndEvt__WBP_Modern_Menu_Player_Header_system_tab_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Modern_Menu_Player_Header_C_BndEvt__WBP_Modern_Menu_Player_Header_system_tab_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Menu_Player_Header_C_BndEvt__WBP_Modern_Menu_Player_Header_system_tab_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Modern_Menu_Player_Header_C_BndEvt__WBP_Modern_Menu_Player_Header_system_tab_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_Modern_Menu_Player_Header_C_BndEvt__WBP_Modern_Menu_Player_Header_system_tab_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Modern_Menu_Player_Header_C_BndEvt__WBP_Modern_Menu_Player_Header_system_tab_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_Modern_Menu_Player_Header_C_BndEvt__WBP_Modern_Menu_Player_Header_system_tab_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_Modern_Menu_Player_Header_C_BndEvt__WBP_Modern_Menu_Player_Header_system_tab_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_Modern_Menu_Player_Header.WBP_Modern_Menu_Player_Header_C.DisableInteractionOnListenningForRebind
// 0x0010 (0x0010 - 0x0000)
struct WBP_Modern_Menu_Player_Header_C_DisableInteractionOnListenningForRebind final
{
public:
	class UVNavigableInputKeySelector*            Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          NewState;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Menu_Player_Header_C_DisableInteractionOnListenningForRebind) == 0x000008, "Wrong alignment on WBP_Modern_Menu_Player_Header_C_DisableInteractionOnListenningForRebind");
static_assert(sizeof(WBP_Modern_Menu_Player_Header_C_DisableInteractionOnListenningForRebind) == 0x000010, "Wrong size on WBP_Modern_Menu_Player_Header_C_DisableInteractionOnListenningForRebind");
static_assert(offsetof(WBP_Modern_Menu_Player_Header_C_DisableInteractionOnListenningForRebind, Target) == 0x000000, "Member 'WBP_Modern_Menu_Player_Header_C_DisableInteractionOnListenningForRebind::Target' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Header_C_DisableInteractionOnListenningForRebind, NewState) == 0x000008, "Member 'WBP_Modern_Menu_Player_Header_C_DisableInteractionOnListenningForRebind::NewState' has a wrong offset!");

// Function WBP_Modern_Menu_Player_Header.WBP_Modern_Menu_Player_Header_C.ExecuteUbergraph_WBP_Modern_Menu_Player_Header
// 0x0050 (0x0050 - 0x0000)
struct WBP_Modern_Menu_Player_Header_C_ExecuteUbergraph_WBP_Modern_Menu_Player_Header final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_6;               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_5;               // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_4;               // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_3;               // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_2;               // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVNavigableInputKeySelector*            K2Node_CustomEvent_Target;                         // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_NewState;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Menu_Player_Header_C_ExecuteUbergraph_WBP_Modern_Menu_Player_Header) == 0x000008, "Wrong alignment on WBP_Modern_Menu_Player_Header_C_ExecuteUbergraph_WBP_Modern_Menu_Player_Header");
static_assert(sizeof(WBP_Modern_Menu_Player_Header_C_ExecuteUbergraph_WBP_Modern_Menu_Player_Header) == 0x000050, "Wrong size on WBP_Modern_Menu_Player_Header_C_ExecuteUbergraph_WBP_Modern_Menu_Player_Header");
static_assert(offsetof(WBP_Modern_Menu_Player_Header_C_ExecuteUbergraph_WBP_Modern_Menu_Player_Header, EntryPoint) == 0x000000, "Member 'WBP_Modern_Menu_Player_Header_C_ExecuteUbergraph_WBP_Modern_Menu_Player_Header::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Header_C_ExecuteUbergraph_WBP_Modern_Menu_Player_Header, K2Node_ComponentBoundEvent_Button_6) == 0x000008, "Member 'WBP_Modern_Menu_Player_Header_C_ExecuteUbergraph_WBP_Modern_Menu_Player_Header::K2Node_ComponentBoundEvent_Button_6' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Header_C_ExecuteUbergraph_WBP_Modern_Menu_Player_Header, K2Node_ComponentBoundEvent_Button_5) == 0x000010, "Member 'WBP_Modern_Menu_Player_Header_C_ExecuteUbergraph_WBP_Modern_Menu_Player_Header::K2Node_ComponentBoundEvent_Button_5' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Header_C_ExecuteUbergraph_WBP_Modern_Menu_Player_Header, K2Node_ComponentBoundEvent_Button_4) == 0x000018, "Member 'WBP_Modern_Menu_Player_Header_C_ExecuteUbergraph_WBP_Modern_Menu_Player_Header::K2Node_ComponentBoundEvent_Button_4' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Header_C_ExecuteUbergraph_WBP_Modern_Menu_Player_Header, K2Node_ComponentBoundEvent_Button_3) == 0x000020, "Member 'WBP_Modern_Menu_Player_Header_C_ExecuteUbergraph_WBP_Modern_Menu_Player_Header::K2Node_ComponentBoundEvent_Button_3' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Header_C_ExecuteUbergraph_WBP_Modern_Menu_Player_Header, K2Node_ComponentBoundEvent_Button_2) == 0x000028, "Member 'WBP_Modern_Menu_Player_Header_C_ExecuteUbergraph_WBP_Modern_Menu_Player_Header::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Header_C_ExecuteUbergraph_WBP_Modern_Menu_Player_Header, K2Node_ComponentBoundEvent_Button_1) == 0x000030, "Member 'WBP_Modern_Menu_Player_Header_C_ExecuteUbergraph_WBP_Modern_Menu_Player_Header::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Header_C_ExecuteUbergraph_WBP_Modern_Menu_Player_Header, K2Node_ComponentBoundEvent_Button) == 0x000038, "Member 'WBP_Modern_Menu_Player_Header_C_ExecuteUbergraph_WBP_Modern_Menu_Player_Header::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Header_C_ExecuteUbergraph_WBP_Modern_Menu_Player_Header, K2Node_CustomEvent_Target) == 0x000040, "Member 'WBP_Modern_Menu_Player_Header_C_ExecuteUbergraph_WBP_Modern_Menu_Player_Header::K2Node_CustomEvent_Target' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Header_C_ExecuteUbergraph_WBP_Modern_Menu_Player_Header, K2Node_CustomEvent_NewState) == 0x000048, "Member 'WBP_Modern_Menu_Player_Header_C_ExecuteUbergraph_WBP_Modern_Menu_Player_Header::K2Node_CustomEvent_NewState' has a wrong offset!");

// Function WBP_Modern_Menu_Player_Header.WBP_Modern_Menu_Player_Header_C.Reset
// 0x0040 (0x0040 - 0x0000)
struct WBP_Modern_Menu_Player_Header_C_Reset final
{
public:
	class UWBP_ModernPrefab_FocusButton_Header_C* Local_CurrentTab;                                  // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWBP_ModernPrefab_FocusButton_Header_C*> K2Node_MakeArray_Array;                    // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ModernPrefab_FocusButton_Header_C* CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Menu_Player_Header_C_Reset) == 0x000008, "Wrong alignment on WBP_Modern_Menu_Player_Header_C_Reset");
static_assert(sizeof(WBP_Modern_Menu_Player_Header_C_Reset) == 0x000040, "Wrong size on WBP_Modern_Menu_Player_Header_C_Reset");
static_assert(offsetof(WBP_Modern_Menu_Player_Header_C_Reset, Local_CurrentTab) == 0x000000, "Member 'WBP_Modern_Menu_Player_Header_C_Reset::Local_CurrentTab' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Header_C_Reset, Temp_int_Array_Index_Variable) == 0x000008, "Member 'WBP_Modern_Menu_Player_Header_C_Reset::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Header_C_Reset, CallFunc_IsValid_ReturnValue) == 0x00000C, "Member 'WBP_Modern_Menu_Player_Header_C_Reset::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Header_C_Reset, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'WBP_Modern_Menu_Player_Header_C_Reset::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Header_C_Reset, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'WBP_Modern_Menu_Player_Header_C_Reset::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Header_C_Reset, K2Node_MakeArray_Array) == 0x000018, "Member 'WBP_Modern_Menu_Player_Header_C_Reset::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Header_C_Reset, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'WBP_Modern_Menu_Player_Header_C_Reset::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Header_C_Reset, CallFunc_Array_Get_Item) == 0x000030, "Member 'WBP_Modern_Menu_Player_Header_C_Reset::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Header_C_Reset, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'WBP_Modern_Menu_Player_Header_C_Reset::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_Modern_Menu_Player_Header.WBP_Modern_Menu_Player_Header_C.SelectPage
// 0x0018 (0x0018 - 0x0000)
struct WBP_Modern_Menu_Player_Header_C_SelectPage final
{
public:
	ELegacyPlayerMenuPage                         NewPage;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Local_IsCurrentTabValid;                           // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELegacyPlayerMenuPage                         Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ModernPrefab_FocusButton_Header_C* K2Node_Select_Default;                             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Menu_Player_Header_C_SelectPage) == 0x000008, "Wrong alignment on WBP_Modern_Menu_Player_Header_C_SelectPage");
static_assert(sizeof(WBP_Modern_Menu_Player_Header_C_SelectPage) == 0x000018, "Wrong size on WBP_Modern_Menu_Player_Header_C_SelectPage");
static_assert(offsetof(WBP_Modern_Menu_Player_Header_C_SelectPage, NewPage) == 0x000000, "Member 'WBP_Modern_Menu_Player_Header_C_SelectPage::NewPage' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Header_C_SelectPage, Local_IsCurrentTabValid) == 0x000001, "Member 'WBP_Modern_Menu_Player_Header_C_SelectPage::Local_IsCurrentTabValid' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Header_C_SelectPage, CallFunc_Not_PreBool_ReturnValue) == 0x000002, "Member 'WBP_Modern_Menu_Player_Header_C_SelectPage::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Header_C_SelectPage, CallFunc_Not_PreBool_ReturnValue_1) == 0x000003, "Member 'WBP_Modern_Menu_Player_Header_C_SelectPage::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Header_C_SelectPage, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'WBP_Modern_Menu_Player_Header_C_SelectPage::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Header_C_SelectPage, Temp_byte_Variable) == 0x000005, "Member 'WBP_Modern_Menu_Player_Header_C_SelectPage::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Header_C_SelectPage, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000006, "Member 'WBP_Modern_Menu_Player_Header_C_SelectPage::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Header_C_SelectPage, K2Node_Select_Default) == 0x000008, "Member 'WBP_Modern_Menu_Player_Header_C_SelectPage::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Header_C_SelectPage, CallFunc_BooleanOR_ReturnValue) == 0x000010, "Member 'WBP_Modern_Menu_Player_Header_C_SelectPage::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Header_C_SelectPage, CallFunc_IsValid_ReturnValue_1) == 0x000011, "Member 'WBP_Modern_Menu_Player_Header_C_SelectPage::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function WBP_Modern_Menu_Player_Header.WBP_Modern_Menu_Player_Header_C.SetHeaderState
// 0x0001 (0x0001 - 0x0000)
struct WBP_Modern_Menu_Player_Header_C_SetHeaderState final
{
public:
	bool                                          IsEnable;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Menu_Player_Header_C_SetHeaderState) == 0x000001, "Wrong alignment on WBP_Modern_Menu_Player_Header_C_SetHeaderState");
static_assert(sizeof(WBP_Modern_Menu_Player_Header_C_SetHeaderState) == 0x000001, "Wrong size on WBP_Modern_Menu_Player_Header_C_SetHeaderState");
static_assert(offsetof(WBP_Modern_Menu_Player_Header_C_SetHeaderState, IsEnable) == 0x000000, "Member 'WBP_Modern_Menu_Player_Header_C_SetHeaderState::IsEnable' has a wrong offset!");

// Function WBP_Modern_Menu_Player_Header.WBP_Modern_Menu_Player_Header_C.Unbinding
// 0x0028 (0x0028 - 0x0000)
struct WBP_Modern_Menu_Player_Header_C_Unbinding final
{
public:
	TDelegate<void(class UVNavigableInputKeySelector* Target, bool NewState)> K2Node_CreateDelegate_OutputDelegate; // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVRebindGlobalSubsystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVRebindGlobalSubsystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Menu_Player_Header_C_Unbinding) == 0x000008, "Wrong alignment on WBP_Modern_Menu_Player_Header_C_Unbinding");
static_assert(sizeof(WBP_Modern_Menu_Player_Header_C_Unbinding) == 0x000028, "Wrong size on WBP_Modern_Menu_Player_Header_C_Unbinding");
static_assert(offsetof(WBP_Modern_Menu_Player_Header_C_Unbinding, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_Modern_Menu_Player_Header_C_Unbinding::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Header_C_Unbinding, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000010, "Member 'WBP_Modern_Menu_Player_Header_C_Unbinding::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
