#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects.WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C
// 0x0098 (0x0380 - 0x02E8)
class UWBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVAddedEffectsListViewModel*            VAddedEffectsListViewModel;                        // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_AltarTextBlock_C*                  inv_enchantment_dots;                              // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModernMenu_AddedEffects_Small_C*   inv_enchantment_effect_1;                          // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModernMenu_AddedEffects_Small_C*   inv_enchantment_effect_2;                          // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModernMenu_AddedEffects_Small_C*   inv_enchantment_effect_3;                          // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModernMenu_AddedEffects_Small_C*   inv_enchantment_effect_4;                          // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               inv_enchantment_seperator_1;                       // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               inv_enchantment_seperator_2;                       // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               inv_enchantment_seperator_3;                       // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               inv_enchantment_seperator_4;                       // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               inv_enchantment_seperator_5;                       // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(int32 EffectsNb)> OnEffectsUpdated;                                // 0x0348(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<class UWBP_ModernMenu_AddedEffects_Small_C*> EffectsArray;                                // 0x0358(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UWBP_OriginalImageTile_C*>       SeperatorsArray;                                   // 0x0368(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                          AreListsInitialized;                               // 0x0378(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects(int32 EntryPoint);
	void HideAllEffects();
	void MakeEffectsArray();
	void MakeSeperatorsArray();
	void TryToInitLists();
	void UpdateEffects(const TArray<struct FModernEffectItemData>& NewItems);
	void UpdateListView(const TArray<struct FModernEffectItemData>& NewItems);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C">();
	}
	static class UWBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C>();
	}
};
static_assert(alignof(UWBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C) == 0x000008, "Wrong alignment on UWBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C");
static_assert(sizeof(UWBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C) == 0x000380, "Wrong size on UWBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C");
static_assert(offsetof(UWBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C, UberGraphFrame) == 0x0002E8, "Member 'UWBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C, VAddedEffectsListViewModel) == 0x0002F0, "Member 'UWBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C::VAddedEffectsListViewModel' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C, inv_enchantment_dots) == 0x0002F8, "Member 'UWBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C::inv_enchantment_dots' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C, inv_enchantment_effect_1) == 0x000300, "Member 'UWBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C::inv_enchantment_effect_1' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C, inv_enchantment_effect_2) == 0x000308, "Member 'UWBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C::inv_enchantment_effect_2' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C, inv_enchantment_effect_3) == 0x000310, "Member 'UWBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C::inv_enchantment_effect_3' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C, inv_enchantment_effect_4) == 0x000318, "Member 'UWBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C::inv_enchantment_effect_4' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C, inv_enchantment_seperator_1) == 0x000320, "Member 'UWBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C::inv_enchantment_seperator_1' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C, inv_enchantment_seperator_2) == 0x000328, "Member 'UWBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C::inv_enchantment_seperator_2' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C, inv_enchantment_seperator_3) == 0x000330, "Member 'UWBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C::inv_enchantment_seperator_3' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C, inv_enchantment_seperator_4) == 0x000338, "Member 'UWBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C::inv_enchantment_seperator_4' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C, inv_enchantment_seperator_5) == 0x000340, "Member 'UWBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C::inv_enchantment_seperator_5' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C, OnEffectsUpdated) == 0x000348, "Member 'UWBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C::OnEffectsUpdated' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C, EffectsArray) == 0x000358, "Member 'UWBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C::EffectsArray' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C, SeperatorsArray) == 0x000368, "Member 'UWBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C::SeperatorsArray' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C, AreListsInitialized) == 0x000378, "Member 'UWBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C::AreListsInitialized' has a wrong offset!");

}

