#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModernHud_Area

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_ModernHud_Area.WBP_ModernHud_Area_C.DiscoveredRetainer_Event
// 0x0008 (0x0008 - 0x0000)
struct WBP_ModernHud_Area_C_DiscoveredRetainer_Event final
{
public:
	class UAnimatableRetainerBox*                 DiscoveredRetainer_0;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_Area_C_DiscoveredRetainer_Event) == 0x000008, "Wrong alignment on WBP_ModernHud_Area_C_DiscoveredRetainer_Event");
static_assert(sizeof(WBP_ModernHud_Area_C_DiscoveredRetainer_Event) == 0x000008, "Wrong size on WBP_ModernHud_Area_C_DiscoveredRetainer_Event");
static_assert(offsetof(WBP_ModernHud_Area_C_DiscoveredRetainer_Event, DiscoveredRetainer_0) == 0x000000, "Member 'WBP_ModernHud_Area_C_DiscoveredRetainer_Event::DiscoveredRetainer_0' has a wrong offset!");

// Function WBP_ModernHud_Area.WBP_ModernHud_Area_C.DisplayArea
// 0x0018 (0x0018 - 0x0000)
struct WBP_ModernHud_Area_C_DisplayArea final
{
public:
	class FText                                   AreaName_0;                                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_ModernHud_Area_C_DisplayArea) == 0x000008, "Wrong alignment on WBP_ModernHud_Area_C_DisplayArea");
static_assert(sizeof(WBP_ModernHud_Area_C_DisplayArea) == 0x000018, "Wrong size on WBP_ModernHud_Area_C_DisplayArea");
static_assert(offsetof(WBP_ModernHud_Area_C_DisplayArea, AreaName_0) == 0x000000, "Member 'WBP_ModernHud_Area_C_DisplayArea::AreaName_0' has a wrong offset!");

// Function WBP_ModernHud_Area.WBP_ModernHud_Area_C.ExecuteUbergraph_WBP_ModernHud_Area
// 0x0030 (0x0030 - 0x0000)
struct WBP_ModernHud_Area_C_ExecuteUbergraph_WBP_ModernHud_Area final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimatableRetainerBox*                 K2Node_CustomEvent_DiscoveredRetainer;             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_CustomEvent_AreaName;                       // 0x0010(0x0018)()
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetNewlyDiscovered_ReturnValue;           // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_Area_C_ExecuteUbergraph_WBP_ModernHud_Area) == 0x000008, "Wrong alignment on WBP_ModernHud_Area_C_ExecuteUbergraph_WBP_ModernHud_Area");
static_assert(sizeof(WBP_ModernHud_Area_C_ExecuteUbergraph_WBP_ModernHud_Area) == 0x000030, "Wrong size on WBP_ModernHud_Area_C_ExecuteUbergraph_WBP_ModernHud_Area");
static_assert(offsetof(WBP_ModernHud_Area_C_ExecuteUbergraph_WBP_ModernHud_Area, EntryPoint) == 0x000000, "Member 'WBP_ModernHud_Area_C_ExecuteUbergraph_WBP_ModernHud_Area::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Area_C_ExecuteUbergraph_WBP_ModernHud_Area, K2Node_CustomEvent_DiscoveredRetainer) == 0x000008, "Member 'WBP_ModernHud_Area_C_ExecuteUbergraph_WBP_ModernHud_Area::K2Node_CustomEvent_DiscoveredRetainer' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Area_C_ExecuteUbergraph_WBP_ModernHud_Area, K2Node_CustomEvent_AreaName) == 0x000010, "Member 'WBP_ModernHud_Area_C_ExecuteUbergraph_WBP_ModernHud_Area::K2Node_CustomEvent_AreaName' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Area_C_ExecuteUbergraph_WBP_ModernHud_Area, CallFunc_IsVisible_ReturnValue) == 0x000028, "Member 'WBP_ModernHud_Area_C_ExecuteUbergraph_WBP_ModernHud_Area::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Area_C_ExecuteUbergraph_WBP_ModernHud_Area, CallFunc_GetNewlyDiscovered_ReturnValue) == 0x000029, "Member 'WBP_ModernHud_Area_C_ExecuteUbergraph_WBP_ModernHud_Area::CallFunc_GetNewlyDiscovered_ReturnValue' has a wrong offset!");

// Function WBP_ModernHud_Area.WBP_ModernHud_Area_C.SequenceEvent__ENTRYPOINTWBP_ModernHud_Area
// 0x0008 (0x0008 - 0x0000)
struct WBP_ModernHud_Area_C_SequenceEvent__ENTRYPOINTWBP_ModernHud_Area final
{
public:
	class UAnimatableRetainerBox*                 DiscoveredRetainer_0;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_Area_C_SequenceEvent__ENTRYPOINTWBP_ModernHud_Area) == 0x000008, "Wrong alignment on WBP_ModernHud_Area_C_SequenceEvent__ENTRYPOINTWBP_ModernHud_Area");
static_assert(sizeof(WBP_ModernHud_Area_C_SequenceEvent__ENTRYPOINTWBP_ModernHud_Area) == 0x000008, "Wrong size on WBP_ModernHud_Area_C_SequenceEvent__ENTRYPOINTWBP_ModernHud_Area");
static_assert(offsetof(WBP_ModernHud_Area_C_SequenceEvent__ENTRYPOINTWBP_ModernHud_Area, DiscoveredRetainer_0) == 0x000000, "Member 'WBP_ModernHud_Area_C_SequenceEvent__ENTRYPOINTWBP_ModernHud_Area::DiscoveredRetainer_0' has a wrong offset!");

// Function WBP_ModernHud_Area.WBP_ModernHud_Area_C.TriggerAnimation
// 0x0020 (0x0020 - 0x0000)
struct WBP_ModernHud_Area_C_TriggerAnimation final
{
public:
	bool                                          AreaDiscovered;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       K2Node_Select_Default_1;                           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_Area_C_TriggerAnimation) == 0x000008, "Wrong alignment on WBP_ModernHud_Area_C_TriggerAnimation");
static_assert(sizeof(WBP_ModernHud_Area_C_TriggerAnimation) == 0x000020, "Wrong size on WBP_ModernHud_Area_C_TriggerAnimation");
static_assert(offsetof(WBP_ModernHud_Area_C_TriggerAnimation, AreaDiscovered) == 0x000000, "Member 'WBP_ModernHud_Area_C_TriggerAnimation::AreaDiscovered' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Area_C_TriggerAnimation, Temp_bool_Variable) == 0x000001, "Member 'WBP_ModernHud_Area_C_TriggerAnimation::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Area_C_TriggerAnimation, Temp_bool_Variable_1) == 0x000002, "Member 'WBP_ModernHud_Area_C_TriggerAnimation::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Area_C_TriggerAnimation, Temp_byte_Variable) == 0x000003, "Member 'WBP_ModernHud_Area_C_TriggerAnimation::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Area_C_TriggerAnimation, Temp_byte_Variable_1) == 0x000004, "Member 'WBP_ModernHud_Area_C_TriggerAnimation::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Area_C_TriggerAnimation, K2Node_Select_Default) == 0x000005, "Member 'WBP_ModernHud_Area_C_TriggerAnimation::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Area_C_TriggerAnimation, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_ModernHud_Area_C_TriggerAnimation::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Area_C_TriggerAnimation, K2Node_Select_Default_1) == 0x000010, "Member 'WBP_ModernHud_Area_C_TriggerAnimation::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Area_C_TriggerAnimation, CallFunc_PlayAnimation_ReturnValue_1) == 0x000018, "Member 'WBP_ModernHud_Area_C_TriggerAnimation::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

// Function WBP_ModernHud_Area.WBP_ModernHud_Area_C.Update Visibility
// 0x0020 (0x0020 - 0x0000)
struct WBP_ModernHud_Area_C_Update_Visibility final
{
public:
	bool                                          Visible;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Area_Discovered;                                   // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_2;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_3;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_4;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_5;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          K2Node_Select_Default_1;                           // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          K2Node_Select_Default_2;                           // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_Area_C_Update_Visibility) == 0x000008, "Wrong alignment on WBP_ModernHud_Area_C_Update_Visibility");
static_assert(sizeof(WBP_ModernHud_Area_C_Update_Visibility) == 0x000020, "Wrong size on WBP_ModernHud_Area_C_Update_Visibility");
static_assert(offsetof(WBP_ModernHud_Area_C_Update_Visibility, Visible) == 0x000000, "Member 'WBP_ModernHud_Area_C_Update_Visibility::Visible' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Area_C_Update_Visibility, Area_Discovered) == 0x000001, "Member 'WBP_ModernHud_Area_C_Update_Visibility::Area_Discovered' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Area_C_Update_Visibility, Temp_bool_Variable) == 0x000002, "Member 'WBP_ModernHud_Area_C_Update_Visibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Area_C_Update_Visibility, Temp_byte_Variable) == 0x000003, "Member 'WBP_ModernHud_Area_C_Update_Visibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Area_C_Update_Visibility, Temp_byte_Variable_1) == 0x000004, "Member 'WBP_ModernHud_Area_C_Update_Visibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Area_C_Update_Visibility, Temp_bool_Variable_1) == 0x000005, "Member 'WBP_ModernHud_Area_C_Update_Visibility::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Area_C_Update_Visibility, Temp_byte_Variable_2) == 0x000006, "Member 'WBP_ModernHud_Area_C_Update_Visibility::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Area_C_Update_Visibility, Temp_byte_Variable_3) == 0x000007, "Member 'WBP_ModernHud_Area_C_Update_Visibility::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Area_C_Update_Visibility, Temp_bool_Variable_2) == 0x000008, "Member 'WBP_ModernHud_Area_C_Update_Visibility::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Area_C_Update_Visibility, Temp_byte_Variable_4) == 0x000009, "Member 'WBP_ModernHud_Area_C_Update_Visibility::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Area_C_Update_Visibility, Temp_byte_Variable_5) == 0x00000A, "Member 'WBP_ModernHud_Area_C_Update_Visibility::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Area_C_Update_Visibility, K2Node_Select_Default) == 0x00000B, "Member 'WBP_ModernHud_Area_C_Update_Visibility::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Area_C_Update_Visibility, K2Node_Select_Default_1) == 0x00000C, "Member 'WBP_ModernHud_Area_C_Update_Visibility::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Area_C_Update_Visibility, K2Node_Select_Default_2) == 0x00000D, "Member 'WBP_ModernHud_Area_C_Update_Visibility::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Area_C_Update_Visibility, CallFunc_PlayAnimation_ReturnValue) == 0x000010, "Member 'WBP_ModernHud_Area_C_Update_Visibility::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Area_C_Update_Visibility, CallFunc_PlayAnimation_ReturnValue_1) == 0x000018, "Member 'WBP_ModernHud_Area_C_Update_Visibility::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

// Function WBP_ModernHud_Area.WBP_ModernHud_Area_C.UpdateTrespassing
// 0x0018 (0x0018 - 0x0000)
struct WBP_ModernHud_Area_C_UpdateTrespassing final
{
public:
	bool                                          IsTrespassing_0;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_Area_C_UpdateTrespassing) == 0x000008, "Wrong alignment on WBP_ModernHud_Area_C_UpdateTrespassing");
static_assert(sizeof(WBP_ModernHud_Area_C_UpdateTrespassing) == 0x000018, "Wrong size on WBP_ModernHud_Area_C_UpdateTrespassing");
static_assert(offsetof(WBP_ModernHud_Area_C_UpdateTrespassing, IsTrespassing_0) == 0x000000, "Member 'WBP_ModernHud_Area_C_UpdateTrespassing::IsTrespassing_0' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Area_C_UpdateTrespassing, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_ModernHud_Area_C_UpdateTrespassing::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Area_C_UpdateTrespassing, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'WBP_ModernHud_Area_C_UpdateTrespassing::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

}

