#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModernHud_Main

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "Altar_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ModernHud_Main.WBP_ModernHud_Main_C
// 0x0098 (0x0580 - 0x04E8)
class UWBP_ModernHud_Main_C final : public UVModernHudMain
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVHUDMainViewModel*                     VHUDMainViewModel;                                 // 0x04F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HUDFadeInOut;                                      // 0x04F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UVerticalBox*                           hudmain_root;                                      // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModernTutorialDisplay_C*           TutorialDisplay;                                   // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               TutorialRoot;                                      // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModernHud_Compass_C*               WBP_ModernHud_Compass;                             // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModernHud_DamageIndicators_C*      WBP_ModernHud_DamageIndicators;                    // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModernHud_EffectIcons_C*           WBP_ModernHud_EffectIcons;                         // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModernHud_Fatigue_C*               WBP_ModernHud_Fatigue;                             // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModernHud_Health_C*                WBP_ModernHud_Health;                              // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModernHud_LevelUpGauge_C*          WBP_ModernHud_LevelUpGauge;                        // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModernHud_MagicIcon_C*             WBP_ModernHud_MagicIcon;                           // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModernHud_Magicka_C*               WBP_ModernHud_Magicka;                             // 0x0550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModernHud_WeaponIcon_C*            WBP_ModernHud_WeaponIcon;                          // 0x0558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         TABS_MAX;                                          // 0x0560(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsMenuMode;                                        // 0x0564(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_565[0x3];                                      // 0x0565(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LastSelectedPageIndex;                             // 0x0568(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ConstructIsFinished;                               // 0x056C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56D[0x3];                                      // 0x056D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          ClickSound;                                        // 0x0570(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AVAltarPlayerController*                CachedPlayerController;                            // 0x0578(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void Create_Hostile_Data(TArray<struct FHostileData>* HostileData);
	void Destruct();
	void ExecuteUbergraph_WBP_ModernHud_Main(int32 EntryPoint);
	void FadePlayerBar(class UWBP_ModernHud_StatusBar_C* StatusBar);
	void FadePlayerBars();
	void FatigueBarBlinking();
	void MagickaBarBlinking();
	void On_Toggle_HUD_Visibility(bool bInIsVisible);
	void PlayBracketAnimation(int32 TargetMenu);
	bool ShouldHidePlayerBars();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Update_Active_Effect_Icons(const TArray<class UTexture2D*>& NewParam);
	void Update_Active_Effects_Time_Left(const TArray<double>& NewParam);
	void Update_Broken_Apparel_Indicator_Visibility(const struct FModernApparelData& InApparelData);
	void Update_CanBeCast(bool NewParam);
	void Update_Compass_Direction_Value(double In_Direction);
	void Update_Fatigue_Bar_Value(double NewParam);
	void Update_Health_Bar_Value(double NewParam);
	void Update_Magicka_Bar_Value(double NewParam);
	void Update_Spell_Icon(class UTexture2D* NewParam);
	void Update_Weapon_Ammo(double InAmmo);
	void Update_Weapon_Charge(const struct FWeaponChargeParams& NewChargeParam);
	void Update_Weapon_Icon(class UTexture2D* InTexture);
	void Update_Weapon_Status(int32 InStatus);
	void Update_Wepon_Health(double InHealth);
	void UpdateBrokenWeaponIndicatorVisibility(bool IsVisible_0);
	void UpdateCompassEnemyMarkers(const TArray<struct FHostileData>& HostileData);
	void UpdateCompassIconMarkers(const TArray<struct FCompassIconMarker>& CompassIconMarkersList);
	void UpdateCompassTrespassing(bool bIsNewTrespassing);
	void UpdateIsMenuMode(bool NewParam);
	void UpdateLevelUpIconVisibility(bool& NewVisibility);
	void UpdateOverencumberedStatus(bool bIsOverencumbered);
	void UpdateSkillLevelUp(struct FModernSkillProgression& NewSkillProgress);
	void UpdateWeaponChargeVisibility(bool IsVisible_0);
	void UpdateWeaponStatusVisibility(bool IsVisible_0);

	void Get_Bracket_Playback_Speed(int32 Target, int32 Current, double* Return_Value) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ModernHud_Main_C">();
	}
	static class UWBP_ModernHud_Main_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ModernHud_Main_C>();
	}
};
static_assert(alignof(UWBP_ModernHud_Main_C) == 0x000008, "Wrong alignment on UWBP_ModernHud_Main_C");
static_assert(sizeof(UWBP_ModernHud_Main_C) == 0x000580, "Wrong size on UWBP_ModernHud_Main_C");
static_assert(offsetof(UWBP_ModernHud_Main_C, UberGraphFrame) == 0x0004E8, "Member 'UWBP_ModernHud_Main_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_Main_C, VHUDMainViewModel) == 0x0004F0, "Member 'UWBP_ModernHud_Main_C::VHUDMainViewModel' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_Main_C, HUDFadeInOut) == 0x0004F8, "Member 'UWBP_ModernHud_Main_C::HUDFadeInOut' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_Main_C, hudmain_root) == 0x000500, "Member 'UWBP_ModernHud_Main_C::hudmain_root' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_Main_C, TutorialDisplay) == 0x000508, "Member 'UWBP_ModernHud_Main_C::TutorialDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_Main_C, TutorialRoot) == 0x000510, "Member 'UWBP_ModernHud_Main_C::TutorialRoot' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_Main_C, WBP_ModernHud_Compass) == 0x000518, "Member 'UWBP_ModernHud_Main_C::WBP_ModernHud_Compass' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_Main_C, WBP_ModernHud_DamageIndicators) == 0x000520, "Member 'UWBP_ModernHud_Main_C::WBP_ModernHud_DamageIndicators' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_Main_C, WBP_ModernHud_EffectIcons) == 0x000528, "Member 'UWBP_ModernHud_Main_C::WBP_ModernHud_EffectIcons' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_Main_C, WBP_ModernHud_Fatigue) == 0x000530, "Member 'UWBP_ModernHud_Main_C::WBP_ModernHud_Fatigue' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_Main_C, WBP_ModernHud_Health) == 0x000538, "Member 'UWBP_ModernHud_Main_C::WBP_ModernHud_Health' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_Main_C, WBP_ModernHud_LevelUpGauge) == 0x000540, "Member 'UWBP_ModernHud_Main_C::WBP_ModernHud_LevelUpGauge' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_Main_C, WBP_ModernHud_MagicIcon) == 0x000548, "Member 'UWBP_ModernHud_Main_C::WBP_ModernHud_MagicIcon' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_Main_C, WBP_ModernHud_Magicka) == 0x000550, "Member 'UWBP_ModernHud_Main_C::WBP_ModernHud_Magicka' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_Main_C, WBP_ModernHud_WeaponIcon) == 0x000558, "Member 'UWBP_ModernHud_Main_C::WBP_ModernHud_WeaponIcon' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_Main_C, TABS_MAX) == 0x000560, "Member 'UWBP_ModernHud_Main_C::TABS_MAX' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_Main_C, IsMenuMode) == 0x000564, "Member 'UWBP_ModernHud_Main_C::IsMenuMode' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_Main_C, LastSelectedPageIndex) == 0x000568, "Member 'UWBP_ModernHud_Main_C::LastSelectedPageIndex' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_Main_C, ConstructIsFinished) == 0x00056C, "Member 'UWBP_ModernHud_Main_C::ConstructIsFinished' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_Main_C, ClickSound) == 0x000570, "Member 'UWBP_ModernHud_Main_C::ClickSound' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_Main_C, CachedPlayerController) == 0x000578, "Member 'UWBP_ModernHud_Main_C::CachedPlayerController' has a wrong offset!");

}

