#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PhysicsControllableEntry

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_PhysicsControllableEntry.WBP_PhysicsControllableEntry_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_PhysicsControllableEntry_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PhysicsControllableEntry_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong alignment on WBP_PhysicsControllableEntry_C_BP_OnItemSelectionChanged");
static_assert(sizeof(WBP_PhysicsControllableEntry_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong size on WBP_PhysicsControllableEntry_C_BP_OnItemSelectionChanged");
static_assert(offsetof(WBP_PhysicsControllableEntry_C_BP_OnItemSelectionChanged, bIsSelected) == 0x000000, "Member 'WBP_PhysicsControllableEntry_C_BP_OnItemSelectionChanged::bIsSelected' has a wrong offset!");

// Function WBP_PhysicsControllableEntry.WBP_PhysicsControllableEntry_C.ExecuteUbergraph_WBP_PhysicsControllableEntry
// 0x0070 (0x0070 - 0x0000)
struct WBP_PhysicsControllableEntry_C_ExecuteUbergraph_WBP_PhysicsControllableEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVControllableEntry*                    K2Node_DynamicCast_AsVControllable_Entry;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0020(0x0018)()
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0048(0x0014)()
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue_1;                // 0x005C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PhysicsControllableEntry_C_ExecuteUbergraph_WBP_PhysicsControllableEntry) == 0x000008, "Wrong alignment on WBP_PhysicsControllableEntry_C_ExecuteUbergraph_WBP_PhysicsControllableEntry");
static_assert(sizeof(WBP_PhysicsControllableEntry_C_ExecuteUbergraph_WBP_PhysicsControllableEntry) == 0x000070, "Wrong size on WBP_PhysicsControllableEntry_C_ExecuteUbergraph_WBP_PhysicsControllableEntry");
static_assert(offsetof(WBP_PhysicsControllableEntry_C_ExecuteUbergraph_WBP_PhysicsControllableEntry, EntryPoint) == 0x000000, "Member 'WBP_PhysicsControllableEntry_C_ExecuteUbergraph_WBP_PhysicsControllableEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_PhysicsControllableEntry_C_ExecuteUbergraph_WBP_PhysicsControllableEntry, K2Node_Event_ListItemObject) == 0x000008, "Member 'WBP_PhysicsControllableEntry_C_ExecuteUbergraph_WBP_PhysicsControllableEntry::K2Node_Event_ListItemObject' has a wrong offset!");
static_assert(offsetof(WBP_PhysicsControllableEntry_C_ExecuteUbergraph_WBP_PhysicsControllableEntry, K2Node_DynamicCast_AsVControllable_Entry) == 0x000010, "Member 'WBP_PhysicsControllableEntry_C_ExecuteUbergraph_WBP_PhysicsControllableEntry::K2Node_DynamicCast_AsVControllable_Entry' has a wrong offset!");
static_assert(offsetof(WBP_PhysicsControllableEntry_C_ExecuteUbergraph_WBP_PhysicsControllableEntry, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_PhysicsControllableEntry_C_ExecuteUbergraph_WBP_PhysicsControllableEntry::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_PhysicsControllableEntry_C_ExecuteUbergraph_WBP_PhysicsControllableEntry, K2Node_Event_bIsSelected) == 0x000019, "Member 'WBP_PhysicsControllableEntry_C_ExecuteUbergraph_WBP_PhysicsControllableEntry::K2Node_Event_bIsSelected' has a wrong offset!");
static_assert(offsetof(WBP_PhysicsControllableEntry_C_ExecuteUbergraph_WBP_PhysicsControllableEntry, CallFunc_Conv_NameToText_ReturnValue) == 0x000020, "Member 'WBP_PhysicsControllableEntry_C_ExecuteUbergraph_WBP_PhysicsControllableEntry::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PhysicsControllableEntry_C_ExecuteUbergraph_WBP_PhysicsControllableEntry, CallFunc_SelectColor_ReturnValue) == 0x000038, "Member 'WBP_PhysicsControllableEntry_C_ExecuteUbergraph_WBP_PhysicsControllableEntry::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PhysicsControllableEntry_C_ExecuteUbergraph_WBP_PhysicsControllableEntry, K2Node_MakeStruct_SlateColor) == 0x000048, "Member 'WBP_PhysicsControllableEntry_C_ExecuteUbergraph_WBP_PhysicsControllableEntry::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_PhysicsControllableEntry_C_ExecuteUbergraph_WBP_PhysicsControllableEntry, CallFunc_SelectColor_ReturnValue_1) == 0x00005C, "Member 'WBP_PhysicsControllableEntry_C_ExecuteUbergraph_WBP_PhysicsControllableEntry::CallFunc_SelectColor_ReturnValue_1' has a wrong offset!");

// Function WBP_PhysicsControllableEntry.WBP_PhysicsControllableEntry_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct WBP_PhysicsControllableEntry_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PhysicsControllableEntry_C_OnListItemObjectSet) == 0x000008, "Wrong alignment on WBP_PhysicsControllableEntry_C_OnListItemObjectSet");
static_assert(sizeof(WBP_PhysicsControllableEntry_C_OnListItemObjectSet) == 0x000008, "Wrong size on WBP_PhysicsControllableEntry_C_OnListItemObjectSet");
static_assert(offsetof(WBP_PhysicsControllableEntry_C_OnListItemObjectSet, ListItemObject) == 0x000000, "Member 'WBP_PhysicsControllableEntry_C_OnListItemObjectSet::ListItemObject' has a wrong offset!");

}

