#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_OriginalImageTile

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Altar_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_OriginalImageTile.WBP_OriginalImageTile_C
// 0x0030 (0x0530 - 0x0500)
class UWBP_OriginalImageTile_C final : public UVOriginalImageTile
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0500(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image;                                             // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       InvalidationBox;                                   // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               Sizer;                                             // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FVector2D                              Size;                                              // 0x0520(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_OriginalImageTile(int32 EntryPoint);
	void ForceUpdate();
	void GetModifiedBrush(struct FSlateBrush* Brush_0);
	void OnCorrectionDataUpdated(const struct FImageCorrectionData& Value);
	void OnSynchronizeProperties();
	void PreConstruct(bool IsDesignTime);
	void UpdateImage();
	void UpdateInvalidation();
	void UpdateSizer();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_OriginalImageTile_C">();
	}
	static class UWBP_OriginalImageTile_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_OriginalImageTile_C>();
	}
};
static_assert(alignof(UWBP_OriginalImageTile_C) == 0x000010, "Wrong alignment on UWBP_OriginalImageTile_C");
static_assert(sizeof(UWBP_OriginalImageTile_C) == 0x000530, "Wrong size on UWBP_OriginalImageTile_C");
static_assert(offsetof(UWBP_OriginalImageTile_C, UberGraphFrame) == 0x000500, "Member 'UWBP_OriginalImageTile_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalImageTile_C, Image) == 0x000508, "Member 'UWBP_OriginalImageTile_C::Image' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalImageTile_C, InvalidationBox) == 0x000510, "Member 'UWBP_OriginalImageTile_C::InvalidationBox' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalImageTile_C, Sizer) == 0x000518, "Member 'UWBP_OriginalImageTile_C::Sizer' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalImageTile_C, Size) == 0x000520, "Member 'UWBP_OriginalImageTile_C::Size' has a wrong offset!");

}

