#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_OriginalMenu_InventoryEntry

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "Altar_structs.hpp"
#include "Altar_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_OriginalMenu_InventoryEntry.WBP_OriginalMenu_InventoryEntry_C
// 0x0100 (0x03D0 - 0x02D0)
class UWBP_OriginalMenu_InventoryEntry_C final : public UNavigationListviewEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVContainerMenuViewModel*               VContainerMenuViewModel;                           // 0x02D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UVInventoryMenuViewModel*               VInventoryMenuViewModel;                           // 0x02E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PenScribble;                                       // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       EntryAnim;                                         // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_OriginalMenu_InventoryEntry_ValueWithLine_C* inv_entry_armor_rating;                  // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               inv_entry_favorite_marker;                         // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModernPrefab_Focusbox_C*           inv_entry_focusBox;                                // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalMenu_InventoryEntry_ValueWithLine_C* inv_entry_health;                        // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalMenu_InventoryIconEntry_C* inv_entry_icon;                                    // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AltarTextBlock_C*                  inv_entry_name;                                    // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               inv_entry_scribble;                                // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalMenu_InventoryEntryStatusIcons_C* inv_entry_statusIcons;                      // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalMenu_InventoryEntry_ValueWithLine_C* inv_entry_value;                         // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalMenu_InventoryEntry_ValueWithLine_C* inv_entry_weapon_damage;                 // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalMenu_InventoryEntry_ValueWithLine_C* inv_entry_weight;                        // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FOriginalInventoryMenuItemProperties   Properties;                                        // 0x0350(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        StatsColumnSize;                                   // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DamageDisplayLimit;                                // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ItemValueDisplayLimit;                             // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ArmorDisplayLimit;                                 // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        WeightValueDisplayLimit;                           // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DefaultValueDisplayLimit;                          // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimateToView();
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void Display_All_Stats();
	void ExecuteUbergraph_WBP_OriginalMenu_InventoryEntry(int32 EntryPoint);
	void HideAllStats();
	void OnListItemObjectSet(class UObject* ListItemObject);
	void PreConstruct(bool IsDesignTime);
	void Property_Value_to_Text(double Value, double ValueLimit, class FText* Text);
	void SetHiddenStatsSpacerSize(int32 NumberOfHiddenStats);
	void SetItemIcon(int32 Count, class UTexture2D* Icon, int32 Status);
	void SetItemStatsVisibility(ELegacyInventoryMenuPage Page);
	void ShouldHideArmorRating(bool ShouldHide);
	void ShouldHideItemHealth(bool ShouldHide);
	void ShouldHideWeaponDamage(bool ShouldHide);
	void ThisIsForPluginCompliance(bool Test);
	void UpdateItem();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_OriginalMenu_InventoryEntry_C">();
	}
	static class UWBP_OriginalMenu_InventoryEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_OriginalMenu_InventoryEntry_C>();
	}
};
static_assert(alignof(UWBP_OriginalMenu_InventoryEntry_C) == 0x000008, "Wrong alignment on UWBP_OriginalMenu_InventoryEntry_C");
static_assert(sizeof(UWBP_OriginalMenu_InventoryEntry_C) == 0x0003D0, "Wrong size on UWBP_OriginalMenu_InventoryEntry_C");
static_assert(offsetof(UWBP_OriginalMenu_InventoryEntry_C, UberGraphFrame) == 0x0002D0, "Member 'UWBP_OriginalMenu_InventoryEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryEntry_C, VContainerMenuViewModel) == 0x0002D8, "Member 'UWBP_OriginalMenu_InventoryEntry_C::VContainerMenuViewModel' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryEntry_C, VInventoryMenuViewModel) == 0x0002E0, "Member 'UWBP_OriginalMenu_InventoryEntry_C::VInventoryMenuViewModel' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryEntry_C, PenScribble) == 0x0002E8, "Member 'UWBP_OriginalMenu_InventoryEntry_C::PenScribble' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryEntry_C, EntryAnim) == 0x0002F0, "Member 'UWBP_OriginalMenu_InventoryEntry_C::EntryAnim' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryEntry_C, inv_entry_armor_rating) == 0x0002F8, "Member 'UWBP_OriginalMenu_InventoryEntry_C::inv_entry_armor_rating' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryEntry_C, inv_entry_favorite_marker) == 0x000300, "Member 'UWBP_OriginalMenu_InventoryEntry_C::inv_entry_favorite_marker' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryEntry_C, inv_entry_focusBox) == 0x000308, "Member 'UWBP_OriginalMenu_InventoryEntry_C::inv_entry_focusBox' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryEntry_C, inv_entry_health) == 0x000310, "Member 'UWBP_OriginalMenu_InventoryEntry_C::inv_entry_health' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryEntry_C, inv_entry_icon) == 0x000318, "Member 'UWBP_OriginalMenu_InventoryEntry_C::inv_entry_icon' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryEntry_C, inv_entry_name) == 0x000320, "Member 'UWBP_OriginalMenu_InventoryEntry_C::inv_entry_name' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryEntry_C, inv_entry_scribble) == 0x000328, "Member 'UWBP_OriginalMenu_InventoryEntry_C::inv_entry_scribble' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryEntry_C, inv_entry_statusIcons) == 0x000330, "Member 'UWBP_OriginalMenu_InventoryEntry_C::inv_entry_statusIcons' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryEntry_C, inv_entry_value) == 0x000338, "Member 'UWBP_OriginalMenu_InventoryEntry_C::inv_entry_value' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryEntry_C, inv_entry_weapon_damage) == 0x000340, "Member 'UWBP_OriginalMenu_InventoryEntry_C::inv_entry_weapon_damage' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryEntry_C, inv_entry_weight) == 0x000348, "Member 'UWBP_OriginalMenu_InventoryEntry_C::inv_entry_weight' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryEntry_C, Properties) == 0x000350, "Member 'UWBP_OriginalMenu_InventoryEntry_C::Properties' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryEntry_C, StatsColumnSize) == 0x0003A0, "Member 'UWBP_OriginalMenu_InventoryEntry_C::StatsColumnSize' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryEntry_C, DamageDisplayLimit) == 0x0003A8, "Member 'UWBP_OriginalMenu_InventoryEntry_C::DamageDisplayLimit' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryEntry_C, ItemValueDisplayLimit) == 0x0003B0, "Member 'UWBP_OriginalMenu_InventoryEntry_C::ItemValueDisplayLimit' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryEntry_C, ArmorDisplayLimit) == 0x0003B8, "Member 'UWBP_OriginalMenu_InventoryEntry_C::ArmorDisplayLimit' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryEntry_C, WeightValueDisplayLimit) == 0x0003C0, "Member 'UWBP_OriginalMenu_InventoryEntry_C::WeightValueDisplayLimit' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryEntry_C, DefaultValueDisplayLimit) == 0x0003C8, "Member 'UWBP_OriginalMenu_InventoryEntry_C::DefaultValueDisplayLimit' has a wrong offset!");

}

