#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Modern_Settings_BindingWarning

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Modern_Settings_BindingWarning.WBP_Modern_Settings_BindingWarning_C.OnBindingChanged
// 0x0008 (0x0008 - 0x0000)
struct WBP_Modern_Settings_BindingWarning_C_OnBindingChanged final
{
public:
	class UVModernRebindSettingWidget*            ChangedRebind;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Settings_BindingWarning_C_OnBindingChanged) == 0x000008, "Wrong alignment on WBP_Modern_Settings_BindingWarning_C_OnBindingChanged");
static_assert(sizeof(WBP_Modern_Settings_BindingWarning_C_OnBindingChanged) == 0x000008, "Wrong size on WBP_Modern_Settings_BindingWarning_C_OnBindingChanged");
static_assert(offsetof(WBP_Modern_Settings_BindingWarning_C_OnBindingChanged, ChangedRebind) == 0x000000, "Member 'WBP_Modern_Settings_BindingWarning_C_OnBindingChanged::ChangedRebind' has a wrong offset!");

// Function WBP_Modern_Settings_BindingWarning.WBP_Modern_Settings_BindingWarning_C.ExecuteUbergraph_WBP_Modern_Settings_BindingWarning
// 0x0050 (0x0050 - 0x0000)
struct WBP_Modern_Settings_BindingWarning_C_ExecuteUbergraph_WBP_Modern_Settings_BindingWarning final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVRebindGlobalSubsystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVRebindGlobalSubsystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesHaveAEmptyPrimaryBindingForType_ReturnValue; // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UVModernRebindSettingWidget* ChangedRebind)> K2Node_CreateDelegate_OutputDelegate; // 0x001C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UVModernRebindSettingWidget* ChangedRebind)> K2Node_CreateDelegate_OutputDelegate_1; // 0x002C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVRebindGlobalSubsystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVModernRebindSettingWidget*            K2Node_CustomEvent_ChangedRebind;                  // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Settings_BindingWarning_C_ExecuteUbergraph_WBP_Modern_Settings_BindingWarning) == 0x000008, "Wrong alignment on WBP_Modern_Settings_BindingWarning_C_ExecuteUbergraph_WBP_Modern_Settings_BindingWarning");
static_assert(sizeof(WBP_Modern_Settings_BindingWarning_C_ExecuteUbergraph_WBP_Modern_Settings_BindingWarning) == 0x000050, "Wrong size on WBP_Modern_Settings_BindingWarning_C_ExecuteUbergraph_WBP_Modern_Settings_BindingWarning");
static_assert(offsetof(WBP_Modern_Settings_BindingWarning_C_ExecuteUbergraph_WBP_Modern_Settings_BindingWarning, EntryPoint) == 0x000000, "Member 'WBP_Modern_Settings_BindingWarning_C_ExecuteUbergraph_WBP_Modern_Settings_BindingWarning::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_BindingWarning_C_ExecuteUbergraph_WBP_Modern_Settings_BindingWarning, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'WBP_Modern_Settings_BindingWarning_C_ExecuteUbergraph_WBP_Modern_Settings_BindingWarning::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_BindingWarning_C_ExecuteUbergraph_WBP_Modern_Settings_BindingWarning, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000010, "Member 'WBP_Modern_Settings_BindingWarning_C_ExecuteUbergraph_WBP_Modern_Settings_BindingWarning::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_BindingWarning_C_ExecuteUbergraph_WBP_Modern_Settings_BindingWarning, CallFunc_DoesHaveAEmptyPrimaryBindingForType_ReturnValue) == 0x000018, "Member 'WBP_Modern_Settings_BindingWarning_C_ExecuteUbergraph_WBP_Modern_Settings_BindingWarning::CallFunc_DoesHaveAEmptyPrimaryBindingForType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_BindingWarning_C_ExecuteUbergraph_WBP_Modern_Settings_BindingWarning, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'WBP_Modern_Settings_BindingWarning_C_ExecuteUbergraph_WBP_Modern_Settings_BindingWarning::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_BindingWarning_C_ExecuteUbergraph_WBP_Modern_Settings_BindingWarning, K2Node_CreateDelegate_OutputDelegate_1) == 0x00002C, "Member 'WBP_Modern_Settings_BindingWarning_C_ExecuteUbergraph_WBP_Modern_Settings_BindingWarning::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_BindingWarning_C_ExecuteUbergraph_WBP_Modern_Settings_BindingWarning, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x000040, "Member 'WBP_Modern_Settings_BindingWarning_C_ExecuteUbergraph_WBP_Modern_Settings_BindingWarning::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_BindingWarning_C_ExecuteUbergraph_WBP_Modern_Settings_BindingWarning, K2Node_CustomEvent_ChangedRebind) == 0x000048, "Member 'WBP_Modern_Settings_BindingWarning_C_ExecuteUbergraph_WBP_Modern_Settings_BindingWarning::K2Node_CustomEvent_ChangedRebind' has a wrong offset!");

}

