#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PairedPawnDebugInfo

#include "Basic.hpp"

#include "Altar_structs.hpp"


namespace SDK::Params
{

// Function WBP_PairedPawnDebugInfo.WBP_PairedPawnDebugInfo_C.AltarActionStateBinding
// 0x0048 (0x0048 - 0x0000)
struct WBP_PairedPawnDebugInfo_C_AltarActionStateBinding final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetActionState_ReturnValue;               // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0030(0x0018)()
};
static_assert(alignof(WBP_PairedPawnDebugInfo_C_AltarActionStateBinding) == 0x000008, "Wrong alignment on WBP_PairedPawnDebugInfo_C_AltarActionStateBinding");
static_assert(sizeof(WBP_PairedPawnDebugInfo_C_AltarActionStateBinding) == 0x000048, "Wrong size on WBP_PairedPawnDebugInfo_C_AltarActionStateBinding");
static_assert(offsetof(WBP_PairedPawnDebugInfo_C_AltarActionStateBinding, ReturnValue) == 0x000000, "Member 'WBP_PairedPawnDebugInfo_C_AltarActionStateBinding::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnDebugInfo_C_AltarActionStateBinding, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'WBP_PairedPawnDebugInfo_C_AltarActionStateBinding::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnDebugInfo_C_AltarActionStateBinding, CallFunc_GetActionState_ReturnValue) == 0x000020, "Member 'WBP_PairedPawnDebugInfo_C_AltarActionStateBinding::CallFunc_GetActionState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnDebugInfo_C_AltarActionStateBinding, CallFunc_Conv_StringToText_ReturnValue) == 0x000030, "Member 'WBP_PairedPawnDebugInfo_C_AltarActionStateBinding::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function WBP_PairedPawnDebugInfo.WBP_PairedPawnDebugInfo_C.AnimActionBinding
// 0x0048 (0x0048 - 0x0000)
struct WBP_PairedPawnDebugInfo_C_AnimActionBinding final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVAnimAction                                  CallFunc_GetOblivionAnimAction_ReturnValue;        // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0030(0x0018)()
};
static_assert(alignof(WBP_PairedPawnDebugInfo_C_AnimActionBinding) == 0x000008, "Wrong alignment on WBP_PairedPawnDebugInfo_C_AnimActionBinding");
static_assert(sizeof(WBP_PairedPawnDebugInfo_C_AnimActionBinding) == 0x000048, "Wrong size on WBP_PairedPawnDebugInfo_C_AnimActionBinding");
static_assert(offsetof(WBP_PairedPawnDebugInfo_C_AnimActionBinding, ReturnValue) == 0x000000, "Member 'WBP_PairedPawnDebugInfo_C_AnimActionBinding::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnDebugInfo_C_AnimActionBinding, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'WBP_PairedPawnDebugInfo_C_AnimActionBinding::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnDebugInfo_C_AnimActionBinding, CallFunc_GetOblivionAnimAction_ReturnValue) == 0x000019, "Member 'WBP_PairedPawnDebugInfo_C_AnimActionBinding::CallFunc_GetOblivionAnimAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnDebugInfo_C_AnimActionBinding, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000020, "Member 'WBP_PairedPawnDebugInfo_C_AnimActionBinding::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnDebugInfo_C_AnimActionBinding, CallFunc_Conv_StringToText_ReturnValue) == 0x000030, "Member 'WBP_PairedPawnDebugInfo_C_AnimActionBinding::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function WBP_PairedPawnDebugInfo.WBP_PairedPawnDebugInfo_C.CombatStateBinding
// 0x0050 (0x0050 - 0x0000)
struct WBP_PairedPawnDebugInfo_C_CombatStateBinding final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0030(0x0018)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PairedPawnDebugInfo_C_CombatStateBinding) == 0x000008, "Wrong alignment on WBP_PairedPawnDebugInfo_C_CombatStateBinding");
static_assert(sizeof(WBP_PairedPawnDebugInfo_C_CombatStateBinding) == 0x000050, "Wrong size on WBP_PairedPawnDebugInfo_C_CombatStateBinding");
static_assert(offsetof(WBP_PairedPawnDebugInfo_C_CombatStateBinding, ReturnValue) == 0x000000, "Member 'WBP_PairedPawnDebugInfo_C_CombatStateBinding::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnDebugInfo_C_CombatStateBinding, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'WBP_PairedPawnDebugInfo_C_CombatStateBinding::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnDebugInfo_C_CombatStateBinding, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000020, "Member 'WBP_PairedPawnDebugInfo_C_CombatStateBinding::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnDebugInfo_C_CombatStateBinding, CallFunc_Conv_StringToText_ReturnValue) == 0x000030, "Member 'WBP_PairedPawnDebugInfo_C_CombatStateBinding::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnDebugInfo_C_CombatStateBinding, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000048, "Member 'WBP_PairedPawnDebugInfo_C_CombatStateBinding::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function WBP_PairedPawnDebugInfo.WBP_PairedPawnDebugInfo_C.ControllerNameBinding
// 0x0048 (0x0048 - 0x0000)
struct WBP_PairedPawnDebugInfo_C_ControllerNameBinding final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0030(0x0018)()
};
static_assert(alignof(WBP_PairedPawnDebugInfo_C_ControllerNameBinding) == 0x000008, "Wrong alignment on WBP_PairedPawnDebugInfo_C_ControllerNameBinding");
static_assert(sizeof(WBP_PairedPawnDebugInfo_C_ControllerNameBinding) == 0x000048, "Wrong size on WBP_PairedPawnDebugInfo_C_ControllerNameBinding");
static_assert(offsetof(WBP_PairedPawnDebugInfo_C_ControllerNameBinding, ReturnValue) == 0x000000, "Member 'WBP_PairedPawnDebugInfo_C_ControllerNameBinding::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnDebugInfo_C_ControllerNameBinding, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'WBP_PairedPawnDebugInfo_C_ControllerNameBinding::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnDebugInfo_C_ControllerNameBinding, CallFunc_GetDisplayName_ReturnValue) == 0x000020, "Member 'WBP_PairedPawnDebugInfo_C_ControllerNameBinding::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnDebugInfo_C_ControllerNameBinding, CallFunc_Conv_StringToText_ReturnValue) == 0x000030, "Member 'WBP_PairedPawnDebugInfo_C_ControllerNameBinding::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function WBP_PairedPawnDebugInfo.WBP_PairedPawnDebugInfo_C.ManeuverBinding
// 0x0050 (0x0050 - 0x0000)
struct WBP_PairedPawnDebugInfo_C_ManeuverBinding final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0030(0x0018)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PairedPawnDebugInfo_C_ManeuverBinding) == 0x000008, "Wrong alignment on WBP_PairedPawnDebugInfo_C_ManeuverBinding");
static_assert(sizeof(WBP_PairedPawnDebugInfo_C_ManeuverBinding) == 0x000050, "Wrong size on WBP_PairedPawnDebugInfo_C_ManeuverBinding");
static_assert(offsetof(WBP_PairedPawnDebugInfo_C_ManeuverBinding, ReturnValue) == 0x000000, "Member 'WBP_PairedPawnDebugInfo_C_ManeuverBinding::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnDebugInfo_C_ManeuverBinding, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'WBP_PairedPawnDebugInfo_C_ManeuverBinding::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnDebugInfo_C_ManeuverBinding, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000020, "Member 'WBP_PairedPawnDebugInfo_C_ManeuverBinding::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnDebugInfo_C_ManeuverBinding, CallFunc_Conv_StringToText_ReturnValue) == 0x000030, "Member 'WBP_PairedPawnDebugInfo_C_ManeuverBinding::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnDebugInfo_C_ManeuverBinding, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000048, "Member 'WBP_PairedPawnDebugInfo_C_ManeuverBinding::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function WBP_PairedPawnDebugInfo.WBP_PairedPawnDebugInfo_C.PackageTypeBinding
// 0x0048 (0x0048 - 0x0000)
struct WBP_PairedPawnDebugInfo_C_PackageTypeBinding final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0030(0x0018)()
};
static_assert(alignof(WBP_PairedPawnDebugInfo_C_PackageTypeBinding) == 0x000008, "Wrong alignment on WBP_PairedPawnDebugInfo_C_PackageTypeBinding");
static_assert(sizeof(WBP_PairedPawnDebugInfo_C_PackageTypeBinding) == 0x000048, "Wrong size on WBP_PairedPawnDebugInfo_C_PackageTypeBinding");
static_assert(offsetof(WBP_PairedPawnDebugInfo_C_PackageTypeBinding, ReturnValue) == 0x000000, "Member 'WBP_PairedPawnDebugInfo_C_PackageTypeBinding::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnDebugInfo_C_PackageTypeBinding, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'WBP_PairedPawnDebugInfo_C_PackageTypeBinding::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnDebugInfo_C_PackageTypeBinding, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000020, "Member 'WBP_PairedPawnDebugInfo_C_PackageTypeBinding::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnDebugInfo_C_PackageTypeBinding, CallFunc_Conv_StringToText_ReturnValue) == 0x000030, "Member 'WBP_PairedPawnDebugInfo_C_PackageTypeBinding::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function WBP_PairedPawnDebugInfo.WBP_PairedPawnDebugInfo_C.PawnNameBinding
// 0x0050 (0x0050 - 0x0000)
struct WBP_PairedPawnDebugInfo_C_PawnNameBinding final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0038(0x0018)()
};
static_assert(alignof(WBP_PairedPawnDebugInfo_C_PawnNameBinding) == 0x000008, "Wrong alignment on WBP_PairedPawnDebugInfo_C_PawnNameBinding");
static_assert(sizeof(WBP_PairedPawnDebugInfo_C_PawnNameBinding) == 0x000050, "Wrong size on WBP_PairedPawnDebugInfo_C_PawnNameBinding");
static_assert(offsetof(WBP_PairedPawnDebugInfo_C_PawnNameBinding, ReturnValue) == 0x000000, "Member 'WBP_PairedPawnDebugInfo_C_PawnNameBinding::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnDebugInfo_C_PawnNameBinding, CallFunc_K2_GetPawn_ReturnValue) == 0x000018, "Member 'WBP_PairedPawnDebugInfo_C_PawnNameBinding::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnDebugInfo_C_PawnNameBinding, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'WBP_PairedPawnDebugInfo_C_PawnNameBinding::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnDebugInfo_C_PawnNameBinding, CallFunc_IsValid_ReturnValue_1) == 0x000021, "Member 'WBP_PairedPawnDebugInfo_C_PawnNameBinding::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnDebugInfo_C_PawnNameBinding, CallFunc_GetDisplayName_ReturnValue) == 0x000028, "Member 'WBP_PairedPawnDebugInfo_C_PawnNameBinding::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnDebugInfo_C_PawnNameBinding, CallFunc_Conv_StringToText_ReturnValue) == 0x000038, "Member 'WBP_PairedPawnDebugInfo_C_PawnNameBinding::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function WBP_PairedPawnDebugInfo.WBP_PairedPawnDebugInfo_C.ProcedureTypeBinding
// 0x0048 (0x0048 - 0x0000)
struct WBP_PairedPawnDebugInfo_C_ProcedureTypeBinding final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0030(0x0018)()
};
static_assert(alignof(WBP_PairedPawnDebugInfo_C_ProcedureTypeBinding) == 0x000008, "Wrong alignment on WBP_PairedPawnDebugInfo_C_ProcedureTypeBinding");
static_assert(sizeof(WBP_PairedPawnDebugInfo_C_ProcedureTypeBinding) == 0x000048, "Wrong size on WBP_PairedPawnDebugInfo_C_ProcedureTypeBinding");
static_assert(offsetof(WBP_PairedPawnDebugInfo_C_ProcedureTypeBinding, ReturnValue) == 0x000000, "Member 'WBP_PairedPawnDebugInfo_C_ProcedureTypeBinding::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnDebugInfo_C_ProcedureTypeBinding, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'WBP_PairedPawnDebugInfo_C_ProcedureTypeBinding::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnDebugInfo_C_ProcedureTypeBinding, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000020, "Member 'WBP_PairedPawnDebugInfo_C_ProcedureTypeBinding::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnDebugInfo_C_ProcedureTypeBinding, CallFunc_Conv_StringToText_ReturnValue) == 0x000030, "Member 'WBP_PairedPawnDebugInfo_C_ProcedureTypeBinding::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function WBP_PairedPawnDebugInfo.WBP_PairedPawnDebugInfo_C.StrategyBinding
// 0x0050 (0x0050 - 0x0000)
struct WBP_PairedPawnDebugInfo_C_StrategyBinding final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0030(0x0018)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PairedPawnDebugInfo_C_StrategyBinding) == 0x000008, "Wrong alignment on WBP_PairedPawnDebugInfo_C_StrategyBinding");
static_assert(sizeof(WBP_PairedPawnDebugInfo_C_StrategyBinding) == 0x000050, "Wrong size on WBP_PairedPawnDebugInfo_C_StrategyBinding");
static_assert(offsetof(WBP_PairedPawnDebugInfo_C_StrategyBinding, ReturnValue) == 0x000000, "Member 'WBP_PairedPawnDebugInfo_C_StrategyBinding::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnDebugInfo_C_StrategyBinding, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'WBP_PairedPawnDebugInfo_C_StrategyBinding::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnDebugInfo_C_StrategyBinding, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000020, "Member 'WBP_PairedPawnDebugInfo_C_StrategyBinding::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnDebugInfo_C_StrategyBinding, CallFunc_Conv_StringToText_ReturnValue) == 0x000030, "Member 'WBP_PairedPawnDebugInfo_C_StrategyBinding::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnDebugInfo_C_StrategyBinding, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000048, "Member 'WBP_PairedPawnDebugInfo_C_StrategyBinding::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function WBP_PairedPawnDebugInfo.WBP_PairedPawnDebugInfo_C.TargetNameBinding
// 0x0050 (0x0050 - 0x0000)
struct WBP_PairedPawnDebugInfo_C_TargetNameBinding final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0030(0x0018)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PairedPawnDebugInfo_C_TargetNameBinding) == 0x000008, "Wrong alignment on WBP_PairedPawnDebugInfo_C_TargetNameBinding");
static_assert(sizeof(WBP_PairedPawnDebugInfo_C_TargetNameBinding) == 0x000050, "Wrong size on WBP_PairedPawnDebugInfo_C_TargetNameBinding");
static_assert(offsetof(WBP_PairedPawnDebugInfo_C_TargetNameBinding, ReturnValue) == 0x000000, "Member 'WBP_PairedPawnDebugInfo_C_TargetNameBinding::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnDebugInfo_C_TargetNameBinding, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'WBP_PairedPawnDebugInfo_C_TargetNameBinding::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnDebugInfo_C_TargetNameBinding, CallFunc_IsValid_ReturnValue_1) == 0x000019, "Member 'WBP_PairedPawnDebugInfo_C_TargetNameBinding::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnDebugInfo_C_TargetNameBinding, CallFunc_GetDisplayName_ReturnValue) == 0x000020, "Member 'WBP_PairedPawnDebugInfo_C_TargetNameBinding::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnDebugInfo_C_TargetNameBinding, CallFunc_Conv_StringToText_ReturnValue) == 0x000030, "Member 'WBP_PairedPawnDebugInfo_C_TargetNameBinding::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnDebugInfo_C_TargetNameBinding, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000048, "Member 'WBP_PairedPawnDebugInfo_C_TargetNameBinding::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

}

