#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModernHud_Breath

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_ModernHud_Breath.WBP_ModernHud_Breath_C.EventOnIsMenuModeUpdated
// 0x0001 (0x0001 - 0x0000)
struct WBP_ModernHud_Breath_C_EventOnIsMenuModeUpdated final
{
public:
	bool                                          NewValue;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_Breath_C_EventOnIsMenuModeUpdated) == 0x000001, "Wrong alignment on WBP_ModernHud_Breath_C_EventOnIsMenuModeUpdated");
static_assert(sizeof(WBP_ModernHud_Breath_C_EventOnIsMenuModeUpdated) == 0x000001, "Wrong size on WBP_ModernHud_Breath_C_EventOnIsMenuModeUpdated");
static_assert(offsetof(WBP_ModernHud_Breath_C_EventOnIsMenuModeUpdated, NewValue) == 0x000000, "Member 'WBP_ModernHud_Breath_C_EventOnIsMenuModeUpdated::NewValue' has a wrong offset!");

// Function WBP_ModernHud_Breath.WBP_ModernHud_Breath_C.ExecuteUbergraph_WBP_ModernHud_Breath
// 0x0078 (0x0078 - 0x0000)
struct WBP_ModernHud_Breath_C_ExecuteUbergraph_WBP_ModernHud_Breath final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_Percentage;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_NewValue_1;                     // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_NewValue;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UVOblivionInitialSettings*        CallFunc_GetOblivionInitialSettings_ReturnValue;   // 0x0048(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable;                                // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default;                             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetGlobalRTPCValue_RTPCValue_ImplicitCast; // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_BlinkingSpeed_ImplicitCast;     // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPlaybackSpeed_PlaybackSpeed_ImplicitCast; // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_Breath_C_ExecuteUbergraph_WBP_ModernHud_Breath) == 0x000008, "Wrong alignment on WBP_ModernHud_Breath_C_ExecuteUbergraph_WBP_ModernHud_Breath");
static_assert(sizeof(WBP_ModernHud_Breath_C_ExecuteUbergraph_WBP_ModernHud_Breath) == 0x000078, "Wrong size on WBP_ModernHud_Breath_C_ExecuteUbergraph_WBP_ModernHud_Breath");
static_assert(offsetof(WBP_ModernHud_Breath_C_ExecuteUbergraph_WBP_ModernHud_Breath, EntryPoint) == 0x000000, "Member 'WBP_ModernHud_Breath_C_ExecuteUbergraph_WBP_ModernHud_Breath::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Breath_C_ExecuteUbergraph_WBP_ModernHud_Breath, Temp_bool_Variable) == 0x000004, "Member 'WBP_ModernHud_Breath_C_ExecuteUbergraph_WBP_ModernHud_Breath::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Breath_C_ExecuteUbergraph_WBP_ModernHud_Breath, K2Node_CustomEvent_Percentage) == 0x000008, "Member 'WBP_ModernHud_Breath_C_ExecuteUbergraph_WBP_ModernHud_Breath::K2Node_CustomEvent_Percentage' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Breath_C_ExecuteUbergraph_WBP_ModernHud_Breath, K2Node_CustomEvent_NewValue_1) == 0x000010, "Member 'WBP_ModernHud_Breath_C_ExecuteUbergraph_WBP_ModernHud_Breath::K2Node_CustomEvent_NewValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Breath_C_ExecuteUbergraph_WBP_ModernHud_Breath, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000018, "Member 'WBP_ModernHud_Breath_C_ExecuteUbergraph_WBP_ModernHud_Breath::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Breath_C_ExecuteUbergraph_WBP_ModernHud_Breath, K2Node_CustomEvent_NewValue) == 0x000020, "Member 'WBP_ModernHud_Breath_C_ExecuteUbergraph_WBP_ModernHud_Breath::K2Node_CustomEvent_NewValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Breath_C_ExecuteUbergraph_WBP_ModernHud_Breath, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000028, "Member 'WBP_ModernHud_Breath_C_ExecuteUbergraph_WBP_ModernHud_Breath::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Breath_C_ExecuteUbergraph_WBP_ModernHud_Breath, CallFunc_PlayAnimationForward_ReturnValue) == 0x000030, "Member 'WBP_ModernHud_Breath_C_ExecuteUbergraph_WBP_ModernHud_Breath::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Breath_C_ExecuteUbergraph_WBP_ModernHud_Breath, K2Node_Event_IsDesignTime) == 0x000038, "Member 'WBP_ModernHud_Breath_C_ExecuteUbergraph_WBP_ModernHud_Breath::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Breath_C_ExecuteUbergraph_WBP_ModernHud_Breath, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000040, "Member 'WBP_ModernHud_Breath_C_ExecuteUbergraph_WBP_ModernHud_Breath::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Breath_C_ExecuteUbergraph_WBP_ModernHud_Breath, CallFunc_GetOblivionInitialSettings_ReturnValue) == 0x000048, "Member 'WBP_ModernHud_Breath_C_ExecuteUbergraph_WBP_ModernHud_Breath::CallFunc_GetOblivionInitialSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Breath_C_ExecuteUbergraph_WBP_ModernHud_Breath, Temp_real_Variable) == 0x000050, "Member 'WBP_ModernHud_Breath_C_ExecuteUbergraph_WBP_ModernHud_Breath::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Breath_C_ExecuteUbergraph_WBP_ModernHud_Breath, K2Node_Select_Default) == 0x000058, "Member 'WBP_ModernHud_Breath_C_ExecuteUbergraph_WBP_ModernHud_Breath::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Breath_C_ExecuteUbergraph_WBP_ModernHud_Breath, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000060, "Member 'WBP_ModernHud_Breath_C_ExecuteUbergraph_WBP_ModernHud_Breath::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Breath_C_ExecuteUbergraph_WBP_ModernHud_Breath, CallFunc_SetGlobalRTPCValue_RTPCValue_ImplicitCast) == 0x000064, "Member 'WBP_ModernHud_Breath_C_ExecuteUbergraph_WBP_ModernHud_Breath::CallFunc_SetGlobalRTPCValue_RTPCValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Breath_C_ExecuteUbergraph_WBP_ModernHud_Breath, K2Node_VariableSet_BlinkingSpeed_ImplicitCast) == 0x000068, "Member 'WBP_ModernHud_Breath_C_ExecuteUbergraph_WBP_ModernHud_Breath::K2Node_VariableSet_BlinkingSpeed_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Breath_C_ExecuteUbergraph_WBP_ModernHud_Breath, CallFunc_SetPlaybackSpeed_PlaybackSpeed_ImplicitCast) == 0x000070, "Member 'WBP_ModernHud_Breath_C_ExecuteUbergraph_WBP_ModernHud_Breath::CallFunc_SetPlaybackSpeed_PlaybackSpeed_ImplicitCast' has a wrong offset!");

// Function WBP_ModernHud_Breath.WBP_ModernHud_Breath_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_ModernHud_Breath_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_Breath_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_ModernHud_Breath_C_PreConstruct");
static_assert(sizeof(WBP_ModernHud_Breath_C_PreConstruct) == 0x000001, "Wrong size on WBP_ModernHud_Breath_C_PreConstruct");
static_assert(offsetof(WBP_ModernHud_Breath_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_ModernHud_Breath_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_ModernHud_Breath.WBP_ModernHud_Breath_C.UpdateBreathPercentage
// 0x0008 (0x0008 - 0x0000)
struct WBP_ModernHud_Breath_C_UpdateBreathPercentage final
{
public:
	double                                        Percentage;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_Breath_C_UpdateBreathPercentage) == 0x000008, "Wrong alignment on WBP_ModernHud_Breath_C_UpdateBreathPercentage");
static_assert(sizeof(WBP_ModernHud_Breath_C_UpdateBreathPercentage) == 0x000008, "Wrong size on WBP_ModernHud_Breath_C_UpdateBreathPercentage");
static_assert(offsetof(WBP_ModernHud_Breath_C_UpdateBreathPercentage, Percentage) == 0x000000, "Member 'WBP_ModernHud_Breath_C_UpdateBreathPercentage::Percentage' has a wrong offset!");

// Function WBP_ModernHud_Breath.WBP_ModernHud_Breath_C.UpdateIsBreathBarBlinking
// 0x0001 (0x0001 - 0x0000)
struct WBP_ModernHud_Breath_C_UpdateIsBreathBarBlinking final
{
public:
	bool                                          NewValue;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_Breath_C_UpdateIsBreathBarBlinking) == 0x000001, "Wrong alignment on WBP_ModernHud_Breath_C_UpdateIsBreathBarBlinking");
static_assert(sizeof(WBP_ModernHud_Breath_C_UpdateIsBreathBarBlinking) == 0x000001, "Wrong size on WBP_ModernHud_Breath_C_UpdateIsBreathBarBlinking");
static_assert(offsetof(WBP_ModernHud_Breath_C_UpdateIsBreathBarBlinking, NewValue) == 0x000000, "Member 'WBP_ModernHud_Breath_C_UpdateIsBreathBarBlinking::NewValue' has a wrong offset!");

}

