#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GraphicsPanel

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GraphicsPanel.WBP_GraphicsPanel_C
// 0x0090 (0x0350 - 0x02C0)
class UWBP_GraphicsPanel_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UScrollBox*                             ScrollBoxGraphics;                                 // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_SSDWarning;                              // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDataTable*                             Table;                                             // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             Table_Windows;                                     // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMap<class FString, class UObject*>           Widgets;                                           // 0x02E8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMulticastInlineDelegate<void()>              NeedRefreshOptions;                                // 0x0338(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UVOriginalVideoSettingWidget*           CreatedWidget;                                     // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_GraphicsPanel(int32 EntryPoint);
	void InitialiseWidget(class UVOriginalVideoSettingWidget* Widget, const class FText& Label, TArray<struct FOriginalVideoOption>& Options, const struct FFloatInterval& ExtremalValue);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GraphicsPanel_C">();
	}
	static class UWBP_GraphicsPanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GraphicsPanel_C>();
	}
};
static_assert(alignof(UWBP_GraphicsPanel_C) == 0x000008, "Wrong alignment on UWBP_GraphicsPanel_C");
static_assert(sizeof(UWBP_GraphicsPanel_C) == 0x000350, "Wrong size on UWBP_GraphicsPanel_C");
static_assert(offsetof(UWBP_GraphicsPanel_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_GraphicsPanel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_GraphicsPanel_C, ScrollBoxGraphics) == 0x0002C8, "Member 'UWBP_GraphicsPanel_C::ScrollBoxGraphics' has a wrong offset!");
static_assert(offsetof(UWBP_GraphicsPanel_C, TextBlock_SSDWarning) == 0x0002D0, "Member 'UWBP_GraphicsPanel_C::TextBlock_SSDWarning' has a wrong offset!");
static_assert(offsetof(UWBP_GraphicsPanel_C, Table) == 0x0002D8, "Member 'UWBP_GraphicsPanel_C::Table' has a wrong offset!");
static_assert(offsetof(UWBP_GraphicsPanel_C, Table_Windows) == 0x0002E0, "Member 'UWBP_GraphicsPanel_C::Table_Windows' has a wrong offset!");
static_assert(offsetof(UWBP_GraphicsPanel_C, Widgets) == 0x0002E8, "Member 'UWBP_GraphicsPanel_C::Widgets' has a wrong offset!");
static_assert(offsetof(UWBP_GraphicsPanel_C, NeedRefreshOptions) == 0x000338, "Member 'UWBP_GraphicsPanel_C::NeedRefreshOptions' has a wrong offset!");
static_assert(offsetof(UWBP_GraphicsPanel_C, CreatedWidget) == 0x000348, "Member 'UWBP_GraphicsPanel_C::CreatedWidget' has a wrong offset!");

}

