#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModernMenu_Player

#include "Basic.hpp"

#include "Altar_structs.hpp"
#include "Engine_structs.hpp"
#include "EnhancedInput_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_ModernMenu_Player.WBP_ModernMenu_Player_C.ActivateBlur
// 0x0030 (0x0030 - 0x0000)
struct WBP_ModernMenu_Player_C_ActivateBlur final
{
public:
	class UVAltarUISubsystem*                     CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVPrimaryGameLayout*                    CallFunc_GetPrimaryGameLayout_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_PrimaryGameLayout_C*               K2Node_DynamicCast_AsWBP_Primary_Game_Layout;      // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_Player_C_ActivateBlur) == 0x000008, "Wrong alignment on WBP_ModernMenu_Player_C_ActivateBlur");
static_assert(sizeof(WBP_ModernMenu_Player_C_ActivateBlur) == 0x000030, "Wrong size on WBP_ModernMenu_Player_C_ActivateBlur");
static_assert(offsetof(WBP_ModernMenu_Player_C_ActivateBlur, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000000, "Member 'WBP_ModernMenu_Player_C_ActivateBlur::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Player_C_ActivateBlur, CallFunc_GetPrimaryGameLayout_ReturnValue) == 0x000008, "Member 'WBP_ModernMenu_Player_C_ActivateBlur::CallFunc_GetPrimaryGameLayout_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Player_C_ActivateBlur, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_ModernMenu_Player_C_ActivateBlur::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Player_C_ActivateBlur, K2Node_DynamicCast_AsWBP_Primary_Game_Layout) == 0x000018, "Member 'WBP_ModernMenu_Player_C_ActivateBlur::K2Node_DynamicCast_AsWBP_Primary_Game_Layout' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Player_C_ActivateBlur, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_ModernMenu_Player_C_ActivateBlur::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Player_C_ActivateBlur, CallFunc_PlayAnimation_ReturnValue) == 0x000028, "Member 'WBP_ModernMenu_Player_C_ActivateBlur::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_ModernMenu_Player.WBP_ModernMenu_Player_C.ActivateCurrentPageWidget
// 0x0020 (0x0020 - 0x0000)
struct WBP_ModernMenu_Player_C_ActivateCurrentPageWidget final
{
public:
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue_1;            // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVAltarMenu*                            K2Node_DynamicCast_AsVAltar_Menu;                  // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_Player_C_ActivateCurrentPageWidget) == 0x000008, "Wrong alignment on WBP_ModernMenu_Player_C_ActivateCurrentPageWidget");
static_assert(sizeof(WBP_ModernMenu_Player_C_ActivateCurrentPageWidget) == 0x000020, "Wrong size on WBP_ModernMenu_Player_C_ActivateCurrentPageWidget");
static_assert(offsetof(WBP_ModernMenu_Player_C_ActivateCurrentPageWidget, CallFunc_GetActiveWidget_ReturnValue) == 0x000000, "Member 'WBP_ModernMenu_Player_C_ActivateCurrentPageWidget::CallFunc_GetActiveWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Player_C_ActivateCurrentPageWidget, CallFunc_GetActiveWidget_ReturnValue_1) == 0x000008, "Member 'WBP_ModernMenu_Player_C_ActivateCurrentPageWidget::CallFunc_GetActiveWidget_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Player_C_ActivateCurrentPageWidget, K2Node_DynamicCast_AsVAltar_Menu) == 0x000010, "Member 'WBP_ModernMenu_Player_C_ActivateCurrentPageWidget::K2Node_DynamicCast_AsVAltar_Menu' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Player_C_ActivateCurrentPageWidget, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_ModernMenu_Player_C_ActivateCurrentPageWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Player_C_ActivateCurrentPageWidget, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'WBP_ModernMenu_Player_C_ActivateCurrentPageWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_ModernMenu_Player.WBP_ModernMenu_Player_C.AddSwitchTabIMC
// 0x0038 (0x0038 - 0x0000)
struct WBP_ModernMenu_Player_C_AddSwitchTabIMC final
{
public:
	struct FModifyContextOptions                  Temp_struct_Variable;                              // 0x0000(0x0001)(ConstParm, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UEnhancedInputLocalPlayerSubsystem*     CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IEnhancedInputSubsystemInterface> CallFunc_AddMappingContext_self_CastInput; // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_Player_C_AddSwitchTabIMC) == 0x000008, "Wrong alignment on WBP_ModernMenu_Player_C_AddSwitchTabIMC");
static_assert(sizeof(WBP_ModernMenu_Player_C_AddSwitchTabIMC) == 0x000038, "Wrong size on WBP_ModernMenu_Player_C_AddSwitchTabIMC");
static_assert(offsetof(WBP_ModernMenu_Player_C_AddSwitchTabIMC, Temp_struct_Variable) == 0x000000, "Member 'WBP_ModernMenu_Player_C_AddSwitchTabIMC::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Player_C_AddSwitchTabIMC, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'WBP_ModernMenu_Player_C_AddSwitchTabIMC::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Player_C_AddSwitchTabIMC, CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue) == 0x000010, "Member 'WBP_ModernMenu_Player_C_AddSwitchTabIMC::CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Player_C_AddSwitchTabIMC, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x000018, "Member 'WBP_ModernMenu_Player_C_AddSwitchTabIMC::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Player_C_AddSwitchTabIMC, CallFunc_AddMappingContext_self_CastInput) == 0x000020, "Member 'WBP_ModernMenu_Player_C_AddSwitchTabIMC::CallFunc_AddMappingContext_self_CastInput' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Player_C_AddSwitchTabIMC, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'WBP_ModernMenu_Player_C_AddSwitchTabIMC::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_ModernMenu_Player.WBP_ModernMenu_Player_C.BndEvt__WBP_ModernMenu_Player_modern_header_K2Node_ComponentBoundEvent_4_OnTabClick__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_ModernMenu_Player_C_BndEvt__WBP_ModernMenu_Player_modern_header_K2Node_ComponentBoundEvent_4_OnTabClick__DelegateSignature final
{
public:
	ELegacyPlayerMenuPage                         NewPage;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_Player_C_BndEvt__WBP_ModernMenu_Player_modern_header_K2Node_ComponentBoundEvent_4_OnTabClick__DelegateSignature) == 0x000001, "Wrong alignment on WBP_ModernMenu_Player_C_BndEvt__WBP_ModernMenu_Player_modern_header_K2Node_ComponentBoundEvent_4_OnTabClick__DelegateSignature");
static_assert(sizeof(WBP_ModernMenu_Player_C_BndEvt__WBP_ModernMenu_Player_modern_header_K2Node_ComponentBoundEvent_4_OnTabClick__DelegateSignature) == 0x000001, "Wrong size on WBP_ModernMenu_Player_C_BndEvt__WBP_ModernMenu_Player_modern_header_K2Node_ComponentBoundEvent_4_OnTabClick__DelegateSignature");
static_assert(offsetof(WBP_ModernMenu_Player_C_BndEvt__WBP_ModernMenu_Player_modern_header_K2Node_ComponentBoundEvent_4_OnTabClick__DelegateSignature, NewPage) == 0x000000, "Member 'WBP_ModernMenu_Player_C_BndEvt__WBP_ModernMenu_Player_modern_header_K2Node_ComponentBoundEvent_4_OnTabClick__DelegateSignature::NewPage' has a wrong offset!");

// Function WBP_ModernMenu_Player.WBP_ModernMenu_Player_C.BP_OnHandleBackAction
// 0x0018 (0x0018 - 0x0000)
struct WBP_ModernMenu_Player_C_BP_OnHandleBackAction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Try_Close_Quick_Wheel_Succeeded;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UVLegacyPlayerSubMenuBase*              CallFunc_Get_Menu_Widget_CurrentMenu;              // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RouteBackEvent_ReturnValue;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_Player_C_BP_OnHandleBackAction) == 0x000008, "Wrong alignment on WBP_ModernMenu_Player_C_BP_OnHandleBackAction");
static_assert(sizeof(WBP_ModernMenu_Player_C_BP_OnHandleBackAction) == 0x000018, "Wrong size on WBP_ModernMenu_Player_C_BP_OnHandleBackAction");
static_assert(offsetof(WBP_ModernMenu_Player_C_BP_OnHandleBackAction, ReturnValue) == 0x000000, "Member 'WBP_ModernMenu_Player_C_BP_OnHandleBackAction::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Player_C_BP_OnHandleBackAction, CallFunc_Try_Close_Quick_Wheel_Succeeded) == 0x000001, "Member 'WBP_ModernMenu_Player_C_BP_OnHandleBackAction::CallFunc_Try_Close_Quick_Wheel_Succeeded' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Player_C_BP_OnHandleBackAction, CallFunc_Get_Menu_Widget_CurrentMenu) == 0x000008, "Member 'WBP_ModernMenu_Player_C_BP_OnHandleBackAction::CallFunc_Get_Menu_Widget_CurrentMenu' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Player_C_BP_OnHandleBackAction, CallFunc_RouteBackEvent_ReturnValue) == 0x000010, "Member 'WBP_ModernMenu_Player_C_BP_OnHandleBackAction::CallFunc_RouteBackEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Player_C_BP_OnHandleBackAction, CallFunc_BooleanOR_ReturnValue) == 0x000011, "Member 'WBP_ModernMenu_Player_C_BP_OnHandleBackAction::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function WBP_ModernMenu_Player.WBP_ModernMenu_Player_C.Change Page
// 0x0004 (0x0004 - 0x0000)
struct WBP_ModernMenu_Player_C_Change_Page final
{
public:
	ELegacyPlayerMenuPage                         NewPage;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoSettingsBlockNavigation_Value;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSettingsMenuDirty_Value;                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_Player_C_Change_Page) == 0x000001, "Wrong alignment on WBP_ModernMenu_Player_C_Change_Page");
static_assert(sizeof(WBP_ModernMenu_Player_C_Change_Page) == 0x000004, "Wrong size on WBP_ModernMenu_Player_C_Change_Page");
static_assert(offsetof(WBP_ModernMenu_Player_C_Change_Page, NewPage) == 0x000000, "Member 'WBP_ModernMenu_Player_C_Change_Page::NewPage' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Player_C_Change_Page, CallFunc_DoSettingsBlockNavigation_Value) == 0x000001, "Member 'WBP_ModernMenu_Player_C_Change_Page::CallFunc_DoSettingsBlockNavigation_Value' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Player_C_Change_Page, CallFunc_Not_PreBool_ReturnValue) == 0x000002, "Member 'WBP_ModernMenu_Player_C_Change_Page::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Player_C_Change_Page, CallFunc_IsSettingsMenuDirty_Value) == 0x000003, "Member 'WBP_ModernMenu_Player_C_Change_Page::CallFunc_IsSettingsMenuDirty_Value' has a wrong offset!");

// Function WBP_ModernMenu_Player.WBP_ModernMenu_Player_C.CustomSetActiveWidget
// 0x0020 (0x0020 - 0x0000)
struct WBP_ModernMenu_Player_C_CustomSetActiveWidget final
{
public:
	ELegacyPlayerMenuPage                         PageEnum;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVLegacyPlayerSubMenuBase*              CallFunc_Get_Menu_Widget_CurrentMenu;              // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVLegacyPlayerSubMenuBase*              CallFunc_Get_Menu_Widget_CurrentMenu_1;            // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_Player_C_CustomSetActiveWidget) == 0x000008, "Wrong alignment on WBP_ModernMenu_Player_C_CustomSetActiveWidget");
static_assert(sizeof(WBP_ModernMenu_Player_C_CustomSetActiveWidget) == 0x000020, "Wrong size on WBP_ModernMenu_Player_C_CustomSetActiveWidget");
static_assert(offsetof(WBP_ModernMenu_Player_C_CustomSetActiveWidget, PageEnum) == 0x000000, "Member 'WBP_ModernMenu_Player_C_CustomSetActiveWidget::PageEnum' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Player_C_CustomSetActiveWidget, CallFunc_Get_Menu_Widget_CurrentMenu) == 0x000008, "Member 'WBP_ModernMenu_Player_C_CustomSetActiveWidget::CallFunc_Get_Menu_Widget_CurrentMenu' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Player_C_CustomSetActiveWidget, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_ModernMenu_Player_C_CustomSetActiveWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Player_C_CustomSetActiveWidget, CallFunc_Get_Menu_Widget_CurrentMenu_1) == 0x000018, "Member 'WBP_ModernMenu_Player_C_CustomSetActiveWidget::CallFunc_Get_Menu_Widget_CurrentMenu_1' has a wrong offset!");

// Function WBP_ModernMenu_Player.WBP_ModernMenu_Player_C.DeactivateCurrentPageWidget
// 0x0020 (0x0020 - 0x0000)
struct WBP_ModernMenu_Player_C_DeactivateCurrentPageWidget final
{
public:
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue_1;            // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVAltarMenu*                            K2Node_DynamicCast_AsVAltar_Menu;                  // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_Player_C_DeactivateCurrentPageWidget) == 0x000008, "Wrong alignment on WBP_ModernMenu_Player_C_DeactivateCurrentPageWidget");
static_assert(sizeof(WBP_ModernMenu_Player_C_DeactivateCurrentPageWidget) == 0x000020, "Wrong size on WBP_ModernMenu_Player_C_DeactivateCurrentPageWidget");
static_assert(offsetof(WBP_ModernMenu_Player_C_DeactivateCurrentPageWidget, CallFunc_GetActiveWidget_ReturnValue) == 0x000000, "Member 'WBP_ModernMenu_Player_C_DeactivateCurrentPageWidget::CallFunc_GetActiveWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Player_C_DeactivateCurrentPageWidget, CallFunc_GetActiveWidget_ReturnValue_1) == 0x000008, "Member 'WBP_ModernMenu_Player_C_DeactivateCurrentPageWidget::CallFunc_GetActiveWidget_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Player_C_DeactivateCurrentPageWidget, K2Node_DynamicCast_AsVAltar_Menu) == 0x000010, "Member 'WBP_ModernMenu_Player_C_DeactivateCurrentPageWidget::K2Node_DynamicCast_AsVAltar_Menu' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Player_C_DeactivateCurrentPageWidget, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_ModernMenu_Player_C_DeactivateCurrentPageWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Player_C_DeactivateCurrentPageWidget, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'WBP_ModernMenu_Player_C_DeactivateCurrentPageWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_ModernMenu_Player.WBP_ModernMenu_Player_C.DisplayPlayerPreview
// 0x0007 (0x0007 - 0x0000)
struct WBP_ModernMenu_Player_C_DisplayPlayerPreview final
{
public:
	bool                                          InShouldDisplayInventoryPreview;                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InShowPlayerCharacter;                             // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActivated_ReturnValue;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActivated_ReturnValue_1;                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_Player_C_DisplayPlayerPreview) == 0x000001, "Wrong alignment on WBP_ModernMenu_Player_C_DisplayPlayerPreview");
static_assert(sizeof(WBP_ModernMenu_Player_C_DisplayPlayerPreview) == 0x000007, "Wrong size on WBP_ModernMenu_Player_C_DisplayPlayerPreview");
static_assert(offsetof(WBP_ModernMenu_Player_C_DisplayPlayerPreview, InShouldDisplayInventoryPreview) == 0x000000, "Member 'WBP_ModernMenu_Player_C_DisplayPlayerPreview::InShouldDisplayInventoryPreview' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Player_C_DisplayPlayerPreview, InShowPlayerCharacter) == 0x000001, "Member 'WBP_ModernMenu_Player_C_DisplayPlayerPreview::InShowPlayerCharacter' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Player_C_DisplayPlayerPreview, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000002, "Member 'WBP_ModernMenu_Player_C_DisplayPlayerPreview::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Player_C_DisplayPlayerPreview, CallFunc_IsActivated_ReturnValue) == 0x000003, "Member 'WBP_ModernMenu_Player_C_DisplayPlayerPreview::CallFunc_IsActivated_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Player_C_DisplayPlayerPreview, CallFunc_IsActivated_ReturnValue_1) == 0x000004, "Member 'WBP_ModernMenu_Player_C_DisplayPlayerPreview::CallFunc_IsActivated_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Player_C_DisplayPlayerPreview, CallFunc_Not_PreBool_ReturnValue) == 0x000005, "Member 'WBP_ModernMenu_Player_C_DisplayPlayerPreview::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Player_C_DisplayPlayerPreview, CallFunc_IsValid_ReturnValue) == 0x000006, "Member 'WBP_ModernMenu_Player_C_DisplayPlayerPreview::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_ModernMenu_Player.WBP_ModernMenu_Player_C.DoSettingsBlockNavigation
// 0x0008 (0x0008 - 0x0000)
struct WBP_ModernMenu_Player_C_DoSettingsBlockNavigation final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNavigationAllowed_IsAllowed;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesHavePopup_Value;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSettingsLocked_IsLocked;                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_Player_C_DoSettingsBlockNavigation) == 0x000001, "Wrong alignment on WBP_ModernMenu_Player_C_DoSettingsBlockNavigation");
static_assert(sizeof(WBP_ModernMenu_Player_C_DoSettingsBlockNavigation) == 0x000008, "Wrong size on WBP_ModernMenu_Player_C_DoSettingsBlockNavigation");
static_assert(offsetof(WBP_ModernMenu_Player_C_DoSettingsBlockNavigation, Value) == 0x000000, "Member 'WBP_ModernMenu_Player_C_DoSettingsBlockNavigation::Value' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Player_C_DoSettingsBlockNavigation, CallFunc_IsNavigationAllowed_IsAllowed) == 0x000001, "Member 'WBP_ModernMenu_Player_C_DoSettingsBlockNavigation::CallFunc_IsNavigationAllowed_IsAllowed' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Player_C_DoSettingsBlockNavigation, CallFunc_DoesHavePopup_Value) == 0x000002, "Member 'WBP_ModernMenu_Player_C_DoSettingsBlockNavigation::CallFunc_DoesHavePopup_Value' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Player_C_DoSettingsBlockNavigation, CallFunc_Not_PreBool_ReturnValue) == 0x000003, "Member 'WBP_ModernMenu_Player_C_DoSettingsBlockNavigation::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Player_C_DoSettingsBlockNavigation, CallFunc_IsSettingsLocked_IsLocked) == 0x000004, "Member 'WBP_ModernMenu_Player_C_DoSettingsBlockNavigation::CallFunc_IsSettingsLocked_IsLocked' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Player_C_DoSettingsBlockNavigation, CallFunc_IsValid_ReturnValue) == 0x000005, "Member 'WBP_ModernMenu_Player_C_DoSettingsBlockNavigation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Player_C_DoSettingsBlockNavigation, CallFunc_BooleanOR_ReturnValue) == 0x000006, "Member 'WBP_ModernMenu_Player_C_DoSettingsBlockNavigation::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Player_C_DoSettingsBlockNavigation, CallFunc_BooleanOR_ReturnValue_1) == 0x000007, "Member 'WBP_ModernMenu_Player_C_DoSettingsBlockNavigation::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");

// Function WBP_ModernMenu_Player.WBP_ModernMenu_Player_C.EventSetPreviewState
// 0x0001 (0x0001 - 0x0000)
struct WBP_ModernMenu_Player_C_EventSetPreviewState final
{
public:
	bool                                          NewState;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_Player_C_EventSetPreviewState) == 0x000001, "Wrong alignment on WBP_ModernMenu_Player_C_EventSetPreviewState");
static_assert(sizeof(WBP_ModernMenu_Player_C_EventSetPreviewState) == 0x000001, "Wrong size on WBP_ModernMenu_Player_C_EventSetPreviewState");
static_assert(offsetof(WBP_ModernMenu_Player_C_EventSetPreviewState, NewState) == 0x000000, "Member 'WBP_ModernMenu_Player_C_EventSetPreviewState::NewState' has a wrong offset!");

// Function WBP_ModernMenu_Player.WBP_ModernMenu_Player_C.ExecuteUbergraph_WBP_ModernMenu_Player
// 0x0308 (0x0308 - 0x0000)
struct WBP_ModernMenu_Player_C_ExecuteUbergraph_WBP_ModernMenu_Player final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELegacyPlayerMenuPage                         Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELegacyPlayerMenuPage                         Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELegacyPlayerMenuPage                         Temp_byte_Variable_2;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELegacyPlayerMenuPage                         Temp_byte_Variable_3;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELegacyPlayerMenuPage                         Temp_byte_Variable_4;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_1;     // 0x0010(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_1;     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_1;   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_1;    // 0x0038(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue;  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           Temp_object_Variable;                              // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable;                                // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_0;                              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_1_0;                            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue;       // 0x0078(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime;       // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime;     // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction;      // 0x00A0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable_1;                            // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_1; // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_2;                              // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3;                              // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2_0;                            // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3_0;                            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_4;                              // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_5;                              // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVViewModelBase*                        K2Node_Event_ViewModelRef;                         // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x00F8(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           Temp_object_Variable_2;                            // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_2;     // 0x0140(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_2;     // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_2;   // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_2;    // 0x0168(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_5_0;                            // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_4_0;                            // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_2; // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELegacyPlayerMenuPage                         K2Node_CustomEvent_NewCurrentPage;                 // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0182(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELegacyMapMenuPage                            Temp_byte_Variable_5;                              // 0x0183(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FadingOutAnimation_FirstAnimationEndTime; // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FadingOutAnimation_SecondAnimationEndTime; // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FadingOutAnimation_ThirdAnimationEndTime; // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue;                         // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue_1;                       // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x01B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B3[0x1];                                      // 0x01B3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x01B4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x01C4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ELegacyPlayerMenuPage                         K2Node_ComponentBoundEvent_NewPage;                // 0x01D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Is_Focused_In_Top_Layer_ReturnValue;      // 0x01D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELegacyMapMenuPage                            K2Node_CustomEvent_MapQuestPage;                   // 0x01D6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELegacyPlayerMenuPage                         K2Node_Select_Default;                             // 0x01D7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActivated_ReturnValue;                  // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVLegacyPlayerSubMenuBase*              CallFunc_Get_Menu_Widget_CurrentMenu;              // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AVInventoryPlayerCharacter*             CallFunc_GetInventoryPlayer_ReturnValue;           // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldMovePlayerPreview_ShouldMove;       // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x3];                                      // 0x01F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x01FC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x020C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x021C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21D[0x3];                                      // 0x021D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0220(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0230(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FadingOutAnimation_FirstAnimationEndTime_1; // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FadingOutAnimation_SecondAnimationEndTime_1; // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FadingOutAnimation_ThirdAnimationEndTime_1; // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UpdatePlayerMenuState_bDoNeedToClosePlayerMenu; // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FMax_ReturnValue_2;                       // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue_3;                       // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UpdatePlayerMenuState_bDoNeedToClosePlayerMenu_1; // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AVInventoryPlayerCharacter*             CallFunc_GetInventoryPlayer_ReturnValue_1;         // 0x0278(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UCommonActivatableWidget*         CallFunc_GetMenuFromEnum_ReturnValue;              // 0x0280(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0289(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x028A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoSettingsBlockNavigation_Value;          // 0x028B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Is_Focused_In_Top_Layer_ReturnValue_1;    // 0x028C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x028D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoSettingsBlockNavigation_Value_1;        // 0x028E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x028F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0291(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Is_Focused_In_Top_Layer_ReturnValue_2;    // 0x0292(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoSettingsBlockNavigation_Value_2;        // 0x0293(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x0294(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0295(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_NewState;                       // 0x0296(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_297[0x1];                                      // 0x0297(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UVUINavigationGlobalSubsystem*          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0298(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IVEnhancedInputNavigable> CallFunc_NavigateToWidget_Widget_CastInput;     // 0x02A0(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_ShouldShowPlayerCharacter;      // 0x02B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldMovePlayerPreview_ShouldMove_1;     // 0x02B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSettingsMenuDirty_Value;                // 0x02B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x02B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x02B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B6[0x2];                                      // 0x02B6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x02B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AVEnhancedAltarPlayerController*        K2Node_DynamicCast_AsVEnhanced_Altar_Player_Controller; // 0x02C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x02D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AVEnhancedAltarPlayerController*        K2Node_DynamicCast_AsVEnhanced_Altar_Player_Controller_1; // 0x02D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E1[0x7];                                      // 0x02E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x02E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AVEnhancedAltarPlayerController*        K2Node_DynamicCast_AsVEnhanced_Altar_Player_Controller_2; // 0x02F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F9[0x3];                                      // 0x02F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast_1;            // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_Player_C_ExecuteUbergraph_WBP_ModernMenu_Player) == 0x000008, "Wrong alignment on WBP_ModernMenu_Player_C_ExecuteUbergraph_WBP_ModernMenu_Player");
static_assert(sizeof(WBP_ModernMenu_Player_C_ExecuteUbergraph_WBP_ModernMenu_Player) == 0x000308, "Wrong size on WBP_ModernMenu_Player_C_ExecuteUbergraph_WBP_ModernMenu_Player");
static_assert(offsetof(WBP_ModernMenu_Player_C_ExecuteUbergraph_WBP_ModernMenu_Player, EntryPoint) == 0x000000, "Member 'WBP_ModernMenu_Player_C_ExecuteUbergraph_WBP_ModernMenu_Player::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Player_C_ExecuteUbergraph_WBP_ModernMenu_Player, Temp_byte_Variable) == 0x000004, "Member 'WBP_ModernMenu_Player_C_ExecuteUbergraph_WBP_ModernMenu_Player::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Player_C_ExecuteUbergraph_WBP_ModernMenu_Player, Temp_byte_Variable_1) == 0x000005, "Member 'WBP_ModernMenu_Player_C_ExecuteUbergraph_WBP_ModernMenu_Player::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Player_C_ExecuteUbergraph_WBP_ModernMenu_Player, Temp_byte_Variable_2) == 0x000006, "Member 'WBP_ModernMenu_Player_C_ExecuteUbergraph_WBP_ModernMenu_Player::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Player_C_ExecuteUbergraph_WBP_ModernMenu_Player, Temp_byte_Variable_3) == 0x000007, "Member 'WBP_ModernMenu_Player_C_ExecuteUbergraph_WBP_ModernMenu_Player::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Player_C_ExecuteUbergraph_WBP_ModernMenu_Player, Temp_byte_Variable_4) == 0x000008, "Member 'WBP_ModernMenu_Player_C_ExecuteUbergraph_WBP_ModernMenu_Player::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Player_C_ExecuteUbergraph_WBP_ModernMenu_Player, K2Node_EnhancedInputActionEvent_ActionValue_1) == 0x000010, "Member 'WBP_ModernMenu_Player_C_ExecuteUbergraph_WBP_ModernMenu_Player::K2Node_EnhancedInputActionEvent_ActionValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Player_C_ExecuteUbergraph_WBP_ModernMenu_Player, K2Node_EnhancedInputActionEvent_ElapsedTime_1) == 0x000030, "Member 'WBP_ModernMenu_Player_C_ExecuteUbergraph_WBP_ModernMenu_Player::K2Node_EnhancedInputActionEvent_ElapsedTime_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Player_C_ExecuteUbergraph_WBP_ModernMenu_Player, K2Node_EnhancedInputActionEvent_TriggeredTime_1) == 0x000034, "Member 'WBP_ModernMenu_Player_C_ExecuteUbergraph_WBP_ModernMenu_Player::K2Node_EnhancedInputActionEvent_TriggeredTime_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Player_C_ExecuteUbergraph_WBP_ModernMenu_Player, K2Node_EnhancedInputActionEvent_SourceAction_1) == 0x000038, "Member 'WBP_ModernMenu_Player_C_ExecuteUbergraph_WBP_ModernMenu_Player::K2Node_EnhancedInputActionEvent_SourceAction_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Player_C_ExecuteUbergraph_WBP_ModernMenu_Player, CallFunc_Conv_InputActionValueToBool_ReturnValue) == 0x000040, "Member 'WBP_ModernMenu_Player_C_ExecuteUbergraph_WBP_ModernMenu_Player::CallFunc_Conv_InputActionValueToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Player_C_ExecuteUbergraph_WBP_ModernMenu_Player, Temp_object_Variable) == 0x000048, "Member 'WBP_ModernMenu_Player_C_ExecuteUbergraph_WBP_ModernMenu_Player::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Player_C_ExecuteUbergraph_WBP_ModernMenu_Player, Temp_real_Variable) == 0x000050, "Member 'WBP_ModernMenu_Player_C_ExecuteUbergraph_WBP_ModernMenu_Player::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Player_C_ExecuteUbergraph_WBP_ModernMenu_Player, Temp_real_Variable_0) == 0x000058, "Member 'WBP_ModernMenu_Player_C_ExecuteUbergraph_WBP_ModernMenu_Player::Temp_real_Variable_0' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Player_C_ExecuteUbergraph_WBP_ModernMenu_Player, Temp_real_Variable_1) == 0x000060, "Member 'WBP_ModernMenu_Player_C_ExecuteUbergraph_WBP_ModernMenu_Player::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Player_C_ExecuteUbergraph_WBP_ModernMenu_Player, Temp_bool_Variable) == 0x000068, "Member 'WBP_ModernMenu_Player_C_ExecuteUbergraph_WBP_ModernMenu_Player::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Player_C_ExecuteUbergraph_WBP_ModernMenu_Player, Temp_real_Variable_1_0) == 0x000070, "Member 'WBP_ModernMenu_Player_C_ExecuteUbergraph_WBP_ModernMenu_Player::Temp_real_Variable_1_0' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Player_C_ExecuteUbergraph_WBP_ModernMenu_Player, K2Node_EnhancedInputActionEvent_ActionValue) == 0x000078, "Member 'WBP_ModernMenu_Player_C_ExecuteUbergraph_WBP_ModernMenu_Player::K2Node_EnhancedInputActionEvent_ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Player_C_ExecuteUbergraph_WBP_ModernMenu_Player, K2Node_EnhancedInputActionEvent_ElapsedTime) == 0x000098, "Member 'WBP_ModernMenu_Player_C_ExecuteUbergraph_WBP_ModernMenu_Player::K2Node_EnhancedInputActionEvent_ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Player_C_ExecuteUbergraph_WBP_ModernMenu_Player, K2Node_EnhancedInputActionEvent_TriggeredTime) == 0x00009C, "Member 'WBP_ModernMenu_Player_C_ExecuteUbergraph_WBP_ModernMenu_Player::K2Node_EnhancedInputActionEvent_TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Player_C_ExecuteUbergraph_WBP_ModernMenu_Player, K2Node_EnhancedInputActionEvent_SourceAction) == 0x0000A0, "Member 'WBP_ModernMenu_Player_C_ExecuteUbergraph_WBP_ModernMenu_Player::K2Node_EnhancedInputActionEvent_SourceAction' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Player_C_ExecuteUbergraph_WBP_ModernMenu_Player, Temp_object_Variable_1) == 0x0000A8, "Member 'WBP_ModernMenu_Player_C_ExecuteUbergraph_WBP_ModernMenu_Player::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Player_C_ExecuteUbergraph_WBP_ModernMenu_Player, CallFunc_Conv_InputActionValueToBool_ReturnValue_1) == 0x0000B0, "Member 'WBP_ModernMenu_Player_C_ExecuteUbergraph_WBP_ModernMenu_Player::CallFunc_Conv_InputActionValueToBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Player_C_ExecuteUbergraph_WBP_ModernMenu_Player, Temp_real_Variable_2) == 0x0000B8, "Member 'WBP_ModernMenu_Player_C_ExecuteUbergraph_WBP_ModernMenu_Player::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Player_C_ExecuteUbergraph_WBP_ModernMenu_Player, Temp_real_Variable_3) == 0x0000C0, "Member 'WBP_ModernMenu_Player_C_ExecuteUbergraph_WBP_ModernMenu_Player::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Player_C_ExecuteUbergraph_WBP_ModernMenu_Player, Temp_real_Variable_2_0) == 0x0000C8, "Member 'WBP_ModernMenu_Player_C_ExecuteUbergraph_WBP_ModernMenu_Player::Temp_real_Variable_2_0' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Player_C_ExecuteUbergraph_WBP_ModernMenu_Player, Temp_real_Variable_3_0) == 0x0000D0, "Member 'WBP_ModernMenu_Player_C_ExecuteUbergraph_WBP_ModernMenu_Player::Temp_real_Variable_3_0' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Player_C_ExecuteUbergraph_WBP_ModernMenu_Player, Temp_bool_Variable_1) == 0x0000D8, "Member 'WBP_ModernMenu_Player_C_ExecuteUbergraph_WBP_ModernMenu_Player::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Player_C_ExecuteUbergraph_WBP_ModernMenu_Player, Temp_real_Variable_4) == 0x0000E0, "Member 'WBP_ModernMenu_Player_C_ExecuteUbergraph_WBP_ModernMenu_Player::Temp_real_Variable_4' has a wrong offset!");
