#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModernPrefab_ButtonWrapper

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_ModernPrefab_ButtonWrapper.WBP_ModernPrefab_ButtonWrapper_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_ModernPrefab_ButtonWrapper_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernPrefab_ButtonWrapper_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_ModernPrefab_ButtonWrapper_C_PreConstruct");
static_assert(sizeof(WBP_ModernPrefab_ButtonWrapper_C_PreConstruct) == 0x000001, "Wrong size on WBP_ModernPrefab_ButtonWrapper_C_PreConstruct");
static_assert(offsetof(WBP_ModernPrefab_ButtonWrapper_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_ModernPrefab_ButtonWrapper_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_ModernPrefab_ButtonWrapper.WBP_ModernPrefab_ButtonWrapper_C.ExecuteUbergraph_WBP_ModernPrefab_ButtonWrapper
// 0x0028 (0x0028 - 0x0000)
struct WBP_ModernPrefab_ButtonWrapper_C_ExecuteUbergraph_WBP_ModernPrefab_ButtonWrapper final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UVUINavigationGlobalSubsystem*          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IVEnhancedInputNavigable> CallFunc_NavigateToWidget_Widget_CastInput;     // 0x0018(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernPrefab_ButtonWrapper_C_ExecuteUbergraph_WBP_ModernPrefab_ButtonWrapper) == 0x000008, "Wrong alignment on WBP_ModernPrefab_ButtonWrapper_C_ExecuteUbergraph_WBP_ModernPrefab_ButtonWrapper");
static_assert(sizeof(WBP_ModernPrefab_ButtonWrapper_C_ExecuteUbergraph_WBP_ModernPrefab_ButtonWrapper) == 0x000028, "Wrong size on WBP_ModernPrefab_ButtonWrapper_C_ExecuteUbergraph_WBP_ModernPrefab_ButtonWrapper");
static_assert(offsetof(WBP_ModernPrefab_ButtonWrapper_C_ExecuteUbergraph_WBP_ModernPrefab_ButtonWrapper, EntryPoint) == 0x000000, "Member 'WBP_ModernPrefab_ButtonWrapper_C_ExecuteUbergraph_WBP_ModernPrefab_ButtonWrapper::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ModernPrefab_ButtonWrapper_C_ExecuteUbergraph_WBP_ModernPrefab_ButtonWrapper, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_ModernPrefab_ButtonWrapper_C_ExecuteUbergraph_WBP_ModernPrefab_ButtonWrapper::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_ModernPrefab_ButtonWrapper_C_ExecuteUbergraph_WBP_ModernPrefab_ButtonWrapper, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'WBP_ModernPrefab_ButtonWrapper_C_ExecuteUbergraph_WBP_ModernPrefab_ButtonWrapper::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernPrefab_ButtonWrapper_C_ExecuteUbergraph_WBP_ModernPrefab_ButtonWrapper, K2Node_ComponentBoundEvent_Button) == 0x000010, "Member 'WBP_ModernPrefab_ButtonWrapper_C_ExecuteUbergraph_WBP_ModernPrefab_ButtonWrapper::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_ModernPrefab_ButtonWrapper_C_ExecuteUbergraph_WBP_ModernPrefab_ButtonWrapper, CallFunc_NavigateToWidget_Widget_CastInput) == 0x000018, "Member 'WBP_ModernPrefab_ButtonWrapper_C_ExecuteUbergraph_WBP_ModernPrefab_ButtonWrapper::CallFunc_NavigateToWidget_Widget_CastInput' has a wrong offset!");

// Function WBP_ModernPrefab_ButtonWrapper.WBP_ModernPrefab_ButtonWrapper_C.BndEvt__WBP_ModernPrefab_ButtonWrapper_modern_prefab_button_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ModernPrefab_ButtonWrapper_C_BndEvt__WBP_ModernPrefab_ButtonWrapper_modern_prefab_button_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernPrefab_ButtonWrapper_C_BndEvt__WBP_ModernPrefab_ButtonWrapper_modern_prefab_button_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ModernPrefab_ButtonWrapper_C_BndEvt__WBP_ModernPrefab_ButtonWrapper_modern_prefab_button_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_ModernPrefab_ButtonWrapper_C_BndEvt__WBP_ModernPrefab_ButtonWrapper_modern_prefab_button_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_ModernPrefab_ButtonWrapper_C_BndEvt__WBP_ModernPrefab_ButtonWrapper_modern_prefab_button_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_ModernPrefab_ButtonWrapper_C_BndEvt__WBP_ModernPrefab_ButtonWrapper_modern_prefab_button_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_ModernPrefab_ButtonWrapper_C_BndEvt__WBP_ModernPrefab_ButtonWrapper_modern_prefab_button_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_ModernPrefab_ButtonWrapper.WBP_ModernPrefab_ButtonWrapper_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct WBP_ModernPrefab_ButtonWrapper_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernPrefab_ButtonWrapper_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_ModernPrefab_ButtonWrapper_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_ModernPrefab_ButtonWrapper_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong size on WBP_ModernPrefab_ButtonWrapper_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_ModernPrefab_ButtonWrapper_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_ModernPrefab_ButtonWrapper_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");

}

