#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Modern_Hud_Vignette

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Modern_Hud_Vignette.WBP_Modern_Hud_Vignette_C.BloodVignetteUpdate
// 0x0020 (0x0020 - 0x0000)
struct WBP_Modern_Hud_Vignette_C_BloodVignetteUpdate final
{
public:
	double                                        Health;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UVOblivionInitialSettings*        CallFunc_GetOblivionInitialSettings_ReturnValue;   // 0x0008(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Less_DoubleDouble_B_ImplicitCast;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Hud_Vignette_C_BloodVignetteUpdate) == 0x000008, "Wrong alignment on WBP_Modern_Hud_Vignette_C_BloodVignetteUpdate");
static_assert(sizeof(WBP_Modern_Hud_Vignette_C_BloodVignetteUpdate) == 0x000020, "Wrong size on WBP_Modern_Hud_Vignette_C_BloodVignetteUpdate");
static_assert(offsetof(WBP_Modern_Hud_Vignette_C_BloodVignetteUpdate, Health) == 0x000000, "Member 'WBP_Modern_Hud_Vignette_C_BloodVignetteUpdate::Health' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Hud_Vignette_C_BloodVignetteUpdate, CallFunc_GetOblivionInitialSettings_ReturnValue) == 0x000008, "Member 'WBP_Modern_Hud_Vignette_C_BloodVignetteUpdate::CallFunc_GetOblivionInitialSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Hud_Vignette_C_BloodVignetteUpdate, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000010, "Member 'WBP_Modern_Hud_Vignette_C_BloodVignetteUpdate::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Hud_Vignette_C_BloodVignetteUpdate, CallFunc_Less_DoubleDouble_B_ImplicitCast) == 0x000018, "Member 'WBP_Modern_Hud_Vignette_C_BloodVignetteUpdate::CallFunc_Less_DoubleDouble_B_ImplicitCast' has a wrong offset!");

// Function WBP_Modern_Hud_Vignette.WBP_Modern_Hud_Vignette_C.ExecuteUbergraph_WBP_Modern_Hud_Vignette
// 0x0060 (0x0060 - 0x0000)
struct WBP_Modern_Hud_Vignette_C_ExecuteUbergraph_WBP_Modern_Hud_Vignette final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetHealthBarValue_ReturnValue;            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue;        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_Health;                         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsSneaking;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_ShouldDisplayBloodVignette;     // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	const class UVOblivionInitialSettings*        CallFunc_GetOblivionInitialSettings_ReturnValue;   // 0x0020(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetHealthBarValue_ReturnValue_1;          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_NotEqual_DoubleDouble_A_ImplicitCast;     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_B_ImplicitCast;         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Hud_Vignette_C_ExecuteUbergraph_WBP_Modern_Hud_Vignette) == 0x000008, "Wrong alignment on WBP_Modern_Hud_Vignette_C_ExecuteUbergraph_WBP_Modern_Hud_Vignette");
static_assert(sizeof(WBP_Modern_Hud_Vignette_C_ExecuteUbergraph_WBP_Modern_Hud_Vignette) == 0x000060, "Wrong size on WBP_Modern_Hud_Vignette_C_ExecuteUbergraph_WBP_Modern_Hud_Vignette");
static_assert(offsetof(WBP_Modern_Hud_Vignette_C_ExecuteUbergraph_WBP_Modern_Hud_Vignette, EntryPoint) == 0x000000, "Member 'WBP_Modern_Hud_Vignette_C_ExecuteUbergraph_WBP_Modern_Hud_Vignette::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Hud_Vignette_C_ExecuteUbergraph_WBP_Modern_Hud_Vignette, CallFunc_GetHealthBarValue_ReturnValue) == 0x000004, "Member 'WBP_Modern_Hud_Vignette_C_ExecuteUbergraph_WBP_Modern_Hud_Vignette::CallFunc_GetHealthBarValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Hud_Vignette_C_ExecuteUbergraph_WBP_Modern_Hud_Vignette, CallFunc_NotEqual_DoubleDouble_ReturnValue) == 0x000008, "Member 'WBP_Modern_Hud_Vignette_C_ExecuteUbergraph_WBP_Modern_Hud_Vignette::CallFunc_NotEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Hud_Vignette_C_ExecuteUbergraph_WBP_Modern_Hud_Vignette, K2Node_CustomEvent_Health) == 0x000010, "Member 'WBP_Modern_Hud_Vignette_C_ExecuteUbergraph_WBP_Modern_Hud_Vignette::K2Node_CustomEvent_Health' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Hud_Vignette_C_ExecuteUbergraph_WBP_Modern_Hud_Vignette, K2Node_CustomEvent_IsSneaking) == 0x000018, "Member 'WBP_Modern_Hud_Vignette_C_ExecuteUbergraph_WBP_Modern_Hud_Vignette::K2Node_CustomEvent_IsSneaking' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Hud_Vignette_C_ExecuteUbergraph_WBP_Modern_Hud_Vignette, K2Node_CustomEvent_ShouldDisplayBloodVignette) == 0x000019, "Member 'WBP_Modern_Hud_Vignette_C_ExecuteUbergraph_WBP_Modern_Hud_Vignette::K2Node_CustomEvent_ShouldDisplayBloodVignette' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Hud_Vignette_C_ExecuteUbergraph_WBP_Modern_Hud_Vignette, CallFunc_GetOblivionInitialSettings_ReturnValue) == 0x000020, "Member 'WBP_Modern_Hud_Vignette_C_ExecuteUbergraph_WBP_Modern_Hud_Vignette::CallFunc_GetOblivionInitialSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Hud_Vignette_C_ExecuteUbergraph_WBP_Modern_Hud_Vignette, CallFunc_GetHealthBarValue_ReturnValue_1) == 0x000028, "Member 'WBP_Modern_Hud_Vignette_C_ExecuteUbergraph_WBP_Modern_Hud_Vignette::CallFunc_GetHealthBarValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Hud_Vignette_C_ExecuteUbergraph_WBP_Modern_Hud_Vignette, CallFunc_Less_DoubleDouble_ReturnValue) == 0x00002C, "Member 'WBP_Modern_Hud_Vignette_C_ExecuteUbergraph_WBP_Modern_Hud_Vignette::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Hud_Vignette_C_ExecuteUbergraph_WBP_Modern_Hud_Vignette, CallFunc_PlayAnimation_ReturnValue) == 0x000030, "Member 'WBP_Modern_Hud_Vignette_C_ExecuteUbergraph_WBP_Modern_Hud_Vignette::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Hud_Vignette_C_ExecuteUbergraph_WBP_Modern_Hud_Vignette, CallFunc_PlayAnimation_ReturnValue_1) == 0x000038, "Member 'WBP_Modern_Hud_Vignette_C_ExecuteUbergraph_WBP_Modern_Hud_Vignette::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Hud_Vignette_C_ExecuteUbergraph_WBP_Modern_Hud_Vignette, CallFunc_PlayAnimation_ReturnValue_2) == 0x000040, "Member 'WBP_Modern_Hud_Vignette_C_ExecuteUbergraph_WBP_Modern_Hud_Vignette::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Hud_Vignette_C_ExecuteUbergraph_WBP_Modern_Hud_Vignette, CallFunc_NotEqual_DoubleDouble_A_ImplicitCast) == 0x000048, "Member 'WBP_Modern_Hud_Vignette_C_ExecuteUbergraph_WBP_Modern_Hud_Vignette::CallFunc_NotEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Hud_Vignette_C_ExecuteUbergraph_WBP_Modern_Hud_Vignette, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x000050, "Member 'WBP_Modern_Hud_Vignette_C_ExecuteUbergraph_WBP_Modern_Hud_Vignette::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Hud_Vignette_C_ExecuteUbergraph_WBP_Modern_Hud_Vignette, CallFunc_Less_DoubleDouble_B_ImplicitCast) == 0x000058, "Member 'WBP_Modern_Hud_Vignette_C_ExecuteUbergraph_WBP_Modern_Hud_Vignette::CallFunc_Less_DoubleDouble_B_ImplicitCast' has a wrong offset!");

// Function WBP_Modern_Hud_Vignette.WBP_Modern_Hud_Vignette_C.FadeIn
// 0x0020 (0x0020 - 0x0000)
struct WBP_Modern_Hud_Vignette_C_FadeIn final
{
public:
	const class UVOblivionInitialSettings*        CallFunc_GetOblivionInitialSettings_ReturnValue;   // 0x0000(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GreaterEqual_DoubleDouble_B_ImplicitCast; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Hud_Vignette_C_FadeIn) == 0x000008, "Wrong alignment on WBP_Modern_Hud_Vignette_C_FadeIn");
static_assert(sizeof(WBP_Modern_Hud_Vignette_C_FadeIn) == 0x000020, "Wrong size on WBP_Modern_Hud_Vignette_C_FadeIn");
static_assert(offsetof(WBP_Modern_Hud_Vignette_C_FadeIn, CallFunc_GetOblivionInitialSettings_ReturnValue) == 0x000000, "Member 'WBP_Modern_Hud_Vignette_C_FadeIn::CallFunc_GetOblivionInitialSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Hud_Vignette_C_FadeIn, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_Modern_Hud_Vignette_C_FadeIn::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Hud_Vignette_C_FadeIn, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000010, "Member 'WBP_Modern_Hud_Vignette_C_FadeIn::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Hud_Vignette_C_FadeIn, CallFunc_GreaterEqual_DoubleDouble_B_ImplicitCast) == 0x000018, "Member 'WBP_Modern_Hud_Vignette_C_FadeIn::CallFunc_GreaterEqual_DoubleDouble_B_ImplicitCast' has a wrong offset!");

// Function WBP_Modern_Hud_Vignette.WBP_Modern_Hud_Vignette_C.FadeOut
// 0x0020 (0x0020 - 0x0000)
struct WBP_Modern_Hud_Vignette_C_FadeOut final
{
public:
	const class UVOblivionInitialSettings*        CallFunc_GetOblivionInitialSettings_ReturnValue;   // 0x0000(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Less_DoubleDouble_B_ImplicitCast;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Hud_Vignette_C_FadeOut) == 0x000008, "Wrong alignment on WBP_Modern_Hud_Vignette_C_FadeOut");
static_assert(sizeof(WBP_Modern_Hud_Vignette_C_FadeOut) == 0x000020, "Wrong size on WBP_Modern_Hud_Vignette_C_FadeOut");
static_assert(offsetof(WBP_Modern_Hud_Vignette_C_FadeOut, CallFunc_GetOblivionInitialSettings_ReturnValue) == 0x000000, "Member 'WBP_Modern_Hud_Vignette_C_FadeOut::CallFunc_GetOblivionInitialSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Hud_Vignette_C_FadeOut, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_Modern_Hud_Vignette_C_FadeOut::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Hud_Vignette_C_FadeOut, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000010, "Member 'WBP_Modern_Hud_Vignette_C_FadeOut::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Hud_Vignette_C_FadeOut, CallFunc_Less_DoubleDouble_B_ImplicitCast) == 0x000018, "Member 'WBP_Modern_Hud_Vignette_C_FadeOut::CallFunc_Less_DoubleDouble_B_ImplicitCast' has a wrong offset!");

// Function WBP_Modern_Hud_Vignette.WBP_Modern_Hud_Vignette_C.SneakingVignetteUpdate
// 0x0018 (0x0018 - 0x0000)
struct WBP_Modern_Hud_Vignette_C_SneakingVignetteUpdate final
{
public:
	bool                                          IsSneaking;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default;                             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Hud_Vignette_C_SneakingVignetteUpdate) == 0x000008, "Wrong alignment on WBP_Modern_Hud_Vignette_C_SneakingVignetteUpdate");
static_assert(sizeof(WBP_Modern_Hud_Vignette_C_SneakingVignetteUpdate) == 0x000018, "Wrong size on WBP_Modern_Hud_Vignette_C_SneakingVignetteUpdate");
static_assert(offsetof(WBP_Modern_Hud_Vignette_C_SneakingVignetteUpdate, IsSneaking) == 0x000000, "Member 'WBP_Modern_Hud_Vignette_C_SneakingVignetteUpdate::IsSneaking' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Hud_Vignette_C_SneakingVignetteUpdate, Temp_bool_Variable) == 0x000001, "Member 'WBP_Modern_Hud_Vignette_C_SneakingVignetteUpdate::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Hud_Vignette_C_SneakingVignetteUpdate, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000002, "Member 'WBP_Modern_Hud_Vignette_C_SneakingVignetteUpdate::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Hud_Vignette_C_SneakingVignetteUpdate, K2Node_Select_Default) == 0x000008, "Member 'WBP_Modern_Hud_Vignette_C_SneakingVignetteUpdate::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Hud_Vignette_C_SneakingVignetteUpdate, CallFunc_PlayAnimation_ReturnValue) == 0x000010, "Member 'WBP_Modern_Hud_Vignette_C_SneakingVignetteUpdate::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_Modern_Hud_Vignette.WBP_Modern_Hud_Vignette_C.UpdateHealthValue
// 0x0008 (0x0008 - 0x0000)
struct WBP_Modern_Hud_Vignette_C_UpdateHealthValue final
{
public:
	double                                        Health;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Hud_Vignette_C_UpdateHealthValue) == 0x000008, "Wrong alignment on WBP_Modern_Hud_Vignette_C_UpdateHealthValue");
static_assert(sizeof(WBP_Modern_Hud_Vignette_C_UpdateHealthValue) == 0x000008, "Wrong size on WBP_Modern_Hud_Vignette_C_UpdateHealthValue");
static_assert(offsetof(WBP_Modern_Hud_Vignette_C_UpdateHealthValue, Health) == 0x000000, "Member 'WBP_Modern_Hud_Vignette_C_UpdateHealthValue::Health' has a wrong offset!");

// Function WBP_Modern_Hud_Vignette.WBP_Modern_Hud_Vignette_C.UpdateShouldDisplayBloodVignette
// 0x0001 (0x0001 - 0x0000)
struct WBP_Modern_Hud_Vignette_C_UpdateShouldDisplayBloodVignette final
{
public:
	bool                                          ShouldDisplayBloodVignette_0;                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Hud_Vignette_C_UpdateShouldDisplayBloodVignette) == 0x000001, "Wrong alignment on WBP_Modern_Hud_Vignette_C_UpdateShouldDisplayBloodVignette");
static_assert(sizeof(WBP_Modern_Hud_Vignette_C_UpdateShouldDisplayBloodVignette) == 0x000001, "Wrong size on WBP_Modern_Hud_Vignette_C_UpdateShouldDisplayBloodVignette");
static_assert(offsetof(WBP_Modern_Hud_Vignette_C_UpdateShouldDisplayBloodVignette, ShouldDisplayBloodVignette_0) == 0x000000, "Member 'WBP_Modern_Hud_Vignette_C_UpdateShouldDisplayBloodVignette::ShouldDisplayBloodVignette_0' has a wrong offset!");

// Function WBP_Modern_Hud_Vignette.WBP_Modern_Hud_Vignette_C.UpdateSneakingProperties
// 0x0001 (0x0001 - 0x0000)
struct WBP_Modern_Hud_Vignette_C_UpdateSneakingProperties final
{
public:
	bool                                          IsSneaking;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Hud_Vignette_C_UpdateSneakingProperties) == 0x000001, "Wrong alignment on WBP_Modern_Hud_Vignette_C_UpdateSneakingProperties");
static_assert(sizeof(WBP_Modern_Hud_Vignette_C_UpdateSneakingProperties) == 0x000001, "Wrong size on WBP_Modern_Hud_Vignette_C_UpdateSneakingProperties");
static_assert(offsetof(WBP_Modern_Hud_Vignette_C_UpdateSneakingProperties, IsSneaking) == 0x000000, "Member 'WBP_Modern_Hud_Vignette_C_UpdateSneakingProperties::IsSneaking' has a wrong offset!");

}

