#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModernHud_StatusBar

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_ModernHud_StatusBar.WBP_ModernHud_StatusBar_C.ExecuteUbergraph_WBP_ModernHud_StatusBar
// 0x0040 (0x0040 - 0x0000)
struct WBP_ModernHud_StatusBar_C_ExecuteUbergraph_WBP_ModernHud_StatusBar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_Delay;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_PlayRate;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_ReversePlay;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue;        // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_StatusBar_C_ExecuteUbergraph_WBP_ModernHud_StatusBar) == 0x000008, "Wrong alignment on WBP_ModernHud_StatusBar_C_ExecuteUbergraph_WBP_ModernHud_StatusBar");
static_assert(sizeof(WBP_ModernHud_StatusBar_C_ExecuteUbergraph_WBP_ModernHud_StatusBar) == 0x000040, "Wrong size on WBP_ModernHud_StatusBar_C_ExecuteUbergraph_WBP_ModernHud_StatusBar");
static_assert(offsetof(WBP_ModernHud_StatusBar_C_ExecuteUbergraph_WBP_ModernHud_StatusBar, EntryPoint) == 0x000000, "Member 'WBP_ModernHud_StatusBar_C_ExecuteUbergraph_WBP_ModernHud_StatusBar::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBar_C_ExecuteUbergraph_WBP_ModernHud_StatusBar, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_ModernHud_StatusBar_C_ExecuteUbergraph_WBP_ModernHud_StatusBar::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBar_C_ExecuteUbergraph_WBP_ModernHud_StatusBar, K2Node_CustomEvent_Delay) == 0x000008, "Member 'WBP_ModernHud_StatusBar_C_ExecuteUbergraph_WBP_ModernHud_StatusBar::K2Node_CustomEvent_Delay' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBar_C_ExecuteUbergraph_WBP_ModernHud_StatusBar, K2Node_CustomEvent_PlayRate) == 0x000010, "Member 'WBP_ModernHud_StatusBar_C_ExecuteUbergraph_WBP_ModernHud_StatusBar::K2Node_CustomEvent_PlayRate' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBar_C_ExecuteUbergraph_WBP_ModernHud_StatusBar, K2Node_CustomEvent_ReversePlay) == 0x000018, "Member 'WBP_ModernHud_StatusBar_C_ExecuteUbergraph_WBP_ModernHud_StatusBar::K2Node_CustomEvent_ReversePlay' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBar_C_ExecuteUbergraph_WBP_ModernHud_StatusBar, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'WBP_ModernHud_StatusBar_C_ExecuteUbergraph_WBP_ModernHud_StatusBar::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBar_C_ExecuteUbergraph_WBP_ModernHud_StatusBar, CallFunc_NotEqual_DoubleDouble_ReturnValue) == 0x00002C, "Member 'WBP_ModernHud_StatusBar_C_ExecuteUbergraph_WBP_ModernHud_StatusBar::CallFunc_NotEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBar_C_ExecuteUbergraph_WBP_ModernHud_StatusBar, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000030, "Member 'WBP_ModernHud_StatusBar_C_ExecuteUbergraph_WBP_ModernHud_StatusBar::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBar_C_ExecuteUbergraph_WBP_ModernHud_StatusBar, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x000038, "Member 'WBP_ModernHud_StatusBar_C_ExecuteUbergraph_WBP_ModernHud_StatusBar::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");

// Function WBP_ModernHud_StatusBar.WBP_ModernHud_StatusBar_C.HandleFadeOutAnimation
// 0x0048 (0x0048 - 0x0000)
struct WBP_ModernHud_StatusBar_C_HandleFadeOutAnimation final
{
public:
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlayingForward_ReturnValue;    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue_1;         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlayingForward_ReturnValue_1;  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_1;       // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimationReverse_PlaybackSpeed_ImplicitCast; // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimationForward_PlaybackSpeed_ImplicitCast; // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimationForward_PlaybackSpeed_ImplicitCast_1; // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimationReverse_PlaybackSpeed_ImplicitCast_1; // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_StatusBar_C_HandleFadeOutAnimation) == 0x000008, "Wrong alignment on WBP_ModernHud_StatusBar_C_HandleFadeOutAnimation");
static_assert(sizeof(WBP_ModernHud_StatusBar_C_HandleFadeOutAnimation) == 0x000048, "Wrong size on WBP_ModernHud_StatusBar_C_HandleFadeOutAnimation");
static_assert(offsetof(WBP_ModernHud_StatusBar_C_HandleFadeOutAnimation, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000000, "Member 'WBP_ModernHud_StatusBar_C_HandleFadeOutAnimation::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBar_C_HandleFadeOutAnimation, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000008, "Member 'WBP_ModernHud_StatusBar_C_HandleFadeOutAnimation::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBar_C_HandleFadeOutAnimation, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000010, "Member 'WBP_ModernHud_StatusBar_C_HandleFadeOutAnimation::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBar_C_HandleFadeOutAnimation, CallFunc_IsAnimationPlayingForward_ReturnValue) == 0x000011, "Member 'WBP_ModernHud_StatusBar_C_HandleFadeOutAnimation::CallFunc_IsAnimationPlayingForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBar_C_HandleFadeOutAnimation, CallFunc_PlayAnimationForward_ReturnValue) == 0x000018, "Member 'WBP_ModernHud_StatusBar_C_HandleFadeOutAnimation::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBar_C_HandleFadeOutAnimation, CallFunc_IsAnimationPlaying_ReturnValue_1) == 0x000020, "Member 'WBP_ModernHud_StatusBar_C_HandleFadeOutAnimation::CallFunc_IsAnimationPlaying_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBar_C_HandleFadeOutAnimation, CallFunc_IsAnimationPlayingForward_ReturnValue_1) == 0x000021, "Member 'WBP_ModernHud_StatusBar_C_HandleFadeOutAnimation::CallFunc_IsAnimationPlayingForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBar_C_HandleFadeOutAnimation, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000028, "Member 'WBP_ModernHud_StatusBar_C_HandleFadeOutAnimation::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBar_C_HandleFadeOutAnimation, CallFunc_PlayAnimationReverse_ReturnValue_1) == 0x000030, "Member 'WBP_ModernHud_StatusBar_C_HandleFadeOutAnimation::CallFunc_PlayAnimationReverse_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBar_C_HandleFadeOutAnimation, CallFunc_PlayAnimationReverse_PlaybackSpeed_ImplicitCast) == 0x000038, "Member 'WBP_ModernHud_StatusBar_C_HandleFadeOutAnimation::CallFunc_PlayAnimationReverse_PlaybackSpeed_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBar_C_HandleFadeOutAnimation, CallFunc_PlayAnimationForward_PlaybackSpeed_ImplicitCast) == 0x00003C, "Member 'WBP_ModernHud_StatusBar_C_HandleFadeOutAnimation::CallFunc_PlayAnimationForward_PlaybackSpeed_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBar_C_HandleFadeOutAnimation, CallFunc_PlayAnimationForward_PlaybackSpeed_ImplicitCast_1) == 0x000040, "Member 'WBP_ModernHud_StatusBar_C_HandleFadeOutAnimation::CallFunc_PlayAnimationForward_PlaybackSpeed_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBar_C_HandleFadeOutAnimation, CallFunc_PlayAnimationReverse_PlaybackSpeed_ImplicitCast_1) == 0x000044, "Member 'WBP_ModernHud_StatusBar_C_HandleFadeOutAnimation::CallFunc_PlayAnimationReverse_PlaybackSpeed_ImplicitCast_1' has a wrong offset!");

// Function WBP_ModernHud_StatusBar.WBP_ModernHud_StatusBar_C.PlayFadeOutAnimation
// 0x0018 (0x0018 - 0x0000)
struct WBP_ModernHud_StatusBar_C_PlayFadeOutAnimation final
{
public:
	double                                        Delay;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        PlayRate;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReversePlay;                                       // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_StatusBar_C_PlayFadeOutAnimation) == 0x000008, "Wrong alignment on WBP_ModernHud_StatusBar_C_PlayFadeOutAnimation");
static_assert(sizeof(WBP_ModernHud_StatusBar_C_PlayFadeOutAnimation) == 0x000018, "Wrong size on WBP_ModernHud_StatusBar_C_PlayFadeOutAnimation");
static_assert(offsetof(WBP_ModernHud_StatusBar_C_PlayFadeOutAnimation, Delay) == 0x000000, "Member 'WBP_ModernHud_StatusBar_C_PlayFadeOutAnimation::Delay' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBar_C_PlayFadeOutAnimation, PlayRate) == 0x000008, "Member 'WBP_ModernHud_StatusBar_C_PlayFadeOutAnimation::PlayRate' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBar_C_PlayFadeOutAnimation, ReversePlay) == 0x000010, "Member 'WBP_ModernHud_StatusBar_C_PlayFadeOutAnimation::ReversePlay' has a wrong offset!");

// Function WBP_ModernHud_StatusBar.WBP_ModernHud_StatusBar_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_ModernHud_StatusBar_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_StatusBar_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_ModernHud_StatusBar_C_PreConstruct");
static_assert(sizeof(WBP_ModernHud_StatusBar_C_PreConstruct) == 0x000001, "Wrong size on WBP_ModernHud_StatusBar_C_PreConstruct");
static_assert(offsetof(WBP_ModernHud_StatusBar_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_ModernHud_StatusBar_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_ModernHud_StatusBar.WBP_ModernHud_StatusBar_C.SetImmediateProgress
// 0x0020 (0x0020 - 0x0000)
struct WBP_ModernHud_StatusBar_C_SetImmediateProgress final
{
public:
	double                                        In_Progress;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               LocalDynamicMaterial;                              // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_StatusBar_C_SetImmediateProgress) == 0x000008, "Wrong alignment on WBP_ModernHud_StatusBar_C_SetImmediateProgress");
static_assert(sizeof(WBP_ModernHud_StatusBar_C_SetImmediateProgress) == 0x000020, "Wrong size on WBP_ModernHud_StatusBar_C_SetImmediateProgress");
static_assert(offsetof(WBP_ModernHud_StatusBar_C_SetImmediateProgress, In_Progress) == 0x000000, "Member 'WBP_ModernHud_StatusBar_C_SetImmediateProgress::In_Progress' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBar_C_SetImmediateProgress, LocalDynamicMaterial) == 0x000008, "Member 'WBP_ModernHud_StatusBar_C_SetImmediateProgress::LocalDynamicMaterial' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBar_C_SetImmediateProgress, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000010, "Member 'WBP_ModernHud_StatusBar_C_SetImmediateProgress::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBar_C_SetImmediateProgress, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000018, "Member 'WBP_ModernHud_StatusBar_C_SetImmediateProgress::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBar_C_SetImmediateProgress, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x00001C, "Member 'WBP_ModernHud_StatusBar_C_SetImmediateProgress::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");

// Function WBP_ModernHud_StatusBar.WBP_ModernHud_StatusBar_C.SetProgress
// 0x0048 (0x0048 - 0x0000)
struct WBP_ModernHud_StatusBar_C_SetProgress final
{
public:
	double                                        InProgress;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPreview;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               Local_DynamicMaterial;                             // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_2;       // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_StatusBar_C_SetProgress) == 0x000008, "Wrong alignment on WBP_ModernHud_StatusBar_C_SetProgress");
static_assert(sizeof(WBP_ModernHud_StatusBar_C_SetProgress) == 0x000048, "Wrong size on WBP_ModernHud_StatusBar_C_SetProgress");
static_assert(offsetof(WBP_ModernHud_StatusBar_C_SetProgress, InProgress) == 0x000000, "Member 'WBP_ModernHud_StatusBar_C_SetProgress::InProgress' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBar_C_SetProgress, IsPreview) == 0x000008, "Member 'WBP_ModernHud_StatusBar_C_SetProgress::IsPreview' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBar_C_SetProgress, Local_DynamicMaterial) == 0x000010, "Member 'WBP_ModernHud_StatusBar_C_SetProgress::Local_DynamicMaterial' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBar_C_SetProgress, CallFunc_PlayAnimationForward_ReturnValue) == 0x000018, "Member 'WBP_ModernHud_StatusBar_C_SetProgress::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBar_C_SetProgress, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000020, "Member 'WBP_ModernHud_StatusBar_C_SetProgress::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBar_C_SetProgress, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000028, "Member 'WBP_ModernHud_StatusBar_C_SetProgress::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBar_C_SetProgress, CallFunc_PlayAnimationForward_ReturnValue_2) == 0x000030, "Member 'WBP_ModernHud_StatusBar_C_SetProgress::CallFunc_PlayAnimationForward_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBar_C_SetProgress, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000038, "Member 'WBP_ModernHud_StatusBar_C_SetProgress::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBar_C_SetProgress, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000040, "Member 'WBP_ModernHud_StatusBar_C_SetProgress::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBar_C_SetProgress, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x000044, "Member 'WBP_ModernHud_StatusBar_C_SetProgress::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");

// Function WBP_ModernHud_StatusBar.WBP_ModernHud_StatusBar_C.ToggleBlinking
// 0x0018 (0x0018 - 0x0000)
struct WBP_ModernHud_StatusBar_C_ToggleBlinking final
{
public:
	bool                                          bOn;                                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_StatusBar_C_ToggleBlinking) == 0x000008, "Wrong alignment on WBP_ModernHud_StatusBar_C_ToggleBlinking");
static_assert(sizeof(WBP_ModernHud_StatusBar_C_ToggleBlinking) == 0x000018, "Wrong size on WBP_ModernHud_StatusBar_C_ToggleBlinking");
static_assert(offsetof(WBP_ModernHud_StatusBar_C_ToggleBlinking, bOn) == 0x000000, "Member 'WBP_ModernHud_StatusBar_C_ToggleBlinking::bOn' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBar_C_ToggleBlinking, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000008, "Member 'WBP_ModernHud_StatusBar_C_ToggleBlinking::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_StatusBar_C_ToggleBlinking, CallFunc_PlayAnimationForward_ReturnValue) == 0x000010, "Member 'WBP_ModernHud_StatusBar_C_ToggleBlinking::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function WBP_ModernHud_StatusBar.WBP_ModernHud_StatusBar_C.TriggerBlinking
// 0x0008 (0x0008 - 0x0000)
struct WBP_ModernHud_StatusBar_C_TriggerBlinking final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_StatusBar_C_TriggerBlinking) == 0x000008, "Wrong alignment on WBP_ModernHud_StatusBar_C_TriggerBlinking");
static_assert(sizeof(WBP_ModernHud_StatusBar_C_TriggerBlinking) == 0x000008, "Wrong size on WBP_ModernHud_StatusBar_C_TriggerBlinking");
static_assert(offsetof(WBP_ModernHud_StatusBar_C_TriggerBlinking, CallFunc_PlayAnimationForward_ReturnValue) == 0x000000, "Member 'WBP_ModernHud_StatusBar_C_TriggerBlinking::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function WBP_ModernHud_StatusBar.WBP_ModernHud_StatusBar_C.GetProgress
// 0x0008 (0x0008 - 0x0000)
struct WBP_ModernHud_StatusBar_C_GetProgress final
{
public:
	double                                        Progress_0;                                        // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_StatusBar_C_GetProgress) == 0x000008, "Wrong alignment on WBP_ModernHud_StatusBar_C_GetProgress");
static_assert(sizeof(WBP_ModernHud_StatusBar_C_GetProgress) == 0x000008, "Wrong size on WBP_ModernHud_StatusBar_C_GetProgress");
static_assert(offsetof(WBP_ModernHud_StatusBar_C_GetProgress, Progress_0) == 0x000000, "Member 'WBP_ModernHud_StatusBar_C_GetProgress::Progress_0' has a wrong offset!");

}

