#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Graphics_TogglerOnOff

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Graphics_TogglerOnOff.WBP_Graphics_TogglerOnOff_C.ExecuteUbergraph_WBP_Graphics_TogglerOnOff
// 0x0040 (0x0040 - 0x0000)
struct WBP_Graphics_TogglerOnOff_C_ExecuteUbergraph_WBP_Graphics_TogglerOnOff final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SupportsHDRDisplayOutput_ReturnValue;     // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue_1;        // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue_2;        // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SupportsHDRDisplayOutput_ReturnValue_1;   // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue_3;        // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHDREnabled_ReturnValue;                 // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Graphics_TogglerOnOff_C_ExecuteUbergraph_WBP_Graphics_TogglerOnOff) == 0x000008, "Wrong alignment on WBP_Graphics_TogglerOnOff_C_ExecuteUbergraph_WBP_Graphics_TogglerOnOff");
static_assert(sizeof(WBP_Graphics_TogglerOnOff_C_ExecuteUbergraph_WBP_Graphics_TogglerOnOff) == 0x000040, "Wrong size on WBP_Graphics_TogglerOnOff_C_ExecuteUbergraph_WBP_Graphics_TogglerOnOff");
static_assert(offsetof(WBP_Graphics_TogglerOnOff_C_ExecuteUbergraph_WBP_Graphics_TogglerOnOff, EntryPoint) == 0x000000, "Member 'WBP_Graphics_TogglerOnOff_C_ExecuteUbergraph_WBP_Graphics_TogglerOnOff::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerOnOff_C_ExecuteUbergraph_WBP_Graphics_TogglerOnOff, CallFunc_GetGameUserSettings_ReturnValue) == 0x000008, "Member 'WBP_Graphics_TogglerOnOff_C_ExecuteUbergraph_WBP_Graphics_TogglerOnOff::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerOnOff_C_ExecuteUbergraph_WBP_Graphics_TogglerOnOff, CallFunc_SupportsHDRDisplayOutput_ReturnValue) == 0x000010, "Member 'WBP_Graphics_TogglerOnOff_C_ExecuteUbergraph_WBP_Graphics_TogglerOnOff::CallFunc_SupportsHDRDisplayOutput_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerOnOff_C_ExecuteUbergraph_WBP_Graphics_TogglerOnOff, CallFunc_GetGameUserSettings_ReturnValue_1) == 0x000018, "Member 'WBP_Graphics_TogglerOnOff_C_ExecuteUbergraph_WBP_Graphics_TogglerOnOff::CallFunc_GetGameUserSettings_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerOnOff_C_ExecuteUbergraph_WBP_Graphics_TogglerOnOff, CallFunc_GetGameUserSettings_ReturnValue_2) == 0x000020, "Member 'WBP_Graphics_TogglerOnOff_C_ExecuteUbergraph_WBP_Graphics_TogglerOnOff::CallFunc_GetGameUserSettings_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerOnOff_C_ExecuteUbergraph_WBP_Graphics_TogglerOnOff, CallFunc_SupportsHDRDisplayOutput_ReturnValue_1) == 0x000028, "Member 'WBP_Graphics_TogglerOnOff_C_ExecuteUbergraph_WBP_Graphics_TogglerOnOff::CallFunc_SupportsHDRDisplayOutput_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerOnOff_C_ExecuteUbergraph_WBP_Graphics_TogglerOnOff, CallFunc_GetGameUserSettings_ReturnValue_3) == 0x000030, "Member 'WBP_Graphics_TogglerOnOff_C_ExecuteUbergraph_WBP_Graphics_TogglerOnOff::CallFunc_GetGameUserSettings_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerOnOff_C_ExecuteUbergraph_WBP_Graphics_TogglerOnOff, CallFunc_IsHDREnabled_ReturnValue) == 0x000038, "Member 'WBP_Graphics_TogglerOnOff_C_ExecuteUbergraph_WBP_Graphics_TogglerOnOff::CallFunc_IsHDREnabled_ReturnValue' has a wrong offset!");

// Function WBP_Graphics_TogglerOnOff.WBP_Graphics_TogglerOnOff_C.HDRSwitch
// 0x0004 (0x0004 - 0x0000)
struct WBP_Graphics_TogglerOnOff_C_HDRSwitch final
{
public:
	bool                                          Off;                                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          On;                                                // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Graphics_TogglerOnOff_C_HDRSwitch) == 0x000001, "Wrong alignment on WBP_Graphics_TogglerOnOff_C_HDRSwitch");
static_assert(sizeof(WBP_Graphics_TogglerOnOff_C_HDRSwitch) == 0x000004, "Wrong size on WBP_Graphics_TogglerOnOff_C_HDRSwitch");
static_assert(offsetof(WBP_Graphics_TogglerOnOff_C_HDRSwitch, Off) == 0x000000, "Member 'WBP_Graphics_TogglerOnOff_C_HDRSwitch::Off' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerOnOff_C_HDRSwitch, On) == 0x000001, "Member 'WBP_Graphics_TogglerOnOff_C_HDRSwitch::On' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerOnOff_C_HDRSwitch, CallFunc_Not_PreBool_ReturnValue) == 0x000002, "Member 'WBP_Graphics_TogglerOnOff_C_HDRSwitch::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerOnOff_C_HDRSwitch, CallFunc_Not_PreBool_ReturnValue_1) == 0x000003, "Member 'WBP_Graphics_TogglerOnOff_C_HDRSwitch::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");

// Function WBP_Graphics_TogglerOnOff.WBP_Graphics_TogglerOnOff_C.Refresh
// 0x0018 (0x0018 - 0x0000)
struct WBP_Graphics_TogglerOnOff_C_Refresh final
{
public:
	class FText                                   CallFunc_GetLabel_ReturnValue;                     // 0x0000(0x0018)(ConstParm)
};
static_assert(alignof(WBP_Graphics_TogglerOnOff_C_Refresh) == 0x000008, "Wrong alignment on WBP_Graphics_TogglerOnOff_C_Refresh");
static_assert(sizeof(WBP_Graphics_TogglerOnOff_C_Refresh) == 0x000018, "Wrong size on WBP_Graphics_TogglerOnOff_C_Refresh");
static_assert(offsetof(WBP_Graphics_TogglerOnOff_C_Refresh, CallFunc_GetLabel_ReturnValue) == 0x000000, "Member 'WBP_Graphics_TogglerOnOff_C_Refresh::CallFunc_GetLabel_ReturnValue' has a wrong offset!");

}

