#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModernMenu_HelpEntry

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_ModernMenu_HelpEntry.WBP_ModernMenu_HelpEntry_C.AnimateToView
// 0x0008 (0x0008 - 0x0000)
struct WBP_ModernMenu_HelpEntry_C_AnimateToView final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_HelpEntry_C_AnimateToView) == 0x000008, "Wrong alignment on WBP_ModernMenu_HelpEntry_C_AnimateToView");
static_assert(sizeof(WBP_ModernMenu_HelpEntry_C_AnimateToView) == 0x000008, "Wrong size on WBP_ModernMenu_HelpEntry_C_AnimateToView");
static_assert(offsetof(WBP_ModernMenu_HelpEntry_C_AnimateToView, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'WBP_ModernMenu_HelpEntry_C_AnimateToView::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_ModernMenu_HelpEntry.WBP_ModernMenu_HelpEntry_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_ModernMenu_HelpEntry_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_HelpEntry_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong alignment on WBP_ModernMenu_HelpEntry_C_BP_OnItemSelectionChanged");
static_assert(sizeof(WBP_ModernMenu_HelpEntry_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong size on WBP_ModernMenu_HelpEntry_C_BP_OnItemSelectionChanged");
static_assert(offsetof(WBP_ModernMenu_HelpEntry_C_BP_OnItemSelectionChanged, bIsSelected) == 0x000000, "Member 'WBP_ModernMenu_HelpEntry_C_BP_OnItemSelectionChanged::bIsSelected' has a wrong offset!");

// Function WBP_ModernMenu_HelpEntry.WBP_ModernMenu_HelpEntry_C.ExecuteUbergraph_WBP_ModernMenu_HelpEntry
// 0x0018 (0x0018 - 0x0000)
struct WBP_ModernMenu_HelpEntry_C_ExecuteUbergraph_WBP_ModernMenu_HelpEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_HelpEntry_C_ExecuteUbergraph_WBP_ModernMenu_HelpEntry) == 0x000008, "Wrong alignment on WBP_ModernMenu_HelpEntry_C_ExecuteUbergraph_WBP_ModernMenu_HelpEntry");
static_assert(sizeof(WBP_ModernMenu_HelpEntry_C_ExecuteUbergraph_WBP_ModernMenu_HelpEntry) == 0x000018, "Wrong size on WBP_ModernMenu_HelpEntry_C_ExecuteUbergraph_WBP_ModernMenu_HelpEntry");
static_assert(offsetof(WBP_ModernMenu_HelpEntry_C_ExecuteUbergraph_WBP_ModernMenu_HelpEntry, EntryPoint) == 0x000000, "Member 'WBP_ModernMenu_HelpEntry_C_ExecuteUbergraph_WBP_ModernMenu_HelpEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_HelpEntry_C_ExecuteUbergraph_WBP_ModernMenu_HelpEntry, K2Node_Event_ListItemObject) == 0x000008, "Member 'WBP_ModernMenu_HelpEntry_C_ExecuteUbergraph_WBP_ModernMenu_HelpEntry::K2Node_Event_ListItemObject' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_HelpEntry_C_ExecuteUbergraph_WBP_ModernMenu_HelpEntry, K2Node_Event_bIsSelected) == 0x000010, "Member 'WBP_ModernMenu_HelpEntry_C_ExecuteUbergraph_WBP_ModernMenu_HelpEntry::K2Node_Event_bIsSelected' has a wrong offset!");

// Function WBP_ModernMenu_HelpEntry.WBP_ModernMenu_HelpEntry_C.ForceUpdateAnimationCurrentTime
// 0x0038 (0x0038 - 0x0000)
struct WBP_ModernMenu_HelpEntry_C_ForceUpdateAnimationCurrentTime final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          K2Node_Select_Default;                             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default_1;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Option_1_ImplicitCast;               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Option_0_ImplicitCast;               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimation_StartAtTime_ImplicitCast;   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_HelpEntry_C_ForceUpdateAnimationCurrentTime) == 0x000008, "Wrong alignment on WBP_ModernMenu_HelpEntry_C_ForceUpdateAnimationCurrentTime");
static_assert(sizeof(WBP_ModernMenu_HelpEntry_C_ForceUpdateAnimationCurrentTime) == 0x000038, "Wrong size on WBP_ModernMenu_HelpEntry_C_ForceUpdateAnimationCurrentTime");
static_assert(offsetof(WBP_ModernMenu_HelpEntry_C_ForceUpdateAnimationCurrentTime, Temp_bool_Variable) == 0x000000, "Member 'WBP_ModernMenu_HelpEntry_C_ForceUpdateAnimationCurrentTime::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_HelpEntry_C_ForceUpdateAnimationCurrentTime, Temp_byte_Variable) == 0x000001, "Member 'WBP_ModernMenu_HelpEntry_C_ForceUpdateAnimationCurrentTime::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_HelpEntry_C_ForceUpdateAnimationCurrentTime, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_ModernMenu_HelpEntry_C_ForceUpdateAnimationCurrentTime::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_HelpEntry_C_ForceUpdateAnimationCurrentTime, Temp_bool_Variable_1) == 0x000003, "Member 'WBP_ModernMenu_HelpEntry_C_ForceUpdateAnimationCurrentTime::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_HelpEntry_C_ForceUpdateAnimationCurrentTime, CallFunc_GetEndTime_ReturnValue) == 0x000004, "Member 'WBP_ModernMenu_HelpEntry_C_ForceUpdateAnimationCurrentTime::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_HelpEntry_C_ForceUpdateAnimationCurrentTime, K2Node_Select_Default) == 0x000008, "Member 'WBP_ModernMenu_HelpEntry_C_ForceUpdateAnimationCurrentTime::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_HelpEntry_C_ForceUpdateAnimationCurrentTime, CallFunc_IsValid_ReturnValue) == 0x000009, "Member 'WBP_ModernMenu_HelpEntry_C_ForceUpdateAnimationCurrentTime::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_HelpEntry_C_ForceUpdateAnimationCurrentTime, K2Node_Select_Default_1) == 0x000010, "Member 'WBP_ModernMenu_HelpEntry_C_ForceUpdateAnimationCurrentTime::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_HelpEntry_C_ForceUpdateAnimationCurrentTime, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'WBP_ModernMenu_HelpEntry_C_ForceUpdateAnimationCurrentTime::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_HelpEntry_C_ForceUpdateAnimationCurrentTime, K2Node_Select_Option_1_ImplicitCast) == 0x000020, "Member 'WBP_ModernMenu_HelpEntry_C_ForceUpdateAnimationCurrentTime::K2Node_Select_Option_1_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_HelpEntry_C_ForceUpdateAnimationCurrentTime, K2Node_Select_Option_0_ImplicitCast) == 0x000028, "Member 'WBP_ModernMenu_HelpEntry_C_ForceUpdateAnimationCurrentTime::K2Node_Select_Option_0_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_HelpEntry_C_ForceUpdateAnimationCurrentTime, CallFunc_PlayAnimation_StartAtTime_ImplicitCast) == 0x000030, "Member 'WBP_ModernMenu_HelpEntry_C_ForceUpdateAnimationCurrentTime::CallFunc_PlayAnimation_StartAtTime_ImplicitCast' has a wrong offset!");

// Function WBP_ModernMenu_HelpEntry.WBP_ModernMenu_HelpEntry_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct WBP_ModernMenu_HelpEntry_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_HelpEntry_C_OnListItemObjectSet) == 0x000008, "Wrong alignment on WBP_ModernMenu_HelpEntry_C_OnListItemObjectSet");
static_assert(sizeof(WBP_ModernMenu_HelpEntry_C_OnListItemObjectSet) == 0x000008, "Wrong size on WBP_ModernMenu_HelpEntry_C_OnListItemObjectSet");
static_assert(offsetof(WBP_ModernMenu_HelpEntry_C_OnListItemObjectSet, ListItemObject) == 0x000000, "Member 'WBP_ModernMenu_HelpEntry_C_OnListItemObjectSet::ListItemObject' has a wrong offset!");

// Function WBP_ModernMenu_HelpEntry.WBP_ModernMenu_HelpEntry_C.PlayArrowToggleAnimation
// 0x0010 (0x0010 - 0x0000)
struct WBP_ModernMenu_HelpEntry_C_PlayArrowToggleAnimation final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_HelpEntry_C_PlayArrowToggleAnimation) == 0x000008, "Wrong alignment on WBP_ModernMenu_HelpEntry_C_PlayArrowToggleAnimation");
static_assert(sizeof(WBP_ModernMenu_HelpEntry_C_PlayArrowToggleAnimation) == 0x000010, "Wrong size on WBP_ModernMenu_HelpEntry_C_PlayArrowToggleAnimation");
static_assert(offsetof(WBP_ModernMenu_HelpEntry_C_PlayArrowToggleAnimation, Temp_bool_Variable) == 0x000000, "Member 'WBP_ModernMenu_HelpEntry_C_PlayArrowToggleAnimation::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_HelpEntry_C_PlayArrowToggleAnimation, Temp_byte_Variable) == 0x000001, "Member 'WBP_ModernMenu_HelpEntry_C_PlayArrowToggleAnimation::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_HelpEntry_C_PlayArrowToggleAnimation, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_ModernMenu_HelpEntry_C_PlayArrowToggleAnimation::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_HelpEntry_C_PlayArrowToggleAnimation, CallFunc_IsValid_ReturnValue) == 0x000003, "Member 'WBP_ModernMenu_HelpEntry_C_PlayArrowToggleAnimation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_HelpEntry_C_PlayArrowToggleAnimation, K2Node_Select_Default) == 0x000004, "Member 'WBP_ModernMenu_HelpEntry_C_PlayArrowToggleAnimation::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_HelpEntry_C_PlayArrowToggleAnimation, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_ModernMenu_HelpEntry_C_PlayArrowToggleAnimation::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_ModernMenu_HelpEntry.WBP_ModernMenu_HelpEntry_C.SetData
// 0x0030 (0x0030 - 0x0000)
struct WBP_ModernMenu_HelpEntry_C_SetData final
{
public:
	class UObject*                                InData;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHelpMenuListEntryData*                 K2Node_DynamicCast_AsHelp_Menu_List_Entry_Data;    // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsCategory_ReturnValue;                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsListItemSelected_ReturnValue;           // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_AltarTextBlock_C*                  K2Node_Select_Default;                             // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsCategory_ReturnValue_1;              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_HelpEntry_C_SetData) == 0x000008, "Wrong alignment on WBP_ModernMenu_HelpEntry_C_SetData");
static_assert(sizeof(WBP_ModernMenu_HelpEntry_C_SetData) == 0x000030, "Wrong size on WBP_ModernMenu_HelpEntry_C_SetData");
static_assert(offsetof(WBP_ModernMenu_HelpEntry_C_SetData, InData) == 0x000000, "Member 'WBP_ModernMenu_HelpEntry_C_SetData::InData' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_HelpEntry_C_SetData, Temp_bool_Variable) == 0x000008, "Member 'WBP_ModernMenu_HelpEntry_C_SetData::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_HelpEntry_C_SetData, K2Node_DynamicCast_AsHelp_Menu_List_Entry_Data) == 0x000010, "Member 'WBP_ModernMenu_HelpEntry_C_SetData::K2Node_DynamicCast_AsHelp_Menu_List_Entry_Data' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_HelpEntry_C_SetData, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_ModernMenu_HelpEntry_C_SetData::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_HelpEntry_C_SetData, CallFunc_GetIsCategory_ReturnValue) == 0x000019, "Member 'WBP_ModernMenu_HelpEntry_C_SetData::CallFunc_GetIsCategory_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_HelpEntry_C_SetData, CallFunc_IsListItemSelected_ReturnValue) == 0x00001A, "Member 'WBP_ModernMenu_HelpEntry_C_SetData::CallFunc_IsListItemSelected_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_HelpEntry_C_SetData, K2Node_Select_Default) == 0x000020, "Member 'WBP_ModernMenu_HelpEntry_C_SetData::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_HelpEntry_C_SetData, CallFunc_GetIsCategory_ReturnValue_1) == 0x000028, "Member 'WBP_ModernMenu_HelpEntry_C_SetData::CallFunc_GetIsCategory_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_HelpEntry_C_SetData, CallFunc_SelectInt_ReturnValue) == 0x00002C, "Member 'WBP_ModernMenu_HelpEntry_C_SetData::CallFunc_SelectInt_ReturnValue' has a wrong offset!");

// Function WBP_ModernMenu_HelpEntry.WBP_ModernMenu_HelpEntry_C.UpdateSelection
// 0x000E (0x000E - 0x0000)
struct WBP_ModernMenu_HelpEntry_C_UpdateSelection final
{
public:
	bool                                          bNewSelected;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsCategory_ReturnValue;                // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_HelpEntry_C_UpdateSelection) == 0x000001, "Wrong alignment on WBP_ModernMenu_HelpEntry_C_UpdateSelection");
static_assert(sizeof(WBP_ModernMenu_HelpEntry_C_UpdateSelection) == 0x00000E, "Wrong size on WBP_ModernMenu_HelpEntry_C_UpdateSelection");
static_assert(offsetof(WBP_ModernMenu_HelpEntry_C_UpdateSelection, bNewSelected) == 0x000000, "Member 'WBP_ModernMenu_HelpEntry_C_UpdateSelection::bNewSelected' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_HelpEntry_C_UpdateSelection, Temp_bool_Variable) == 0x000001, "Member 'WBP_ModernMenu_HelpEntry_C_UpdateSelection::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_HelpEntry_C_UpdateSelection, Temp_byte_Variable) == 0x000002, "Member 'WBP_ModernMenu_HelpEntry_C_UpdateSelection::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_HelpEntry_C_UpdateSelection, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_ModernMenu_HelpEntry_C_UpdateSelection::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_HelpEntry_C_UpdateSelection, Temp_bool_Variable_1) == 0x000004, "Member 'WBP_ModernMenu_HelpEntry_C_UpdateSelection::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_HelpEntry_C_UpdateSelection, Temp_byte_Variable_2) == 0x000005, "Member 'WBP_ModernMenu_HelpEntry_C_UpdateSelection::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_HelpEntry_C_UpdateSelection, Temp_byte_Variable_3) == 0x000006, "Member 'WBP_ModernMenu_HelpEntry_C_UpdateSelection::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_HelpEntry_C_UpdateSelection, Temp_bool_Variable_2) == 0x000007, "Member 'WBP_ModernMenu_HelpEntry_C_UpdateSelection::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_HelpEntry_C_UpdateSelection, Temp_byte_Variable_4) == 0x000008, "Member 'WBP_ModernMenu_HelpEntry_C_UpdateSelection::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_HelpEntry_C_UpdateSelection, Temp_byte_Variable_5) == 0x000009, "Member 'WBP_ModernMenu_HelpEntry_C_UpdateSelection::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_HelpEntry_C_UpdateSelection, K2Node_Select_Default) == 0x00000A, "Member 'WBP_ModernMenu_HelpEntry_C_UpdateSelection::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_HelpEntry_C_UpdateSelection, K2Node_Select_Default_1) == 0x00000B, "Member 'WBP_ModernMenu_HelpEntry_C_UpdateSelection::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_HelpEntry_C_UpdateSelection, K2Node_Select_Default_2) == 0x00000C, "Member 'WBP_ModernMenu_HelpEntry_C_UpdateSelection::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_HelpEntry_C_UpdateSelection, CallFunc_GetIsCategory_ReturnValue) == 0x00000D, "Member 'WBP_ModernMenu_HelpEntry_C_UpdateSelection::CallFunc_GetIsCategory_ReturnValue' has a wrong offset!");

}

