#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ListView_Help

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonInput_structs.hpp"
#include "Altar_classes.hpp"
#include "VCommonUIEnhancedInputNavigation_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ListView_Help.WBP_ListView_Help_C
// 0x0020 (0x0570 - 0x0550)
class UWBP_ListView_Help_C final : public UVAltarNavigableListView
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0550(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TMulticastInlineDelegate<void(class UObject* Item)> OnItemSelected;                              // 0x0558(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UMaterialInstanceDynamic*               ScrollMaterial;                                    // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_ListView_Help_ListView_K2Node_ComponentBoundEvent_1_OnListItemSelectionChangedDynamic__DelegateSignature(class UObject* Item, bool bIsSelected);
	void ClearList();
	void Construct();
	void ExecuteUbergraph_WBP_ListView_Help(int32 EntryPoint);
	void OnInputMethodChanged(ECommonInputType bNewInputType);
	void OnListEntriesUpdated(const TArray<class UHelpMenuListEntryData*>& InListData);
	void PreConstruct(bool IsDesignTime);
	void ScrollToViewport(class UObject* InEntry);
	void UpdateNavHint(ECommonInputType InputType);
	void UpdateSelection(class UObject* Entry);

	TScriptInterface<class IVEnhancedInputNavigable> GetNavigationWidgetForAction(EVNavigationDirection Action) const;
	bool IsNavigable() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ListView_Help_C">();
	}
	static class UWBP_ListView_Help_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ListView_Help_C>();
	}
};
static_assert(alignof(UWBP_ListView_Help_C) == 0x000008, "Wrong alignment on UWBP_ListView_Help_C");
static_assert(sizeof(UWBP_ListView_Help_C) == 0x000570, "Wrong size on UWBP_ListView_Help_C");
static_assert(offsetof(UWBP_ListView_Help_C, UberGraphFrame) == 0x000550, "Member 'UWBP_ListView_Help_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ListView_Help_C, OnItemSelected) == 0x000558, "Member 'UWBP_ListView_Help_C::OnItemSelected' has a wrong offset!");
static_assert(offsetof(UWBP_ListView_Help_C, ScrollMaterial) == 0x000568, "Member 'UWBP_ListView_Help_C::ScrollMaterial' has a wrong offset!");

}

