#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModernHud_LevelUpGauge

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ModernHud_LevelUpGauge.WBP_ModernHud_LevelUpGauge_C
// 0x0070 (0x0358 - 0x02E8)
class UWBP_ModernHud_LevelUpGauge_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ProgressAnimation;                                 // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowLevelUpIcon;                                   // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowBar;                                           // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 AltarBarProgressHighlight;                         // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               AltarLevelUpIcon;                                  // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 AltarProgressBar;                                  // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Background;                                        // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AltarRichTextBlock_C*              InfoText;                                          // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AltarRichTextBlock_C*              PlayerLevelText;                                   // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInterface*                     ProgressMaterial;                                  // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        RawProgress;                                       // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CeiledProgress;                                    // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        OldProgress;                                       // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_ModernHud_LevelUpGauge(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetInfoText(struct FModernSkillProgression& NewSkillProgress);
	void SetProgressValues(struct FModernSkillProgression& NewSkillProgress);
	void ToggleLevelUpIconVisibility(bool Visible);
	void UpdateProgress(struct FModernSkillProgression& NewSkillProgress);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ModernHud_LevelUpGauge_C">();
	}
	static class UWBP_ModernHud_LevelUpGauge_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ModernHud_LevelUpGauge_C>();
	}
};
static_assert(alignof(UWBP_ModernHud_LevelUpGauge_C) == 0x000008, "Wrong alignment on UWBP_ModernHud_LevelUpGauge_C");
static_assert(sizeof(UWBP_ModernHud_LevelUpGauge_C) == 0x000358, "Wrong size on UWBP_ModernHud_LevelUpGauge_C");
static_assert(offsetof(UWBP_ModernHud_LevelUpGauge_C, UberGraphFrame) == 0x0002E8, "Member 'UWBP_ModernHud_LevelUpGauge_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_LevelUpGauge_C, ProgressAnimation) == 0x0002F0, "Member 'UWBP_ModernHud_LevelUpGauge_C::ProgressAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_LevelUpGauge_C, ShowLevelUpIcon) == 0x0002F8, "Member 'UWBP_ModernHud_LevelUpGauge_C::ShowLevelUpIcon' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_LevelUpGauge_C, ShowBar) == 0x000300, "Member 'UWBP_ModernHud_LevelUpGauge_C::ShowBar' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_LevelUpGauge_C, AltarBarProgressHighlight) == 0x000308, "Member 'UWBP_ModernHud_LevelUpGauge_C::AltarBarProgressHighlight' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_LevelUpGauge_C, AltarLevelUpIcon) == 0x000310, "Member 'UWBP_ModernHud_LevelUpGauge_C::AltarLevelUpIcon' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_LevelUpGauge_C, AltarProgressBar) == 0x000318, "Member 'UWBP_ModernHud_LevelUpGauge_C::AltarProgressBar' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_LevelUpGauge_C, Background) == 0x000320, "Member 'UWBP_ModernHud_LevelUpGauge_C::Background' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_LevelUpGauge_C, InfoText) == 0x000328, "Member 'UWBP_ModernHud_LevelUpGauge_C::InfoText' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_LevelUpGauge_C, PlayerLevelText) == 0x000330, "Member 'UWBP_ModernHud_LevelUpGauge_C::PlayerLevelText' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_LevelUpGauge_C, ProgressMaterial) == 0x000338, "Member 'UWBP_ModernHud_LevelUpGauge_C::ProgressMaterial' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_LevelUpGauge_C, RawProgress) == 0x000340, "Member 'UWBP_ModernHud_LevelUpGauge_C::RawProgress' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_LevelUpGauge_C, CeiledProgress) == 0x000348, "Member 'UWBP_ModernHud_LevelUpGauge_C::CeiledProgress' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_LevelUpGauge_C, OldProgress) == 0x000350, "Member 'UWBP_ModernHud_LevelUpGauge_C::OldProgress' has a wrong offset!");

}

