#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModernHud_Fatigue

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_ModernHud_Fatigue.WBP_ModernHud_Fatigue_C.ExecuteUbergraph_WBP_ModernHud_Fatigue
// 0x0004 (0x0004 - 0x0000)
struct WBP_ModernHud_Fatigue_C_ExecuteUbergraph_WBP_ModernHud_Fatigue final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_Fatigue_C_ExecuteUbergraph_WBP_ModernHud_Fatigue) == 0x000004, "Wrong alignment on WBP_ModernHud_Fatigue_C_ExecuteUbergraph_WBP_ModernHud_Fatigue");
static_assert(sizeof(WBP_ModernHud_Fatigue_C_ExecuteUbergraph_WBP_ModernHud_Fatigue) == 0x000004, "Wrong size on WBP_ModernHud_Fatigue_C_ExecuteUbergraph_WBP_ModernHud_Fatigue");
static_assert(offsetof(WBP_ModernHud_Fatigue_C_ExecuteUbergraph_WBP_ModernHud_Fatigue, EntryPoint) == 0x000000, "Member 'WBP_ModernHud_Fatigue_C_ExecuteUbergraph_WBP_ModernHud_Fatigue::EntryPoint' has a wrong offset!");

// Function WBP_ModernHud_Fatigue.WBP_ModernHud_Fatigue_C.UpdateFatigue
// 0x0028 (0x0028 - 0x0000)
struct WBP_ModernHud_Fatigue_C_UpdateFatigue final
{
public:
	double                                        NewProgress;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetGlobalRTPCValue_RTPCValue_ImplicitCast; // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_Fatigue_C_UpdateFatigue) == 0x000008, "Wrong alignment on WBP_ModernHud_Fatigue_C_UpdateFatigue");
static_assert(sizeof(WBP_ModernHud_Fatigue_C_UpdateFatigue) == 0x000028, "Wrong size on WBP_ModernHud_Fatigue_C_UpdateFatigue");
static_assert(offsetof(WBP_ModernHud_Fatigue_C_UpdateFatigue, NewProgress) == 0x000000, "Member 'WBP_ModernHud_Fatigue_C_UpdateFatigue::NewProgress' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Fatigue_C_UpdateFatigue, CallFunc_GetOwningPlayerPawn_ReturnValue) == 0x000008, "Member 'WBP_ModernHud_Fatigue_C_UpdateFatigue::CallFunc_GetOwningPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Fatigue_C_UpdateFatigue, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000010, "Member 'WBP_ModernHud_Fatigue_C_UpdateFatigue::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Fatigue_C_UpdateFatigue, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000018, "Member 'WBP_ModernHud_Fatigue_C_UpdateFatigue::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Fatigue_C_UpdateFatigue, CallFunc_SetGlobalRTPCValue_RTPCValue_ImplicitCast) == 0x000020, "Member 'WBP_ModernHud_Fatigue_C_UpdateFatigue::CallFunc_SetGlobalRTPCValue_RTPCValue_ImplicitCast' has a wrong offset!");

}

