#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ConsoleCommandButton_Simple

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ConsoleCommandButton_Simple.WBP_ConsoleCommandButton_Simple_C
// 0x0058 (0x0318 - 0x02C0)
class UWBP_ConsoleCommandButton_Simple_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button;                                            // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ButtonText;                                        // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FString                                 Command;                                           // 0x02D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   DefaultButtonText;                                 // 0x02E8(0x0018)(Edit, BlueprintVisible)
	bool                                          bTextWasSet;                                       // 0x0300(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_301[0x7];                                      // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              Clicked;                                           // 0x0308(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void SetButtonText(bool ForceSet, const class FText& InText);
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_WBP_ConsoleCommandButton_Simple(int32 EntryPoint);
	void ButtonPressed();
	void BndEvt__WBP_SimpleConsoleCommandButton_Button_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ConsoleCommandButton_Simple_C">();
	}
	static class UWBP_ConsoleCommandButton_Simple_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ConsoleCommandButton_Simple_C>();
	}
};
static_assert(alignof(UWBP_ConsoleCommandButton_Simple_C) == 0x000008, "Wrong alignment on UWBP_ConsoleCommandButton_Simple_C");
static_assert(sizeof(UWBP_ConsoleCommandButton_Simple_C) == 0x000318, "Wrong size on UWBP_ConsoleCommandButton_Simple_C");
static_assert(offsetof(UWBP_ConsoleCommandButton_Simple_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_ConsoleCommandButton_Simple_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ConsoleCommandButton_Simple_C, Button) == 0x0002C8, "Member 'UWBP_ConsoleCommandButton_Simple_C::Button' has a wrong offset!");
static_assert(offsetof(UWBP_ConsoleCommandButton_Simple_C, ButtonText) == 0x0002D0, "Member 'UWBP_ConsoleCommandButton_Simple_C::ButtonText' has a wrong offset!");
static_assert(offsetof(UWBP_ConsoleCommandButton_Simple_C, Command) == 0x0002D8, "Member 'UWBP_ConsoleCommandButton_Simple_C::Command' has a wrong offset!");
static_assert(offsetof(UWBP_ConsoleCommandButton_Simple_C, DefaultButtonText) == 0x0002E8, "Member 'UWBP_ConsoleCommandButton_Simple_C::DefaultButtonText' has a wrong offset!");
static_assert(offsetof(UWBP_ConsoleCommandButton_Simple_C, bTextWasSet) == 0x000300, "Member 'UWBP_ConsoleCommandButton_Simple_C::bTextWasSet' has a wrong offset!");
static_assert(offsetof(UWBP_ConsoleCommandButton_Simple_C, Clicked) == 0x000308, "Member 'UWBP_ConsoleCommandButton_Simple_C::Clicked' has a wrong offset!");

}

