#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Modern_QuestHistoryCarousel

#include "Basic.hpp"

#include "EnhancedInput_structs.hpp"


namespace SDK::Params
{

// Function WBP_Modern_QuestHistoryCarousel.WBP_Modern_QuestHistoryCarousel_C.BndEvt__WBP_Modern_QuestHistoryCarousel_Carousel_K2Node_ComponentBoundEvent_0_OnCurrentPageIndexChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_Modern_QuestHistoryCarousel_C_BndEvt__WBP_Modern_QuestHistoryCarousel_Carousel_K2Node_ComponentBoundEvent_0_OnCurrentPageIndexChanged__DelegateSignature final
{
public:
	class UCommonWidgetCarousel*                  CarouselWidget;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentPageIndex;                                  // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_QuestHistoryCarousel_C_BndEvt__WBP_Modern_QuestHistoryCarousel_Carousel_K2Node_ComponentBoundEvent_0_OnCurrentPageIndexChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Modern_QuestHistoryCarousel_C_BndEvt__WBP_Modern_QuestHistoryCarousel_Carousel_K2Node_ComponentBoundEvent_0_OnCurrentPageIndexChanged__DelegateSignature");
static_assert(sizeof(WBP_Modern_QuestHistoryCarousel_C_BndEvt__WBP_Modern_QuestHistoryCarousel_Carousel_K2Node_ComponentBoundEvent_0_OnCurrentPageIndexChanged__DelegateSignature) == 0x000010, "Wrong size on WBP_Modern_QuestHistoryCarousel_C_BndEvt__WBP_Modern_QuestHistoryCarousel_Carousel_K2Node_ComponentBoundEvent_0_OnCurrentPageIndexChanged__DelegateSignature");
static_assert(offsetof(WBP_Modern_QuestHistoryCarousel_C_BndEvt__WBP_Modern_QuestHistoryCarousel_Carousel_K2Node_ComponentBoundEvent_0_OnCurrentPageIndexChanged__DelegateSignature, CarouselWidget) == 0x000000, "Member 'WBP_Modern_QuestHistoryCarousel_C_BndEvt__WBP_Modern_QuestHistoryCarousel_Carousel_K2Node_ComponentBoundEvent_0_OnCurrentPageIndexChanged__DelegateSignature::CarouselWidget' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarousel_C_BndEvt__WBP_Modern_QuestHistoryCarousel_Carousel_K2Node_ComponentBoundEvent_0_OnCurrentPageIndexChanged__DelegateSignature, CurrentPageIndex) == 0x000008, "Member 'WBP_Modern_QuestHistoryCarousel_C_BndEvt__WBP_Modern_QuestHistoryCarousel_Carousel_K2Node_ComponentBoundEvent_0_OnCurrentPageIndexChanged__DelegateSignature::CurrentPageIndex' has a wrong offset!");

// Function WBP_Modern_QuestHistoryCarousel.WBP_Modern_QuestHistoryCarousel_C.ExecuteUbergraph_WBP_Modern_QuestHistoryCarousel
// 0x0100 (0x0100 - 0x0000)
struct WBP_Modern_QuestHistoryCarousel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarousel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonWidgetCarousel*                  K2Node_ComponentBoundEvent_CarouselWidget;         // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_CurrentPageIndex;       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_1;     // 0x0018(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_1;     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_1;   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_1;    // 0x0040(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue;  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           Temp_object_Variable;                              // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable;                                // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_0;                              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_1_0;                            // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue;       // 0x0080(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime;       // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime;     // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction;      // 0x00A8(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable_1;                            // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_InputActionValueToAxis1D_ReturnValue; // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2;                              // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3;                              // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2_0;                            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3_0;                            // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_4;                              // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetCurrentItem_ReturnValue;               // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Modern_QuestHistoryCarouselEntry_C* K2Node_DynamicCast_AsWBP_Modern_Quest_History_Carousel_Entry; // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_QuestHistoryCarousel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarousel) == 0x000008, "Wrong alignment on WBP_Modern_QuestHistoryCarousel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarousel");
static_assert(sizeof(WBP_Modern_QuestHistoryCarousel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarousel) == 0x000100, "Wrong size on WBP_Modern_QuestHistoryCarousel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarousel");
static_assert(offsetof(WBP_Modern_QuestHistoryCarousel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarousel, EntryPoint) == 0x000000, "Member 'WBP_Modern_QuestHistoryCarousel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarousel::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarousel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarousel, K2Node_ComponentBoundEvent_CarouselWidget) == 0x000008, "Member 'WBP_Modern_QuestHistoryCarousel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarousel::K2Node_ComponentBoundEvent_CarouselWidget' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarousel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarousel, K2Node_ComponentBoundEvent_CurrentPageIndex) == 0x000010, "Member 'WBP_Modern_QuestHistoryCarousel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarousel::K2Node_ComponentBoundEvent_CurrentPageIndex' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarousel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarousel, K2Node_EnhancedInputActionEvent_ActionValue_1) == 0x000018, "Member 'WBP_Modern_QuestHistoryCarousel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarousel::K2Node_EnhancedInputActionEvent_ActionValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarousel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarousel, K2Node_EnhancedInputActionEvent_ElapsedTime_1) == 0x000038, "Member 'WBP_Modern_QuestHistoryCarousel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarousel::K2Node_EnhancedInputActionEvent_ElapsedTime_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarousel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarousel, K2Node_EnhancedInputActionEvent_TriggeredTime_1) == 0x00003C, "Member 'WBP_Modern_QuestHistoryCarousel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarousel::K2Node_EnhancedInputActionEvent_TriggeredTime_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarousel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarousel, K2Node_EnhancedInputActionEvent_SourceAction_1) == 0x000040, "Member 'WBP_Modern_QuestHistoryCarousel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarousel::K2Node_EnhancedInputActionEvent_SourceAction_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarousel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarousel, CallFunc_Conv_InputActionValueToBool_ReturnValue) == 0x000048, "Member 'WBP_Modern_QuestHistoryCarousel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarousel::CallFunc_Conv_InputActionValueToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarousel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarousel, Temp_object_Variable) == 0x000050, "Member 'WBP_Modern_QuestHistoryCarousel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarousel::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarousel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarousel, Temp_real_Variable) == 0x000058, "Member 'WBP_Modern_QuestHistoryCarousel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarousel::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarousel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarousel, Temp_real_Variable_0) == 0x000060, "Member 'WBP_Modern_QuestHistoryCarousel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarousel::Temp_real_Variable_0' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarousel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarousel, Temp_real_Variable_1) == 0x000068, "Member 'WBP_Modern_QuestHistoryCarousel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarousel::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarousel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarousel, Temp_bool_Variable) == 0x000070, "Member 'WBP_Modern_QuestHistoryCarousel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarousel::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarousel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarousel, Temp_real_Variable_1_0) == 0x000078, "Member 'WBP_Modern_QuestHistoryCarousel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarousel::Temp_real_Variable_1_0' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarousel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarousel, K2Node_EnhancedInputActionEvent_ActionValue) == 0x000080, "Member 'WBP_Modern_QuestHistoryCarousel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarousel::K2Node_EnhancedInputActionEvent_ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarousel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarousel, K2Node_EnhancedInputActionEvent_ElapsedTime) == 0x0000A0, "Member 'WBP_Modern_QuestHistoryCarousel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarousel::K2Node_EnhancedInputActionEvent_ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarousel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarousel, K2Node_EnhancedInputActionEvent_TriggeredTime) == 0x0000A4, "Member 'WBP_Modern_QuestHistoryCarousel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarousel::K2Node_EnhancedInputActionEvent_TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarousel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarousel, K2Node_EnhancedInputActionEvent_SourceAction) == 0x0000A8, "Member 'WBP_Modern_QuestHistoryCarousel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarousel::K2Node_EnhancedInputActionEvent_SourceAction' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarousel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarousel, Temp_object_Variable_1) == 0x0000B0, "Member 'WBP_Modern_QuestHistoryCarousel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarousel::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarousel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarousel, CallFunc_Conv_InputActionValueToAxis1D_ReturnValue) == 0x0000B8, "Member 'WBP_Modern_QuestHistoryCarousel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarousel::CallFunc_Conv_InputActionValueToAxis1D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarousel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarousel, Temp_real_Variable_2) == 0x0000C0, "Member 'WBP_Modern_QuestHistoryCarousel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarousel::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarousel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarousel, Temp_real_Variable_3) == 0x0000C8, "Member 'WBP_Modern_QuestHistoryCarousel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarousel::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarousel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarousel, Temp_real_Variable_2_0) == 0x0000D0, "Member 'WBP_Modern_QuestHistoryCarousel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarousel::Temp_real_Variable_2_0' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarousel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarousel, Temp_real_Variable_3_0) == 0x0000D8, "Member 'WBP_Modern_QuestHistoryCarousel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarousel::Temp_real_Variable_3_0' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarousel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarousel, Temp_real_Variable_4) == 0x0000E0, "Member 'WBP_Modern_QuestHistoryCarousel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarousel::Temp_real_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarousel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarousel, CallFunc_GetCurrentItem_ReturnValue) == 0x0000E8, "Member 'WBP_Modern_QuestHistoryCarousel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarousel::CallFunc_GetCurrentItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarousel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarousel, K2Node_DynamicCast_AsWBP_Modern_Quest_History_Carousel_Entry) == 0x0000F0, "Member 'WBP_Modern_QuestHistoryCarousel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarousel::K2Node_DynamicCast_AsWBP_Modern_Quest_History_Carousel_Entry' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarousel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarousel, K2Node_DynamicCast_bSuccess) == 0x0000F8, "Member 'WBP_Modern_QuestHistoryCarousel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryCarousel::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_Modern_QuestHistoryCarousel.WBP_Modern_QuestHistoryCarousel_C.InpActEvt_IA_UI_Specific_QuestMenu_GoToQuestDetailsLastStep_K2Node_EnhancedInputActionEvent_1
// 0x0030 (0x0030 - 0x0000)
struct WBP_Modern_QuestHistoryCarousel_C_InpActEvt_IA_UI_Specific_QuestMenu_GoToQuestDetailsLastStep_K2Node_EnhancedInputActionEvent_1 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_QuestHistoryCarousel_C_InpActEvt_IA_UI_Specific_QuestMenu_GoToQuestDetailsLastStep_K2Node_EnhancedInputActionEvent_1) == 0x000008, "Wrong alignment on WBP_Modern_QuestHistoryCarousel_C_InpActEvt_IA_UI_Specific_QuestMenu_GoToQuestDetailsLastStep_K2Node_EnhancedInputActionEvent_1");
static_assert(sizeof(WBP_Modern_QuestHistoryCarousel_C_InpActEvt_IA_UI_Specific_QuestMenu_GoToQuestDetailsLastStep_K2Node_EnhancedInputActionEvent_1) == 0x000030, "Wrong size on WBP_Modern_QuestHistoryCarousel_C_InpActEvt_IA_UI_Specific_QuestMenu_GoToQuestDetailsLastStep_K2Node_EnhancedInputActionEvent_1");
static_assert(offsetof(WBP_Modern_QuestHistoryCarousel_C_InpActEvt_IA_UI_Specific_QuestMenu_GoToQuestDetailsLastStep_K2Node_EnhancedInputActionEvent_1, ActionValue) == 0x000000, "Member 'WBP_Modern_QuestHistoryCarousel_C_InpActEvt_IA_UI_Specific_QuestMenu_GoToQuestDetailsLastStep_K2Node_EnhancedInputActionEvent_1::ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarousel_C_InpActEvt_IA_UI_Specific_QuestMenu_GoToQuestDetailsLastStep_K2Node_EnhancedInputActionEvent_1, ElapsedTime) == 0x000020, "Member 'WBP_Modern_QuestHistoryCarousel_C_InpActEvt_IA_UI_Specific_QuestMenu_GoToQuestDetailsLastStep_K2Node_EnhancedInputActionEvent_1::ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarousel_C_InpActEvt_IA_UI_Specific_QuestMenu_GoToQuestDetailsLastStep_K2Node_EnhancedInputActionEvent_1, TriggeredTime) == 0x000024, "Member 'WBP_Modern_QuestHistoryCarousel_C_InpActEvt_IA_UI_Specific_QuestMenu_GoToQuestDetailsLastStep_K2Node_EnhancedInputActionEvent_1::TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarousel_C_InpActEvt_IA_UI_Specific_QuestMenu_GoToQuestDetailsLastStep_K2Node_EnhancedInputActionEvent_1, SourceAction) == 0x000028, "Member 'WBP_Modern_QuestHistoryCarousel_C_InpActEvt_IA_UI_Specific_QuestMenu_GoToQuestDetailsLastStep_K2Node_EnhancedInputActionEvent_1::SourceAction' has a wrong offset!");

// Function WBP_Modern_QuestHistoryCarousel.WBP_Modern_QuestHistoryCarousel_C.InpActEvt_IA_UI_Specific_QuestMenu_ScrollHistoric_K2Node_EnhancedInputActionEvent_0
// 0x0030 (0x0030 - 0x0000)
struct WBP_Modern_QuestHistoryCarousel_C_InpActEvt_IA_UI_Specific_QuestMenu_ScrollHistoric_K2Node_EnhancedInputActionEvent_0 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_QuestHistoryCarousel_C_InpActEvt_IA_UI_Specific_QuestMenu_ScrollHistoric_K2Node_EnhancedInputActionEvent_0) == 0x000008, "Wrong alignment on WBP_Modern_QuestHistoryCarousel_C_InpActEvt_IA_UI_Specific_QuestMenu_ScrollHistoric_K2Node_EnhancedInputActionEvent_0");
static_assert(sizeof(WBP_Modern_QuestHistoryCarousel_C_InpActEvt_IA_UI_Specific_QuestMenu_ScrollHistoric_K2Node_EnhancedInputActionEvent_0) == 0x000030, "Wrong size on WBP_Modern_QuestHistoryCarousel_C_InpActEvt_IA_UI_Specific_QuestMenu_ScrollHistoric_K2Node_EnhancedInputActionEvent_0");
static_assert(offsetof(WBP_Modern_QuestHistoryCarousel_C_InpActEvt_IA_UI_Specific_QuestMenu_ScrollHistoric_K2Node_EnhancedInputActionEvent_0, ActionValue) == 0x000000, "Member 'WBP_Modern_QuestHistoryCarousel_C_InpActEvt_IA_UI_Specific_QuestMenu_ScrollHistoric_K2Node_EnhancedInputActionEvent_0::ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarousel_C_InpActEvt_IA_UI_Specific_QuestMenu_ScrollHistoric_K2Node_EnhancedInputActionEvent_0, ElapsedTime) == 0x000020, "Member 'WBP_Modern_QuestHistoryCarousel_C_InpActEvt_IA_UI_Specific_QuestMenu_ScrollHistoric_K2Node_EnhancedInputActionEvent_0::ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarousel_C_InpActEvt_IA_UI_Specific_QuestMenu_ScrollHistoric_K2Node_EnhancedInputActionEvent_0, TriggeredTime) == 0x000024, "Member 'WBP_Modern_QuestHistoryCarousel_C_InpActEvt_IA_UI_Specific_QuestMenu_ScrollHistoric_K2Node_EnhancedInputActionEvent_0::TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryCarousel_C_InpActEvt_IA_UI_Specific_QuestMenu_ScrollHistoric_K2Node_EnhancedInputActionEvent_0, SourceAction) == 0x000028, "Member 'WBP_Modern_QuestHistoryCarousel_C_InpActEvt_IA_UI_Specific_QuestMenu_ScrollHistoric_K2Node_EnhancedInputActionEvent_0::SourceAction' has a wrong offset!");

// Function WBP_Modern_QuestHistoryCarousel.WBP_Modern_QuestHistoryCarousel_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct WBP_Modern_QuestHistoryCarousel_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_QuestHistoryCarousel_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_Modern_QuestHistoryCarousel_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_Modern_QuestHistoryCarousel_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong size on WBP_Modern_QuestHistoryCarousel_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_Modern_QuestHistoryCarousel_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_Modern_QuestHistoryCarousel_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");

}

