#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModernMenu_StatsFactionEntry

#include "Basic.hpp"

#include "Altar_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_ModernMenu_StatsFactionEntry.WBP_ModernMenu_StatsFactionEntry_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_ModernMenu_StatsFactionEntry_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_StatsFactionEntry_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong alignment on WBP_ModernMenu_StatsFactionEntry_C_BP_OnItemSelectionChanged");
static_assert(sizeof(WBP_ModernMenu_StatsFactionEntry_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong size on WBP_ModernMenu_StatsFactionEntry_C_BP_OnItemSelectionChanged");
static_assert(offsetof(WBP_ModernMenu_StatsFactionEntry_C_BP_OnItemSelectionChanged, bIsSelected) == 0x000000, "Member 'WBP_ModernMenu_StatsFactionEntry_C_BP_OnItemSelectionChanged::bIsSelected' has a wrong offset!");

// Function WBP_ModernMenu_StatsFactionEntry.WBP_ModernMenu_StatsFactionEntry_C.ExecuteUbergraph_WBP_ModernMenu_StatsFactionEntry
// 0x0078 (0x0078 - 0x0000)
struct WBP_ModernMenu_StatsFactionEntry_C_ExecuteUbergraph_WBP_ModernMenu_StatsFactionEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVLegacyStatsMenuFaction*               K2Node_DynamicCast_AsVLegacy_Stats_Menu_Faction;   // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLegacyStatsMenuFactionProperties      CallFunc_GetFaction_ReturnValue;                   // 0x0020(0x0058)(ConstParm)
};
static_assert(alignof(WBP_ModernMenu_StatsFactionEntry_C_ExecuteUbergraph_WBP_ModernMenu_StatsFactionEntry) == 0x000008, "Wrong alignment on WBP_ModernMenu_StatsFactionEntry_C_ExecuteUbergraph_WBP_ModernMenu_StatsFactionEntry");
static_assert(sizeof(WBP_ModernMenu_StatsFactionEntry_C_ExecuteUbergraph_WBP_ModernMenu_StatsFactionEntry) == 0x000078, "Wrong size on WBP_ModernMenu_StatsFactionEntry_C_ExecuteUbergraph_WBP_ModernMenu_StatsFactionEntry");
static_assert(offsetof(WBP_ModernMenu_StatsFactionEntry_C_ExecuteUbergraph_WBP_ModernMenu_StatsFactionEntry, EntryPoint) == 0x000000, "Member 'WBP_ModernMenu_StatsFactionEntry_C_ExecuteUbergraph_WBP_ModernMenu_StatsFactionEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsFactionEntry_C_ExecuteUbergraph_WBP_ModernMenu_StatsFactionEntry, K2Node_Event_ListItemObject) == 0x000008, "Member 'WBP_ModernMenu_StatsFactionEntry_C_ExecuteUbergraph_WBP_ModernMenu_StatsFactionEntry::K2Node_Event_ListItemObject' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsFactionEntry_C_ExecuteUbergraph_WBP_ModernMenu_StatsFactionEntry, K2Node_DynamicCast_AsVLegacy_Stats_Menu_Faction) == 0x000010, "Member 'WBP_ModernMenu_StatsFactionEntry_C_ExecuteUbergraph_WBP_ModernMenu_StatsFactionEntry::K2Node_DynamicCast_AsVLegacy_Stats_Menu_Faction' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsFactionEntry_C_ExecuteUbergraph_WBP_ModernMenu_StatsFactionEntry, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_ModernMenu_StatsFactionEntry_C_ExecuteUbergraph_WBP_ModernMenu_StatsFactionEntry::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsFactionEntry_C_ExecuteUbergraph_WBP_ModernMenu_StatsFactionEntry, K2Node_Event_bIsSelected) == 0x000019, "Member 'WBP_ModernMenu_StatsFactionEntry_C_ExecuteUbergraph_WBP_ModernMenu_StatsFactionEntry::K2Node_Event_bIsSelected' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsFactionEntry_C_ExecuteUbergraph_WBP_ModernMenu_StatsFactionEntry, CallFunc_GetFaction_ReturnValue) == 0x000020, "Member 'WBP_ModernMenu_StatsFactionEntry_C_ExecuteUbergraph_WBP_ModernMenu_StatsFactionEntry::CallFunc_GetFaction_ReturnValue' has a wrong offset!");

// Function WBP_ModernMenu_StatsFactionEntry.WBP_ModernMenu_StatsFactionEntry_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct WBP_ModernMenu_StatsFactionEntry_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_StatsFactionEntry_C_OnListItemObjectSet) == 0x000008, "Wrong alignment on WBP_ModernMenu_StatsFactionEntry_C_OnListItemObjectSet");
static_assert(sizeof(WBP_ModernMenu_StatsFactionEntry_C_OnListItemObjectSet) == 0x000008, "Wrong size on WBP_ModernMenu_StatsFactionEntry_C_OnListItemObjectSet");
static_assert(offsetof(WBP_ModernMenu_StatsFactionEntry_C_OnListItemObjectSet, ListItemObject) == 0x000000, "Member 'WBP_ModernMenu_StatsFactionEntry_C_OnListItemObjectSet::ListItemObject' has a wrong offset!");

// Function WBP_ModernMenu_StatsFactionEntry.WBP_ModernMenu_StatsFactionEntry_C.SetIcon
// 0x00F0 (0x00F0 - 0x0000)
struct WBP_ModernMenu_StatsFactionEntry_C_SetIcon final
{
public:
	class UTexture2D*                             Texture;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Blueprint_GetSizeY_ReturnValue;           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Blueprint_GetSizeX_ReturnValue;           // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            CallFunc_MakeBrushFromTexture_ReturnValue;         // 0x0010(0x00D0)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_StatsFactionEntry_C_SetIcon) == 0x000010, "Wrong alignment on WBP_ModernMenu_StatsFactionEntry_C_SetIcon");
static_assert(sizeof(WBP_ModernMenu_StatsFactionEntry_C_SetIcon) == 0x0000F0, "Wrong size on WBP_ModernMenu_StatsFactionEntry_C_SetIcon");
static_assert(offsetof(WBP_ModernMenu_StatsFactionEntry_C_SetIcon, Texture) == 0x000000, "Member 'WBP_ModernMenu_StatsFactionEntry_C_SetIcon::Texture' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsFactionEntry_C_SetIcon, CallFunc_Blueprint_GetSizeY_ReturnValue) == 0x000008, "Member 'WBP_ModernMenu_StatsFactionEntry_C_SetIcon::CallFunc_Blueprint_GetSizeY_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsFactionEntry_C_SetIcon, CallFunc_Blueprint_GetSizeX_ReturnValue) == 0x00000C, "Member 'WBP_ModernMenu_StatsFactionEntry_C_SetIcon::CallFunc_Blueprint_GetSizeX_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsFactionEntry_C_SetIcon, CallFunc_MakeBrushFromTexture_ReturnValue) == 0x000010, "Member 'WBP_ModernMenu_StatsFactionEntry_C_SetIcon::CallFunc_MakeBrushFromTexture_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsFactionEntry_C_SetIcon, CallFunc_IsValid_ReturnValue) == 0x0000E0, "Member 'WBP_ModernMenu_StatsFactionEntry_C_SetIcon::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_ModernMenu_StatsFactionEntry.WBP_ModernMenu_StatsFactionEntry_C.UpdateData
// 0x0058 (0x0058 - 0x0000)
struct WBP_ModernMenu_StatsFactionEntry_C_UpdateData final
{
public:
	struct FLegacyStatsMenuFactionProperties      Data;                                              // 0x0000(0x0058)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_ModernMenu_StatsFactionEntry_C_UpdateData) == 0x000008, "Wrong alignment on WBP_ModernMenu_StatsFactionEntry_C_UpdateData");
static_assert(sizeof(WBP_ModernMenu_StatsFactionEntry_C_UpdateData) == 0x000058, "Wrong size on WBP_ModernMenu_StatsFactionEntry_C_UpdateData");
static_assert(offsetof(WBP_ModernMenu_StatsFactionEntry_C_UpdateData, Data) == 0x000000, "Member 'WBP_ModernMenu_StatsFactionEntry_C_UpdateData::Data' has a wrong offset!");

}

