#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModernMenu_StatsPage3_Scrollbox

#include "Basic.hpp"

#include "CommonInput_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_ModernMenu_StatsPage3_Scrollbox.WBP_ModernMenu_StatsPage3_Scrollbox_C.ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Scrollbox
// 0x0160 (0x0160 - 0x0000)
struct WBP_ModernMenu_StatsPage3_Scrollbox_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Scrollbox final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UScrollBox*                             CallFunc_GetScrollBox_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable;                                // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_2;                              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAltarUISubsystem*                     CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            CallFunc_TryGetBrushFromKey_OutBrush;              // 0x0030(0x00D0)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               K2Node_DynamicCast_AsTexture;                      // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable_3;                              // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue; // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate;            // 0x0128(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UScrollBox*                             CallFunc_GetScrollBox_ReturnValue_1;               // 0x0138(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              K2Node_CustomEvent_bNewInputType;                  // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UScrollBox*                             CallFunc_GetScrollBox_ReturnValue_2;               // 0x0148(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              Temp_byte_Variable;                                // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x3];                                      // 0x0151(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_StatsPage3_Scrollbox_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Scrollbox) == 0x000010, "Wrong alignment on WBP_ModernMenu_StatsPage3_Scrollbox_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Scrollbox");
static_assert(sizeof(WBP_ModernMenu_StatsPage3_Scrollbox_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Scrollbox) == 0x000160, "Wrong size on WBP_ModernMenu_StatsPage3_Scrollbox_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Scrollbox");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Scrollbox_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Scrollbox, EntryPoint) == 0x000000, "Member 'WBP_ModernMenu_StatsPage3_Scrollbox_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Scrollbox::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Scrollbox_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Scrollbox, CallFunc_GetScrollBox_ReturnValue) == 0x000008, "Member 'WBP_ModernMenu_StatsPage3_Scrollbox_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Scrollbox::CallFunc_GetScrollBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Scrollbox_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Scrollbox, Temp_real_Variable) == 0x000010, "Member 'WBP_ModernMenu_StatsPage3_Scrollbox_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Scrollbox::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Scrollbox_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Scrollbox, Temp_real_Variable_1) == 0x000014, "Member 'WBP_ModernMenu_StatsPage3_Scrollbox_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Scrollbox::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Scrollbox_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Scrollbox, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000018, "Member 'WBP_ModernMenu_StatsPage3_Scrollbox_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Scrollbox::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Scrollbox_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Scrollbox, Temp_real_Variable_2) == 0x000020, "Member 'WBP_ModernMenu_StatsPage3_Scrollbox_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Scrollbox::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Scrollbox_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Scrollbox, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000028, "Member 'WBP_ModernMenu_StatsPage3_Scrollbox_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Scrollbox::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Scrollbox_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Scrollbox, CallFunc_TryGetBrushFromKey_OutBrush) == 0x000030, "Member 'WBP_ModernMenu_StatsPage3_Scrollbox_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Scrollbox::CallFunc_TryGetBrushFromKey_OutBrush' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Scrollbox_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Scrollbox, K2Node_Event_IsDesignTime) == 0x000100, "Member 'WBP_ModernMenu_StatsPage3_Scrollbox_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Scrollbox::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Scrollbox_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Scrollbox, K2Node_DynamicCast_AsTexture) == 0x000108, "Member 'WBP_ModernMenu_StatsPage3_Scrollbox_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Scrollbox::K2Node_DynamicCast_AsTexture' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Scrollbox_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Scrollbox, K2Node_DynamicCast_bSuccess) == 0x000110, "Member 'WBP_ModernMenu_StatsPage3_Scrollbox_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Scrollbox::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Scrollbox_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Scrollbox, Temp_real_Variable_3) == 0x000114, "Member 'WBP_ModernMenu_StatsPage3_Scrollbox_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Scrollbox::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Scrollbox_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Scrollbox, CallFunc_GetPlayerController_ReturnValue) == 0x000118, "Member 'WBP_ModernMenu_StatsPage3_Scrollbox_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Scrollbox::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Scrollbox_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Scrollbox, CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue) == 0x000120, "Member 'WBP_ModernMenu_StatsPage3_Scrollbox_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Scrollbox::CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Scrollbox_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Scrollbox, K2Node_CreateDelegate_OutputDelegate) == 0x000128, "Member 'WBP_ModernMenu_StatsPage3_Scrollbox_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Scrollbox::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Scrollbox_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Scrollbox, CallFunc_GetScrollBox_ReturnValue_1) == 0x000138, "Member 'WBP_ModernMenu_StatsPage3_Scrollbox_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Scrollbox::CallFunc_GetScrollBox_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Scrollbox_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Scrollbox, K2Node_CustomEvent_bNewInputType) == 0x000140, "Member 'WBP_ModernMenu_StatsPage3_Scrollbox_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Scrollbox::K2Node_CustomEvent_bNewInputType' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Scrollbox_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Scrollbox, CallFunc_GetScrollBox_ReturnValue_2) == 0x000148, "Member 'WBP_ModernMenu_StatsPage3_Scrollbox_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Scrollbox::CallFunc_GetScrollBox_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Scrollbox_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Scrollbox, Temp_byte_Variable) == 0x000150, "Member 'WBP_ModernMenu_StatsPage3_Scrollbox_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Scrollbox::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Scrollbox_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Scrollbox, K2Node_Select_Default) == 0x000154, "Member 'WBP_ModernMenu_StatsPage3_Scrollbox_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Scrollbox::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Scrollbox_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Scrollbox, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000158, "Member 'WBP_ModernMenu_StatsPage3_Scrollbox_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Scrollbox::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");

// Function WBP_ModernMenu_StatsPage3_Scrollbox.WBP_ModernMenu_StatsPage3_Scrollbox_C.OnInputMethodChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_ModernMenu_StatsPage3_Scrollbox_C_OnInputMethodChanged final
{
public:
	ECommonInputType                              bNewInputType;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_StatsPage3_Scrollbox_C_OnInputMethodChanged) == 0x000001, "Wrong alignment on WBP_ModernMenu_StatsPage3_Scrollbox_C_OnInputMethodChanged");
static_assert(sizeof(WBP_ModernMenu_StatsPage3_Scrollbox_C_OnInputMethodChanged) == 0x000001, "Wrong size on WBP_ModernMenu_StatsPage3_Scrollbox_C_OnInputMethodChanged");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Scrollbox_C_OnInputMethodChanged, bNewInputType) == 0x000000, "Member 'WBP_ModernMenu_StatsPage3_Scrollbox_C_OnInputMethodChanged::bNewInputType' has a wrong offset!");

// Function WBP_ModernMenu_StatsPage3_Scrollbox.WBP_ModernMenu_StatsPage3_Scrollbox_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_ModernMenu_StatsPage3_Scrollbox_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_StatsPage3_Scrollbox_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_ModernMenu_StatsPage3_Scrollbox_C_PreConstruct");
static_assert(sizeof(WBP_ModernMenu_StatsPage3_Scrollbox_C_PreConstruct) == 0x000001, "Wrong size on WBP_ModernMenu_StatsPage3_Scrollbox_C_PreConstruct");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Scrollbox_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_ModernMenu_StatsPage3_Scrollbox_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

