#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Modern_Menu_Player_BoundAction

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CommonInput_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Modern_Menu_Player_BoundAction.WBP_Modern_Menu_Player_BoundAction_C.DisplayComboIfAny
// 0x0038 (0x0038 - 0x0000)
struct WBP_Modern_Menu_Player_BoundAction_C_DisplayComboIfAny final
{
public:
	class UVModifierKeysInputTrigger*             ModifierKeysInputTrigger;                          // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInputTrigger*                          CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVModifierKeysInputTrigger*             K2Node_DynamicCast_AsVModifier_Keys_Input_Trigger; // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Menu_Player_BoundAction_C_DisplayComboIfAny) == 0x000008, "Wrong alignment on WBP_Modern_Menu_Player_BoundAction_C_DisplayComboIfAny");
static_assert(sizeof(WBP_Modern_Menu_Player_BoundAction_C_DisplayComboIfAny) == 0x000038, "Wrong size on WBP_Modern_Menu_Player_BoundAction_C_DisplayComboIfAny");
static_assert(offsetof(WBP_Modern_Menu_Player_BoundAction_C_DisplayComboIfAny, ModifierKeysInputTrigger) == 0x000000, "Member 'WBP_Modern_Menu_Player_BoundAction_C_DisplayComboIfAny::ModifierKeysInputTrigger' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_BoundAction_C_DisplayComboIfAny, Temp_int_Array_Index_Variable) == 0x000008, "Member 'WBP_Modern_Menu_Player_BoundAction_C_DisplayComboIfAny::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_BoundAction_C_DisplayComboIfAny, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'WBP_Modern_Menu_Player_BoundAction_C_DisplayComboIfAny::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_BoundAction_C_DisplayComboIfAny, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WBP_Modern_Menu_Player_BoundAction_C_DisplayComboIfAny::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_BoundAction_C_DisplayComboIfAny, CallFunc_Array_Length_ReturnValue) == 0x000014, "Member 'WBP_Modern_Menu_Player_BoundAction_C_DisplayComboIfAny::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_BoundAction_C_DisplayComboIfAny, CallFunc_Array_Get_Item) == 0x000018, "Member 'WBP_Modern_Menu_Player_BoundAction_C_DisplayComboIfAny::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_BoundAction_C_DisplayComboIfAny, CallFunc_Less_IntInt_ReturnValue) == 0x000020, "Member 'WBP_Modern_Menu_Player_BoundAction_C_DisplayComboIfAny::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_BoundAction_C_DisplayComboIfAny, K2Node_DynamicCast_AsVModifier_Keys_Input_Trigger) == 0x000028, "Member 'WBP_Modern_Menu_Player_BoundAction_C_DisplayComboIfAny::K2Node_DynamicCast_AsVModifier_Keys_Input_Trigger' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_BoundAction_C_DisplayComboIfAny, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'WBP_Modern_Menu_Player_BoundAction_C_DisplayComboIfAny::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_Modern_Menu_Player_BoundAction.WBP_Modern_Menu_Player_BoundAction_C.ExecuteUbergraph_WBP_Modern_Menu_Player_BoundAction
// 0x00B8 (0x00B8 - 0x0000)
struct WBP_Modern_Menu_Player_BoundAction_C_ExecuteUbergraph_WBP_Modern_Menu_Player_BoundAction final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAltarTextBlock*                       CallFunc_GetActionAltarTextBlock_AltarTextBlock;   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0010(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_NewText;                        // 0x0050(0x0018)()
	class UVAltarTextBlock*                       CallFunc_GetActionAltarTextBlock_AltarTextBlock_1; // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVAltarTextBlock*                       CallFunc_GetActionAltarTextBlock_AltarTextBlock_2; // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVAltarUISubsystem*                     CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bIsHidden)>               K2Node_CreateDelegate_OutputDelegate;              // 0x0080(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInputHintsVisible_ReturnValue;          // 0x0090(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAltarUISubsystem*                     CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAltarTextSubsystem*                   CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAltarTextSubsystem*                   CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAltarTextBlock*                       CallFunc_GetActionAltarTextBlock_AltarTextBlock_3; // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Menu_Player_BoundAction_C_ExecuteUbergraph_WBP_Modern_Menu_Player_BoundAction) == 0x000008, "Wrong alignment on WBP_Modern_Menu_Player_BoundAction_C_ExecuteUbergraph_WBP_Modern_Menu_Player_BoundAction");
static_assert(sizeof(WBP_Modern_Menu_Player_BoundAction_C_ExecuteUbergraph_WBP_Modern_Menu_Player_BoundAction) == 0x0000B8, "Wrong size on WBP_Modern_Menu_Player_BoundAction_C_ExecuteUbergraph_WBP_Modern_Menu_Player_BoundAction");
static_assert(offsetof(WBP_Modern_Menu_Player_BoundAction_C_ExecuteUbergraph_WBP_Modern_Menu_Player_BoundAction, EntryPoint) == 0x000000, "Member 'WBP_Modern_Menu_Player_BoundAction_C_ExecuteUbergraph_WBP_Modern_Menu_Player_BoundAction::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_BoundAction_C_ExecuteUbergraph_WBP_Modern_Menu_Player_BoundAction, CallFunc_GetActionAltarTextBlock_AltarTextBlock) == 0x000008, "Member 'WBP_Modern_Menu_Player_BoundAction_C_ExecuteUbergraph_WBP_Modern_Menu_Player_BoundAction::CallFunc_GetActionAltarTextBlock_AltarTextBlock' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_BoundAction_C_ExecuteUbergraph_WBP_Modern_Menu_Player_BoundAction, K2Node_Event_MyGeometry) == 0x000010, "Member 'WBP_Modern_Menu_Player_BoundAction_C_ExecuteUbergraph_WBP_Modern_Menu_Player_BoundAction::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_BoundAction_C_ExecuteUbergraph_WBP_Modern_Menu_Player_BoundAction, K2Node_Event_InDeltaTime) == 0x000048, "Member 'WBP_Modern_Menu_Player_BoundAction_C_ExecuteUbergraph_WBP_Modern_Menu_Player_BoundAction::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_BoundAction_C_ExecuteUbergraph_WBP_Modern_Menu_Player_BoundAction, K2Node_CustomEvent_NewText) == 0x000050, "Member 'WBP_Modern_Menu_Player_BoundAction_C_ExecuteUbergraph_WBP_Modern_Menu_Player_BoundAction::K2Node_CustomEvent_NewText' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_BoundAction_C_ExecuteUbergraph_WBP_Modern_Menu_Player_BoundAction, CallFunc_GetActionAltarTextBlock_AltarTextBlock_1) == 0x000068, "Member 'WBP_Modern_Menu_Player_BoundAction_C_ExecuteUbergraph_WBP_Modern_Menu_Player_BoundAction::CallFunc_GetActionAltarTextBlock_AltarTextBlock_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_BoundAction_C_ExecuteUbergraph_WBP_Modern_Menu_Player_BoundAction, CallFunc_GetActionAltarTextBlock_AltarTextBlock_2) == 0x000070, "Member 'WBP_Modern_Menu_Player_BoundAction_C_ExecuteUbergraph_WBP_Modern_Menu_Player_BoundAction::CallFunc_GetActionAltarTextBlock_AltarTextBlock_2' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_BoundAction_C_ExecuteUbergraph_WBP_Modern_Menu_Player_BoundAction, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000078, "Member 'WBP_Modern_Menu_Player_BoundAction_C_ExecuteUbergraph_WBP_Modern_Menu_Player_BoundAction::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_BoundAction_C_ExecuteUbergraph_WBP_Modern_Menu_Player_BoundAction, K2Node_CreateDelegate_OutputDelegate) == 0x000080, "Member 'WBP_Modern_Menu_Player_BoundAction_C_ExecuteUbergraph_WBP_Modern_Menu_Player_BoundAction::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_BoundAction_C_ExecuteUbergraph_WBP_Modern_Menu_Player_BoundAction, CallFunc_IsInputHintsVisible_ReturnValue) == 0x000090, "Member 'WBP_Modern_Menu_Player_BoundAction_C_ExecuteUbergraph_WBP_Modern_Menu_Player_BoundAction::CallFunc_IsInputHintsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_BoundAction_C_ExecuteUbergraph_WBP_Modern_Menu_Player_BoundAction, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000098, "Member 'WBP_Modern_Menu_Player_BoundAction_C_ExecuteUbergraph_WBP_Modern_Menu_Player_BoundAction::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_BoundAction_C_ExecuteUbergraph_WBP_Modern_Menu_Player_BoundAction, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x0000A0, "Member 'WBP_Modern_Menu_Player_BoundAction_C_ExecuteUbergraph_WBP_Modern_Menu_Player_BoundAction::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_BoundAction_C_ExecuteUbergraph_WBP_Modern_Menu_Player_BoundAction, CallFunc_GetGameInstanceSubsystem_ReturnValue_3) == 0x0000A8, "Member 'WBP_Modern_Menu_Player_BoundAction_C_ExecuteUbergraph_WBP_Modern_Menu_Player_BoundAction::CallFunc_GetGameInstanceSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_BoundAction_C_ExecuteUbergraph_WBP_Modern_Menu_Player_BoundAction, CallFunc_GetActionAltarTextBlock_AltarTextBlock_3) == 0x0000B0, "Member 'WBP_Modern_Menu_Player_BoundAction_C_ExecuteUbergraph_WBP_Modern_Menu_Player_BoundAction::CallFunc_GetActionAltarTextBlock_AltarTextBlock_3' has a wrong offset!");

// Function WBP_Modern_Menu_Player_BoundAction.WBP_Modern_Menu_Player_BoundAction_C.GetActionAltarTextBlock
// 0x0020 (0x0020 - 0x0000)
struct WBP_Modern_Menu_Player_BoundAction_C_GetActionAltarTextBlock final
{
public:
	class UVAltarTextBlock*                       AltarTextBlock;                                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       CallFunc_GetText_ReturnValue;                      // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVAltarTextBlock*                       K2Node_DynamicCast_AsVAltar_Text_Block;            // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Menu_Player_BoundAction_C_GetActionAltarTextBlock) == 0x000008, "Wrong alignment on WBP_Modern_Menu_Player_BoundAction_C_GetActionAltarTextBlock");
static_assert(sizeof(WBP_Modern_Menu_Player_BoundAction_C_GetActionAltarTextBlock) == 0x000020, "Wrong size on WBP_Modern_Menu_Player_BoundAction_C_GetActionAltarTextBlock");
static_assert(offsetof(WBP_Modern_Menu_Player_BoundAction_C_GetActionAltarTextBlock, AltarTextBlock) == 0x000000, "Member 'WBP_Modern_Menu_Player_BoundAction_C_GetActionAltarTextBlock::AltarTextBlock' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_BoundAction_C_GetActionAltarTextBlock, CallFunc_GetText_ReturnValue) == 0x000008, "Member 'WBP_Modern_Menu_Player_BoundAction_C_GetActionAltarTextBlock::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_BoundAction_C_GetActionAltarTextBlock, K2Node_DynamicCast_AsVAltar_Text_Block) == 0x000010, "Member 'WBP_Modern_Menu_Player_BoundAction_C_GetActionAltarTextBlock::K2Node_DynamicCast_AsVAltar_Text_Block' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_BoundAction_C_GetActionAltarTextBlock, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_Modern_Menu_Player_BoundAction_C_GetActionAltarTextBlock::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_Modern_Menu_Player_BoundAction.WBP_Modern_Menu_Player_BoundAction_C.GetPercentage
// 0x0020 (0x0020 - 0x0000)
struct WBP_Modern_Menu_Player_BoundAction_C_GetPercentage final
{
public:
	double                                        Percentage;                                        // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue;   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_FunctionResult_Percentage_ImplicitCast;     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Menu_Player_BoundAction_C_GetPercentage) == 0x000008, "Wrong alignment on WBP_Modern_Menu_Player_BoundAction_C_GetPercentage");
static_assert(sizeof(WBP_Modern_Menu_Player_BoundAction_C_GetPercentage) == 0x000020, "Wrong size on WBP_Modern_Menu_Player_BoundAction_C_GetPercentage");
static_assert(offsetof(WBP_Modern_Menu_Player_BoundAction_C_GetPercentage, Percentage) == 0x000000, "Member 'WBP_Modern_Menu_Player_BoundAction_C_GetPercentage::Percentage' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_BoundAction_C_GetPercentage, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'WBP_Modern_Menu_Player_BoundAction_C_GetPercentage::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_BoundAction_C_GetPercentage, CallFunc_K2_GetScalarParameterValue_ReturnValue) == 0x000010, "Member 'WBP_Modern_Menu_Player_BoundAction_C_GetPercentage::CallFunc_K2_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_BoundAction_C_GetPercentage, K2Node_FunctionResult_Percentage_ImplicitCast) == 0x000018, "Member 'WBP_Modern_Menu_Player_BoundAction_C_GetPercentage::K2Node_FunctionResult_Percentage_ImplicitCast' has a wrong offset!");

// Function WBP_Modern_Menu_Player_BoundAction.WBP_Modern_Menu_Player_BoundAction_C.IsComplete
// 0x0028 (0x0028 - 0x0000)
struct WBP_Modern_Menu_Player_BoundAction_C_IsComplete final
{
public:
	bool                                          IsComplete_0;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Local_Percentage;                                  // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetPercentage_Percentage;                 // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Menu_Player_BoundAction_C_IsComplete) == 0x000008, "Wrong alignment on WBP_Modern_Menu_Player_BoundAction_C_IsComplete");
static_assert(sizeof(WBP_Modern_Menu_Player_BoundAction_C_IsComplete) == 0x000028, "Wrong size on WBP_Modern_Menu_Player_BoundAction_C_IsComplete");
static_assert(offsetof(WBP_Modern_Menu_Player_BoundAction_C_IsComplete, IsComplete_0) == 0x000000, "Member 'WBP_Modern_Menu_Player_BoundAction_C_IsComplete::IsComplete_0' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_BoundAction_C_IsComplete, Local_Percentage) == 0x000008, "Member 'WBP_Modern_Menu_Player_BoundAction_C_IsComplete::Local_Percentage' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_BoundAction_C_IsComplete, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000010, "Member 'WBP_Modern_Menu_Player_BoundAction_C_IsComplete::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_BoundAction_C_IsComplete, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x000011, "Member 'WBP_Modern_Menu_Player_BoundAction_C_IsComplete::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_BoundAction_C_IsComplete, CallFunc_GetPercentage_Percentage) == 0x000018, "Member 'WBP_Modern_Menu_Player_BoundAction_C_IsComplete::CallFunc_GetPercentage_Percentage' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_BoundAction_C_IsComplete, CallFunc_BooleanOR_ReturnValue) == 0x000020, "Member 'WBP_Modern_Menu_Player_BoundAction_C_IsComplete::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function WBP_Modern_Menu_Player_BoundAction.WBP_Modern_Menu_Player_BoundAction_C.On Toggle Input Visibility
// 0x0005 (0x0005 - 0x0000)
struct WBP_Modern_Menu_Player_BoundAction_C_On_Toggle_Input_Visibility final
{
public:
	bool                                          bInIsVisible;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Menu_Player_BoundAction_C_On_Toggle_Input_Visibility) == 0x000001, "Wrong alignment on WBP_Modern_Menu_Player_BoundAction_C_On_Toggle_Input_Visibility");
static_assert(sizeof(WBP_Modern_Menu_Player_BoundAction_C_On_Toggle_Input_Visibility) == 0x000005, "Wrong size on WBP_Modern_Menu_Player_BoundAction_C_On_Toggle_Input_Visibility");
static_assert(offsetof(WBP_Modern_Menu_Player_BoundAction_C_On_Toggle_Input_Visibility, bInIsVisible) == 0x000000, "Member 'WBP_Modern_Menu_Player_BoundAction_C_On_Toggle_Input_Visibility::bInIsVisible' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_BoundAction_C_On_Toggle_Input_Visibility, Temp_bool_Variable) == 0x000001, "Member 'WBP_Modern_Menu_Player_BoundAction_C_On_Toggle_Input_Visibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_BoundAction_C_On_Toggle_Input_Visibility, Temp_byte_Variable) == 0x000002, "Member 'WBP_Modern_Menu_Player_BoundAction_C_On_Toggle_Input_Visibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_BoundAction_C_On_Toggle_Input_Visibility, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_Modern_Menu_Player_BoundAction_C_On_Toggle_Input_Visibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_BoundAction_C_On_Toggle_Input_Visibility, K2Node_Select_Default) == 0x000004, "Member 'WBP_Modern_Menu_Player_BoundAction_C_On_Toggle_Input_Visibility::K2Node_Select_Default' has a wrong offset!");

// Function WBP_Modern_Menu_Player_BoundAction.WBP_Modern_Menu_Player_BoundAction_C.OnTextChange
// 0x0018 (0x0018 - 0x0000)
struct WBP_Modern_Menu_Player_BoundAction_C_OnTextChange final
{
public:
	class FText                                   NewText;                                           // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Modern_Menu_Player_BoundAction_C_OnTextChange) == 0x000008, "Wrong alignment on WBP_Modern_Menu_Player_BoundAction_C_OnTextChange");
static_assert(sizeof(WBP_Modern_Menu_Player_BoundAction_C_OnTextChange) == 0x000018, "Wrong size on WBP_Modern_Menu_Player_BoundAction_C_OnTextChange");
static_assert(offsetof(WBP_Modern_Menu_Player_BoundAction_C_OnTextChange, NewText) == 0x000000, "Member 'WBP_Modern_Menu_Player_BoundAction_C_OnTextChange::NewText' has a wrong offset!");

// Function WBP_Modern_Menu_Player_BoundAction.WBP_Modern_Menu_Player_BoundAction_C.PluginCompliance
// 0x0001 (0x0001 - 0x0000)
struct WBP_Modern_Menu_Player_BoundAction_C_PluginCompliance final
{
public:
	bool                                          bPluginCompliance;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Menu_Player_BoundAction_C_PluginCompliance) == 0x000001, "Wrong alignment on WBP_Modern_Menu_Player_BoundAction_C_PluginCompliance");
static_assert(sizeof(WBP_Modern_Menu_Player_BoundAction_C_PluginCompliance) == 0x000001, "Wrong size on WBP_Modern_Menu_Player_BoundAction_C_PluginCompliance");
static_assert(offsetof(WBP_Modern_Menu_Player_BoundAction_C_PluginCompliance, bPluginCompliance) == 0x000000, "Member 'WBP_Modern_Menu_Player_BoundAction_C_PluginCompliance::bPluginCompliance' has a wrong offset!");

// Function WBP_Modern_Menu_Player_BoundAction.WBP_Modern_Menu_Player_BoundAction_C.Set and Brodcast Timer Value
// 0x0050 (0x0050 - 0x0000)
struct WBP_Modern_Menu_Player_BoundAction_C_Set_and_Brodcast_Timer_Value final
{
public:
	double                                        Local_HeldPercent;                                 // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetHoldTreshold_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetHoldTreshold_ReturnValue_1;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_OnActionProgress_HeldPercent_ImplicitCast; // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Less_DoubleDouble_B_ImplicitCast;         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast;       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Menu_Player_BoundAction_C_Set_and_Brodcast_Timer_Value) == 0x000008, "Wrong alignment on WBP_Modern_Menu_Player_BoundAction_C_Set_and_Brodcast_Timer_Value");
static_assert(sizeof(WBP_Modern_Menu_Player_BoundAction_C_Set_and_Brodcast_Timer_Value) == 0x000050, "Wrong size on WBP_Modern_Menu_Player_BoundAction_C_Set_and_Brodcast_Timer_Value");
static_assert(offsetof(WBP_Modern_Menu_Player_BoundAction_C_Set_and_Brodcast_Timer_Value, Local_HeldPercent) == 0x000000, "Member 'WBP_Modern_Menu_Player_BoundAction_C_Set_and_Brodcast_Timer_Value::Local_HeldPercent' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_BoundAction_C_Set_and_Brodcast_Timer_Value, CallFunc_GetHoldTreshold_ReturnValue) == 0x000008, "Member 'WBP_Modern_Menu_Player_BoundAction_C_Set_and_Brodcast_Timer_Value::CallFunc_GetHoldTreshold_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_BoundAction_C_Set_and_Brodcast_Timer_Value, CallFunc_GetHoldTreshold_ReturnValue_1) == 0x00000C, "Member 'WBP_Modern_Menu_Player_BoundAction_C_Set_and_Brodcast_Timer_Value::CallFunc_GetHoldTreshold_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_BoundAction_C_Set_and_Brodcast_Timer_Value, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000010, "Member 'WBP_Modern_Menu_Player_BoundAction_C_Set_and_Brodcast_Timer_Value::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_BoundAction_C_Set_and_Brodcast_Timer_Value, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000018, "Member 'WBP_Modern_Menu_Player_BoundAction_C_Set_and_Brodcast_Timer_Value::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_BoundAction_C_Set_and_Brodcast_Timer_Value, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000020, "Member 'WBP_Modern_Menu_Player_BoundAction_C_Set_and_Brodcast_Timer_Value::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_BoundAction_C_Set_and_Brodcast_Timer_Value, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000028, "Member 'WBP_Modern_Menu_Player_BoundAction_C_Set_and_Brodcast_Timer_Value::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_BoundAction_C_Set_and_Brodcast_Timer_Value, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000030, "Member 'WBP_Modern_Menu_Player_BoundAction_C_Set_and_Brodcast_Timer_Value::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_BoundAction_C_Set_and_Brodcast_Timer_Value, CallFunc_OnActionProgress_HeldPercent_ImplicitCast) == 0x000038, "Member 'WBP_Modern_Menu_Player_BoundAction_C_Set_and_Brodcast_Timer_Value::CallFunc_OnActionProgress_HeldPercent_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_BoundAction_C_Set_and_Brodcast_Timer_Value, CallFunc_Less_DoubleDouble_B_ImplicitCast) == 0x000040, "Member 'WBP_Modern_Menu_Player_BoundAction_C_Set_and_Brodcast_Timer_Value::CallFunc_Less_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_BoundAction_C_Set_and_Brodcast_Timer_Value, CallFunc_Divide_DoubleDouble_B_ImplicitCast) == 0x000048, "Member 'WBP_Modern_Menu_Player_BoundAction_C_Set_and_Brodcast_Timer_Value::CallFunc_Divide_DoubleDouble_B_ImplicitCast' has a wrong offset!");

// Function WBP_Modern_Menu_Player_BoundAction.WBP_Modern_Menu_Player_BoundAction_C.SetTextFontSize
// 0x0018 (0x0018 - 0x0000)
struct WBP_Modern_Menu_Player_BoundAction_C_SetTextFontSize final
{
public:
	int32                                         NewTextSize;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAltarTextBlock*                       K2Node_DynamicCast_AsVAltar_Text_Block;            // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Menu_Player_BoundAction_C_SetTextFontSize) == 0x000008, "Wrong alignment on WBP_Modern_Menu_Player_BoundAction_C_SetTextFontSize");
static_assert(sizeof(WBP_Modern_Menu_Player_BoundAction_C_SetTextFontSize) == 0x000018, "Wrong size on WBP_Modern_Menu_Player_BoundAction_C_SetTextFontSize");
static_assert(offsetof(WBP_Modern_Menu_Player_BoundAction_C_SetTextFontSize, NewTextSize) == 0x000000, "Member 'WBP_Modern_Menu_Player_BoundAction_C_SetTextFontSize::NewTextSize' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_BoundAction_C_SetTextFontSize, K2Node_DynamicCast_AsVAltar_Text_Block) == 0x000008, "Member 'WBP_Modern_Menu_Player_BoundAction_C_SetTextFontSize::K2Node_DynamicCast_AsVAltar_Text_Block' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_BoundAction_C_SetTextFontSize, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'WBP_Modern_Menu_Player_BoundAction_C_SetTextFontSize::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_Modern_Menu_Player_BoundAction.WBP_Modern_Menu_Player_BoundAction_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_Modern_Menu_Player_BoundAction_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Menu_Player_BoundAction_C_Tick) == 0x000004, "Wrong alignment on WBP_Modern_Menu_Player_BoundAction_C_Tick");
static_assert(sizeof(WBP_Modern_Menu_Player_BoundAction_C_Tick) == 0x00003C, "Wrong size on WBP_Modern_Menu_Player_BoundAction_C_Tick");
static_assert(offsetof(WBP_Modern_Menu_Player_BoundAction_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_Modern_Menu_Player_BoundAction_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_BoundAction_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_Modern_Menu_Player_BoundAction_C_Tick::InDeltaTime' has a wrong offset!");

// Function WBP_Modern_Menu_Player_BoundAction.WBP_Modern_Menu_Player_BoundAction_C.Update Hint Key For Keyboard
// 0x0058 (0x0058 - 0x0000)
struct WBP_Modern_Menu_Player_BoundAction_C_Update_Hint_Key_For_Keyboard final
{
public:
	class FText                                   Local_KeyText;                                     // 0x0000(0x0018)(Edit, BlueprintVisible)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHeldAction_ReturnValue;                 // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetInputActionKeyText_ReturnValue;        // 0x0038(0x0018)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Menu_Player_BoundAction_C_Update_Hint_Key_For_Keyboard) == 0x000008, "Wrong alignment on WBP_Modern_Menu_Player_BoundAction_C_Update_Hint_Key_For_Keyboard");
static_assert(sizeof(WBP_Modern_Menu_Player_BoundAction_C_Update_Hint_Key_For_Keyboard) == 0x000058, "Wrong size on WBP_Modern_Menu_Player_BoundAction_C_Update_Hint_Key_For_Keyboard");
static_assert(offsetof(WBP_Modern_Menu_Player_BoundAction_C_Update_Hint_Key_For_Keyboard, Local_KeyText) == 0x000000, "Member 'WBP_Modern_Menu_Player_BoundAction_C_Update_Hint_Key_For_Keyboard::Local_KeyText' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_BoundAction_C_Update_Hint_Key_For_Keyboard, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000018, "Member 'WBP_Modern_Menu_Player_BoundAction_C_Update_Hint_Key_For_Keyboard::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_BoundAction_C_Update_Hint_Key_For_Keyboard, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'WBP_Modern_Menu_Player_BoundAction_C_Update_Hint_Key_For_Keyboard::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_BoundAction_C_Update_Hint_Key_For_Keyboard, CallFunc_TextIsEmpty_ReturnValue) == 0x000021, "Member 'WBP_Modern_Menu_Player_BoundAction_C_Update_Hint_Key_For_Keyboard::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_BoundAction_C_Update_Hint_Key_For_Keyboard, CallFunc_IsHeldAction_ReturnValue) == 0x000022, "Member 'WBP_Modern_Menu_Player_BoundAction_C_Update_Hint_Key_For_Keyboard::CallFunc_IsHeldAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_BoundAction_C_Update_Hint_Key_For_Keyboard, CallFunc_IsValid_ReturnValue_1) == 0x000023, "Member 'WBP_Modern_Menu_Player_BoundAction_C_Update_Hint_Key_For_Keyboard::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_BoundAction_C_Update_Hint_Key_For_Keyboard, CallFunc_GetLocalPlayerSubsystem_ReturnValue_1) == 0x000028, "Member 'WBP_Modern_Menu_Player_BoundAction_C_Update_Hint_Key_For_Keyboard::CallFunc_GetLocalPlayerSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_BoundAction_C_Update_Hint_Key_For_Keyboard, CallFunc_GetCurrentInputType_ReturnValue) == 0x000030, "Member 'WBP_Modern_Menu_Player_BoundAction_C_Update_Hint_Key_For_Keyboard::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_BoundAction_C_Update_Hint_Key_For_Keyboard, CallFunc_GetInputActionKeyText_ReturnValue) == 0x000038, "Member 'WBP_Modern_Menu_Player_BoundAction_C_Update_Hint_Key_For_Keyboard::CallFunc_GetInputActionKeyText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_BoundAction_C_Update_Hint_Key_For_Keyboard, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000050, "Member 'WBP_Modern_Menu_Player_BoundAction_C_Update_Hint_Key_For_Keyboard::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_BoundAction_C_Update_Hint_Key_For_Keyboard, CallFunc_BooleanAND_ReturnValue) == 0x000051, "Member 'WBP_Modern_Menu_Player_BoundAction_C_Update_Hint_Key_For_Keyboard::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_Modern_Menu_Player_BoundAction.WBP_Modern_Menu_Player_BoundAction_C.UpdateKeyboardProgress
// 0x0018 (0x0018 - 0x0000)
struct WBP_Modern_Menu_Player_BoundAction_C_UpdateKeyboardProgress final
{
public:
	double                                        HeldPercent;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Menu_Player_BoundAction_C_UpdateKeyboardProgress) == 0x000008, "Wrong alignment on WBP_Modern_Menu_Player_BoundAction_C_UpdateKeyboardProgress");
static_assert(sizeof(WBP_Modern_Menu_Player_BoundAction_C_UpdateKeyboardProgress) == 0x000018, "Wrong size on WBP_Modern_Menu_Player_BoundAction_C_UpdateKeyboardProgress");
static_assert(offsetof(WBP_Modern_Menu_Player_BoundAction_C_UpdateKeyboardProgress, HeldPercent) == 0x000000, "Member 'WBP_Modern_Menu_Player_BoundAction_C_UpdateKeyboardProgress::HeldPercent' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_BoundAction_C_UpdateKeyboardProgress, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'WBP_Modern_Menu_Player_BoundAction_C_UpdateKeyboardProgress::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
