#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModernPrefab_FocusButton_Header

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "WBP_ModernPrefab_NavigableButton_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ModernPrefab_FocusButton_Header.WBP_ModernPrefab_FocusButton_Header_C
// 0x0060 (0x1720 - 0x16C0)
class UWBP_ModernPrefab_FocusButton_Header_C final : public UWBP_ModernPrefab_NavigableButton_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_ModernPrefab_FocusButton_Header_C; // 0x16C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnHover;                                           // 0x16C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Focused;                                           // 0x16D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BottomGlow;                                        // 0x16D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BottomLine;                                        // 0x16E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AltarTextBlock_C*                  HeaderText;                                        // 0x16E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HoverGlow;                                         // 0x16F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsCurrentTab;                                      // 0x16F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsActive;                                          // 0x16F9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16FA[0x2];                                     // 0x16FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           HoverTextColor;                                    // 0x16FC(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           UnhoverTextColor;                                  // 0x170C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_WBP_ModernPrefab_FocusButton_Header(int32 EntryPoint);
	void HoverEffect(bool IsHovered_0, bool IsInstant);
	void OnInitButtonWidgets();
	void SetButtonActive(bool NewIsActive);
	void SetButtonFocus(bool NewIsCurrentTab, bool IsInstant);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ModernPrefab_FocusButton_Header_C">();
	}
	static class UWBP_ModernPrefab_FocusButton_Header_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ModernPrefab_FocusButton_Header_C>();
	}
};
static_assert(alignof(UWBP_ModernPrefab_FocusButton_Header_C) == 0x000010, "Wrong alignment on UWBP_ModernPrefab_FocusButton_Header_C");
static_assert(sizeof(UWBP_ModernPrefab_FocusButton_Header_C) == 0x001720, "Wrong size on UWBP_ModernPrefab_FocusButton_Header_C");
static_assert(offsetof(UWBP_ModernPrefab_FocusButton_Header_C, UberGraphFrame_WBP_ModernPrefab_FocusButton_Header_C) == 0x0016C0, "Member 'UWBP_ModernPrefab_FocusButton_Header_C::UberGraphFrame_WBP_ModernPrefab_FocusButton_Header_C' has a wrong offset!");
static_assert(offsetof(UWBP_ModernPrefab_FocusButton_Header_C, OnHover) == 0x0016C8, "Member 'UWBP_ModernPrefab_FocusButton_Header_C::OnHover' has a wrong offset!");
static_assert(offsetof(UWBP_ModernPrefab_FocusButton_Header_C, Focused) == 0x0016D0, "Member 'UWBP_ModernPrefab_FocusButton_Header_C::Focused' has a wrong offset!");
static_assert(offsetof(UWBP_ModernPrefab_FocusButton_Header_C, BottomGlow) == 0x0016D8, "Member 'UWBP_ModernPrefab_FocusButton_Header_C::BottomGlow' has a wrong offset!");
static_assert(offsetof(UWBP_ModernPrefab_FocusButton_Header_C, BottomLine) == 0x0016E0, "Member 'UWBP_ModernPrefab_FocusButton_Header_C::BottomLine' has a wrong offset!");
static_assert(offsetof(UWBP_ModernPrefab_FocusButton_Header_C, HeaderText) == 0x0016E8, "Member 'UWBP_ModernPrefab_FocusButton_Header_C::HeaderText' has a wrong offset!");
static_assert(offsetof(UWBP_ModernPrefab_FocusButton_Header_C, HoverGlow) == 0x0016F0, "Member 'UWBP_ModernPrefab_FocusButton_Header_C::HoverGlow' has a wrong offset!");
static_assert(offsetof(UWBP_ModernPrefab_FocusButton_Header_C, IsCurrentTab) == 0x0016F8, "Member 'UWBP_ModernPrefab_FocusButton_Header_C::IsCurrentTab' has a wrong offset!");
static_assert(offsetof(UWBP_ModernPrefab_FocusButton_Header_C, IsActive) == 0x0016F9, "Member 'UWBP_ModernPrefab_FocusButton_Header_C::IsActive' has a wrong offset!");
static_assert(offsetof(UWBP_ModernPrefab_FocusButton_Header_C, HoverTextColor) == 0x0016FC, "Member 'UWBP_ModernPrefab_FocusButton_Header_C::HoverTextColor' has a wrong offset!");
static_assert(offsetof(UWBP_ModernPrefab_FocusButton_Header_C, UnhoverTextColor) == 0x00170C, "Member 'UWBP_ModernPrefab_FocusButton_Header_C::UnhoverTextColor' has a wrong offset!");

}

