#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Graphics_Slider

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Graphics_Slider.WBP_Graphics_Slider_C.BndEvt__WBP_Graphics_Slider_Slider_K2Node_ComponentBoundEvent_2_OnFloatValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_Graphics_Slider_C_BndEvt__WBP_Graphics_Slider_Slider_K2Node_ComponentBoundEvent_2_OnFloatValueChangedEvent__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Graphics_Slider_C_BndEvt__WBP_Graphics_Slider_Slider_K2Node_ComponentBoundEvent_2_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on WBP_Graphics_Slider_C_BndEvt__WBP_Graphics_Slider_Slider_K2Node_ComponentBoundEvent_2_OnFloatValueChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_Graphics_Slider_C_BndEvt__WBP_Graphics_Slider_Slider_K2Node_ComponentBoundEvent_2_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong size on WBP_Graphics_Slider_C_BndEvt__WBP_Graphics_Slider_Slider_K2Node_ComponentBoundEvent_2_OnFloatValueChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_Graphics_Slider_C_BndEvt__WBP_Graphics_Slider_Slider_K2Node_ComponentBoundEvent_2_OnFloatValueChangedEvent__DelegateSignature, Value) == 0x000000, "Member 'WBP_Graphics_Slider_C_BndEvt__WBP_Graphics_Slider_Slider_K2Node_ComponentBoundEvent_2_OnFloatValueChangedEvent__DelegateSignature::Value' has a wrong offset!");

// Function WBP_Graphics_Slider.WBP_Graphics_Slider_C.ExecuteUbergraph_WBP_Graphics_Slider
// 0x01A0 (0x01A0 - 0x0000)
struct WBP_Graphics_Slider_C_ExecuteUbergraph_WBP_Graphics_Slider final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_ComponentBoundEvent_Value;                  // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue;          // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int64                                         CallFunc_Round64_ReturnValue;                      // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Subtract_Int64Int64_ReturnValue;          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_Int64ToString_ReturnValue;           // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int64                                         CallFunc_Round64_ReturnValue_1;                    // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_Int64ToString_ReturnValue_1;         // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00A0(0x0018)()
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x00C8(0x0018)()
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue_1;                   // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_112[0x6];                                      // 0x0112(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x0118(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_2;          // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue_2;                   // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_3;          // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_SetValue_InValue_ImplicitCast;            // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast;          // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_B_ImplicitCast;      // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_B_ImplicitCast;         // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_SliderCurrentValue_ImplicitCast; // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetValue_InValue_ImplicitCast_1;          // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Graphics_Slider_C_ExecuteUbergraph_WBP_Graphics_Slider) == 0x000008, "Wrong alignment on WBP_Graphics_Slider_C_ExecuteUbergraph_WBP_Graphics_Slider");
static_assert(sizeof(WBP_Graphics_Slider_C_ExecuteUbergraph_WBP_Graphics_Slider) == 0x0001A0, "Wrong size on WBP_Graphics_Slider_C_ExecuteUbergraph_WBP_Graphics_Slider");
static_assert(offsetof(WBP_Graphics_Slider_C_ExecuteUbergraph_WBP_Graphics_Slider, EntryPoint) == 0x000000, "Member 'WBP_Graphics_Slider_C_ExecuteUbergraph_WBP_Graphics_Slider::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_Slider_C_ExecuteUbergraph_WBP_Graphics_Slider, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000008, "Member 'WBP_Graphics_Slider_C_ExecuteUbergraph_WBP_Graphics_Slider::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_Slider_C_ExecuteUbergraph_WBP_Graphics_Slider, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000010, "Member 'WBP_Graphics_Slider_C_ExecuteUbergraph_WBP_Graphics_Slider::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_Slider_C_ExecuteUbergraph_WBP_Graphics_Slider, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000018, "Member 'WBP_Graphics_Slider_C_ExecuteUbergraph_WBP_Graphics_Slider::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_Slider_C_ExecuteUbergraph_WBP_Graphics_Slider, K2Node_ComponentBoundEvent_Value) == 0x00001C, "Member 'WBP_Graphics_Slider_C_ExecuteUbergraph_WBP_Graphics_Slider::K2Node_ComponentBoundEvent_Value' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_Slider_C_ExecuteUbergraph_WBP_Graphics_Slider, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000020, "Member 'WBP_Graphics_Slider_C_ExecuteUbergraph_WBP_Graphics_Slider::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_Slider_C_ExecuteUbergraph_WBP_Graphics_Slider, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000028, "Member 'WBP_Graphics_Slider_C_ExecuteUbergraph_WBP_Graphics_Slider::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_Slider_C_ExecuteUbergraph_WBP_Graphics_Slider, CallFunc_Conv_DoubleToString_ReturnValue) == 0x000030, "Member 'WBP_Graphics_Slider_C_ExecuteUbergraph_WBP_Graphics_Slider::CallFunc_Conv_DoubleToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_Slider_C_ExecuteUbergraph_WBP_Graphics_Slider, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000040, "Member 'WBP_Graphics_Slider_C_ExecuteUbergraph_WBP_Graphics_Slider::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_Slider_C_ExecuteUbergraph_WBP_Graphics_Slider, CallFunc_Concat_StrStr_ReturnValue) == 0x000048, "Member 'WBP_Graphics_Slider_C_ExecuteUbergraph_WBP_Graphics_Slider::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_Slider_C_ExecuteUbergraph_WBP_Graphics_Slider, CallFunc_Round64_ReturnValue) == 0x000058, "Member 'WBP_Graphics_Slider_C_ExecuteUbergraph_WBP_Graphics_Slider::CallFunc_Round64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_Slider_C_ExecuteUbergraph_WBP_Graphics_Slider, CallFunc_Subtract_Int64Int64_ReturnValue) == 0x000060, "Member 'WBP_Graphics_Slider_C_ExecuteUbergraph_WBP_Graphics_Slider::CallFunc_Subtract_Int64Int64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_Slider_C_ExecuteUbergraph_WBP_Graphics_Slider, CallFunc_Conv_Int64ToString_ReturnValue) == 0x000068, "Member 'WBP_Graphics_Slider_C_ExecuteUbergraph_WBP_Graphics_Slider::CallFunc_Conv_Int64ToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_Slider_C_ExecuteUbergraph_WBP_Graphics_Slider, CallFunc_Round64_ReturnValue_1) == 0x000078, "Member 'WBP_Graphics_Slider_C_ExecuteUbergraph_WBP_Graphics_Slider::CallFunc_Round64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_Slider_C_ExecuteUbergraph_WBP_Graphics_Slider, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000080, "Member 'WBP_Graphics_Slider_C_ExecuteUbergraph_WBP_Graphics_Slider::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_Slider_C_ExecuteUbergraph_WBP_Graphics_Slider, CallFunc_Conv_Int64ToString_ReturnValue_1) == 0x000090, "Member 'WBP_Graphics_Slider_C_ExecuteUbergraph_WBP_Graphics_Slider::CallFunc_Conv_Int64ToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_Slider_C_ExecuteUbergraph_WBP_Graphics_Slider, CallFunc_Conv_StringToText_ReturnValue) == 0x0000A0, "Member 'WBP_Graphics_Slider_C_ExecuteUbergraph_WBP_Graphics_Slider::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_Slider_C_ExecuteUbergraph_WBP_Graphics_Slider, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0000B8, "Member 'WBP_Graphics_Slider_C_ExecuteUbergraph_WBP_Graphics_Slider::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_Slider_C_ExecuteUbergraph_WBP_Graphics_Slider, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0000C8, "Member 'WBP_Graphics_Slider_C_ExecuteUbergraph_WBP_Graphics_Slider::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_Slider_C_ExecuteUbergraph_WBP_Graphics_Slider, CallFunc_Concat_StrStr_ReturnValue_3) == 0x0000E0, "Member 'WBP_Graphics_Slider_C_ExecuteUbergraph_WBP_Graphics_Slider::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_Slider_C_ExecuteUbergraph_WBP_Graphics_Slider, CallFunc_Conv_TextToString_ReturnValue) == 0x0000F0, "Member 'WBP_Graphics_Slider_C_ExecuteUbergraph_WBP_Graphics_Slider::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_Slider_C_ExecuteUbergraph_WBP_Graphics_Slider, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000100, "Member 'WBP_Graphics_Slider_C_ExecuteUbergraph_WBP_Graphics_Slider::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_Slider_C_ExecuteUbergraph_WBP_Graphics_Slider, CallFunc_Contains_ReturnValue) == 0x000110, "Member 'WBP_Graphics_Slider_C_ExecuteUbergraph_WBP_Graphics_Slider::CallFunc_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_Slider_C_ExecuteUbergraph_WBP_Graphics_Slider, CallFunc_Contains_ReturnValue_1) == 0x000111, "Member 'WBP_Graphics_Slider_C_ExecuteUbergraph_WBP_Graphics_Slider::CallFunc_Contains_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_Slider_C_ExecuteUbergraph_WBP_Graphics_Slider, CallFunc_Conv_DoubleToText_ReturnValue) == 0x000118, "Member 'WBP_Graphics_Slider_C_ExecuteUbergraph_WBP_Graphics_Slider::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_Slider_C_ExecuteUbergraph_WBP_Graphics_Slider, CallFunc_Conv_TextToString_ReturnValue_2) == 0x000130, "Member 'WBP_Graphics_Slider_C_ExecuteUbergraph_WBP_Graphics_Slider::CallFunc_Conv_TextToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_Slider_C_ExecuteUbergraph_WBP_Graphics_Slider, CallFunc_Contains_ReturnValue_2) == 0x000140, "Member 'WBP_Graphics_Slider_C_ExecuteUbergraph_WBP_Graphics_Slider::CallFunc_Contains_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_Slider_C_ExecuteUbergraph_WBP_Graphics_Slider, CallFunc_Conv_TextToString_ReturnValue_3) == 0x000148, "Member 'WBP_Graphics_Slider_C_ExecuteUbergraph_WBP_Graphics_Slider::CallFunc_Conv_TextToString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_Slider_C_ExecuteUbergraph_WBP_Graphics_Slider, CallFunc_Concat_StrStr_ReturnValue_4) == 0x000158, "Member 'WBP_Graphics_Slider_C_ExecuteUbergraph_WBP_Graphics_Slider::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_Slider_C_ExecuteUbergraph_WBP_Graphics_Slider, CallFunc_SetValue_InValue_ImplicitCast) == 0x000168, "Member 'WBP_Graphics_Slider_C_ExecuteUbergraph_WBP_Graphics_Slider::CallFunc_SetValue_InValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_Slider_C_ExecuteUbergraph_WBP_Graphics_Slider, CallFunc_Subtract_DoubleDouble_B_ImplicitCast) == 0x000170, "Member 'WBP_Graphics_Slider_C_ExecuteUbergraph_WBP_Graphics_Slider::CallFunc_Subtract_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_Slider_C_ExecuteUbergraph_WBP_Graphics_Slider, CallFunc_Add_DoubleDouble_B_ImplicitCast) == 0x000178, "Member 'WBP_Graphics_Slider_C_ExecuteUbergraph_WBP_Graphics_Slider::CallFunc_Add_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_Slider_C_ExecuteUbergraph_WBP_Graphics_Slider, CallFunc_Greater_DoubleDouble_B_ImplicitCast) == 0x000180, "Member 'WBP_Graphics_Slider_C_ExecuteUbergraph_WBP_Graphics_Slider::CallFunc_Greater_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_Slider_C_ExecuteUbergraph_WBP_Graphics_Slider, CallFunc_Less_DoubleDouble_B_ImplicitCast) == 0x000188, "Member 'WBP_Graphics_Slider_C_ExecuteUbergraph_WBP_Graphics_Slider::CallFunc_Less_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_Slider_C_ExecuteUbergraph_WBP_Graphics_Slider, K2Node_VariableSet_SliderCurrentValue_ImplicitCast) == 0x000190, "Member 'WBP_Graphics_Slider_C_ExecuteUbergraph_WBP_Graphics_Slider::K2Node_VariableSet_SliderCurrentValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_Slider_C_ExecuteUbergraph_WBP_Graphics_Slider, CallFunc_SetValue_InValue_ImplicitCast_1) == 0x000198, "Member 'WBP_Graphics_Slider_C_ExecuteUbergraph_WBP_Graphics_Slider::CallFunc_SetValue_InValue_ImplicitCast_1' has a wrong offset!");

// Function WBP_Graphics_Slider.WBP_Graphics_Slider_C.InitSlider
// 0x0030 (0x0030 - 0x0000)
struct WBP_Graphics_Slider_C_InitSlider final
{
public:
	double                                        Min;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Max;                                               // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        StepSize;                                          // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DefaultValue;                                      // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetMinValue_InValue_ImplicitCast;         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetMaxValue_InValue_ImplicitCast;         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetStepSize_InValue_ImplicitCast;         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Graphics_Slider_C_InitSlider) == 0x000008, "Wrong alignment on WBP_Graphics_Slider_C_InitSlider");
static_assert(sizeof(WBP_Graphics_Slider_C_InitSlider) == 0x000030, "Wrong size on WBP_Graphics_Slider_C_InitSlider");
static_assert(offsetof(WBP_Graphics_Slider_C_InitSlider, Min) == 0x000000, "Member 'WBP_Graphics_Slider_C_InitSlider::Min' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_Slider_C_InitSlider, Max) == 0x000008, "Member 'WBP_Graphics_Slider_C_InitSlider::Max' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_Slider_C_InitSlider, StepSize) == 0x000010, "Member 'WBP_Graphics_Slider_C_InitSlider::StepSize' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_Slider_C_InitSlider, DefaultValue) == 0x000018, "Member 'WBP_Graphics_Slider_C_InitSlider::DefaultValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_Slider_C_InitSlider, CallFunc_SetMinValue_InValue_ImplicitCast) == 0x000020, "Member 'WBP_Graphics_Slider_C_InitSlider::CallFunc_SetMinValue_InValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_Slider_C_InitSlider, CallFunc_SetMaxValue_InValue_ImplicitCast) == 0x000024, "Member 'WBP_Graphics_Slider_C_InitSlider::CallFunc_SetMaxValue_InValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_Slider_C_InitSlider, CallFunc_SetStepSize_InValue_ImplicitCast) == 0x000028, "Member 'WBP_Graphics_Slider_C_InitSlider::CallFunc_SetStepSize_InValue_ImplicitCast' has a wrong offset!");

}

