#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_OriginalMenu_InventoryItemPreview

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "Altar_structs.hpp"
#include "SlateCore_structs.hpp"
#include "FInventoryPreviewInitializationSettings_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_OriginalMenu_InventoryItemPreview.WBP_OriginalMenu_InventoryItemPreview_C.BindOnInventoryItemDisplayed
// 0x0028 (0x0028 - 0x0000)
struct WBP_OriginalMenu_InventoryItemPreview_C_BindOnInventoryItemDisplayed final
{
public:
	bool                                          IsRendererVisible;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool IsItemDisplayed)>         K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool IsItemDisplayed)>         K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OriginalMenu_InventoryItemPreview_C_BindOnInventoryItemDisplayed) == 0x000004, "Wrong alignment on WBP_OriginalMenu_InventoryItemPreview_C_BindOnInventoryItemDisplayed");
static_assert(sizeof(WBP_OriginalMenu_InventoryItemPreview_C_BindOnInventoryItemDisplayed) == 0x000028, "Wrong size on WBP_OriginalMenu_InventoryItemPreview_C_BindOnInventoryItemDisplayed");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_BindOnInventoryItemDisplayed, IsRendererVisible) == 0x000000, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_BindOnInventoryItemDisplayed::IsRendererVisible' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_BindOnInventoryItemDisplayed, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_BindOnInventoryItemDisplayed::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_BindOnInventoryItemDisplayed, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_BindOnInventoryItemDisplayed::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_BindOnInventoryItemDisplayed, CallFunc_IsValid_ReturnValue) == 0x000024, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_BindOnInventoryItemDisplayed::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_OriginalMenu_InventoryItemPreview.WBP_OriginalMenu_InventoryItemPreview_C.Change Visibility Of Object
// 0x0038 (0x0038 - 0x0000)
struct WBP_OriginalMenu_InventoryItemPreview_C_Change_Visibility_Of_Object final
{
public:
	bool                                          ShouldBeHidden;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Local_HoveredObject;                               // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 AttachedItem;                                      // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAttachedItem_OutAttachedItem;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAltarUISubsystem*                     CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetInventoryHoveredObjectActor_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OriginalMenu_InventoryItemPreview_C_Change_Visibility_Of_Object) == 0x000008, "Wrong alignment on WBP_OriginalMenu_InventoryItemPreview_C_Change_Visibility_Of_Object");
static_assert(sizeof(WBP_OriginalMenu_InventoryItemPreview_C_Change_Visibility_Of_Object) == 0x000038, "Wrong size on WBP_OriginalMenu_InventoryItemPreview_C_Change_Visibility_Of_Object");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_Change_Visibility_Of_Object, ShouldBeHidden) == 0x000000, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_Change_Visibility_Of_Object::ShouldBeHidden' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_Change_Visibility_Of_Object, Local_HoveredObject) == 0x000008, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_Change_Visibility_Of_Object::Local_HoveredObject' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_Change_Visibility_Of_Object, AttachedItem) == 0x000010, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_Change_Visibility_Of_Object::AttachedItem' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_Change_Visibility_Of_Object, CallFunc_GetAttachedItem_OutAttachedItem) == 0x000018, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_Change_Visibility_Of_Object::CallFunc_GetAttachedItem_OutAttachedItem' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_Change_Visibility_Of_Object, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_Change_Visibility_Of_Object::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_Change_Visibility_Of_Object, CallFunc_IsValid_ReturnValue_1) == 0x000021, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_Change_Visibility_Of_Object::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_Change_Visibility_Of_Object, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000028, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_Change_Visibility_Of_Object::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_Change_Visibility_Of_Object, CallFunc_GetInventoryHoveredObjectActor_ReturnValue) == 0x000030, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_Change_Visibility_Of_Object::CallFunc_GetInventoryHoveredObjectActor_ReturnValue' has a wrong offset!");

// Function WBP_OriginalMenu_InventoryItemPreview.WBP_OriginalMenu_InventoryItemPreview_C.ClearItem
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_OriginalMenu_InventoryItemPreview_C_ClearItem final
{
public:
	class AActor*                                 Local_CurrentActorToDelete;                        // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAltarUISubsystem*                     CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetInventoryHoveredObjectActor_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActorBeingDestroyed_ReturnValue;        // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAltarUISubsystem*                     CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B[0x5];                                       // 0x003B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAltarUISubsystem*                     CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAltarUISubsystem*                     CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetInventoryHoveredObjectActor_ReturnValue_1; // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetInventoryHoveredObjectActor_ReturnValue_2; // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetAttachedActors_OutActors;              // 0x0060(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAltarUISubsystem*                     CallFunc_GetGameInstanceSubsystem_ReturnValue_4;   // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAltarUISubsystem*                     CallFunc_GetGameInstanceSubsystem_ReturnValue_5;   // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetInventoryHoveredObjectActor_ReturnValue_3; // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActorBeingDestroyed_ReturnValue_1;      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OriginalMenu_InventoryItemPreview_C_ClearItem) == 0x000008, "Wrong alignment on WBP_OriginalMenu_InventoryItemPreview_C_ClearItem");
static_assert(sizeof(WBP_OriginalMenu_InventoryItemPreview_C_ClearItem) == 0x0000B0, "Wrong size on WBP_OriginalMenu_InventoryItemPreview_C_ClearItem");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_ClearItem, Local_CurrentActorToDelete) == 0x000000, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_ClearItem::Local_CurrentActorToDelete' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_ClearItem, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_ClearItem::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_ClearItem, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_ClearItem::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_ClearItem, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_ClearItem::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_ClearItem, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000018, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_ClearItem::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_ClearItem, CallFunc_GetInventoryHoveredObjectActor_ReturnValue) == 0x000020, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_ClearItem::CallFunc_GetInventoryHoveredObjectActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_ClearItem, CallFunc_IsActorBeingDestroyed_ReturnValue) == 0x000028, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_ClearItem::CallFunc_IsActorBeingDestroyed_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_ClearItem, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000030, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_ClearItem::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_ClearItem, CallFunc_Not_PreBool_ReturnValue) == 0x000038, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_ClearItem::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_ClearItem, CallFunc_IsValid_ReturnValue) == 0x000039, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_ClearItem::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_ClearItem, CallFunc_IsValid_ReturnValue_1) == 0x00003A, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_ClearItem::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_ClearItem, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x000040, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_ClearItem::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_ClearItem, CallFunc_GetGameInstanceSubsystem_ReturnValue_3) == 0x000048, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_ClearItem::CallFunc_GetGameInstanceSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_ClearItem, CallFunc_GetInventoryHoveredObjectActor_ReturnValue_1) == 0x000050, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_ClearItem::CallFunc_GetInventoryHoveredObjectActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_ClearItem, CallFunc_GetInventoryHoveredObjectActor_ReturnValue_2) == 0x000058, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_ClearItem::CallFunc_GetInventoryHoveredObjectActor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_ClearItem, CallFunc_GetAttachedActors_OutActors) == 0x000060, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_ClearItem::CallFunc_GetAttachedActors_OutActors' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_ClearItem, CallFunc_IsValid_ReturnValue_2) == 0x000070, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_ClearItem::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_ClearItem, CallFunc_Array_Get_Item) == 0x000078, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_ClearItem::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_ClearItem, CallFunc_Array_Length_ReturnValue) == 0x000080, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_ClearItem::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_ClearItem, CallFunc_GetGameInstanceSubsystem_ReturnValue_4) == 0x000088, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_ClearItem::CallFunc_GetGameInstanceSubsystem_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_ClearItem, CallFunc_Less_IntInt_ReturnValue) == 0x000090, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_ClearItem::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_ClearItem, CallFunc_GetGameInstanceSubsystem_ReturnValue_5) == 0x000098, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_ClearItem::CallFunc_GetGameInstanceSubsystem_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_ClearItem, CallFunc_GetInventoryHoveredObjectActor_ReturnValue_3) == 0x0000A0, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_ClearItem::CallFunc_GetInventoryHoveredObjectActor_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_ClearItem, CallFunc_IsActorBeingDestroyed_ReturnValue_1) == 0x0000A8, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_ClearItem::CallFunc_IsActorBeingDestroyed_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_ClearItem, CallFunc_Not_PreBool_ReturnValue_1) == 0x0000A9, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_ClearItem::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");

// Function WBP_OriginalMenu_InventoryItemPreview.WBP_OriginalMenu_InventoryItemPreview_C.DEBUG_AddOffset
// 0x0218 (0x0218 - 0x0000)
struct WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_AddOffset final
{
public:
	struct FVector                                InLocationOffset;                                  // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                InScaleOffset;                                     // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVAltarUISubsystem*                     CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetInventoryHoveredObjectActor_ReturnValue; // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAltarUISubsystem*                     CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetInventoryHoveredObjectActor_ReturnValue_1; // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAltarUISubsystem*                     CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_AddActorWorldOffset_SweepHitResult;    // 0x0060(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AActor*                                 CallFunc_GetInventoryHoveredObjectActor_ReturnValue_2; // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorScale3D_ReturnValue;              // 0x0150(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0168(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVAltarUISubsystem*                     CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetInventoryHoveredObjectActor_ReturnValue_3; // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0190(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVAltarUIDebugSubsystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue_4;   // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetInventoryDebugModeState_ReturnValue;   // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B2[0x6];                                      // 0x01B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x01B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVInventoryPreviewPositionOverride     K2Node_MakeStruct_VInventoryPreviewPositionOverride; // 0x01D0(0x0048)(NoDestructor)
};
static_assert(alignof(WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_AddOffset) == 0x000008, "Wrong alignment on WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_AddOffset");
static_assert(sizeof(WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_AddOffset) == 0x000218, "Wrong size on WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_AddOffset");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_AddOffset, InLocationOffset) == 0x000000, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_AddOffset::InLocationOffset' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_AddOffset, InScaleOffset) == 0x000018, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_AddOffset::InScaleOffset' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_AddOffset, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000030, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_AddOffset::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_AddOffset, CallFunc_GetInventoryHoveredObjectActor_ReturnValue) == 0x000038, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_AddOffset::CallFunc_GetInventoryHoveredObjectActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_AddOffset, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000040, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_AddOffset::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_AddOffset, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_AddOffset::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_AddOffset, CallFunc_GetInventoryHoveredObjectActor_ReturnValue_1) == 0x000050, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_AddOffset::CallFunc_GetInventoryHoveredObjectActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_AddOffset, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x000058, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_AddOffset::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_AddOffset, CallFunc_K2_AddActorWorldOffset_SweepHitResult) == 0x000060, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_AddOffset::CallFunc_K2_AddActorWorldOffset_SweepHitResult' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_AddOffset, CallFunc_GetInventoryHoveredObjectActor_ReturnValue_2) == 0x000148, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_AddOffset::CallFunc_GetInventoryHoveredObjectActor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_AddOffset, CallFunc_GetActorScale3D_ReturnValue) == 0x000150, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_AddOffset::CallFunc_GetActorScale3D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_AddOffset, CallFunc_Add_VectorVector_ReturnValue) == 0x000168, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_AddOffset::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_AddOffset, CallFunc_GetGameInstanceSubsystem_ReturnValue_3) == 0x000180, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_AddOffset::CallFunc_GetGameInstanceSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_AddOffset, CallFunc_GetInventoryHoveredObjectActor_ReturnValue_3) == 0x000188, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_AddOffset::CallFunc_GetInventoryHoveredObjectActor_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_AddOffset, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000190, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_AddOffset::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_AddOffset, CallFunc_GetGameInstanceSubsystem_ReturnValue_4) == 0x0001A8, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_AddOffset::CallFunc_GetGameInstanceSubsystem_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_AddOffset, CallFunc_GetInventoryDebugModeState_ReturnValue) == 0x0001B0, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_AddOffset::CallFunc_GetInventoryDebugModeState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_AddOffset, CallFunc_BooleanAND_ReturnValue) == 0x0001B1, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_AddOffset::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_AddOffset, CallFunc_Add_VectorVector_ReturnValue_2) == 0x0001B8, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_AddOffset::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_AddOffset, K2Node_MakeStruct_VInventoryPreviewPositionOverride) == 0x0001D0, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_AddOffset::K2Node_MakeStruct_VInventoryPreviewPositionOverride' has a wrong offset!");

// Function WBP_OriginalMenu_InventoryItemPreview.WBP_OriginalMenu_InventoryItemPreview_C.DEBUG_AddRotation
// 0x0160 (0x0160 - 0x0000)
struct WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_AddRotation final
{
public:
	struct FRotator                               InRotationOffset;                                  // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UVAltarUISubsystem*                     CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetInventoryHoveredObjectActor_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAltarUISubsystem*                     CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetInventoryHoveredObjectActor_ReturnValue_1; // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAltarUISubsystem*                     CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_AddActorWorldRotation_SweepHitResult;  // 0x0048(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AActor*                                 CallFunc_GetInventoryHoveredObjectActor_ReturnValue_2; // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAltarUIDebugSubsystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0140(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetInventoryDebugModeState_ReturnValue;   // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_AddRotation) == 0x000008, "Wrong alignment on WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_AddRotation");
static_assert(sizeof(WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_AddRotation) == 0x000160, "Wrong size on WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_AddRotation");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_AddRotation, InRotationOffset) == 0x000000, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_AddRotation::InRotationOffset' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_AddRotation, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000018, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_AddRotation::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_AddRotation, CallFunc_GetInventoryHoveredObjectActor_ReturnValue) == 0x000020, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_AddRotation::CallFunc_GetInventoryHoveredObjectActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_AddRotation, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_AddRotation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_AddRotation, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000030, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_AddRotation::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_AddRotation, CallFunc_GetInventoryHoveredObjectActor_ReturnValue_1) == 0x000038, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_AddRotation::CallFunc_GetInventoryHoveredObjectActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_AddRotation, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x000040, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_AddRotation::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_AddRotation, CallFunc_K2_AddActorWorldRotation_SweepHitResult) == 0x000048, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_AddRotation::CallFunc_K2_AddActorWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_AddRotation, CallFunc_GetInventoryHoveredObjectActor_ReturnValue_2) == 0x000130, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_AddRotation::CallFunc_GetInventoryHoveredObjectActor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_AddRotation, CallFunc_GetGameInstanceSubsystem_ReturnValue_3) == 0x000138, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_AddRotation::CallFunc_GetGameInstanceSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_AddRotation, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000140, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_AddRotation::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_AddRotation, CallFunc_GetInventoryDebugModeState_ReturnValue) == 0x000158, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_AddRotation::CallFunc_GetInventoryDebugModeState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_AddRotation, CallFunc_BooleanAND_ReturnValue) == 0x000159, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_AddRotation::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_OriginalMenu_InventoryItemPreview.WBP_OriginalMenu_InventoryItemPreview_C.DEBUG_CopyItemInfoToClipboard
// 0x0180 (0x0180 - 0x0000)
struct WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard final
{
public:
	class USkeletalMesh*                          Local_SkeletalMesh;                                // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Local_SkeletalMeshComponent;                       // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Local_StaticMesh;                                  // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Local_StaticMeshComponent;                         // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 ItemActor;                                         // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class FString                                 ObjectInfoString;                                  // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class UVAltarUIDebugSubsystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetInventoryDebugModeState_ReturnValue;   // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UVAltarUISubsystem*                     CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetInventoryHoveredObjectActor_ReturnValue; // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAttachedItem_OutAttachedItem;          // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_FindComponentByName_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPathName_ReturnValue;                  // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A3[0x5];                                       // 0x00A3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_GetComponentByClass_ReturnValue;          // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetComponentByClass_ReturnValue_1;        // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPathName_ReturnValue_1;                // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class USkeletalMesh*                          CallFunc_GetSkeletalMeshAsset_ReturnValue;         // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPathName_ReturnValue_2;                // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UVAltarUISubsystem*                     CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTESForm*                               CallFunc_GetInventoryHoveredObjectForm_ReturnValue; // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetFormDetailedString_ReturnValue;        // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAltarUISubsystem*                     CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetInventoryHoveredObjectActor_ReturnValue_1; // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsItemCloth_ReturnValue;                  // 0x017A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard) == 0x000008, "Wrong alignment on WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard");
static_assert(sizeof(WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard) == 0x000180, "Wrong size on WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard, Local_SkeletalMesh) == 0x000000, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard::Local_SkeletalMesh' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard, Local_SkeletalMeshComponent) == 0x000008, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard::Local_SkeletalMeshComponent' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard, Local_StaticMesh) == 0x000010, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard::Local_StaticMesh' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard, Local_StaticMeshComponent) == 0x000018, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard::Local_StaticMeshComponent' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard, ItemActor) == 0x000020, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard::ItemActor' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard, ObjectInfoString) == 0x000028, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard::ObjectInfoString' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000038, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard, CallFunc_GetInventoryDebugModeState_ReturnValue) == 0x000040, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard::CallFunc_GetInventoryDebugModeState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard, CallFunc_Concat_StrStr_ReturnValue) == 0x000048, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000058, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard, CallFunc_GetInventoryHoveredObjectActor_ReturnValue) == 0x000060, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard::CallFunc_GetInventoryHoveredObjectActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard, CallFunc_MakeLiteralName_ReturnValue) == 0x000068, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard, CallFunc_GetAttachedItem_OutAttachedItem) == 0x000070, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard::CallFunc_GetAttachedItem_OutAttachedItem' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard, CallFunc_FindComponentByName_ReturnValue) == 0x000078, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard::CallFunc_FindComponentByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard, CallFunc_GetPathName_ReturnValue) == 0x000080, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard::CallFunc_GetPathName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000090, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard, CallFunc_IsValid_ReturnValue) == 0x0000A0, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard, CallFunc_IsValid_ReturnValue_1) == 0x0000A1, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard, CallFunc_IsValid_ReturnValue_2) == 0x0000A2, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0000A8, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard, CallFunc_Concat_StrStr_ReturnValue_3) == 0x0000B8, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard, CallFunc_GetComponentByClass_ReturnValue) == 0x0000C8, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard, CallFunc_GetComponentByClass_ReturnValue_1) == 0x0000D0, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard, CallFunc_IsValid_ReturnValue_3) == 0x0000D8, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard, CallFunc_GetPathName_ReturnValue_1) == 0x0000E0, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard::CallFunc_GetPathName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard, CallFunc_IsValid_ReturnValue_4) == 0x0000F0, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard, CallFunc_Concat_StrStr_ReturnValue_4) == 0x0000F8, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard, CallFunc_GetSkeletalMeshAsset_ReturnValue) == 0x000108, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard::CallFunc_GetSkeletalMeshAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard, CallFunc_IsValid_ReturnValue_5) == 0x000110, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard, CallFunc_GetPathName_ReturnValue_2) == 0x000118, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard::CallFunc_GetPathName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard, CallFunc_IsValid_ReturnValue_6) == 0x000128, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard, CallFunc_Concat_StrStr_ReturnValue_5) == 0x000130, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x000140, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard, CallFunc_GetInventoryHoveredObjectForm_ReturnValue) == 0x000148, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard::CallFunc_GetInventoryHoveredObjectForm_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard, CallFunc_GetFormDetailedString_ReturnValue) == 0x000150, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard::CallFunc_GetFormDetailedString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard, CallFunc_IsValid_ReturnValue_7) == 0x000160, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard, CallFunc_GetGameInstanceSubsystem_ReturnValue_3) == 0x000168, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard::CallFunc_GetGameInstanceSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard, CallFunc_GetInventoryHoveredObjectActor_ReturnValue_1) == 0x000170, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard::CallFunc_GetInventoryHoveredObjectActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard, CallFunc_IsValid_ReturnValue_8) == 0x000178, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard, CallFunc_BooleanAND_ReturnValue) == 0x000179, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard, CallFunc_IsItemCloth_ReturnValue) == 0x00017A, "Member 'WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_CopyItemInfoToClipboard::CallFunc_IsItemCloth_ReturnValue' has a wrong offset!");

// Function WBP_OriginalMenu_InventoryItemPreview.WBP_OriginalMenu_InventoryItemPreview_C.DEBUG_DrawItemPreviewDebugMode
// 0x01D0 (0x01D0 - 0x0000)
struct WBP_OriginalMenu_InventoryItemPreview_C_DEBUG_DrawItemPreviewDebugMode final
{
public:
	class AActor*                                 AttachedItem;                                      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FString                                 CallFunc_Conv_RotatorToString_ReturnValue;         // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_VectorToString_ReturnValue;          // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UVAltarUIDebugSubsystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAltarUISubsystem*                     CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetInventoryDebugModeState_ReturnValue;   // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetInventoryHoveredObjectActor_ReturnValue; // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetItemBounds_OutOrigin;                  // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetItemBounds_OutBoxExtent;               // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorBounds_Origin;                    // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
