#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModernHud_CrosshairSneakEye

#include "Basic.hpp"

#include "Altar_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_ModernHud_CrosshairSneakEye.WBP_ModernHud_CrosshairSneakEye_C.ExecuteUbergraph_WBP_ModernHud_CrosshairSneakEye
// 0x0090 (0x0090 - 0x0000)
struct WBP_ModernHud_CrosshairSneakEye_C_ExecuteUbergraph_WBP_ModernHud_CrosshairSneakEye final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAccurateRealTime_Seconds;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetAccurateRealTime_PartialSeconds;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0048(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0058(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_DrawBowAniEndTime_ImplicitCast; // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_PlayBowAnimation_InDuration_ImplicitCast; // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_PlayBowAnimation_InDuration_ImplicitCast_1; // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_CrosshairSneakEye_C_ExecuteUbergraph_WBP_ModernHud_CrosshairSneakEye) == 0x000008, "Wrong alignment on WBP_ModernHud_CrosshairSneakEye_C_ExecuteUbergraph_WBP_ModernHud_CrosshairSneakEye");
static_assert(sizeof(WBP_ModernHud_CrosshairSneakEye_C_ExecuteUbergraph_WBP_ModernHud_CrosshairSneakEye) == 0x000090, "Wrong size on WBP_ModernHud_CrosshairSneakEye_C_ExecuteUbergraph_WBP_ModernHud_CrosshairSneakEye");
static_assert(offsetof(WBP_ModernHud_CrosshairSneakEye_C_ExecuteUbergraph_WBP_ModernHud_CrosshairSneakEye, EntryPoint) == 0x000000, "Member 'WBP_ModernHud_CrosshairSneakEye_C_ExecuteUbergraph_WBP_ModernHud_CrosshairSneakEye::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_CrosshairSneakEye_C_ExecuteUbergraph_WBP_ModernHud_CrosshairSneakEye, CallFunc_GetAccurateRealTime_Seconds) == 0x000004, "Member 'WBP_ModernHud_CrosshairSneakEye_C_ExecuteUbergraph_WBP_ModernHud_CrosshairSneakEye::CallFunc_GetAccurateRealTime_Seconds' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_CrosshairSneakEye_C_ExecuteUbergraph_WBP_ModernHud_CrosshairSneakEye, CallFunc_GetAccurateRealTime_PartialSeconds) == 0x000008, "Member 'WBP_ModernHud_CrosshairSneakEye_C_ExecuteUbergraph_WBP_ModernHud_CrosshairSneakEye::CallFunc_GetAccurateRealTime_PartialSeconds' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_CrosshairSneakEye_C_ExecuteUbergraph_WBP_ModernHud_CrosshairSneakEye, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000010, "Member 'WBP_ModernHud_CrosshairSneakEye_C_ExecuteUbergraph_WBP_ModernHud_CrosshairSneakEye::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_CrosshairSneakEye_C_ExecuteUbergraph_WBP_ModernHud_CrosshairSneakEye, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000018, "Member 'WBP_ModernHud_CrosshairSneakEye_C_ExecuteUbergraph_WBP_ModernHud_CrosshairSneakEye::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_CrosshairSneakEye_C_ExecuteUbergraph_WBP_ModernHud_CrosshairSneakEye, CallFunc_GetEndTime_ReturnValue) == 0x000020, "Member 'WBP_ModernHud_CrosshairSneakEye_C_ExecuteUbergraph_WBP_ModernHud_CrosshairSneakEye::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_CrosshairSneakEye_C_ExecuteUbergraph_WBP_ModernHud_CrosshairSneakEye, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000028, "Member 'WBP_ModernHud_CrosshairSneakEye_C_ExecuteUbergraph_WBP_ModernHud_CrosshairSneakEye::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_CrosshairSneakEye_C_ExecuteUbergraph_WBP_ModernHud_CrosshairSneakEye, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000030, "Member 'WBP_ModernHud_CrosshairSneakEye_C_ExecuteUbergraph_WBP_ModernHud_CrosshairSneakEye::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_CrosshairSneakEye_C_ExecuteUbergraph_WBP_ModernHud_CrosshairSneakEye, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000038, "Member 'WBP_ModernHud_CrosshairSneakEye_C_ExecuteUbergraph_WBP_ModernHud_CrosshairSneakEye::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_CrosshairSneakEye_C_ExecuteUbergraph_WBP_ModernHud_CrosshairSneakEye, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000040, "Member 'WBP_ModernHud_CrosshairSneakEye_C_ExecuteUbergraph_WBP_ModernHud_CrosshairSneakEye::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_CrosshairSneakEye_C_ExecuteUbergraph_WBP_ModernHud_CrosshairSneakEye, K2Node_CreateDelegate_OutputDelegate) == 0x000048, "Member 'WBP_ModernHud_CrosshairSneakEye_C_ExecuteUbergraph_WBP_ModernHud_CrosshairSneakEye::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_CrosshairSneakEye_C_ExecuteUbergraph_WBP_ModernHud_CrosshairSneakEye, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000058, "Member 'WBP_ModernHud_CrosshairSneakEye_C_ExecuteUbergraph_WBP_ModernHud_CrosshairSneakEye::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_CrosshairSneakEye_C_ExecuteUbergraph_WBP_ModernHud_CrosshairSneakEye, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000060, "Member 'WBP_ModernHud_CrosshairSneakEye_C_ExecuteUbergraph_WBP_ModernHud_CrosshairSneakEye::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_CrosshairSneakEye_C_ExecuteUbergraph_WBP_ModernHud_CrosshairSneakEye, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x000068, "Member 'WBP_ModernHud_CrosshairSneakEye_C_ExecuteUbergraph_WBP_ModernHud_CrosshairSneakEye::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_CrosshairSneakEye_C_ExecuteUbergraph_WBP_ModernHud_CrosshairSneakEye, K2Node_VariableSet_DrawBowAniEndTime_ImplicitCast) == 0x000070, "Member 'WBP_ModernHud_CrosshairSneakEye_C_ExecuteUbergraph_WBP_ModernHud_CrosshairSneakEye::K2Node_VariableSet_DrawBowAniEndTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_CrosshairSneakEye_C_ExecuteUbergraph_WBP_ModernHud_CrosshairSneakEye, CallFunc_PlayBowAnimation_InDuration_ImplicitCast) == 0x000078, "Member 'WBP_ModernHud_CrosshairSneakEye_C_ExecuteUbergraph_WBP_ModernHud_CrosshairSneakEye::CallFunc_PlayBowAnimation_InDuration_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_CrosshairSneakEye_C_ExecuteUbergraph_WBP_ModernHud_CrosshairSneakEye, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x000080, "Member 'WBP_ModernHud_CrosshairSneakEye_C_ExecuteUbergraph_WBP_ModernHud_CrosshairSneakEye::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_CrosshairSneakEye_C_ExecuteUbergraph_WBP_ModernHud_CrosshairSneakEye, CallFunc_PlayBowAnimation_InDuration_ImplicitCast_1) == 0x000088, "Member 'WBP_ModernHud_CrosshairSneakEye_C_ExecuteUbergraph_WBP_ModernHud_CrosshairSneakEye::CallFunc_PlayBowAnimation_InDuration_ImplicitCast_1' has a wrong offset!");

// Function WBP_ModernHud_CrosshairSneakEye.WBP_ModernHud_CrosshairSneakEye_C.GetNextAnimationStartTime
// 0x0038 (0x0038 - 0x0000)
struct WBP_ModernHud_CrosshairSneakEye_C_GetNextAnimationStartTime final
{
public:
	double                                        OutTIme;                                           // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimationCurrentTime_ReturnValue;      // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlayingForward_ReturnValue;    // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetAnimationCurrentTime_ReturnValue_1;    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_FunctionResult_OutTIme_ImplicitCast;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_CrosshairSneakEye_C_GetNextAnimationStartTime) == 0x000008, "Wrong alignment on WBP_ModernHud_CrosshairSneakEye_C_GetNextAnimationStartTime");
static_assert(sizeof(WBP_ModernHud_CrosshairSneakEye_C_GetNextAnimationStartTime) == 0x000038, "Wrong size on WBP_ModernHud_CrosshairSneakEye_C_GetNextAnimationStartTime");
static_assert(offsetof(WBP_ModernHud_CrosshairSneakEye_C_GetNextAnimationStartTime, OutTIme) == 0x000000, "Member 'WBP_ModernHud_CrosshairSneakEye_C_GetNextAnimationStartTime::OutTIme' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_CrosshairSneakEye_C_GetNextAnimationStartTime, CallFunc_GetAnimationCurrentTime_ReturnValue) == 0x000008, "Member 'WBP_ModernHud_CrosshairSneakEye_C_GetNextAnimationStartTime::CallFunc_GetAnimationCurrentTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_CrosshairSneakEye_C_GetNextAnimationStartTime, CallFunc_IsAnimationPlayingForward_ReturnValue) == 0x00000C, "Member 'WBP_ModernHud_CrosshairSneakEye_C_GetNextAnimationStartTime::CallFunc_IsAnimationPlayingForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_CrosshairSneakEye_C_GetNextAnimationStartTime, CallFunc_GetAnimationCurrentTime_ReturnValue_1) == 0x000010, "Member 'WBP_ModernHud_CrosshairSneakEye_C_GetNextAnimationStartTime::CallFunc_GetAnimationCurrentTime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_CrosshairSneakEye_C_GetNextAnimationStartTime, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000018, "Member 'WBP_ModernHud_CrosshairSneakEye_C_GetNextAnimationStartTime::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_CrosshairSneakEye_C_GetNextAnimationStartTime, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000020, "Member 'WBP_ModernHud_CrosshairSneakEye_C_GetNextAnimationStartTime::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_CrosshairSneakEye_C_GetNextAnimationStartTime, K2Node_FunctionResult_OutTIme_ImplicitCast) == 0x000028, "Member 'WBP_ModernHud_CrosshairSneakEye_C_GetNextAnimationStartTime::K2Node_FunctionResult_OutTIme_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_CrosshairSneakEye_C_GetNextAnimationStartTime, CallFunc_Subtract_DoubleDouble_B_ImplicitCast) == 0x000030, "Member 'WBP_ModernHud_CrosshairSneakEye_C_GetNextAnimationStartTime::CallFunc_Subtract_DoubleDouble_B_ImplicitCast' has a wrong offset!");

// Function WBP_ModernHud_CrosshairSneakEye.WBP_ModernHud_CrosshairSneakEye_C.PlayBowAnimation
// 0x0028 (0x0028 - 0x0000)
struct WBP_ModernHud_CrosshairSneakEye_C_PlayBowAnimation final
{
public:
	double                                        InDuration;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          InPlayback;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimation_StartAtTime_ImplicitCast;   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimation_PlaybackSpeed_ImplicitCast; // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_CrosshairSneakEye_C_PlayBowAnimation) == 0x000008, "Wrong alignment on WBP_ModernHud_CrosshairSneakEye_C_PlayBowAnimation");
static_assert(sizeof(WBP_ModernHud_CrosshairSneakEye_C_PlayBowAnimation) == 0x000028, "Wrong size on WBP_ModernHud_CrosshairSneakEye_C_PlayBowAnimation");
static_assert(offsetof(WBP_ModernHud_CrosshairSneakEye_C_PlayBowAnimation, InDuration) == 0x000000, "Member 'WBP_ModernHud_CrosshairSneakEye_C_PlayBowAnimation::InDuration' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_CrosshairSneakEye_C_PlayBowAnimation, InPlayback) == 0x000008, "Member 'WBP_ModernHud_CrosshairSneakEye_C_PlayBowAnimation::InPlayback' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_CrosshairSneakEye_C_PlayBowAnimation, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000010, "Member 'WBP_ModernHud_CrosshairSneakEye_C_PlayBowAnimation::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_CrosshairSneakEye_C_PlayBowAnimation, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'WBP_ModernHud_CrosshairSneakEye_C_PlayBowAnimation::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_CrosshairSneakEye_C_PlayBowAnimation, CallFunc_PlayAnimation_StartAtTime_ImplicitCast) == 0x000020, "Member 'WBP_ModernHud_CrosshairSneakEye_C_PlayBowAnimation::CallFunc_PlayAnimation_StartAtTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_CrosshairSneakEye_C_PlayBowAnimation, CallFunc_PlayAnimation_PlaybackSpeed_ImplicitCast) == 0x000024, "Member 'WBP_ModernHud_CrosshairSneakEye_C_PlayBowAnimation::CallFunc_PlayAnimation_PlaybackSpeed_ImplicitCast' has a wrong offset!");

// Function WBP_ModernHud_CrosshairSneakEye.WBP_ModernHud_CrosshairSneakEye_C.PlayHitAnimation
// 0x0008 (0x0008 - 0x0000)
struct WBP_ModernHud_CrosshairSneakEye_C_PlayHitAnimation final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_CrosshairSneakEye_C_PlayHitAnimation) == 0x000008, "Wrong alignment on WBP_ModernHud_CrosshairSneakEye_C_PlayHitAnimation");
static_assert(sizeof(WBP_ModernHud_CrosshairSneakEye_C_PlayHitAnimation) == 0x000008, "Wrong size on WBP_ModernHud_CrosshairSneakEye_C_PlayHitAnimation");
static_assert(offsetof(WBP_ModernHud_CrosshairSneakEye_C_PlayHitAnimation, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'WBP_ModernHud_CrosshairSneakEye_C_PlayHitAnimation::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_ModernHud_CrosshairSneakEye.WBP_ModernHud_CrosshairSneakEye_C.ProperlyStopAnimation
// 0x0008 (0x0008 - 0x0000)
struct WBP_ModernHud_CrosshairSneakEye_C_ProperlyStopAnimation final
{
public:
	double                                        CallFunc_GetNextAnimationStartTime_OutTIme;        // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_CrosshairSneakEye_C_ProperlyStopAnimation) == 0x000008, "Wrong alignment on WBP_ModernHud_CrosshairSneakEye_C_ProperlyStopAnimation");
static_assert(sizeof(WBP_ModernHud_CrosshairSneakEye_C_ProperlyStopAnimation) == 0x000008, "Wrong size on WBP_ModernHud_CrosshairSneakEye_C_ProperlyStopAnimation");
static_assert(offsetof(WBP_ModernHud_CrosshairSneakEye_C_ProperlyStopAnimation, CallFunc_GetNextAnimationStartTime_OutTIme) == 0x000000, "Member 'WBP_ModernHud_CrosshairSneakEye_C_ProperlyStopAnimation::CallFunc_GetNextAnimationStartTime_OutTIme' has a wrong offset!");

// Function WBP_ModernHud_CrosshairSneakEye.WBP_ModernHud_CrosshairSneakEye_C.SetActionIconColorIllegality
// 0x0014 (0x0014 - 0x0000)
struct WBP_ModernHud_CrosshairSneakEye_C_SetActionIconColorIllegality final
{
public:
	bool                                          bNewIllegal;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_CrosshairSneakEye_C_SetActionIconColorIllegality) == 0x000004, "Wrong alignment on WBP_ModernHud_CrosshairSneakEye_C_SetActionIconColorIllegality");
static_assert(sizeof(WBP_ModernHud_CrosshairSneakEye_C_SetActionIconColorIllegality) == 0x000014, "Wrong size on WBP_ModernHud_CrosshairSneakEye_C_SetActionIconColorIllegality");
static_assert(offsetof(WBP_ModernHud_CrosshairSneakEye_C_SetActionIconColorIllegality, bNewIllegal) == 0x000000, "Member 'WBP_ModernHud_CrosshairSneakEye_C_SetActionIconColorIllegality::bNewIllegal' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_CrosshairSneakEye_C_SetActionIconColorIllegality, Temp_bool_Variable) == 0x000001, "Member 'WBP_ModernHud_CrosshairSneakEye_C_SetActionIconColorIllegality::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_CrosshairSneakEye_C_SetActionIconColorIllegality, K2Node_Select_Default) == 0x000004, "Member 'WBP_ModernHud_CrosshairSneakEye_C_SetActionIconColorIllegality::K2Node_Select_Default' has a wrong offset!");

// Function WBP_ModernHud_CrosshairSneakEye.WBP_ModernHud_CrosshairSneakEye_C.SetActionIconTexture
// 0x0018 (0x0018 - 0x0000)
struct WBP_ModernHud_CrosshairSneakEye_C_SetActionIconTexture final
{
public:
	ELegacyHudReticleIcon                         NewReticle;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LocalNewActionIconVisibility;                      // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Subtract_ByteByte_ReturnValue;            // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_ByteToDouble_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_CrosshairSneakEye_C_SetActionIconTexture) == 0x000008, "Wrong alignment on WBP_ModernHud_CrosshairSneakEye_C_SetActionIconTexture");
static_assert(sizeof(WBP_ModernHud_CrosshairSneakEye_C_SetActionIconTexture) == 0x000018, "Wrong size on WBP_ModernHud_CrosshairSneakEye_C_SetActionIconTexture");
static_assert(offsetof(WBP_ModernHud_CrosshairSneakEye_C_SetActionIconTexture, NewReticle) == 0x000000, "Member 'WBP_ModernHud_CrosshairSneakEye_C_SetActionIconTexture::NewReticle' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_CrosshairSneakEye_C_SetActionIconTexture, LocalNewActionIconVisibility) == 0x000001, "Member 'WBP_ModernHud_CrosshairSneakEye_C_SetActionIconTexture::LocalNewActionIconVisibility' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_CrosshairSneakEye_C_SetActionIconTexture, CallFunc_Subtract_ByteByte_ReturnValue) == 0x000002, "Member 'WBP_ModernHud_CrosshairSneakEye_C_SetActionIconTexture::CallFunc_Subtract_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_CrosshairSneakEye_C_SetActionIconTexture, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000003, "Member 'WBP_ModernHud_CrosshairSneakEye_C_SetActionIconTexture::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_CrosshairSneakEye_C_SetActionIconTexture, CallFunc_Conv_ByteToDouble_ReturnValue) == 0x000008, "Member 'WBP_ModernHud_CrosshairSneakEye_C_SetActionIconTexture::CallFunc_Conv_ByteToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_CrosshairSneakEye_C_SetActionIconTexture, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000010, "Member 'WBP_ModernHud_CrosshairSneakEye_C_SetActionIconTexture::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function WBP_ModernHud_CrosshairSneakEye.WBP_ModernHud_CrosshairSneakEye_C.SetActionIconVisibility
// 0x0038 (0x0038 - 0x0000)
struct WBP_ModernHud_CrosshairSneakEye_C_SetActionIconVisibility final
{
public:
	bool                                          bNewVisibility;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_BoolToDouble_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAccurateRealTime_Seconds;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetAccurateRealTime_PartialSeconds;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_CrosshairSneakEye_C_SetActionIconVisibility) == 0x000008, "Wrong alignment on WBP_ModernHud_CrosshairSneakEye_C_SetActionIconVisibility");
static_assert(sizeof(WBP_ModernHud_CrosshairSneakEye_C_SetActionIconVisibility) == 0x000038, "Wrong size on WBP_ModernHud_CrosshairSneakEye_C_SetActionIconVisibility");
static_assert(offsetof(WBP_ModernHud_CrosshairSneakEye_C_SetActionIconVisibility, bNewVisibility) == 0x000000, "Member 'WBP_ModernHud_CrosshairSneakEye_C_SetActionIconVisibility::bNewVisibility' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_CrosshairSneakEye_C_SetActionIconVisibility, CallFunc_Conv_BoolToDouble_ReturnValue) == 0x000008, "Member 'WBP_ModernHud_CrosshairSneakEye_C_SetActionIconVisibility::CallFunc_Conv_BoolToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_CrosshairSneakEye_C_SetActionIconVisibility, CallFunc_GetAccurateRealTime_Seconds) == 0x000010, "Member 'WBP_ModernHud_CrosshairSneakEye_C_SetActionIconVisibility::CallFunc_GetAccurateRealTime_Seconds' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_CrosshairSneakEye_C_SetActionIconVisibility, CallFunc_GetAccurateRealTime_PartialSeconds) == 0x000018, "Member 'WBP_ModernHud_CrosshairSneakEye_C_SetActionIconVisibility::CallFunc_GetAccurateRealTime_PartialSeconds' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_CrosshairSneakEye_C_SetActionIconVisibility, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000020, "Member 'WBP_ModernHud_CrosshairSneakEye_C_SetActionIconVisibility::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_CrosshairSneakEye_C_SetActionIconVisibility, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000028, "Member 'WBP_ModernHud_CrosshairSneakEye_C_SetActionIconVisibility::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_CrosshairSneakEye_C_SetActionIconVisibility, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000030, "Member 'WBP_ModernHud_CrosshairSneakEye_C_SetActionIconVisibility::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_CrosshairSneakEye_C_SetActionIconVisibility, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x000034, "Member 'WBP_ModernHud_CrosshairSneakEye_C_SetActionIconVisibility::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");

// Function WBP_ModernHud_CrosshairSneakEye.WBP_ModernHud_CrosshairSneakEye_C.SetBehavior
// 0x0002 (0x0002 - 0x0000)
struct WBP_ModernHud_CrosshairSneakEye_C_SetBehavior final
{
public:
	EModernReticleWeaponBehavior                  NewBehavior;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_CrosshairSneakEye_C_SetBehavior) == 0x000001, "Wrong alignment on WBP_ModernHud_CrosshairSneakEye_C_SetBehavior");
static_assert(sizeof(WBP_ModernHud_CrosshairSneakEye_C_SetBehavior) == 0x000002, "Wrong size on WBP_ModernHud_CrosshairSneakEye_C_SetBehavior");
static_assert(offsetof(WBP_ModernHud_CrosshairSneakEye_C_SetBehavior, NewBehavior) == 0x000000, "Member 'WBP_ModernHud_CrosshairSneakEye_C_SetBehavior::NewBehavior' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_CrosshairSneakEye_C_SetBehavior, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'WBP_ModernHud_CrosshairSneakEye_C_SetBehavior::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_ModernHud_CrosshairSneakEye.WBP_ModernHud_CrosshairSneakEye_C.SetSneaking
// 0x0030 (0x0030 - 0x0000)
struct WBP_ModernHud_CrosshairSneakEye_C_SetSneaking final
{
public:
	bool                                          InIsSneaking;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetAccurateRealTime_Seconds;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetAccurateRealTime_PartialSeconds;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_BoolToDouble_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_CrosshairSneakEye_C_SetSneaking) == 0x000008, "Wrong alignment on WBP_ModernHud_CrosshairSneakEye_C_SetSneaking");
static_assert(sizeof(WBP_ModernHud_CrosshairSneakEye_C_SetSneaking) == 0x000030, "Wrong size on WBP_ModernHud_CrosshairSneakEye_C_SetSneaking");
static_assert(offsetof(WBP_ModernHud_CrosshairSneakEye_C_SetSneaking, InIsSneaking) == 0x000000, "Member 'WBP_ModernHud_CrosshairSneakEye_C_SetSneaking::InIsSneaking' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_CrosshairSneakEye_C_SetSneaking, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000001, "Member 'WBP_ModernHud_CrosshairSneakEye_C_SetSneaking::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_CrosshairSneakEye_C_SetSneaking, CallFunc_GetAccurateRealTime_Seconds) == 0x000004, "Member 'WBP_ModernHud_CrosshairSneakEye_C_SetSneaking::CallFunc_GetAccurateRealTime_Seconds' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_CrosshairSneakEye_C_SetSneaking, CallFunc_GetAccurateRealTime_PartialSeconds) == 0x000008, "Member 'WBP_ModernHud_CrosshairSneakEye_C_SetSneaking::CallFunc_GetAccurateRealTime_PartialSeconds' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_CrosshairSneakEye_C_SetSneaking, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000010, "Member 'WBP_ModernHud_CrosshairSneakEye_C_SetSneaking::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_CrosshairSneakEye_C_SetSneaking, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000018, "Member 'WBP_ModernHud_CrosshairSneakEye_C_SetSneaking::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_CrosshairSneakEye_C_SetSneaking, CallFunc_Conv_BoolToDouble_ReturnValue) == 0x000020, "Member 'WBP_ModernHud_CrosshairSneakEye_C_SetSneaking::CallFunc_Conv_BoolToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_CrosshairSneakEye_C_SetSneaking, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000028, "Member 'WBP_ModernHud_CrosshairSneakEye_C_SetSneaking::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_CrosshairSneakEye_C_SetSneaking, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x00002C, "Member 'WBP_ModernHud_CrosshairSneakEye_C_SetSneaking::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");

// Function WBP_ModernHud_CrosshairSneakEye.WBP_ModernHud_CrosshairSneakEye_C.SneakAlpha
// 0x0028 (0x0028 - 0x0000)
struct WBP_ModernHud_CrosshairSneakEye_C_SneakAlpha final
{
public:
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue_1;    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_CrosshairSneakEye_C_SneakAlpha) == 0x000008, "Wrong alignment on WBP_ModernHud_CrosshairSneakEye_C_SneakAlpha");
static_assert(sizeof(WBP_ModernHud_CrosshairSneakEye_C_SneakAlpha) == 0x000028, "Wrong size on WBP_ModernHud_CrosshairSneakEye_C_SneakAlpha");
static_assert(offsetof(WBP_ModernHud_CrosshairSneakEye_C_SneakAlpha, CallFunc_EqualEqual_DoubleDouble_ReturnValue) == 0x000000, "Member 'WBP_ModernHud_CrosshairSneakEye_C_SneakAlpha::CallFunc_EqualEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_CrosshairSneakEye_C_SneakAlpha, CallFunc_EqualEqual_DoubleDouble_ReturnValue_1) == 0x000001, "Member 'WBP_ModernHud_CrosshairSneakEye_C_SneakAlpha::CallFunc_EqualEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_CrosshairSneakEye_C_SneakAlpha, CallFunc_BooleanAND_ReturnValue) == 0x000002, "Member 'WBP_ModernHud_CrosshairSneakEye_C_SneakAlpha::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_CrosshairSneakEye_C_SneakAlpha, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000003, "Member 'WBP_ModernHud_CrosshairSneakEye_C_SneakAlpha::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_CrosshairSneakEye_C_SneakAlpha, CallFunc_FClamp_ReturnValue) == 0x000008, "Member 'WBP_ModernHud_CrosshairSneakEye_C_SneakAlpha::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_CrosshairSneakEye_C_SneakAlpha, CallFunc_Lerp_ReturnValue) == 0x000010, "Member 'WBP_ModernHud_CrosshairSneakEye_C_SneakAlpha::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_CrosshairSneakEye_C_SneakAlpha, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000018, "Member 'WBP_ModernHud_CrosshairSneakEye_C_SneakAlpha::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_CrosshairSneakEye_C_SneakAlpha, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000020, "Member 'WBP_ModernHud_CrosshairSneakEye_C_SneakAlpha::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function WBP_ModernHud_CrosshairSneakEye.WBP_ModernHud_CrosshairSneakEye_C.UpdateSneakLevel
// 0x0030 (0x0030 - 0x0000)
struct WBP_ModernHud_CrosshairSneakEye_C_UpdateSneakLevel final
{
public:
	double                                        InSneakLevel;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue;   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_VariableSet_CurrentSneakLevel_ImplicitCast; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_CrosshairSneakEye_C_UpdateSneakLevel) == 0x000008, "Wrong alignment on WBP_ModernHud_CrosshairSneakEye_C_UpdateSneakLevel");
static_assert(sizeof(WBP_ModernHud_CrosshairSneakEye_C_UpdateSneakLevel) == 0x000030, "Wrong size on WBP_ModernHud_CrosshairSneakEye_C_UpdateSneakLevel");
static_assert(offsetof(WBP_ModernHud_CrosshairSneakEye_C_UpdateSneakLevel, InSneakLevel) == 0x000000, "Member 'WBP_ModernHud_CrosshairSneakEye_C_UpdateSneakLevel::InSneakLevel' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_CrosshairSneakEye_C_UpdateSneakLevel, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_ModernHud_CrosshairSneakEye_C_UpdateSneakLevel::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
