#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModernHud_Compass

#include "Basic.hpp"

#include "Altar_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_ModernHud_Compass.WBP_ModernHud_Compass_C.CreateCompassMarker
// 0x0068 (0x0068 - 0x0000)
struct WBP_ModernHud_Compass_C_CreateCompassMarker final
{
public:
	class UPanelWidget*                           NewMarkerParent;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FCompassIconMarker                     CompassIconData;                                   // 0x0008(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UWBP_ModernHud_CompassIcon_C*           NewMarker;                                         // 0x0048(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_ModernHud_CompassIcon_C*           Local_NewCompassIcon;                              // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_ModernHud_CompassIcon_C*           CallFunc_Create_ReturnValue;                       // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_Compass_C_CreateCompassMarker) == 0x000008, "Wrong alignment on WBP_ModernHud_Compass_C_CreateCompassMarker");
static_assert(sizeof(WBP_ModernHud_Compass_C_CreateCompassMarker) == 0x000068, "Wrong size on WBP_ModernHud_Compass_C_CreateCompassMarker");
static_assert(offsetof(WBP_ModernHud_Compass_C_CreateCompassMarker, NewMarkerParent) == 0x000000, "Member 'WBP_ModernHud_Compass_C_CreateCompassMarker::NewMarkerParent' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_CreateCompassMarker, CompassIconData) == 0x000008, "Member 'WBP_ModernHud_Compass_C_CreateCompassMarker::CompassIconData' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_CreateCompassMarker, NewMarker) == 0x000048, "Member 'WBP_ModernHud_Compass_C_CreateCompassMarker::NewMarker' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_CreateCompassMarker, Local_NewCompassIcon) == 0x000050, "Member 'WBP_ModernHud_Compass_C_CreateCompassMarker::Local_NewCompassIcon' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_CreateCompassMarker, CallFunc_Create_ReturnValue) == 0x000058, "Member 'WBP_ModernHud_Compass_C_CreateCompassMarker::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_CreateCompassMarker, CallFunc_Array_Add_ReturnValue) == 0x000060, "Member 'WBP_ModernHud_Compass_C_CreateCompassMarker::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function WBP_ModernHud_Compass.WBP_ModernHud_Compass_C.CreateHostileMarker
// 0x0068 (0x0068 - 0x0000)
struct WBP_ModernHud_Compass_C_CreateHostileMarker final
{
public:
	class UPanelWidget*                           NewMarkerParent;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_ModernHud_CompassIcon_C*           NewHostileMarker;                                  // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_ModernHud_CompassIcon_C*           Local_NewCompassIcon;                              // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_ModernHud_CompassIcon_C*           CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCompassIconMarker                     Temp_struct_Variable;                              // 0x0028(0x0040)()
};
static_assert(alignof(WBP_ModernHud_Compass_C_CreateHostileMarker) == 0x000008, "Wrong alignment on WBP_ModernHud_Compass_C_CreateHostileMarker");
static_assert(sizeof(WBP_ModernHud_Compass_C_CreateHostileMarker) == 0x000068, "Wrong size on WBP_ModernHud_Compass_C_CreateHostileMarker");
static_assert(offsetof(WBP_ModernHud_Compass_C_CreateHostileMarker, NewMarkerParent) == 0x000000, "Member 'WBP_ModernHud_Compass_C_CreateHostileMarker::NewMarkerParent' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_CreateHostileMarker, NewHostileMarker) == 0x000008, "Member 'WBP_ModernHud_Compass_C_CreateHostileMarker::NewHostileMarker' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_CreateHostileMarker, Local_NewCompassIcon) == 0x000010, "Member 'WBP_ModernHud_Compass_C_CreateHostileMarker::Local_NewCompassIcon' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_CreateHostileMarker, CallFunc_Create_ReturnValue) == 0x000018, "Member 'WBP_ModernHud_Compass_C_CreateHostileMarker::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_CreateHostileMarker, CallFunc_Array_Add_ReturnValue) == 0x000020, "Member 'WBP_ModernHud_Compass_C_CreateHostileMarker::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_CreateHostileMarker, Temp_struct_Variable) == 0x000028, "Member 'WBP_ModernHud_Compass_C_CreateHostileMarker::Temp_struct_Variable' has a wrong offset!");

// Function WBP_ModernHud_Compass.WBP_ModernHud_Compass_C.EventOnQuestMarkerdUpdated
// 0x0010 (0x0010 - 0x0000)
struct WBP_ModernHud_Compass_C_EventOnQuestMarkerdUpdated final
{
public:
	TArray<struct FCompassIconMarker>             CompassIconMarkersList;                            // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_ModernHud_Compass_C_EventOnQuestMarkerdUpdated) == 0x000008, "Wrong alignment on WBP_ModernHud_Compass_C_EventOnQuestMarkerdUpdated");
static_assert(sizeof(WBP_ModernHud_Compass_C_EventOnQuestMarkerdUpdated) == 0x000010, "Wrong size on WBP_ModernHud_Compass_C_EventOnQuestMarkerdUpdated");
static_assert(offsetof(WBP_ModernHud_Compass_C_EventOnQuestMarkerdUpdated, CompassIconMarkersList) == 0x000000, "Member 'WBP_ModernHud_Compass_C_EventOnQuestMarkerdUpdated::CompassIconMarkersList' has a wrong offset!");

// Function WBP_ModernHud_Compass.WBP_ModernHud_Compass_C.ExecuteUbergraph_WBP_ModernHud_Compass
// 0x0028 (0x0028 - 0x0000)
struct WBP_ModernHud_Compass_C_ExecuteUbergraph_WBP_ModernHud_Compass final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCompassIconMarker>             K2Node_CustomEvent_CompassIconMarkersList;         // 0x0008(0x0010)(ConstParm, ReferenceParm)
	TArray<struct FHostileData>                   K2Node_CustomEvent_HostileData;                    // 0x0018(0x0010)(ConstParm, ReferenceParm)
};
static_assert(alignof(WBP_ModernHud_Compass_C_ExecuteUbergraph_WBP_ModernHud_Compass) == 0x000008, "Wrong alignment on WBP_ModernHud_Compass_C_ExecuteUbergraph_WBP_ModernHud_Compass");
static_assert(sizeof(WBP_ModernHud_Compass_C_ExecuteUbergraph_WBP_ModernHud_Compass) == 0x000028, "Wrong size on WBP_ModernHud_Compass_C_ExecuteUbergraph_WBP_ModernHud_Compass");
static_assert(offsetof(WBP_ModernHud_Compass_C_ExecuteUbergraph_WBP_ModernHud_Compass, EntryPoint) == 0x000000, "Member 'WBP_ModernHud_Compass_C_ExecuteUbergraph_WBP_ModernHud_Compass::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_ExecuteUbergraph_WBP_ModernHud_Compass, K2Node_CustomEvent_CompassIconMarkersList) == 0x000008, "Member 'WBP_ModernHud_Compass_C_ExecuteUbergraph_WBP_ModernHud_Compass::K2Node_CustomEvent_CompassIconMarkersList' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_ExecuteUbergraph_WBP_ModernHud_Compass, K2Node_CustomEvent_HostileData) == 0x000018, "Member 'WBP_ModernHud_Compass_C_ExecuteUbergraph_WBP_ModernHud_Compass::K2Node_CustomEvent_HostileData' has a wrong offset!");

// Function WBP_ModernHud_Compass.WBP_ModernHud_Compass_C.On Heading Updated
// 0x0010 (0x0010 - 0x0000)
struct WBP_ModernHud_Compass_C_On_Heading_Updated final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_VariableSet_Heading_ImplicitCast;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_Compass_C_On_Heading_Updated) == 0x000008, "Wrong alignment on WBP_ModernHud_Compass_C_On_Heading_Updated");
static_assert(sizeof(WBP_ModernHud_Compass_C_On_Heading_Updated) == 0x000010, "Wrong size on WBP_ModernHud_Compass_C_On_Heading_Updated");
static_assert(offsetof(WBP_ModernHud_Compass_C_On_Heading_Updated, Value) == 0x000000, "Member 'WBP_ModernHud_Compass_C_On_Heading_Updated::Value' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_On_Heading_Updated, K2Node_VariableSet_Heading_ImplicitCast) == 0x000008, "Member 'WBP_ModernHud_Compass_C_On_Heading_Updated::K2Node_VariableSet_Heading_ImplicitCast' has a wrong offset!");

// Function WBP_ModernHud_Compass.WBP_ModernHud_Compass_C.SetCompassFacePosition
// 0x0008 (0x0008 - 0x0000)
struct WBP_ModernHud_Compass_C_SetCompassFacePosition final
{
public:
	double                                        CompassNewPosition;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_Compass_C_SetCompassFacePosition) == 0x000008, "Wrong alignment on WBP_ModernHud_Compass_C_SetCompassFacePosition");
static_assert(sizeof(WBP_ModernHud_Compass_C_SetCompassFacePosition) == 0x000008, "Wrong size on WBP_ModernHud_Compass_C_SetCompassFacePosition");
static_assert(offsetof(WBP_ModernHud_Compass_C_SetCompassFacePosition, CompassNewPosition) == 0x000000, "Member 'WBP_ModernHud_Compass_C_SetCompassFacePosition::CompassNewPosition' has a wrong offset!");

// Function WBP_ModernHud_Compass.WBP_ModernHud_Compass_C.SetText
// 0x0020 (0x0020 - 0x0000)
struct WBP_ModernHud_Compass_C_SetText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	double                                        InPositionX;                                       // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_Compass_C_SetText) == 0x000008, "Wrong alignment on WBP_ModernHud_Compass_C_SetText");
static_assert(sizeof(WBP_ModernHud_Compass_C_SetText) == 0x000020, "Wrong size on WBP_ModernHud_Compass_C_SetText");
static_assert(offsetof(WBP_ModernHud_Compass_C_SetText, InText) == 0x000000, "Member 'WBP_ModernHud_Compass_C_SetText::InText' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_SetText, InPositionX) == 0x000018, "Member 'WBP_ModernHud_Compass_C_SetText::InPositionX' has a wrong offset!");

// Function WBP_ModernHud_Compass.WBP_ModernHud_Compass_C.SetTextPosition
// 0x0060 (0x0060 - 0x0000)
struct WBP_ModernHud_Compass_C_SetTextPosition final
{
public:
	double                                        InNewPosition;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_1;           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetPosition_ReturnValue;                  // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_1;                        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_1;                        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_Compass_C_SetTextPosition) == 0x000008, "Wrong alignment on WBP_ModernHud_Compass_C_SetTextPosition");
static_assert(sizeof(WBP_ModernHud_Compass_C_SetTextPosition) == 0x000060, "Wrong size on WBP_ModernHud_Compass_C_SetTextPosition");
static_assert(offsetof(WBP_ModernHud_Compass_C_SetTextPosition, InNewPosition) == 0x000000, "Member 'WBP_ModernHud_Compass_C_SetTextPosition::InNewPosition' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_SetTextPosition, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000008, "Member 'WBP_ModernHud_Compass_C_SetTextPosition::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_SetTextPosition, CallFunc_SlotAsCanvasSlot_ReturnValue_1) == 0x000010, "Member 'WBP_ModernHud_Compass_C_SetTextPosition::CallFunc_SlotAsCanvasSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_SetTextPosition, CallFunc_GetPosition_ReturnValue) == 0x000018, "Member 'WBP_ModernHud_Compass_C_SetTextPosition::CallFunc_GetPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_SetTextPosition, CallFunc_BreakVector2D_X) == 0x000028, "Member 'WBP_ModernHud_Compass_C_SetTextPosition::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_SetTextPosition, CallFunc_BreakVector2D_Y) == 0x000030, "Member 'WBP_ModernHud_Compass_C_SetTextPosition::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_SetTextPosition, CallFunc_BreakVector2D_X_1) == 0x000038, "Member 'WBP_ModernHud_Compass_C_SetTextPosition::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_SetTextPosition, CallFunc_BreakVector2D_Y_1) == 0x000040, "Member 'WBP_ModernHud_Compass_C_SetTextPosition::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_SetTextPosition, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000048, "Member 'WBP_ModernHud_Compass_C_SetTextPosition::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_SetTextPosition, CallFunc_MakeVector2D_ReturnValue) == 0x000050, "Member 'WBP_ModernHud_Compass_C_SetTextPosition::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");

// Function WBP_ModernHud_Compass.WBP_ModernHud_Compass_C.SetTextVisibility
// 0x0005 (0x0005 - 0x0000)
struct WBP_ModernHud_Compass_C_SetTextVisibility final
{
public:
	bool                                          bInVisible;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_Compass_C_SetTextVisibility) == 0x000001, "Wrong alignment on WBP_ModernHud_Compass_C_SetTextVisibility");
static_assert(sizeof(WBP_ModernHud_Compass_C_SetTextVisibility) == 0x000005, "Wrong size on WBP_ModernHud_Compass_C_SetTextVisibility");
static_assert(offsetof(WBP_ModernHud_Compass_C_SetTextVisibility, bInVisible) == 0x000000, "Member 'WBP_ModernHud_Compass_C_SetTextVisibility::bInVisible' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_SetTextVisibility, Temp_bool_Variable) == 0x000001, "Member 'WBP_ModernHud_Compass_C_SetTextVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_SetTextVisibility, Temp_byte_Variable) == 0x000002, "Member 'WBP_ModernHud_Compass_C_SetTextVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_SetTextVisibility, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_ModernHud_Compass_C_SetTextVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_SetTextVisibility, K2Node_Select_Default) == 0x000004, "Member 'WBP_ModernHud_Compass_C_SetTextVisibility::K2Node_Select_Default' has a wrong offset!");

// Function WBP_ModernHud_Compass.WBP_ModernHud_Compass_C.SyncHostileWidgetCount
// 0x0060 (0x0060 - 0x0000)
struct WBP_ModernHud_Compass_C_SyncHostileWidgetCount final
{
public:
	int32                                         Local_DataLenght;                                  // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Local_HostilesLenght;                              // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_ModernHud_CompassIcon_C*           Local_HostileElement;                              // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_ModernHud_CompassIcon_C*           CallFunc_CreateHostileMarker_NewHostileMarker;     // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ModernHud_CompassIcon_C*           CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53[0x1];                                       // 0x0053(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_Compass_C_SyncHostileWidgetCount) == 0x000008, "Wrong alignment on WBP_ModernHud_Compass_C_SyncHostileWidgetCount");
static_assert(sizeof(WBP_ModernHud_Compass_C_SyncHostileWidgetCount) == 0x000060, "Wrong size on WBP_ModernHud_Compass_C_SyncHostileWidgetCount");
static_assert(offsetof(WBP_ModernHud_Compass_C_SyncHostileWidgetCount, Local_DataLenght) == 0x000000, "Member 'WBP_ModernHud_Compass_C_SyncHostileWidgetCount::Local_DataLenght' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_SyncHostileWidgetCount, Local_HostilesLenght) == 0x000004, "Member 'WBP_ModernHud_Compass_C_SyncHostileWidgetCount::Local_HostilesLenght' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_SyncHostileWidgetCount, Local_HostileElement) == 0x000008, "Member 'WBP_ModernHud_Compass_C_SyncHostileWidgetCount::Local_HostileElement' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_SyncHostileWidgetCount, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'WBP_ModernHud_Compass_C_SyncHostileWidgetCount::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_SyncHostileWidgetCount, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'WBP_ModernHud_Compass_C_SyncHostileWidgetCount::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_SyncHostileWidgetCount, Temp_int_Array_Index_Variable) == 0x000018, "Member 'WBP_ModernHud_Compass_C_SyncHostileWidgetCount::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_SyncHostileWidgetCount, Temp_int_Array_Index_Variable_1) == 0x00001C, "Member 'WBP_ModernHud_Compass_C_SyncHostileWidgetCount::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_SyncHostileWidgetCount, CallFunc_CreateHostileMarker_NewHostileMarker) == 0x000020, "Member 'WBP_ModernHud_Compass_C_SyncHostileWidgetCount::CallFunc_CreateHostileMarker_NewHostileMarker' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_SyncHostileWidgetCount, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'WBP_ModernHud_Compass_C_SyncHostileWidgetCount::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_SyncHostileWidgetCount, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'WBP_ModernHud_Compass_C_SyncHostileWidgetCount::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_SyncHostileWidgetCount, CallFunc_Array_Length_ReturnValue_1) == 0x000030, "Member 'WBP_ModernHud_Compass_C_SyncHostileWidgetCount::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_SyncHostileWidgetCount, CallFunc_Array_Length_ReturnValue_2) == 0x000034, "Member 'WBP_ModernHud_Compass_C_SyncHostileWidgetCount::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_SyncHostileWidgetCount, CallFunc_Array_Length_ReturnValue_3) == 0x000038, "Member 'WBP_ModernHud_Compass_C_SyncHostileWidgetCount::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_SyncHostileWidgetCount, CallFunc_Less_IntInt_ReturnValue_1) == 0x00003C, "Member 'WBP_ModernHud_Compass_C_SyncHostileWidgetCount::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_SyncHostileWidgetCount, CallFunc_Array_Get_Item) == 0x000040, "Member 'WBP_ModernHud_Compass_C_SyncHostileWidgetCount::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_SyncHostileWidgetCount, CallFunc_Array_Length_ReturnValue_4) == 0x000048, "Member 'WBP_ModernHud_Compass_C_SyncHostileWidgetCount::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_SyncHostileWidgetCount, CallFunc_Array_Length_ReturnValue_5) == 0x00004C, "Member 'WBP_ModernHud_Compass_C_SyncHostileWidgetCount::CallFunc_Array_Length_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_SyncHostileWidgetCount, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000050, "Member 'WBP_ModernHud_Compass_C_SyncHostileWidgetCount::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_SyncHostileWidgetCount, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x000051, "Member 'WBP_ModernHud_Compass_C_SyncHostileWidgetCount::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_SyncHostileWidgetCount, CallFunc_Greater_IntInt_ReturnValue) == 0x000052, "Member 'WBP_ModernHud_Compass_C_SyncHostileWidgetCount::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_SyncHostileWidgetCount, Temp_int_Loop_Counter_Variable_1) == 0x000054, "Member 'WBP_ModernHud_Compass_C_SyncHostileWidgetCount::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_SyncHostileWidgetCount, CallFunc_Less_IntInt_ReturnValue_2) == 0x000058, "Member 'WBP_ModernHud_Compass_C_SyncHostileWidgetCount::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_SyncHostileWidgetCount, CallFunc_Add_IntInt_ReturnValue_1) == 0x00005C, "Member 'WBP_ModernHud_Compass_C_SyncHostileWidgetCount::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");

// Function WBP_ModernHud_Compass.WBP_ModernHud_Compass_C.SyncMarkerWidgetCount
// 0x00E0 (0x00E0 - 0x0000)
struct WBP_ModernHud_Compass_C_SyncMarkerWidgetCount final
{
public:
	struct FCompassIconMarker                     Local_MarkerElementData;                           // 0x0000(0x0040)(Edit, BlueprintVisible)
	int32                                         Local_DataLenght;                                  // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Local_MarkersLenght;                               // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_ModernHud_CompassIcon_C*           Local_MarkerElement;                               // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63[0x5];                                       // 0x0063(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ModernHud_CompassIcon_C*           CallFunc_CreateCompassMarker_NewMarker;            // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_ModernHud_CompassIcon_C*           CallFunc_Array_Get_Item;                           // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCompassIconMarker                     CallFunc_Array_Get_Item_1;                         // 0x0080(0x0040)()
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C6[0x2];                                       // 0x00C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_Compass_C_SyncMarkerWidgetCount) == 0x000008, "Wrong alignment on WBP_ModernHud_Compass_C_SyncMarkerWidgetCount");
static_assert(sizeof(WBP_ModernHud_Compass_C_SyncMarkerWidgetCount) == 0x0000E0, "Wrong size on WBP_ModernHud_Compass_C_SyncMarkerWidgetCount");
static_assert(offsetof(WBP_ModernHud_Compass_C_SyncMarkerWidgetCount, Local_MarkerElementData) == 0x000000, "Member 'WBP_ModernHud_Compass_C_SyncMarkerWidgetCount::Local_MarkerElementData' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_SyncMarkerWidgetCount, Local_DataLenght) == 0x000040, "Member 'WBP_ModernHud_Compass_C_SyncMarkerWidgetCount::Local_DataLenght' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_SyncMarkerWidgetCount, Local_MarkersLenght) == 0x000044, "Member 'WBP_ModernHud_Compass_C_SyncMarkerWidgetCount::Local_MarkersLenght' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_SyncMarkerWidgetCount, Local_MarkerElement) == 0x000048, "Member 'WBP_ModernHud_Compass_C_SyncMarkerWidgetCount::Local_MarkerElement' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_SyncMarkerWidgetCount, Temp_int_Loop_Counter_Variable) == 0x000050, "Member 'WBP_ModernHud_Compass_C_SyncMarkerWidgetCount::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_SyncMarkerWidgetCount, CallFunc_Add_IntInt_ReturnValue) == 0x000054, "Member 'WBP_ModernHud_Compass_C_SyncMarkerWidgetCount::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_SyncMarkerWidgetCount, Temp_int_Array_Index_Variable) == 0x000058, "Member 'WBP_ModernHud_Compass_C_SyncMarkerWidgetCount::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_SyncMarkerWidgetCount, Temp_int_Array_Index_Variable_1) == 0x00005C, "Member 'WBP_ModernHud_Compass_C_SyncMarkerWidgetCount::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_SyncMarkerWidgetCount, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000060, "Member 'WBP_ModernHud_Compass_C_SyncMarkerWidgetCount::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_SyncMarkerWidgetCount, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x000061, "Member 'WBP_ModernHud_Compass_C_SyncMarkerWidgetCount::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_SyncMarkerWidgetCount, CallFunc_Greater_IntInt_ReturnValue) == 0x000062, "Member 'WBP_ModernHud_Compass_C_SyncMarkerWidgetCount::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_SyncMarkerWidgetCount, CallFunc_CreateCompassMarker_NewMarker) == 0x000068, "Member 'WBP_ModernHud_Compass_C_SyncMarkerWidgetCount::CallFunc_CreateCompassMarker_NewMarker' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_SyncMarkerWidgetCount, CallFunc_Array_Get_Item) == 0x000070, "Member 'WBP_ModernHud_Compass_C_SyncMarkerWidgetCount::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_SyncMarkerWidgetCount, CallFunc_Array_Length_ReturnValue) == 0x000078, "Member 'WBP_ModernHud_Compass_C_SyncMarkerWidgetCount::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_SyncMarkerWidgetCount, Temp_int_Loop_Counter_Variable_1) == 0x00007C, "Member 'WBP_ModernHud_Compass_C_SyncMarkerWidgetCount::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_SyncMarkerWidgetCount, CallFunc_Array_Get_Item_1) == 0x000080, "Member 'WBP_ModernHud_Compass_C_SyncMarkerWidgetCount::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_SyncMarkerWidgetCount, CallFunc_Array_Length_ReturnValue_1) == 0x0000C0, "Member 'WBP_ModernHud_Compass_C_SyncMarkerWidgetCount::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_SyncMarkerWidgetCount, CallFunc_Less_IntInt_ReturnValue) == 0x0000C4, "Member 'WBP_ModernHud_Compass_C_SyncMarkerWidgetCount::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_SyncMarkerWidgetCount, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000C5, "Member 'WBP_ModernHud_Compass_C_SyncMarkerWidgetCount::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_SyncMarkerWidgetCount, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000C8, "Member 'WBP_ModernHud_Compass_C_SyncMarkerWidgetCount::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_SyncMarkerWidgetCount, CallFunc_Array_Length_ReturnValue_2) == 0x0000CC, "Member 'WBP_ModernHud_Compass_C_SyncMarkerWidgetCount::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_SyncMarkerWidgetCount, CallFunc_Array_Length_ReturnValue_3) == 0x0000D0, "Member 'WBP_ModernHud_Compass_C_SyncMarkerWidgetCount::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_SyncMarkerWidgetCount, CallFunc_Less_IntInt_ReturnValue_2) == 0x0000D4, "Member 'WBP_ModernHud_Compass_C_SyncMarkerWidgetCount::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_SyncMarkerWidgetCount, CallFunc_Array_Length_ReturnValue_4) == 0x0000D8, "Member 'WBP_ModernHud_Compass_C_SyncMarkerWidgetCount::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_SyncMarkerWidgetCount, CallFunc_Array_Length_ReturnValue_5) == 0x0000DC, "Member 'WBP_ModernHud_Compass_C_SyncMarkerWidgetCount::CallFunc_Array_Length_ReturnValue_5' has a wrong offset!");

// Function WBP_ModernHud_Compass.WBP_ModernHud_Compass_C.ThisIsForPluginCompliance
// 0x0001 (0x0001 - 0x0000)
struct WBP_ModernHud_Compass_C_ThisIsForPluginCompliance final
{
public:
	bool                                          Test;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_Compass_C_ThisIsForPluginCompliance) == 0x000001, "Wrong alignment on WBP_ModernHud_Compass_C_ThisIsForPluginCompliance");
static_assert(sizeof(WBP_ModernHud_Compass_C_ThisIsForPluginCompliance) == 0x000001, "Wrong size on WBP_ModernHud_Compass_C_ThisIsForPluginCompliance");
static_assert(offsetof(WBP_ModernHud_Compass_C_ThisIsForPluginCompliance, Test) == 0x000000, "Member 'WBP_ModernHud_Compass_C_ThisIsForPluginCompliance::Test' has a wrong offset!");

// Function WBP_ModernHud_Compass.WBP_ModernHud_Compass_C.UpdateClosestText
// 0x0058 (0x0058 - 0x0000)
struct WBP_ModernHud_Compass_C_UpdateClosestText final
{
public:
	double                                        Local_ArrayValue;                                  // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Local_LowestValue;                                 // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ModernHud_CompassIcon_C*           CallFunc_Map_Find_Value;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<double>                                CallFunc_Map_Keys_Keys;                            // 0x0030(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_Compass_C_UpdateClosestText) == 0x000008, "Wrong alignment on WBP_ModernHud_Compass_C_UpdateClosestText");
static_assert(sizeof(WBP_ModernHud_Compass_C_UpdateClosestText) == 0x000058, "Wrong size on WBP_ModernHud_Compass_C_UpdateClosestText");
static_assert(offsetof(WBP_ModernHud_Compass_C_UpdateClosestText, Local_ArrayValue) == 0x000000, "Member 'WBP_ModernHud_Compass_C_UpdateClosestText::Local_ArrayValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_UpdateClosestText, Local_LowestValue) == 0x000008, "Member 'WBP_ModernHud_Compass_C_UpdateClosestText::Local_LowestValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_UpdateClosestText, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WBP_ModernHud_Compass_C_UpdateClosestText::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_UpdateClosestText, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'WBP_ModernHud_Compass_C_UpdateClosestText::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_UpdateClosestText, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WBP_ModernHud_Compass_C_UpdateClosestText::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_UpdateClosestText, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x00001C, "Member 'WBP_ModernHud_Compass_C_UpdateClosestText::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_UpdateClosestText, CallFunc_Map_Find_Value) == 0x000020, "Member 'WBP_ModernHud_Compass_C_UpdateClosestText::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_UpdateClosestText, CallFunc_Map_Find_ReturnValue) == 0x000028, "Member 'WBP_ModernHud_Compass_C_UpdateClosestText::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_UpdateClosestText, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000029, "Member 'WBP_ModernHud_Compass_C_UpdateClosestText::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_UpdateClosestText, CallFunc_BooleanAND_ReturnValue) == 0x00002A, "Member 'WBP_ModernHud_Compass_C_UpdateClosestText::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_UpdateClosestText, CallFunc_Map_Keys_Keys) == 0x000030, "Member 'WBP_ModernHud_Compass_C_UpdateClosestText::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_UpdateClosestText, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'WBP_ModernHud_Compass_C_UpdateClosestText::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_UpdateClosestText, CallFunc_Array_Get_Item) == 0x000048, "Member 'WBP_ModernHud_Compass_C_UpdateClosestText::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_UpdateClosestText, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'WBP_ModernHud_Compass_C_UpdateClosestText::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_ModernHud_Compass.WBP_ModernHud_Compass_C.UpdateCompassFacePosition
// 0x0058 (0x0058 - 0x0000)
struct WBP_ModernHud_Compass_C_UpdateCompassFacePosition final
{
public:
	struct FCompassIconMarker                     Local_Helper;                                      // 0x0000(0x0040)(Edit, BlueprintVisible)
	double                                        CompassNewPosition;                                // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ComputeRelativeMarkerXPosition_ReturnValue; // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ComputeRelativeMarkerXPosition_Heading_ImplicitCast; // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SetCompassFacePosition_CompassNewPosition_ImplicitCast; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_Compass_C_UpdateCompassFacePosition) == 0x000008, "Wrong alignment on WBP_ModernHud_Compass_C_UpdateCompassFacePosition");
static_assert(sizeof(WBP_ModernHud_Compass_C_UpdateCompassFacePosition) == 0x000058, "Wrong size on WBP_ModernHud_Compass_C_UpdateCompassFacePosition");
static_assert(offsetof(WBP_ModernHud_Compass_C_UpdateCompassFacePosition, Local_Helper) == 0x000000, "Member 'WBP_ModernHud_Compass_C_UpdateCompassFacePosition::Local_Helper' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_UpdateCompassFacePosition, CompassNewPosition) == 0x000040, "Member 'WBP_ModernHud_Compass_C_UpdateCompassFacePosition::CompassNewPosition' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_UpdateCompassFacePosition, CallFunc_ComputeRelativeMarkerXPosition_ReturnValue) == 0x000048, "Member 'WBP_ModernHud_Compass_C_UpdateCompassFacePosition::CallFunc_ComputeRelativeMarkerXPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_UpdateCompassFacePosition, CallFunc_ComputeRelativeMarkerXPosition_Heading_ImplicitCast) == 0x00004C, "Member 'WBP_ModernHud_Compass_C_UpdateCompassFacePosition::CallFunc_ComputeRelativeMarkerXPosition_Heading_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_UpdateCompassFacePosition, CallFunc_SetCompassFacePosition_CompassNewPosition_ImplicitCast) == 0x000050, "Member 'WBP_ModernHud_Compass_C_UpdateCompassFacePosition::CallFunc_SetCompassFacePosition_CompassNewPosition_ImplicitCast' has a wrong offset!");

// Function WBP_ModernHud_Compass.WBP_ModernHud_Compass_C.UpdateCompassHostileMarkers
// 0x0078 (0x0078 - 0x0000)
struct WBP_ModernHud_Compass_C_UpdateCompassHostileMarkers final
{
public:
	class UWBP_ModernHud_CompassIcon_C*           Local_HostileIcon;                                 // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FHostileData                           Local_HostileData;                                 // 0x0008(0x0008)(Edit, BlueprintVisible, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCompassIconMarker                     K2Node_MakeStruct_CompassIconMarker;               // 0x0018(0x0040)()
	class UWBP_ModernHud_CompassIcon_C*           CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FHostileData                           CallFunc_Array_Get_Item_1;                         // 0x0060(0x0008)(NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_Compass_C_UpdateCompassHostileMarkers) == 0x000008, "Wrong alignment on WBP_ModernHud_Compass_C_UpdateCompassHostileMarkers");
static_assert(sizeof(WBP_ModernHud_Compass_C_UpdateCompassHostileMarkers) == 0x000078, "Wrong size on WBP_ModernHud_Compass_C_UpdateCompassHostileMarkers");
static_assert(offsetof(WBP_ModernHud_Compass_C_UpdateCompassHostileMarkers, Local_HostileIcon) == 0x000000, "Member 'WBP_ModernHud_Compass_C_UpdateCompassHostileMarkers::Local_HostileIcon' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_UpdateCompassHostileMarkers, Local_HostileData) == 0x000008, "Member 'WBP_ModernHud_Compass_C_UpdateCompassHostileMarkers::Local_HostileData' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_UpdateCompassHostileMarkers, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WBP_ModernHud_Compass_C_UpdateCompassHostileMarkers::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_UpdateCompassHostileMarkers, K2Node_MakeStruct_CompassIconMarker) == 0x000018, "Member 'WBP_ModernHud_Compass_C_UpdateCompassHostileMarkers::K2Node_MakeStruct_CompassIconMarker' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_UpdateCompassHostileMarkers, CallFunc_Array_Get_Item) == 0x000058, "Member 'WBP_ModernHud_Compass_C_UpdateCompassHostileMarkers::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_UpdateCompassHostileMarkers, CallFunc_Array_Get_Item_1) == 0x000060, "Member 'WBP_ModernHud_Compass_C_UpdateCompassHostileMarkers::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_UpdateCompassHostileMarkers, CallFunc_Array_Length_ReturnValue) == 0x000068, "Member 'WBP_ModernHud_Compass_C_UpdateCompassHostileMarkers::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_UpdateCompassHostileMarkers, Temp_int_Loop_Counter_Variable) == 0x00006C, "Member 'WBP_ModernHud_Compass_C_UpdateCompassHostileMarkers::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_UpdateCompassHostileMarkers, CallFunc_Less_IntInt_ReturnValue) == 0x000070, "Member 'WBP_ModernHud_Compass_C_UpdateCompassHostileMarkers::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_UpdateCompassHostileMarkers, CallFunc_Add_IntInt_ReturnValue) == 0x000074, "Member 'WBP_ModernHud_Compass_C_UpdateCompassHostileMarkers::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_ModernHud_Compass.WBP_ModernHud_Compass_C.UpdateCompassHostilePosition
// 0x0078 (0x0078 - 0x0000)
struct WBP_ModernHud_Compass_C_UpdateCompassHostilePosition final
{
public:
	struct FCompassIconMarker                     MarkerData;                                        // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UWBP_ModernHud_CompassIcon_C*           MarkerIcon;                                        // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPositionClampedInWindow;                         // 0x0048(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        LocalHostileMarkerXPosition;                       // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_Compass_C_UpdateCompassHostilePosition) == 0x000008, "Wrong alignment on WBP_ModernHud_Compass_C_UpdateCompassHostilePosition");
static_assert(sizeof(WBP_ModernHud_Compass_C_UpdateCompassHostilePosition) == 0x000078, "Wrong size on WBP_ModernHud_Compass_C_UpdateCompassHostilePosition");
static_assert(offsetof(WBP_ModernHud_Compass_C_UpdateCompassHostilePosition, MarkerData) == 0x000000, "Member 'WBP_ModernHud_Compass_C_UpdateCompassHostilePosition::MarkerData' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_UpdateCompassHostilePosition, MarkerIcon) == 0x000040, "Member 'WBP_ModernHud_Compass_C_UpdateCompassHostilePosition::MarkerIcon' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_UpdateCompassHostilePosition, IsPositionClampedInWindow) == 0x000048, "Member 'WBP_ModernHud_Compass_C_UpdateCompassHostilePosition::IsPositionClampedInWindow' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_UpdateCompassHostilePosition, LocalHostileMarkerXPosition) == 0x000050, "Member 'WBP_ModernHud_Compass_C_UpdateCompassHostilePosition::LocalHostileMarkerXPosition' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Compass_C_UpdateCompassHostilePosition, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000058, "Member 'WBP_ModernHud_Compass_C_UpdateCompassHostilePosition::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
