#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_OriginalMenu_InventoryItemDetailsSubTabsButton

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_OriginalMenu_InventoryItemDetailsSubTabsButton.WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C.ExecuteUbergraph_WBP_OriginalMenu_InventoryItemDetailsSubTabsButton
// 0x0008 (0x0008 - 0x0000)
struct WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryItemDetailsSubTabsButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryItemDetailsSubTabsButton) == 0x000004, "Wrong alignment on WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryItemDetailsSubTabsButton");
static_assert(sizeof(WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryItemDetailsSubTabsButton) == 0x000008, "Wrong size on WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryItemDetailsSubTabsButton");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryItemDetailsSubTabsButton, EntryPoint) == 0x000000, "Member 'WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryItemDetailsSubTabsButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryItemDetailsSubTabsButton, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryItemDetailsSubTabsButton::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WBP_OriginalMenu_InventoryItemDetailsSubTabsButton.WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C.PlayPopOutAnimation
// 0x0038 (0x0038 - 0x0000)
struct WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C_PlayPopOutAnimation final
{
public:
	bool                                          Forward;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Instant;                                           // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Local_StartAtTime;                                 // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_1;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          K2Node_Select_Default;                             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimation_PlaybackSpeed_ImplicitCast; // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimation_StartAtTime_ImplicitCast;   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C_PlayPopOutAnimation) == 0x000008, "Wrong alignment on WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C_PlayPopOutAnimation");
static_assert(sizeof(WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C_PlayPopOutAnimation) == 0x000038, "Wrong size on WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C_PlayPopOutAnimation");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C_PlayPopOutAnimation, Forward) == 0x000000, "Member 'WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C_PlayPopOutAnimation::Forward' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C_PlayPopOutAnimation, Instant) == 0x000001, "Member 'WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C_PlayPopOutAnimation::Instant' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C_PlayPopOutAnimation, Local_StartAtTime) == 0x000008, "Member 'WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C_PlayPopOutAnimation::Local_StartAtTime' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C_PlayPopOutAnimation, Temp_bool_Variable) == 0x000010, "Member 'WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C_PlayPopOutAnimation::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C_PlayPopOutAnimation, Temp_byte_Variable) == 0x000011, "Member 'WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C_PlayPopOutAnimation::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C_PlayPopOutAnimation, Temp_byte_Variable_1) == 0x000012, "Member 'WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C_PlayPopOutAnimation::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C_PlayPopOutAnimation, CallFunc_SelectFloat_ReturnValue) == 0x000018, "Member 'WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C_PlayPopOutAnimation::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C_PlayPopOutAnimation, K2Node_Select_Default) == 0x000020, "Member 'WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C_PlayPopOutAnimation::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C_PlayPopOutAnimation, CallFunc_PlayAnimation_ReturnValue) == 0x000028, "Member 'WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C_PlayPopOutAnimation::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C_PlayPopOutAnimation, CallFunc_PlayAnimation_PlaybackSpeed_ImplicitCast) == 0x000030, "Member 'WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C_PlayPopOutAnimation::CallFunc_PlayAnimation_PlaybackSpeed_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C_PlayPopOutAnimation, CallFunc_PlayAnimation_StartAtTime_ImplicitCast) == 0x000034, "Member 'WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C_PlayPopOutAnimation::CallFunc_PlayAnimation_StartAtTime_ImplicitCast' has a wrong offset!");

// Function WBP_OriginalMenu_InventoryItemDetailsSubTabsButton.WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C_PreConstruct");
static_assert(sizeof(WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C_PreConstruct) == 0x000001, "Wrong size on WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C_PreConstruct");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_OriginalMenu_InventoryItemDetailsSubTabsButton.WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C.SetIsActive
// 0x0030 (0x0030 - 0x0000)
struct WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C_SetIsActive final
{
public:
	bool                                          IsActive;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsOnConstruct;                                     // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       K2Node_Select_Default_1;                           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C_SetIsActive) == 0x000008, "Wrong alignment on WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C_SetIsActive");
static_assert(sizeof(WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C_SetIsActive) == 0x000030, "Wrong size on WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C_SetIsActive");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C_SetIsActive, IsActive) == 0x000000, "Member 'WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C_SetIsActive::IsActive' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C_SetIsActive, IsOnConstruct) == 0x000001, "Member 'WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C_SetIsActive::IsOnConstruct' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C_SetIsActive, Temp_real_Variable) == 0x000004, "Member 'WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C_SetIsActive::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C_SetIsActive, Temp_real_Variable_1) == 0x000008, "Member 'WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C_SetIsActive::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C_SetIsActive, Temp_bool_Variable) == 0x00000C, "Member 'WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C_SetIsActive::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C_SetIsActive, Temp_bool_Variable_1) == 0x00000D, "Member 'WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C_SetIsActive::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C_SetIsActive, Temp_byte_Variable) == 0x00000E, "Member 'WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C_SetIsActive::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C_SetIsActive, Temp_byte_Variable_1) == 0x00000F, "Member 'WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C_SetIsActive::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C_SetIsActive, Temp_bool_Variable_2) == 0x000010, "Member 'WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C_SetIsActive::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C_SetIsActive, K2Node_Select_Default) == 0x000014, "Member 'WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C_SetIsActive::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C_SetIsActive, K2Node_Select_Default_1) == 0x000018, "Member 'WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C_SetIsActive::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C_SetIsActive, CallFunc_PlayAnimation_ReturnValue) == 0x000020, "Member 'WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C_SetIsActive::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C_SetIsActive, K2Node_Select_Default_2) == 0x000028, "Member 'WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C_SetIsActive::K2Node_Select_Default_2' has a wrong offset!");

}

