#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_OriginalMenu_InventoryMainContent

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_OriginalMenu_InventoryMainContent.WBP_OriginalMenu_InventoryMainContent_C.UpdateDescription
// 0x0020 (0x0020 - 0x0000)
struct WBP_OriginalMenu_InventoryMainContent_C_UpdateDescription final
{
public:
	class FText                                   NewDescription;                                    // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          IsBackgroundDisplayed;                             // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OriginalMenu_InventoryMainContent_C_UpdateDescription) == 0x000008, "Wrong alignment on WBP_OriginalMenu_InventoryMainContent_C_UpdateDescription");
static_assert(sizeof(WBP_OriginalMenu_InventoryMainContent_C_UpdateDescription) == 0x000020, "Wrong size on WBP_OriginalMenu_InventoryMainContent_C_UpdateDescription");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainContent_C_UpdateDescription, NewDescription) == 0x000000, "Member 'WBP_OriginalMenu_InventoryMainContent_C_UpdateDescription::NewDescription' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainContent_C_UpdateDescription, IsBackgroundDisplayed) == 0x000018, "Member 'WBP_OriginalMenu_InventoryMainContent_C_UpdateDescription::IsBackgroundDisplayed' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainContent_C_UpdateDescription, Temp_bool_Variable) == 0x000019, "Member 'WBP_OriginalMenu_InventoryMainContent_C_UpdateDescription::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainContent_C_UpdateDescription, Temp_byte_Variable) == 0x00001A, "Member 'WBP_OriginalMenu_InventoryMainContent_C_UpdateDescription::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainContent_C_UpdateDescription, Temp_byte_Variable_1) == 0x00001B, "Member 'WBP_OriginalMenu_InventoryMainContent_C_UpdateDescription::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainContent_C_UpdateDescription, K2Node_Select_Default) == 0x00001C, "Member 'WBP_OriginalMenu_InventoryMainContent_C_UpdateDescription::K2Node_Select_Default' has a wrong offset!");

}

