#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LegacyPrefab_FocusBox

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_LegacyPrefab_FocusBox.WBP_LegacyPrefab_FocusBox_C.DisplayFocusBox
// 0x0003 (0x0003 - 0x0000)
struct WBP_LegacyPrefab_FocusBox_C_DisplayFocusBox final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LegacyPrefab_FocusBox_C_DisplayFocusBox) == 0x000001, "Wrong alignment on WBP_LegacyPrefab_FocusBox_C_DisplayFocusBox");
static_assert(sizeof(WBP_LegacyPrefab_FocusBox_C_DisplayFocusBox) == 0x000003, "Wrong size on WBP_LegacyPrefab_FocusBox_C_DisplayFocusBox");
static_assert(offsetof(WBP_LegacyPrefab_FocusBox_C_DisplayFocusBox, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'WBP_LegacyPrefab_FocusBox_C_DisplayFocusBox::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LegacyPrefab_FocusBox_C_DisplayFocusBox, CallFunc_GetVisibility_ReturnValue) == 0x000001, "Member 'WBP_LegacyPrefab_FocusBox_C_DisplayFocusBox::CallFunc_GetVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LegacyPrefab_FocusBox_C_DisplayFocusBox, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000002, "Member 'WBP_LegacyPrefab_FocusBox_C_DisplayFocusBox::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function WBP_LegacyPrefab_FocusBox.WBP_LegacyPrefab_FocusBox_C.HideFocusBox
// 0x0003 (0x0003 - 0x0000)
struct WBP_LegacyPrefab_FocusBox_C_HideFocusBox final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LegacyPrefab_FocusBox_C_HideFocusBox) == 0x000001, "Wrong alignment on WBP_LegacyPrefab_FocusBox_C_HideFocusBox");
static_assert(sizeof(WBP_LegacyPrefab_FocusBox_C_HideFocusBox) == 0x000003, "Wrong size on WBP_LegacyPrefab_FocusBox_C_HideFocusBox");
static_assert(offsetof(WBP_LegacyPrefab_FocusBox_C_HideFocusBox, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'WBP_LegacyPrefab_FocusBox_C_HideFocusBox::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LegacyPrefab_FocusBox_C_HideFocusBox, CallFunc_GetVisibility_ReturnValue) == 0x000001, "Member 'WBP_LegacyPrefab_FocusBox_C_HideFocusBox::CallFunc_GetVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LegacyPrefab_FocusBox_C_HideFocusBox, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000002, "Member 'WBP_LegacyPrefab_FocusBox_C_HideFocusBox::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");

}

