#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_VideoMenu_ValueSwitcher

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Altar_structs.hpp"


namespace SDK::Params
{

// Function WBP_VideoMenu_ValueSwitcher.WBP_VideoMenu_ValueSwitcher_C.BndEvt__WBP_VideoMenu_ValueSwitcher_RowOption_K2Node_ComponentBoundEvent_0_OnValueUpdated__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_VideoMenu_ValueSwitcher_C_BndEvt__WBP_VideoMenu_ValueSwitcher_RowOption_K2Node_ComponentBoundEvent_0_OnValueUpdated__DelegateSignature final
{
public:
	class FText                                   Value;                                             // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         Index_0;                                           // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VideoMenu_ValueSwitcher_C_BndEvt__WBP_VideoMenu_ValueSwitcher_RowOption_K2Node_ComponentBoundEvent_0_OnValueUpdated__DelegateSignature) == 0x000008, "Wrong alignment on WBP_VideoMenu_ValueSwitcher_C_BndEvt__WBP_VideoMenu_ValueSwitcher_RowOption_K2Node_ComponentBoundEvent_0_OnValueUpdated__DelegateSignature");
static_assert(sizeof(WBP_VideoMenu_ValueSwitcher_C_BndEvt__WBP_VideoMenu_ValueSwitcher_RowOption_K2Node_ComponentBoundEvent_0_OnValueUpdated__DelegateSignature) == 0x000020, "Wrong size on WBP_VideoMenu_ValueSwitcher_C_BndEvt__WBP_VideoMenu_ValueSwitcher_RowOption_K2Node_ComponentBoundEvent_0_OnValueUpdated__DelegateSignature");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_BndEvt__WBP_VideoMenu_ValueSwitcher_RowOption_K2Node_ComponentBoundEvent_0_OnValueUpdated__DelegateSignature, Value) == 0x000000, "Member 'WBP_VideoMenu_ValueSwitcher_C_BndEvt__WBP_VideoMenu_ValueSwitcher_RowOption_K2Node_ComponentBoundEvent_0_OnValueUpdated__DelegateSignature::Value' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_BndEvt__WBP_VideoMenu_ValueSwitcher_RowOption_K2Node_ComponentBoundEvent_0_OnValueUpdated__DelegateSignature, Index_0) == 0x000018, "Member 'WBP_VideoMenu_ValueSwitcher_C_BndEvt__WBP_VideoMenu_ValueSwitcher_RowOption_K2Node_ComponentBoundEvent_0_OnValueUpdated__DelegateSignature::Index_0' has a wrong offset!");

// Function WBP_VideoMenu_ValueSwitcher.WBP_VideoMenu_ValueSwitcher_C.ExecuteUbergraph_WBP_VideoMenu_ValueSwitcher
// 0x0040 (0x0040 - 0x0000)
struct WBP_VideoMenu_ValueSwitcher_C_ExecuteUbergraph_WBP_VideoMenu_ValueSwitcher final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Value;                  // 0x0008(0x0018)()
	int32                                         K2Node_ComponentBoundEvent_Index;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVUINavigationGlobalSubsystem*          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IVEnhancedInputNavigable> CallFunc_NavigateToWidget_Widget_CastInput;     // 0x0030(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VideoMenu_ValueSwitcher_C_ExecuteUbergraph_WBP_VideoMenu_ValueSwitcher) == 0x000008, "Wrong alignment on WBP_VideoMenu_ValueSwitcher_C_ExecuteUbergraph_WBP_VideoMenu_ValueSwitcher");
static_assert(sizeof(WBP_VideoMenu_ValueSwitcher_C_ExecuteUbergraph_WBP_VideoMenu_ValueSwitcher) == 0x000040, "Wrong size on WBP_VideoMenu_ValueSwitcher_C_ExecuteUbergraph_WBP_VideoMenu_ValueSwitcher");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_ExecuteUbergraph_WBP_VideoMenu_ValueSwitcher, EntryPoint) == 0x000000, "Member 'WBP_VideoMenu_ValueSwitcher_C_ExecuteUbergraph_WBP_VideoMenu_ValueSwitcher::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_ExecuteUbergraph_WBP_VideoMenu_ValueSwitcher, K2Node_ComponentBoundEvent_Value) == 0x000008, "Member 'WBP_VideoMenu_ValueSwitcher_C_ExecuteUbergraph_WBP_VideoMenu_ValueSwitcher::K2Node_ComponentBoundEvent_Value' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_ExecuteUbergraph_WBP_VideoMenu_ValueSwitcher, K2Node_ComponentBoundEvent_Index) == 0x000020, "Member 'WBP_VideoMenu_ValueSwitcher_C_ExecuteUbergraph_WBP_VideoMenu_ValueSwitcher::K2Node_ComponentBoundEvent_Index' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_ExecuteUbergraph_WBP_VideoMenu_ValueSwitcher, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000028, "Member 'WBP_VideoMenu_ValueSwitcher_C_ExecuteUbergraph_WBP_VideoMenu_ValueSwitcher::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_ExecuteUbergraph_WBP_VideoMenu_ValueSwitcher, CallFunc_NavigateToWidget_Widget_CastInput) == 0x000030, "Member 'WBP_VideoMenu_ValueSwitcher_C_ExecuteUbergraph_WBP_VideoMenu_ValueSwitcher::CallFunc_NavigateToWidget_Widget_CastInput' has a wrong offset!");

// Function WBP_VideoMenu_ValueSwitcher.WBP_VideoMenu_ValueSwitcher_C.Prepare Screen Mode CMD
// 0x01F0 (0x01F0 - 0x0000)
struct WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD final
{
public:
	class FString                                 OptionLabel;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 NewCMD;                                            // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	struct FIntPoint                              Local_CurrentScreenResolution;                     // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetEnumeratorValueFromIndex_ReturnValue;  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x2];                                       // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetLabel_ReturnValue;                     // 0x0058(0x0018)(ConstParm)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0070(0x0018)()
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue;          // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_2;           // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_3;           // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_6;              // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_7;              // 0x0140(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_4;           // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_5;           // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_8;              // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_9;              // 0x0188(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_10;             // 0x0198(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_11;             // 0x01B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue_1;        // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue_2;        // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue_3;        // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E1[0x3];                                      // 0x01E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIntPoint                              CallFunc_GetScreenResolution_ReturnValue;          // 0x01E4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD) == 0x000008, "Wrong alignment on WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD");
static_assert(sizeof(WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD) == 0x0001F0, "Wrong size on WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD, OptionLabel) == 0x000000, "Member 'WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD::OptionLabel' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD, NewCMD) == 0x000010, "Member 'WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD::NewCMD' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD, Local_CurrentScreenResolution) == 0x000020, "Member 'WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD::Local_CurrentScreenResolution' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD, Temp_int_Variable) == 0x000028, "Member 'WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD, Temp_int_Variable_1) == 0x00002C, "Member 'WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD, CallFunc_Conv_IntToByte_ReturnValue) == 0x000030, "Member 'WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD, CallFunc_GetValidValue_ReturnValue) == 0x000038, "Member 'WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD, CallFunc_Conv_IntToByte_ReturnValue_1) == 0x000039, "Member 'WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD::CallFunc_Conv_IntToByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000040, "Member 'WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD, CallFunc_GetEnumeratorValueFromIndex_ReturnValue) == 0x000050, "Member 'WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD::CallFunc_GetEnumeratorValueFromIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD, K2Node_SwitchEnum_CmpSuccess) == 0x000051, "Member 'WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000054, "Member 'WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD, CallFunc_GetLabel_ReturnValue) == 0x000058, "Member 'WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD::CallFunc_GetLabel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD, CallFunc_Conv_StringToText_ReturnValue) == 0x000070, "Member 'WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD, CallFunc_EqualEqual_TextText_ReturnValue) == 0x000088, "Member 'WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD::CallFunc_EqualEqual_TextText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD, CallFunc_Conv_IntToString_ReturnValue) == 0x000090, "Member 'WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD, CallFunc_Conv_IntToString_ReturnValue_1) == 0x0000A0, "Member 'WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD, CallFunc_Concat_StrStr_ReturnValue) == 0x0000B0, "Member 'WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0000C0, "Member 'WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD, CallFunc_Conv_IntToString_ReturnValue_2) == 0x0000D0, "Member 'WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD::CallFunc_Conv_IntToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0000E0, "Member 'WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD, CallFunc_Conv_IntToString_ReturnValue_3) == 0x0000F0, "Member 'WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD::CallFunc_Conv_IntToString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000100, "Member 'WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD, CallFunc_Concat_StrStr_ReturnValue_4) == 0x000110, "Member 'WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD, CallFunc_Concat_StrStr_ReturnValue_5) == 0x000120, "Member 'WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD, CallFunc_Concat_StrStr_ReturnValue_6) == 0x000130, "Member 'WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD::CallFunc_Concat_StrStr_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD, CallFunc_Concat_StrStr_ReturnValue_7) == 0x000140, "Member 'WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD::CallFunc_Concat_StrStr_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD, CallFunc_Conv_IntToString_ReturnValue_4) == 0x000150, "Member 'WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD::CallFunc_Conv_IntToString_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD, CallFunc_Conv_IntToString_ReturnValue_5) == 0x000160, "Member 'WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD::CallFunc_Conv_IntToString_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD, CallFunc_Concat_StrStr_ReturnValue_8) == 0x000170, "Member 'WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD::CallFunc_Concat_StrStr_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000180, "Member 'WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD, CallFunc_Concat_StrStr_ReturnValue_9) == 0x000188, "Member 'WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD::CallFunc_Concat_StrStr_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD, CallFunc_Concat_StrStr_ReturnValue_10) == 0x000198, "Member 'WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD::CallFunc_Concat_StrStr_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD, CallFunc_GetGameUserSettings_ReturnValue) == 0x0001A8, "Member 'WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD, CallFunc_Concat_StrStr_ReturnValue_11) == 0x0001B0, "Member 'WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD::CallFunc_Concat_StrStr_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD, CallFunc_GetGameUserSettings_ReturnValue_1) == 0x0001C0, "Member 'WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD::CallFunc_GetGameUserSettings_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD, CallFunc_GetGameUserSettings_ReturnValue_2) == 0x0001C8, "Member 'WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD::CallFunc_GetGameUserSettings_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD, CallFunc_MakeLiteralInt_ReturnValue) == 0x0001D0, "Member 'WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD, CallFunc_GetGameUserSettings_ReturnValue_3) == 0x0001D8, "Member 'WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD::CallFunc_GetGameUserSettings_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD, CallFunc_Less_IntInt_ReturnValue) == 0x0001E0, "Member 'WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD, CallFunc_GetScreenResolution_ReturnValue) == 0x0001E4, "Member 'WBP_VideoMenu_ValueSwitcher_C_Prepare_Screen_Mode_CMD::CallFunc_GetScreenResolution_ReturnValue' has a wrong offset!");

// Function WBP_VideoMenu_ValueSwitcher.WBP_VideoMenu_ValueSwitcher_C.Prepare Supported Resolution Options
// 0x0100 (0x0100 - 0x0000)
struct WBP_VideoMenu_ValueSwitcher_C_Prepare_Supported_Resolution_Options final
{
public:
	TArray<struct FOriginalVideoOption>           OriginalVideoOptions;                              // 0x0000(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FIntPoint>                      CallFunc_GetSupportedFullscreenResolutions_Resolutions; // 0x0020(0x0010)(ReferenceParm)
	bool                                          CallFunc_GetSupportedFullscreenResolutions_ReturnValue; // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0088(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         K2Node_MakeArray_Array;                            // 0x00C0(0x0010)(ReferenceParm)
	struct FOriginalVideoOption                   K2Node_MakeStruct_OriginalVideoOption;             // 0x00D0(0x0028)()
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VideoMenu_ValueSwitcher_C_Prepare_Supported_Resolution_Options) == 0x000008, "Wrong alignment on WBP_VideoMenu_ValueSwitcher_C_Prepare_Supported_Resolution_Options");
static_assert(sizeof(WBP_VideoMenu_ValueSwitcher_C_Prepare_Supported_Resolution_Options) == 0x000100, "Wrong size on WBP_VideoMenu_ValueSwitcher_C_Prepare_Supported_Resolution_Options");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Prepare_Supported_Resolution_Options, OriginalVideoOptions) == 0x000000, "Member 'WBP_VideoMenu_ValueSwitcher_C_Prepare_Supported_Resolution_Options::OriginalVideoOptions' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Prepare_Supported_Resolution_Options, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WBP_VideoMenu_ValueSwitcher_C_Prepare_Supported_Resolution_Options::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Prepare_Supported_Resolution_Options, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'WBP_VideoMenu_ValueSwitcher_C_Prepare_Supported_Resolution_Options::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Prepare_Supported_Resolution_Options, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WBP_VideoMenu_ValueSwitcher_C_Prepare_Supported_Resolution_Options::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Prepare_Supported_Resolution_Options, CallFunc_GetSupportedFullscreenResolutions_Resolutions) == 0x000020, "Member 'WBP_VideoMenu_ValueSwitcher_C_Prepare_Supported_Resolution_Options::CallFunc_GetSupportedFullscreenResolutions_Resolutions' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Prepare_Supported_Resolution_Options, CallFunc_GetSupportedFullscreenResolutions_ReturnValue) == 0x000030, "Member 'WBP_VideoMenu_ValueSwitcher_C_Prepare_Supported_Resolution_Options::CallFunc_GetSupportedFullscreenResolutions_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Prepare_Supported_Resolution_Options, CallFunc_Array_Length_ReturnValue) == 0x000034, "Member 'WBP_VideoMenu_ValueSwitcher_C_Prepare_Supported_Resolution_Options::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Prepare_Supported_Resolution_Options, CallFunc_Array_Get_Item) == 0x000038, "Member 'WBP_VideoMenu_ValueSwitcher_C_Prepare_Supported_Resolution_Options::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Prepare_Supported_Resolution_Options, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'WBP_VideoMenu_ValueSwitcher_C_Prepare_Supported_Resolution_Options::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Prepare_Supported_Resolution_Options, CallFunc_Conv_IntToString_ReturnValue) == 0x000048, "Member 'WBP_VideoMenu_ValueSwitcher_C_Prepare_Supported_Resolution_Options::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Prepare_Supported_Resolution_Options, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000058, "Member 'WBP_VideoMenu_ValueSwitcher_C_Prepare_Supported_Resolution_Options::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Prepare_Supported_Resolution_Options, CallFunc_Concat_StrStr_ReturnValue) == 0x000068, "Member 'WBP_VideoMenu_ValueSwitcher_C_Prepare_Supported_Resolution_Options::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Prepare_Supported_Resolution_Options, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000078, "Member 'WBP_VideoMenu_ValueSwitcher_C_Prepare_Supported_Resolution_Options::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Prepare_Supported_Resolution_Options, CallFunc_Conv_StringToText_ReturnValue) == 0x000088, "Member 'WBP_VideoMenu_ValueSwitcher_C_Prepare_Supported_Resolution_Options::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Prepare_Supported_Resolution_Options, CallFunc_Conv_TextToString_ReturnValue) == 0x0000A0, "Member 'WBP_VideoMenu_ValueSwitcher_C_Prepare_Supported_Resolution_Options::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Prepare_Supported_Resolution_Options, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0000B0, "Member 'WBP_VideoMenu_ValueSwitcher_C_Prepare_Supported_Resolution_Options::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Prepare_Supported_Resolution_Options, K2Node_MakeArray_Array) == 0x0000C0, "Member 'WBP_VideoMenu_ValueSwitcher_C_Prepare_Supported_Resolution_Options::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Prepare_Supported_Resolution_Options, K2Node_MakeStruct_OriginalVideoOption) == 0x0000D0, "Member 'WBP_VideoMenu_ValueSwitcher_C_Prepare_Supported_Resolution_Options::K2Node_MakeStruct_OriginalVideoOption' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Prepare_Supported_Resolution_Options, CallFunc_Array_Add_ReturnValue) == 0x0000F8, "Member 'WBP_VideoMenu_ValueSwitcher_C_Prepare_Supported_Resolution_Options::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function WBP_VideoMenu_ValueSwitcher.WBP_VideoMenu_ValueSwitcher_C.Refresh
// 0x00B8 (0x00B8 - 0x0000)
struct WBP_VideoMenu_ValueSwitcher_C_Refresh final
{
public:
	TArray<class FText>                           Local_OptionsTextArray;                            // 0x0000(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetLabel_ReturnValue;                     // 0x0020(0x0018)(ConstParm)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0038(0x0018)()
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue;          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetLabel_ReturnValue_1;                   // 0x0058(0x0018)(ConstParm)
	TArray<struct FOriginalVideoOption>           CallFunc_GetOptions_ReturnValue;                   // 0x0070(0x0010)(ConstParm, ReferenceParm)
	struct FOriginalVideoOption                   CallFunc_Array_Get_Item;                           // 0x0080(0x0028)()
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VideoMenu_ValueSwitcher_C_Refresh) == 0x000008, "Wrong alignment on WBP_VideoMenu_ValueSwitcher_C_Refresh");
static_assert(sizeof(WBP_VideoMenu_ValueSwitcher_C_Refresh) == 0x0000B8, "Wrong size on WBP_VideoMenu_ValueSwitcher_C_Refresh");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Refresh, Local_OptionsTextArray) == 0x000000, "Member 'WBP_VideoMenu_ValueSwitcher_C_Refresh::Local_OptionsTextArray' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Refresh, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WBP_VideoMenu_ValueSwitcher_C_Refresh::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Refresh, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'WBP_VideoMenu_ValueSwitcher_C_Refresh::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Refresh, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WBP_VideoMenu_ValueSwitcher_C_Refresh::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Refresh, CallFunc_GetLabel_ReturnValue) == 0x000020, "Member 'WBP_VideoMenu_ValueSwitcher_C_Refresh::CallFunc_GetLabel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Refresh, CallFunc_Conv_StringToText_ReturnValue) == 0x000038, "Member 'WBP_VideoMenu_ValueSwitcher_C_Refresh::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Refresh, CallFunc_EqualEqual_TextText_ReturnValue) == 0x000050, "Member 'WBP_VideoMenu_ValueSwitcher_C_Refresh::CallFunc_EqualEqual_TextText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Refresh, CallFunc_Array_Length_ReturnValue) == 0x000054, "Member 'WBP_VideoMenu_ValueSwitcher_C_Refresh::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Refresh, CallFunc_GetLabel_ReturnValue_1) == 0x000058, "Member 'WBP_VideoMenu_ValueSwitcher_C_Refresh::CallFunc_GetLabel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Refresh, CallFunc_GetOptions_ReturnValue) == 0x000070, "Member 'WBP_VideoMenu_ValueSwitcher_C_Refresh::CallFunc_GetOptions_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Refresh, CallFunc_Array_Get_Item) == 0x000080, "Member 'WBP_VideoMenu_ValueSwitcher_C_Refresh::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Refresh, CallFunc_Array_Length_ReturnValue_1) == 0x0000A8, "Member 'WBP_VideoMenu_ValueSwitcher_C_Refresh::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Refresh, CallFunc_Less_IntInt_ReturnValue) == 0x0000AC, "Member 'WBP_VideoMenu_ValueSwitcher_C_Refresh::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Refresh, CallFunc_Array_Add_ReturnValue) == 0x0000B0, "Member 'WBP_VideoMenu_ValueSwitcher_C_Refresh::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function WBP_VideoMenu_ValueSwitcher.WBP_VideoMenu_ValueSwitcher_C.Update Resolution in Game User Settings
// 0x0050 (0x0050 - 0x0000)
struct WBP_VideoMenu_ValueSwitcher_C_Update_Resolution_in_Game_User_Settings final
{
public:
	class FString                                 Option_Label;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_LeftS;                              // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_RightS;                             // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Split_ReturnValue;                        // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_StringToInt_ReturnValue;             // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_StringToInt_ReturnValue_1;           // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              K2Node_MakeStruct_IntPoint;                        // 0x0044(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VideoMenu_ValueSwitcher_C_Update_Resolution_in_Game_User_Settings) == 0x000008, "Wrong alignment on WBP_VideoMenu_ValueSwitcher_C_Update_Resolution_in_Game_User_Settings");
static_assert(sizeof(WBP_VideoMenu_ValueSwitcher_C_Update_Resolution_in_Game_User_Settings) == 0x000050, "Wrong size on WBP_VideoMenu_ValueSwitcher_C_Update_Resolution_in_Game_User_Settings");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Update_Resolution_in_Game_User_Settings, Option_Label) == 0x000000, "Member 'WBP_VideoMenu_ValueSwitcher_C_Update_Resolution_in_Game_User_Settings::Option_Label' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Update_Resolution_in_Game_User_Settings, CallFunc_GetGameUserSettings_ReturnValue) == 0x000010, "Member 'WBP_VideoMenu_ValueSwitcher_C_Update_Resolution_in_Game_User_Settings::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Update_Resolution_in_Game_User_Settings, CallFunc_Split_LeftS) == 0x000018, "Member 'WBP_VideoMenu_ValueSwitcher_C_Update_Resolution_in_Game_User_Settings::CallFunc_Split_LeftS' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Update_Resolution_in_Game_User_Settings, CallFunc_Split_RightS) == 0x000028, "Member 'WBP_VideoMenu_ValueSwitcher_C_Update_Resolution_in_Game_User_Settings::CallFunc_Split_RightS' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Update_Resolution_in_Game_User_Settings, CallFunc_Split_ReturnValue) == 0x000038, "Member 'WBP_VideoMenu_ValueSwitcher_C_Update_Resolution_in_Game_User_Settings::CallFunc_Split_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Update_Resolution_in_Game_User_Settings, CallFunc_Conv_StringToInt_ReturnValue) == 0x00003C, "Member 'WBP_VideoMenu_ValueSwitcher_C_Update_Resolution_in_Game_User_Settings::CallFunc_Conv_StringToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Update_Resolution_in_Game_User_Settings, CallFunc_Conv_StringToInt_ReturnValue_1) == 0x000040, "Member 'WBP_VideoMenu_ValueSwitcher_C_Update_Resolution_in_Game_User_Settings::CallFunc_Conv_StringToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Update_Resolution_in_Game_User_Settings, K2Node_MakeStruct_IntPoint) == 0x000044, "Member 'WBP_VideoMenu_ValueSwitcher_C_Update_Resolution_in_Game_User_Settings::K2Node_MakeStruct_IntPoint' has a wrong offset!");

// Function WBP_VideoMenu_ValueSwitcher.WBP_VideoMenu_ValueSwitcher_C.Update Selected Resolution
// 0x00A8 (0x00A8 - 0x0000)
struct WBP_VideoMenu_ValueSwitcher_C_Update_Selected_Resolution final
{
public:
	TArray<class FText>                           OptionsText;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Array_Get_Item;                           // 0x0020(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              CallFunc_GetScreenResolution_ReturnValue;          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VideoMenu_ValueSwitcher_C_Update_Selected_Resolution) == 0x000008, "Wrong alignment on WBP_VideoMenu_ValueSwitcher_C_Update_Selected_Resolution");
static_assert(sizeof(WBP_VideoMenu_ValueSwitcher_C_Update_Selected_Resolution) == 0x0000A8, "Wrong size on WBP_VideoMenu_ValueSwitcher_C_Update_Selected_Resolution");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Update_Selected_Resolution, OptionsText) == 0x000000, "Member 'WBP_VideoMenu_ValueSwitcher_C_Update_Selected_Resolution::OptionsText' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Update_Selected_Resolution, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'WBP_VideoMenu_ValueSwitcher_C_Update_Selected_Resolution::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Update_Selected_Resolution, Temp_int_Array_Index_Variable) == 0x000014, "Member 'WBP_VideoMenu_ValueSwitcher_C_Update_Selected_Resolution::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Update_Selected_Resolution, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'WBP_VideoMenu_ValueSwitcher_C_Update_Selected_Resolution::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Update_Selected_Resolution, CallFunc_Array_Get_Item) == 0x000020, "Member 'WBP_VideoMenu_ValueSwitcher_C_Update_Selected_Resolution::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Update_Selected_Resolution, CallFunc_Conv_TextToString_ReturnValue) == 0x000038, "Member 'WBP_VideoMenu_ValueSwitcher_C_Update_Selected_Resolution::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Update_Selected_Resolution, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'WBP_VideoMenu_ValueSwitcher_C_Update_Selected_Resolution::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Update_Selected_Resolution, CallFunc_Add_IntInt_ReturnValue) == 0x00004C, "Member 'WBP_VideoMenu_ValueSwitcher_C_Update_Selected_Resolution::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Update_Selected_Resolution, CallFunc_GetGameUserSettings_ReturnValue) == 0x000050, "Member 'WBP_VideoMenu_ValueSwitcher_C_Update_Selected_Resolution::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Update_Selected_Resolution, CallFunc_GetScreenResolution_ReturnValue) == 0x000058, "Member 'WBP_VideoMenu_ValueSwitcher_C_Update_Selected_Resolution::CallFunc_GetScreenResolution_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Update_Selected_Resolution, CallFunc_Conv_IntToString_ReturnValue) == 0x000060, "Member 'WBP_VideoMenu_ValueSwitcher_C_Update_Selected_Resolution::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Update_Selected_Resolution, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000070, "Member 'WBP_VideoMenu_ValueSwitcher_C_Update_Selected_Resolution::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Update_Selected_Resolution, CallFunc_Concat_StrStr_ReturnValue) == 0x000080, "Member 'WBP_VideoMenu_ValueSwitcher_C_Update_Selected_Resolution::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Update_Selected_Resolution, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000090, "Member 'WBP_VideoMenu_ValueSwitcher_C_Update_Selected_Resolution::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_Update_Selected_Resolution, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x0000A0, "Member 'WBP_VideoMenu_ValueSwitcher_C_Update_Selected_Resolution::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");

// Function WBP_VideoMenu_ValueSwitcher.WBP_VideoMenu_ValueSwitcher_C.UpdateValue
// 0x0140 (0x0140 - 0x0000)
struct WBP_VideoMenu_ValueSwitcher_C_UpdateValue final
{
public:
	class FText                                   Value;                                             // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FString                                 Local_CMD;                                         // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetLabel_ReturnValue;                     // 0x0048(0x0018)(ConstParm)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0070(0x0018)()
	class FString                                 CallFunc_Prepare_Screen_Mode_CMD_NewCMD;           // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue;          // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetLabel_ReturnValue_1;                   // 0x00A0(0x0018)(ConstParm)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x00B8(0x0018)()
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue_1;        // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FOriginalVideoOption>           CallFunc_GetOptions_ReturnValue;                   // 0x00E0(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOriginalVideoOption                   CallFunc_Array_Get_Item;                           // 0x00F8(0x0028)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item_1;                         // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue_2;        // 0x013D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VideoMenu_ValueSwitcher_C_UpdateValue) == 0x000008, "Wrong alignment on WBP_VideoMenu_ValueSwitcher_C_UpdateValue");
static_assert(sizeof(WBP_VideoMenu_ValueSwitcher_C_UpdateValue) == 0x000140, "Wrong size on WBP_VideoMenu_ValueSwitcher_C_UpdateValue");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_UpdateValue, Value) == 0x000000, "Member 'WBP_VideoMenu_ValueSwitcher_C_UpdateValue::Value' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_UpdateValue, Local_CMD) == 0x000018, "Member 'WBP_VideoMenu_ValueSwitcher_C_UpdateValue::Local_CMD' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_UpdateValue, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'WBP_VideoMenu_ValueSwitcher_C_UpdateValue::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_UpdateValue, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'WBP_VideoMenu_ValueSwitcher_C_UpdateValue::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_UpdateValue, Temp_int_Array_Index_Variable) == 0x000030, "Member 'WBP_VideoMenu_ValueSwitcher_C_UpdateValue::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_UpdateValue, Temp_int_Array_Index_Variable_1) == 0x000034, "Member 'WBP_VideoMenu_ValueSwitcher_C_UpdateValue::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_UpdateValue, CallFunc_Conv_TextToString_ReturnValue) == 0x000038, "Member 'WBP_VideoMenu_ValueSwitcher_C_UpdateValue::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_UpdateValue, CallFunc_GetLabel_ReturnValue) == 0x000048, "Member 'WBP_VideoMenu_ValueSwitcher_C_UpdateValue::CallFunc_GetLabel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_UpdateValue, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000060, "Member 'WBP_VideoMenu_ValueSwitcher_C_UpdateValue::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_UpdateValue, CallFunc_Conv_StringToText_ReturnValue) == 0x000070, "Member 'WBP_VideoMenu_ValueSwitcher_C_UpdateValue::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VideoMenu_ValueSwitcher_C_UpdateValue, CallFunc_Prepare_Screen_Mode_CMD_NewCMD) == 0x000088, "Member 'WBP_VideoMenu_ValueSwitcher_C_UpdateValue::CallFunc_Prepare_Screen_Mode_CMD_NewCMD' has a wrong offset!");
