#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Modern_Settings_PresetsWidget

#include "Basic.hpp"

#include "Altar_structs.hpp"


namespace SDK::Params
{

// Function WBP_Modern_Settings_PresetsWidget.WBP_Modern_Settings_PresetsWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Modern_Settings_PresetsWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Settings_PresetsWidget_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_Modern_Settings_PresetsWidget_C_PreConstruct");
static_assert(sizeof(WBP_Modern_Settings_PresetsWidget_C_PreConstruct) == 0x000001, "Wrong size on WBP_Modern_Settings_PresetsWidget_C_PreConstruct");
static_assert(offsetof(WBP_Modern_Settings_PresetsWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_Modern_Settings_PresetsWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_Modern_Settings_PresetsWidget.WBP_Modern_Settings_PresetsWidget_C.OnStepChanged
// 0x0018 (0x0018 - 0x0000)
struct WBP_Modern_Settings_PresetsWidget_C_OnStepChanged final
{
public:
	int32                                         StepIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Value;                                             // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Settings_PresetsWidget_C_OnStepChanged) == 0x000008, "Wrong alignment on WBP_Modern_Settings_PresetsWidget_C_OnStepChanged");
static_assert(sizeof(WBP_Modern_Settings_PresetsWidget_C_OnStepChanged) == 0x000018, "Wrong size on WBP_Modern_Settings_PresetsWidget_C_OnStepChanged");
static_assert(offsetof(WBP_Modern_Settings_PresetsWidget_C_OnStepChanged, StepIndex) == 0x000000, "Member 'WBP_Modern_Settings_PresetsWidget_C_OnStepChanged::StepIndex' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_PresetsWidget_C_OnStepChanged, Value) == 0x000008, "Member 'WBP_Modern_Settings_PresetsWidget_C_OnStepChanged::Value' has a wrong offset!");

// Function WBP_Modern_Settings_PresetsWidget.WBP_Modern_Settings_PresetsWidget_C.OnSettingChanged
// 0x0138 (0x0138 - 0x0000)
struct WBP_Modern_Settings_PresetsWidget_C_OnSettingChanged final
{
public:
	struct FModernSettingTableRow                 NewSettingRow;                                     // 0x0000(0x0138)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_Modern_Settings_PresetsWidget_C_OnSettingChanged) == 0x000008, "Wrong alignment on WBP_Modern_Settings_PresetsWidget_C_OnSettingChanged");
static_assert(sizeof(WBP_Modern_Settings_PresetsWidget_C_OnSettingChanged) == 0x000138, "Wrong size on WBP_Modern_Settings_PresetsWidget_C_OnSettingChanged");
static_assert(offsetof(WBP_Modern_Settings_PresetsWidget_C_OnSettingChanged, NewSettingRow) == 0x000000, "Member 'WBP_Modern_Settings_PresetsWidget_C_OnSettingChanged::NewSettingRow' has a wrong offset!");

// Function WBP_Modern_Settings_PresetsWidget.WBP_Modern_Settings_PresetsWidget_C.OnRefreshWidgetRequested
// 0x0004 (0x0004 - 0x0000)
struct WBP_Modern_Settings_PresetsWidget_C_OnRefreshWidgetRequested final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Settings_PresetsWidget_C_OnRefreshWidgetRequested) == 0x000004, "Wrong alignment on WBP_Modern_Settings_PresetsWidget_C_OnRefreshWidgetRequested");
static_assert(sizeof(WBP_Modern_Settings_PresetsWidget_C_OnRefreshWidgetRequested) == 0x000004, "Wrong size on WBP_Modern_Settings_PresetsWidget_C_OnRefreshWidgetRequested");
static_assert(offsetof(WBP_Modern_Settings_PresetsWidget_C_OnRefreshWidgetRequested, Value) == 0x000000, "Member 'WBP_Modern_Settings_PresetsWidget_C_OnRefreshWidgetRequested::Value' has a wrong offset!");

// Function WBP_Modern_Settings_PresetsWidget.WBP_Modern_Settings_PresetsWidget_C.InitializeWidget
// 0x0160 (0x0160 - 0x0000)
struct WBP_Modern_Settings_PresetsWidget_C_InitializeWidget final
{
public:
	struct FModernSettingTableRow                 CallFunc_GetSettingRow_ReturnValue;                // 0x0000(0x0138)(ConstParm)
	float                                         CallFunc_GetCurrentWidgetValue_ReturnValue;        // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_145[0x3];                                      // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 StepIndex, const class FString& Value)> K2Node_CreateDelegate_OutputDelegate; // 0x0148(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FTrunc_A_ImplicitCast;                    // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Settings_PresetsWidget_C_InitializeWidget) == 0x000008, "Wrong alignment on WBP_Modern_Settings_PresetsWidget_C_InitializeWidget");
static_assert(sizeof(WBP_Modern_Settings_PresetsWidget_C_InitializeWidget) == 0x000160, "Wrong size on WBP_Modern_Settings_PresetsWidget_C_InitializeWidget");
static_assert(offsetof(WBP_Modern_Settings_PresetsWidget_C_InitializeWidget, CallFunc_GetSettingRow_ReturnValue) == 0x000000, "Member 'WBP_Modern_Settings_PresetsWidget_C_InitializeWidget::CallFunc_GetSettingRow_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_PresetsWidget_C_InitializeWidget, CallFunc_GetCurrentWidgetValue_ReturnValue) == 0x000138, "Member 'WBP_Modern_Settings_PresetsWidget_C_InitializeWidget::CallFunc_GetCurrentWidgetValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_PresetsWidget_C_InitializeWidget, CallFunc_FTrunc_ReturnValue) == 0x00013C, "Member 'WBP_Modern_Settings_PresetsWidget_C_InitializeWidget::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_PresetsWidget_C_InitializeWidget, CallFunc_Array_Length_ReturnValue) == 0x000140, "Member 'WBP_Modern_Settings_PresetsWidget_C_InitializeWidget::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_PresetsWidget_C_InitializeWidget, CallFunc_Greater_IntInt_ReturnValue) == 0x000144, "Member 'WBP_Modern_Settings_PresetsWidget_C_InitializeWidget::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_PresetsWidget_C_InitializeWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000148, "Member 'WBP_Modern_Settings_PresetsWidget_C_InitializeWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_PresetsWidget_C_InitializeWidget, CallFunc_FTrunc_A_ImplicitCast) == 0x000158, "Member 'WBP_Modern_Settings_PresetsWidget_C_InitializeWidget::CallFunc_FTrunc_A_ImplicitCast' has a wrong offset!");

// Function WBP_Modern_Settings_PresetsWidget.WBP_Modern_Settings_PresetsWidget_C.ExecuteUbergraph_WBP_Modern_Settings_PresetsWidget
// 0x0680 (0x0680 - 0x0000)
struct WBP_Modern_Settings_PresetsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_PresetsWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FModernSettingTableRow                 CallFunc_GetSettingRow_ReturnValue;                // 0x0008(0x0138)(ConstParm)
	struct FModernSettingTableRow                 K2Node_Event_NewSettingRow;                        // 0x0140(0x0138)(ConstParm)
	struct FModernSettingTableRow                 CallFunc_GetSettingRow_ReturnValue_1;              // 0x0278(0x0138)(ConstParm)
	struct FModernSettingTableRow                 CallFunc_GetSettingRow_ReturnValue_2;              // 0x03B0(0x0138)(ConstParm)
	int32                                         CallFunc_GetCurrentIndex_Value;                    // 0x04E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x04EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCurrentIndex_Value_1;                  // 0x04F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x04F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCurrentIndex_Value_2;                  // 0x04F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x04FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_StepIndex;              // 0x0500(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_504[0x4];                                      // 0x0504(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_ComponentBoundEvent_Value;                  // 0x0508(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0518(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FModernSettingTableRow                 CallFunc_GetSettingRow_ReturnValue_3;              // 0x0520(0x0138)(ConstParm)
	float                                         K2Node_Event_Value;                                // 0x0658(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x065C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCurrentIndex_Value_3;                  // 0x0660(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0664(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCurrentIndex_Value_4;                  // 0x0668(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x066C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0670(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_671[0x3];                                      // 0x0671(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_ApplyNewValue_WidgetValue_ImplicitCast;   // 0x0674(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FTrunc_A_ImplicitCast;                    // 0x0678(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Settings_PresetsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_PresetsWidget) == 0x000008, "Wrong alignment on WBP_Modern_Settings_PresetsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_PresetsWidget");
static_assert(sizeof(WBP_Modern_Settings_PresetsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_PresetsWidget) == 0x000680, "Wrong size on WBP_Modern_Settings_PresetsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_PresetsWidget");
static_assert(offsetof(WBP_Modern_Settings_PresetsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_PresetsWidget, EntryPoint) == 0x000000, "Member 'WBP_Modern_Settings_PresetsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_PresetsWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_PresetsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_PresetsWidget, CallFunc_GetSettingRow_ReturnValue) == 0x000008, "Member 'WBP_Modern_Settings_PresetsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_PresetsWidget::CallFunc_GetSettingRow_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_PresetsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_PresetsWidget, K2Node_Event_NewSettingRow) == 0x000140, "Member 'WBP_Modern_Settings_PresetsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_PresetsWidget::K2Node_Event_NewSettingRow' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_PresetsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_PresetsWidget, CallFunc_GetSettingRow_ReturnValue_1) == 0x000278, "Member 'WBP_Modern_Settings_PresetsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_PresetsWidget::CallFunc_GetSettingRow_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_PresetsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_PresetsWidget, CallFunc_GetSettingRow_ReturnValue_2) == 0x0003B0, "Member 'WBP_Modern_Settings_PresetsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_PresetsWidget::CallFunc_GetSettingRow_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_PresetsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_PresetsWidget, CallFunc_GetCurrentIndex_Value) == 0x0004E8, "Member 'WBP_Modern_Settings_PresetsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_PresetsWidget::CallFunc_GetCurrentIndex_Value' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_PresetsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_PresetsWidget, CallFunc_Add_IntInt_ReturnValue) == 0x0004EC, "Member 'WBP_Modern_Settings_PresetsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_PresetsWidget::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_PresetsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_PresetsWidget, CallFunc_GetCurrentIndex_Value_1) == 0x0004F0, "Member 'WBP_Modern_Settings_PresetsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_PresetsWidget::CallFunc_GetCurrentIndex_Value_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_PresetsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_PresetsWidget, CallFunc_Subtract_IntInt_ReturnValue) == 0x0004F4, "Member 'WBP_Modern_Settings_PresetsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_PresetsWidget::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_PresetsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_PresetsWidget, CallFunc_GetCurrentIndex_Value_2) == 0x0004F8, "Member 'WBP_Modern_Settings_PresetsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_PresetsWidget::CallFunc_GetCurrentIndex_Value_2' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_PresetsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_PresetsWidget, CallFunc_Add_IntInt_ReturnValue_1) == 0x0004FC, "Member 'WBP_Modern_Settings_PresetsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_PresetsWidget::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_PresetsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_PresetsWidget, K2Node_ComponentBoundEvent_StepIndex) == 0x000500, "Member 'WBP_Modern_Settings_PresetsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_PresetsWidget::K2Node_ComponentBoundEvent_StepIndex' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_PresetsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_PresetsWidget, K2Node_ComponentBoundEvent_Value) == 0x000508, "Member 'WBP_Modern_Settings_PresetsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_PresetsWidget::K2Node_ComponentBoundEvent_Value' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_PresetsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_PresetsWidget, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000518, "Member 'WBP_Modern_Settings_PresetsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_PresetsWidget::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_PresetsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_PresetsWidget, CallFunc_GetSettingRow_ReturnValue_3) == 0x000520, "Member 'WBP_Modern_Settings_PresetsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_PresetsWidget::CallFunc_GetSettingRow_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_PresetsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_PresetsWidget, K2Node_Event_Value) == 0x000658, "Member 'WBP_Modern_Settings_PresetsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_PresetsWidget::K2Node_Event_Value' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_PresetsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_PresetsWidget, CallFunc_FTrunc_ReturnValue) == 0x00065C, "Member 'WBP_Modern_Settings_PresetsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_PresetsWidget::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_PresetsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_PresetsWidget, CallFunc_GetCurrentIndex_Value_3) == 0x000660, "Member 'WBP_Modern_Settings_PresetsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_PresetsWidget::CallFunc_GetCurrentIndex_Value_3' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_PresetsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_PresetsWidget, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000664, "Member 'WBP_Modern_Settings_PresetsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_PresetsWidget::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_PresetsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_PresetsWidget, CallFunc_GetCurrentIndex_Value_4) == 0x000668, "Member 'WBP_Modern_Settings_PresetsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_PresetsWidget::CallFunc_GetCurrentIndex_Value_4' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_PresetsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_PresetsWidget, CallFunc_Add_IntInt_ReturnValue_2) == 0x00066C, "Member 'WBP_Modern_Settings_PresetsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_PresetsWidget::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_PresetsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_PresetsWidget, K2Node_Event_IsDesignTime) == 0x000670, "Member 'WBP_Modern_Settings_PresetsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_PresetsWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_PresetsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_PresetsWidget, CallFunc_ApplyNewValue_WidgetValue_ImplicitCast) == 0x000674, "Member 'WBP_Modern_Settings_PresetsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_PresetsWidget::CallFunc_ApplyNewValue_WidgetValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_PresetsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_PresetsWidget, CallFunc_FTrunc_A_ImplicitCast) == 0x000678, "Member 'WBP_Modern_Settings_PresetsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_PresetsWidget::CallFunc_FTrunc_A_ImplicitCast' has a wrong offset!");

// Function WBP_Modern_Settings_PresetsWidget.WBP_Modern_Settings_PresetsWidget_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct WBP_Modern_Settings_PresetsWidget_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Settings_PresetsWidget_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_Modern_Settings_PresetsWidget_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_Modern_Settings_PresetsWidget_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong size on WBP_Modern_Settings_PresetsWidget_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_Modern_Settings_PresetsWidget_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_Modern_Settings_PresetsWidget_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");

}

