#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModernHud_WeaponIcon

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_ModernHud_WeaponIcon.WBP_ModernHud_WeaponIcon_C.ExecuteUbergraph_WBP_ModernHud_WeaponIcon
// 0x000C (0x000C - 0x0000)
struct WBP_ModernHud_WeaponIcon_C_ExecuteUbergraph_WBP_ModernHud_WeaponIcon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Value_1;                              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Value;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_WeaponIcon_C_ExecuteUbergraph_WBP_ModernHud_WeaponIcon) == 0x000004, "Wrong alignment on WBP_ModernHud_WeaponIcon_C_ExecuteUbergraph_WBP_ModernHud_WeaponIcon");
static_assert(sizeof(WBP_ModernHud_WeaponIcon_C_ExecuteUbergraph_WBP_ModernHud_WeaponIcon) == 0x00000C, "Wrong size on WBP_ModernHud_WeaponIcon_C_ExecuteUbergraph_WBP_ModernHud_WeaponIcon");
static_assert(offsetof(WBP_ModernHud_WeaponIcon_C_ExecuteUbergraph_WBP_ModernHud_WeaponIcon, EntryPoint) == 0x000000, "Member 'WBP_ModernHud_WeaponIcon_C_ExecuteUbergraph_WBP_ModernHud_WeaponIcon::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_WeaponIcon_C_ExecuteUbergraph_WBP_ModernHud_WeaponIcon, K2Node_Event_Value_1) == 0x000004, "Member 'WBP_ModernHud_WeaponIcon_C_ExecuteUbergraph_WBP_ModernHud_WeaponIcon::K2Node_Event_Value_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_WeaponIcon_C_ExecuteUbergraph_WBP_ModernHud_WeaponIcon, K2Node_Event_Value) == 0x000008, "Member 'WBP_ModernHud_WeaponIcon_C_ExecuteUbergraph_WBP_ModernHud_WeaponIcon::K2Node_Event_Value' has a wrong offset!");

// Function WBP_ModernHud_WeaponIcon.WBP_ModernHud_WeaponIcon_C.OnAmmoCountUpdated
// 0x0004 (0x0004 - 0x0000)
struct WBP_ModernHud_WeaponIcon_C_OnAmmoCountUpdated final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_WeaponIcon_C_OnAmmoCountUpdated) == 0x000004, "Wrong alignment on WBP_ModernHud_WeaponIcon_C_OnAmmoCountUpdated");
static_assert(sizeof(WBP_ModernHud_WeaponIcon_C_OnAmmoCountUpdated) == 0x000004, "Wrong size on WBP_ModernHud_WeaponIcon_C_OnAmmoCountUpdated");
static_assert(offsetof(WBP_ModernHud_WeaponIcon_C_OnAmmoCountUpdated, Value) == 0x000000, "Member 'WBP_ModernHud_WeaponIcon_C_OnAmmoCountUpdated::Value' has a wrong offset!");

// Function WBP_ModernHud_WeaponIcon.WBP_ModernHud_WeaponIcon_C.OnIsAmmoVisibleUpdated
// 0x0001 (0x0001 - 0x0000)
struct WBP_ModernHud_WeaponIcon_C_OnIsAmmoVisibleUpdated final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_WeaponIcon_C_OnIsAmmoVisibleUpdated) == 0x000001, "Wrong alignment on WBP_ModernHud_WeaponIcon_C_OnIsAmmoVisibleUpdated");
static_assert(sizeof(WBP_ModernHud_WeaponIcon_C_OnIsAmmoVisibleUpdated) == 0x000001, "Wrong size on WBP_ModernHud_WeaponIcon_C_OnIsAmmoVisibleUpdated");
static_assert(offsetof(WBP_ModernHud_WeaponIcon_C_OnIsAmmoVisibleUpdated, Value) == 0x000000, "Member 'WBP_ModernHud_WeaponIcon_C_OnIsAmmoVisibleUpdated::Value' has a wrong offset!");

// Function WBP_ModernHud_WeaponIcon.WBP_ModernHud_WeaponIcon_C.SetAmmoText
// 0x0020 (0x0020 - 0x0000)
struct WBP_ModernHud_WeaponIcon_C_SetAmmoText final
{
public:
	int32                                         InAmmoCount;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_FormatAmmoText_ReturnValue;               // 0x0008(0x0018)()
};
static_assert(alignof(WBP_ModernHud_WeaponIcon_C_SetAmmoText) == 0x000008, "Wrong alignment on WBP_ModernHud_WeaponIcon_C_SetAmmoText");
static_assert(sizeof(WBP_ModernHud_WeaponIcon_C_SetAmmoText) == 0x000020, "Wrong size on WBP_ModernHud_WeaponIcon_C_SetAmmoText");
static_assert(offsetof(WBP_ModernHud_WeaponIcon_C_SetAmmoText, InAmmoCount) == 0x000000, "Member 'WBP_ModernHud_WeaponIcon_C_SetAmmoText::InAmmoCount' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_WeaponIcon_C_SetAmmoText, CallFunc_FormatAmmoText_ReturnValue) == 0x000008, "Member 'WBP_ModernHud_WeaponIcon_C_SetAmmoText::CallFunc_FormatAmmoText_ReturnValue' has a wrong offset!");

// Function WBP_ModernHud_WeaponIcon.WBP_ModernHud_WeaponIcon_C.SetAmmoVisibilityOverride
// 0x0001 (0x0001 - 0x0000)
struct WBP_ModernHud_WeaponIcon_C_SetAmmoVisibilityOverride final
{
public:
	bool                                          bIsAmmoVisible;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_WeaponIcon_C_SetAmmoVisibilityOverride) == 0x000001, "Wrong alignment on WBP_ModernHud_WeaponIcon_C_SetAmmoVisibilityOverride");
static_assert(sizeof(WBP_ModernHud_WeaponIcon_C_SetAmmoVisibilityOverride) == 0x000001, "Wrong size on WBP_ModernHud_WeaponIcon_C_SetAmmoVisibilityOverride");
static_assert(offsetof(WBP_ModernHud_WeaponIcon_C_SetAmmoVisibilityOverride, bIsAmmoVisible) == 0x000000, "Member 'WBP_ModernHud_WeaponIcon_C_SetAmmoVisibilityOverride::bIsAmmoVisible' has a wrong offset!");

// Function WBP_ModernHud_WeaponIcon.WBP_ModernHud_WeaponIcon_C.SetWeaponChargePercent
// 0x0018 (0x0018 - 0x0000)
struct WBP_ModernHud_WeaponIcon_C_SetWeaponChargePercent final
{
public:
	double                                        InPercent;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_WeaponIcon_C_SetWeaponChargePercent) == 0x000008, "Wrong alignment on WBP_ModernHud_WeaponIcon_C_SetWeaponChargePercent");
static_assert(sizeof(WBP_ModernHud_WeaponIcon_C_SetWeaponChargePercent) == 0x000018, "Wrong size on WBP_ModernHud_WeaponIcon_C_SetWeaponChargePercent");
static_assert(offsetof(WBP_ModernHud_WeaponIcon_C_SetWeaponChargePercent, InPercent) == 0x000000, "Member 'WBP_ModernHud_WeaponIcon_C_SetWeaponChargePercent::InPercent' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_WeaponIcon_C_SetWeaponChargePercent, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'WBP_ModernHud_WeaponIcon_C_SetWeaponChargePercent::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_WeaponIcon_C_SetWeaponChargePercent, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000010, "Member 'WBP_ModernHud_WeaponIcon_C_SetWeaponChargePercent::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function WBP_ModernHud_WeaponIcon.WBP_ModernHud_WeaponIcon_C.SetWeaponChargeVisibility
// 0x0020 (0x0020 - 0x0000)
struct WBP_ModernHud_WeaponIcon_C_SetWeaponChargeVisibility final
{
public:
	bool                                          bInChargeVisible;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_WeaponIcon_C_SetWeaponChargeVisibility) == 0x000008, "Wrong alignment on WBP_ModernHud_WeaponIcon_C_SetWeaponChargeVisibility");
static_assert(sizeof(WBP_ModernHud_WeaponIcon_C_SetWeaponChargeVisibility) == 0x000020, "Wrong size on WBP_ModernHud_WeaponIcon_C_SetWeaponChargeVisibility");
static_assert(offsetof(WBP_ModernHud_WeaponIcon_C_SetWeaponChargeVisibility, bInChargeVisible) == 0x000000, "Member 'WBP_ModernHud_WeaponIcon_C_SetWeaponChargeVisibility::bInChargeVisible' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_WeaponIcon_C_SetWeaponChargeVisibility, CallFunc_SelectFloat_ReturnValue) == 0x000008, "Member 'WBP_ModernHud_WeaponIcon_C_SetWeaponChargeVisibility::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_WeaponIcon_C_SetWeaponChargeVisibility, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000010, "Member 'WBP_ModernHud_WeaponIcon_C_SetWeaponChargeVisibility::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_WeaponIcon_C_SetWeaponChargeVisibility, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000018, "Member 'WBP_ModernHud_WeaponIcon_C_SetWeaponChargeVisibility::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function WBP_ModernHud_WeaponIcon.WBP_ModernHud_WeaponIcon_C.SetWeaponStatusVisibility
// 0x0005 (0x0005 - 0x0000)
struct WBP_ModernHud_WeaponIcon_C_SetWeaponStatusVisibility final
{
public:
	bool                                          Visible;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_WeaponIcon_C_SetWeaponStatusVisibility) == 0x000001, "Wrong alignment on WBP_ModernHud_WeaponIcon_C_SetWeaponStatusVisibility");
static_assert(sizeof(WBP_ModernHud_WeaponIcon_C_SetWeaponStatusVisibility) == 0x000005, "Wrong size on WBP_ModernHud_WeaponIcon_C_SetWeaponStatusVisibility");
static_assert(offsetof(WBP_ModernHud_WeaponIcon_C_SetWeaponStatusVisibility, Visible) == 0x000000, "Member 'WBP_ModernHud_WeaponIcon_C_SetWeaponStatusVisibility::Visible' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_WeaponIcon_C_SetWeaponStatusVisibility, Temp_bool_Variable) == 0x000001, "Member 'WBP_ModernHud_WeaponIcon_C_SetWeaponStatusVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_WeaponIcon_C_SetWeaponStatusVisibility, Temp_byte_Variable) == 0x000002, "Member 'WBP_ModernHud_WeaponIcon_C_SetWeaponStatusVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_WeaponIcon_C_SetWeaponStatusVisibility, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_ModernHud_WeaponIcon_C_SetWeaponStatusVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_WeaponIcon_C_SetWeaponStatusVisibility, K2Node_Select_Default) == 0x000004, "Member 'WBP_ModernHud_WeaponIcon_C_SetWeaponStatusVisibility::K2Node_Select_Default' has a wrong offset!");

// Function WBP_ModernHud_WeaponIcon.WBP_ModernHud_WeaponIcon_C.UpdateAmmoVisibility
// 0x0006 (0x0006 - 0x0000)
struct WBP_ModernHud_WeaponIcon_C_UpdateAmmoVisibility final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_WeaponIcon_C_UpdateAmmoVisibility) == 0x000001, "Wrong alignment on WBP_ModernHud_WeaponIcon_C_UpdateAmmoVisibility");
static_assert(sizeof(WBP_ModernHud_WeaponIcon_C_UpdateAmmoVisibility) == 0x000006, "Wrong size on WBP_ModernHud_WeaponIcon_C_UpdateAmmoVisibility");
static_assert(offsetof(WBP_ModernHud_WeaponIcon_C_UpdateAmmoVisibility, Temp_bool_Variable) == 0x000000, "Member 'WBP_ModernHud_WeaponIcon_C_UpdateAmmoVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_WeaponIcon_C_UpdateAmmoVisibility, Temp_byte_Variable) == 0x000001, "Member 'WBP_ModernHud_WeaponIcon_C_UpdateAmmoVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_WeaponIcon_C_UpdateAmmoVisibility, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_ModernHud_WeaponIcon_C_UpdateAmmoVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_WeaponIcon_C_UpdateAmmoVisibility, CallFunc_Greater_IntInt_ReturnValue) == 0x000003, "Member 'WBP_ModernHud_WeaponIcon_C_UpdateAmmoVisibility::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_WeaponIcon_C_UpdateAmmoVisibility, CallFunc_BooleanAND_ReturnValue) == 0x000004, "Member 'WBP_ModernHud_WeaponIcon_C_UpdateAmmoVisibility::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_WeaponIcon_C_UpdateAmmoVisibility, K2Node_Select_Default) == 0x000005, "Member 'WBP_ModernHud_WeaponIcon_C_UpdateAmmoVisibility::K2Node_Select_Default' has a wrong offset!");

// Function WBP_ModernHud_WeaponIcon.WBP_ModernHud_WeaponIcon_C.UpdateStatus
// 0x00F0 (0x00F0 - 0x0000)
struct WBP_ModernHud_WeaponIcon_C_UpdateStatus final
{
public:
	int32                                         InStatusIndex;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_Map_Find_Value;                           // 0x0010(0x00D0)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_WeaponIcon_C_UpdateStatus) == 0x000010, "Wrong alignment on WBP_ModernHud_WeaponIcon_C_UpdateStatus");
static_assert(sizeof(WBP_ModernHud_WeaponIcon_C_UpdateStatus) == 0x0000F0, "Wrong size on WBP_ModernHud_WeaponIcon_C_UpdateStatus");
static_assert(offsetof(WBP_ModernHud_WeaponIcon_C_UpdateStatus, InStatusIndex) == 0x000000, "Member 'WBP_ModernHud_WeaponIcon_C_UpdateStatus::InStatusIndex' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_WeaponIcon_C_UpdateStatus, CallFunc_Map_Find_Value) == 0x000010, "Member 'WBP_ModernHud_WeaponIcon_C_UpdateStatus::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_WeaponIcon_C_UpdateStatus, CallFunc_Map_Find_ReturnValue) == 0x0000E0, "Member 'WBP_ModernHud_WeaponIcon_C_UpdateStatus::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function WBP_ModernHud_WeaponIcon.WBP_ModernHud_WeaponIcon_C.UpdateWeaponHealth
// 0x0030 (0x0030 - 0x0000)
struct WBP_ModernHud_WeaponIcon_C_UpdateWeaponHealth final
{
public:
	double                                        InHealth;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IAudioParameterControllerInterface> K2Node_DynamicCast_AsAudio_Parameter_Controller_Interface; // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_WeaponIcon_C_UpdateWeaponHealth) == 0x000008, "Wrong alignment on WBP_ModernHud_WeaponIcon_C_UpdateWeaponHealth");
static_assert(sizeof(WBP_ModernHud_WeaponIcon_C_UpdateWeaponHealth) == 0x000030, "Wrong size on WBP_ModernHud_WeaponIcon_C_UpdateWeaponHealth");
static_assert(offsetof(WBP_ModernHud_WeaponIcon_C_UpdateWeaponHealth, InHealth) == 0x000000, "Member 'WBP_ModernHud_WeaponIcon_C_UpdateWeaponHealth::InHealth' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_WeaponIcon_C_UpdateWeaponHealth, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000008, "Member 'WBP_ModernHud_WeaponIcon_C_UpdateWeaponHealth::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_WeaponIcon_C_UpdateWeaponHealth, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000010, "Member 'WBP_ModernHud_WeaponIcon_C_UpdateWeaponHealth::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_WeaponIcon_C_UpdateWeaponHealth, K2Node_DynamicCast_AsAudio_Parameter_Controller_Interface) == 0x000018, "Member 'WBP_ModernHud_WeaponIcon_C_UpdateWeaponHealth::K2Node_DynamicCast_AsAudio_Parameter_Controller_Interface' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_WeaponIcon_C_UpdateWeaponHealth, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WBP_ModernHud_WeaponIcon_C_UpdateWeaponHealth::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_ModernHud_WeaponIcon.WBP_ModernHud_WeaponIcon_C.UpdateWeaponIcon
// 0x0010 (0x0010 - 0x0000)
struct WBP_ModernHud_WeaponIcon_C_UpdateWeaponIcon final
{
public:
	class UTexture2D*                             InTexture;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_WeaponIcon_C_UpdateWeaponIcon) == 0x000008, "Wrong alignment on WBP_ModernHud_WeaponIcon_C_UpdateWeaponIcon");
static_assert(sizeof(WBP_ModernHud_WeaponIcon_C_UpdateWeaponIcon) == 0x000010, "Wrong size on WBP_ModernHud_WeaponIcon_C_UpdateWeaponIcon");
static_assert(offsetof(WBP_ModernHud_WeaponIcon_C_UpdateWeaponIcon, InTexture) == 0x000000, "Member 'WBP_ModernHud_WeaponIcon_C_UpdateWeaponIcon::InTexture' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_WeaponIcon_C_UpdateWeaponIcon, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'WBP_ModernHud_WeaponIcon_C_UpdateWeaponIcon::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function WBP_ModernHud_WeaponIcon.WBP_ModernHud_WeaponIcon_C.FormatAmmoText
// 0x0040 (0x0040 - 0x0000)
struct WBP_ModernHud_WeaponIcon_C_FormatAmmoText final
{
public:
	int32                                         InValue;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ReturnParm)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0020(0x0018)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_WeaponIcon_C_FormatAmmoText) == 0x000008, "Wrong alignment on WBP_ModernHud_WeaponIcon_C_FormatAmmoText");
static_assert(sizeof(WBP_ModernHud_WeaponIcon_C_FormatAmmoText) == 0x000040, "Wrong size on WBP_ModernHud_WeaponIcon_C_FormatAmmoText");
static_assert(offsetof(WBP_ModernHud_WeaponIcon_C_FormatAmmoText, InValue) == 0x000000, "Member 'WBP_ModernHud_WeaponIcon_C_FormatAmmoText::InValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_WeaponIcon_C_FormatAmmoText, ReturnValue) == 0x000008, "Member 'WBP_ModernHud_WeaponIcon_C_FormatAmmoText::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_WeaponIcon_C_FormatAmmoText, CallFunc_Conv_IntToText_ReturnValue) == 0x000020, "Member 'WBP_ModernHud_WeaponIcon_C_FormatAmmoText::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_WeaponIcon_C_FormatAmmoText, CallFunc_Greater_IntInt_ReturnValue) == 0x000038, "Member 'WBP_ModernHud_WeaponIcon_C_FormatAmmoText::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

}

