#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_NavigableScrollBox_SigilStoneMenu

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CommonInput_structs.hpp"


namespace SDK::Params
{

// Function WBP_NavigableScrollBox_SigilStoneMenu.WBP_NavigableScrollBox_SigilStoneMenu_C.DoScroll
// 0x0058 (0x0058 - 0x0000)
struct WBP_NavigableScrollBox_SigilStoneMenu_C_DoScroll final
{
public:
	double                                        ScrollDelta;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Local_NewScrollOffset;                             // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScrollBox*                             CallFunc_GetScrollBox_ReturnValue;                 // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UScrollBox*                             CallFunc_GetScrollBox_ReturnValue_1;               // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScrollOffsetOfEnd_ReturnValue;         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScrollOffset_ReturnValue;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScrollBox*                             CallFunc_GetScrollBox_ReturnValue_2;               // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_Max_ImplicitCast;                  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScrollOffset_NewScrollOffset_ImplicitCast; // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_NavigableScrollBox_SigilStoneMenu_C_DoScroll) == 0x000008, "Wrong alignment on WBP_NavigableScrollBox_SigilStoneMenu_C_DoScroll");
static_assert(sizeof(WBP_NavigableScrollBox_SigilStoneMenu_C_DoScroll) == 0x000058, "Wrong size on WBP_NavigableScrollBox_SigilStoneMenu_C_DoScroll");
static_assert(offsetof(WBP_NavigableScrollBox_SigilStoneMenu_C_DoScroll, ScrollDelta) == 0x000000, "Member 'WBP_NavigableScrollBox_SigilStoneMenu_C_DoScroll::ScrollDelta' has a wrong offset!");
static_assert(offsetof(WBP_NavigableScrollBox_SigilStoneMenu_C_DoScroll, Local_NewScrollOffset) == 0x000008, "Member 'WBP_NavigableScrollBox_SigilStoneMenu_C_DoScroll::Local_NewScrollOffset' has a wrong offset!");
static_assert(offsetof(WBP_NavigableScrollBox_SigilStoneMenu_C_DoScroll, CallFunc_GetScrollBox_ReturnValue) == 0x000010, "Member 'WBP_NavigableScrollBox_SigilStoneMenu_C_DoScroll::CallFunc_GetScrollBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NavigableScrollBox_SigilStoneMenu_C_DoScroll, CallFunc_GetScrollBox_ReturnValue_1) == 0x000018, "Member 'WBP_NavigableScrollBox_SigilStoneMenu_C_DoScroll::CallFunc_GetScrollBox_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_NavigableScrollBox_SigilStoneMenu_C_DoScroll, CallFunc_GetScrollOffsetOfEnd_ReturnValue) == 0x000020, "Member 'WBP_NavigableScrollBox_SigilStoneMenu_C_DoScroll::CallFunc_GetScrollOffsetOfEnd_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NavigableScrollBox_SigilStoneMenu_C_DoScroll, CallFunc_GetScrollOffset_ReturnValue) == 0x000024, "Member 'WBP_NavigableScrollBox_SigilStoneMenu_C_DoScroll::CallFunc_GetScrollOffset_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NavigableScrollBox_SigilStoneMenu_C_DoScroll, CallFunc_GetScrollBox_ReturnValue_2) == 0x000028, "Member 'WBP_NavigableScrollBox_SigilStoneMenu_C_DoScroll::CallFunc_GetScrollBox_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_NavigableScrollBox_SigilStoneMenu_C_DoScroll, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000030, "Member 'WBP_NavigableScrollBox_SigilStoneMenu_C_DoScroll::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NavigableScrollBox_SigilStoneMenu_C_DoScroll, CallFunc_FClamp_ReturnValue) == 0x000038, "Member 'WBP_NavigableScrollBox_SigilStoneMenu_C_DoScroll::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NavigableScrollBox_SigilStoneMenu_C_DoScroll, CallFunc_FClamp_Max_ImplicitCast) == 0x000040, "Member 'WBP_NavigableScrollBox_SigilStoneMenu_C_DoScroll::CallFunc_FClamp_Max_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_NavigableScrollBox_SigilStoneMenu_C_DoScroll, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000048, "Member 'WBP_NavigableScrollBox_SigilStoneMenu_C_DoScroll::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_NavigableScrollBox_SigilStoneMenu_C_DoScroll, CallFunc_SetScrollOffset_NewScrollOffset_ImplicitCast) == 0x000050, "Member 'WBP_NavigableScrollBox_SigilStoneMenu_C_DoScroll::CallFunc_SetScrollOffset_NewScrollOffset_ImplicitCast' has a wrong offset!");

// Function WBP_NavigableScrollBox_SigilStoneMenu.WBP_NavigableScrollBox_SigilStoneMenu_C.ExecuteUbergraph_WBP_NavigableScrollBox_SigilStoneMenu
// 0x0068 (0x0068 - 0x0000)
struct WBP_NavigableScrollBox_SigilStoneMenu_C_ExecuteUbergraph_WBP_NavigableScrollBox_SigilStoneMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UScrollBox*                             CallFunc_GetScrollBox_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable;                                // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_2;                              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_3;                              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate;            // 0x0038(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue; // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              K2Node_CustomEvent_bNewInputType;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UScrollBox*                             CallFunc_GetScrollBox_ReturnValue_1;               // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_NavigableScrollBox_SigilStoneMenu_C_ExecuteUbergraph_WBP_NavigableScrollBox_SigilStoneMenu) == 0x000008, "Wrong alignment on WBP_NavigableScrollBox_SigilStoneMenu_C_ExecuteUbergraph_WBP_NavigableScrollBox_SigilStoneMenu");
static_assert(sizeof(WBP_NavigableScrollBox_SigilStoneMenu_C_ExecuteUbergraph_WBP_NavigableScrollBox_SigilStoneMenu) == 0x000068, "Wrong size on WBP_NavigableScrollBox_SigilStoneMenu_C_ExecuteUbergraph_WBP_NavigableScrollBox_SigilStoneMenu");
static_assert(offsetof(WBP_NavigableScrollBox_SigilStoneMenu_C_ExecuteUbergraph_WBP_NavigableScrollBox_SigilStoneMenu, EntryPoint) == 0x000000, "Member 'WBP_NavigableScrollBox_SigilStoneMenu_C_ExecuteUbergraph_WBP_NavigableScrollBox_SigilStoneMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_NavigableScrollBox_SigilStoneMenu_C_ExecuteUbergraph_WBP_NavigableScrollBox_SigilStoneMenu, CallFunc_GetScrollBox_ReturnValue) == 0x000008, "Member 'WBP_NavigableScrollBox_SigilStoneMenu_C_ExecuteUbergraph_WBP_NavigableScrollBox_SigilStoneMenu::CallFunc_GetScrollBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NavigableScrollBox_SigilStoneMenu_C_ExecuteUbergraph_WBP_NavigableScrollBox_SigilStoneMenu, Temp_byte_Variable) == 0x000010, "Member 'WBP_NavigableScrollBox_SigilStoneMenu_C_ExecuteUbergraph_WBP_NavigableScrollBox_SigilStoneMenu::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_NavigableScrollBox_SigilStoneMenu_C_ExecuteUbergraph_WBP_NavigableScrollBox_SigilStoneMenu, Temp_real_Variable) == 0x000014, "Member 'WBP_NavigableScrollBox_SigilStoneMenu_C_ExecuteUbergraph_WBP_NavigableScrollBox_SigilStoneMenu::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_NavigableScrollBox_SigilStoneMenu_C_ExecuteUbergraph_WBP_NavigableScrollBox_SigilStoneMenu, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000018, "Member 'WBP_NavigableScrollBox_SigilStoneMenu_C_ExecuteUbergraph_WBP_NavigableScrollBox_SigilStoneMenu::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NavigableScrollBox_SigilStoneMenu_C_ExecuteUbergraph_WBP_NavigableScrollBox_SigilStoneMenu, Temp_real_Variable_1) == 0x000020, "Member 'WBP_NavigableScrollBox_SigilStoneMenu_C_ExecuteUbergraph_WBP_NavigableScrollBox_SigilStoneMenu::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_NavigableScrollBox_SigilStoneMenu_C_ExecuteUbergraph_WBP_NavigableScrollBox_SigilStoneMenu, Temp_real_Variable_2) == 0x000024, "Member 'WBP_NavigableScrollBox_SigilStoneMenu_C_ExecuteUbergraph_WBP_NavigableScrollBox_SigilStoneMenu::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_NavigableScrollBox_SigilStoneMenu_C_ExecuteUbergraph_WBP_NavigableScrollBox_SigilStoneMenu, Temp_real_Variable_3) == 0x000028, "Member 'WBP_NavigableScrollBox_SigilStoneMenu_C_ExecuteUbergraph_WBP_NavigableScrollBox_SigilStoneMenu::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_NavigableScrollBox_SigilStoneMenu_C_ExecuteUbergraph_WBP_NavigableScrollBox_SigilStoneMenu, K2Node_Event_IsDesignTime) == 0x00002C, "Member 'WBP_NavigableScrollBox_SigilStoneMenu_C_ExecuteUbergraph_WBP_NavigableScrollBox_SigilStoneMenu::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_NavigableScrollBox_SigilStoneMenu_C_ExecuteUbergraph_WBP_NavigableScrollBox_SigilStoneMenu, CallFunc_GetPlayerController_ReturnValue) == 0x000030, "Member 'WBP_NavigableScrollBox_SigilStoneMenu_C_ExecuteUbergraph_WBP_NavigableScrollBox_SigilStoneMenu::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NavigableScrollBox_SigilStoneMenu_C_ExecuteUbergraph_WBP_NavigableScrollBox_SigilStoneMenu, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'WBP_NavigableScrollBox_SigilStoneMenu_C_ExecuteUbergraph_WBP_NavigableScrollBox_SigilStoneMenu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_NavigableScrollBox_SigilStoneMenu_C_ExecuteUbergraph_WBP_NavigableScrollBox_SigilStoneMenu, CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue) == 0x000048, "Member 'WBP_NavigableScrollBox_SigilStoneMenu_C_ExecuteUbergraph_WBP_NavigableScrollBox_SigilStoneMenu::CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NavigableScrollBox_SigilStoneMenu_C_ExecuteUbergraph_WBP_NavigableScrollBox_SigilStoneMenu, K2Node_CustomEvent_bNewInputType) == 0x000050, "Member 'WBP_NavigableScrollBox_SigilStoneMenu_C_ExecuteUbergraph_WBP_NavigableScrollBox_SigilStoneMenu::K2Node_CustomEvent_bNewInputType' has a wrong offset!");
static_assert(offsetof(WBP_NavigableScrollBox_SigilStoneMenu_C_ExecuteUbergraph_WBP_NavigableScrollBox_SigilStoneMenu, CallFunc_GetScrollBox_ReturnValue_1) == 0x000058, "Member 'WBP_NavigableScrollBox_SigilStoneMenu_C_ExecuteUbergraph_WBP_NavigableScrollBox_SigilStoneMenu::CallFunc_GetScrollBox_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_NavigableScrollBox_SigilStoneMenu_C_ExecuteUbergraph_WBP_NavigableScrollBox_SigilStoneMenu, K2Node_Select_Default) == 0x000060, "Member 'WBP_NavigableScrollBox_SigilStoneMenu_C_ExecuteUbergraph_WBP_NavigableScrollBox_SigilStoneMenu::K2Node_Select_Default' has a wrong offset!");

// Function WBP_NavigableScrollBox_SigilStoneMenu.WBP_NavigableScrollBox_SigilStoneMenu_C.OnInputMethodChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_NavigableScrollBox_SigilStoneMenu_C_OnInputMethodChanged final
{
public:
	ECommonInputType                              bNewInputType;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_NavigableScrollBox_SigilStoneMenu_C_OnInputMethodChanged) == 0x000001, "Wrong alignment on WBP_NavigableScrollBox_SigilStoneMenu_C_OnInputMethodChanged");
static_assert(sizeof(WBP_NavigableScrollBox_SigilStoneMenu_C_OnInputMethodChanged) == 0x000001, "Wrong size on WBP_NavigableScrollBox_SigilStoneMenu_C_OnInputMethodChanged");
static_assert(offsetof(WBP_NavigableScrollBox_SigilStoneMenu_C_OnInputMethodChanged, bNewInputType) == 0x000000, "Member 'WBP_NavigableScrollBox_SigilStoneMenu_C_OnInputMethodChanged::bNewInputType' has a wrong offset!");

// Function WBP_NavigableScrollBox_SigilStoneMenu.WBP_NavigableScrollBox_SigilStoneMenu_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_NavigableScrollBox_SigilStoneMenu_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_NavigableScrollBox_SigilStoneMenu_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_NavigableScrollBox_SigilStoneMenu_C_PreConstruct");
static_assert(sizeof(WBP_NavigableScrollBox_SigilStoneMenu_C_PreConstruct) == 0x000001, "Wrong size on WBP_NavigableScrollBox_SigilStoneMenu_C_PreConstruct");
static_assert(offsetof(WBP_NavigableScrollBox_SigilStoneMenu_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_NavigableScrollBox_SigilStoneMenu_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_NavigableScrollBox_SigilStoneMenu.WBP_NavigableScrollBox_SigilStoneMenu_C.SetScrollbarInputHint
// 0x0130 (0x0130 - 0x0000)
struct WBP_NavigableScrollBox_SigilStoneMenu_C_SetScrollbarInputHint final
{
public:
	bool                                          ScrollWithRS;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   Local_Key;                                         // 0x0008(0x0018)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class UTexture*                               Local_KeyTexture;                                  // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UScrollBox*                             CallFunc_GetScrollBox_ReturnValue;                 // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVAltarUISubsystem*                     CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_TryGetBrushFromKey_OutBrush;              // 0x0040(0x00D0)()
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               K2Node_DynamicCast_AsTexture;                      // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_NavigableScrollBox_SigilStoneMenu_C_SetScrollbarInputHint) == 0x000010, "Wrong alignment on WBP_NavigableScrollBox_SigilStoneMenu_C_SetScrollbarInputHint");
static_assert(sizeof(WBP_NavigableScrollBox_SigilStoneMenu_C_SetScrollbarInputHint) == 0x000130, "Wrong size on WBP_NavigableScrollBox_SigilStoneMenu_C_SetScrollbarInputHint");
static_assert(offsetof(WBP_NavigableScrollBox_SigilStoneMenu_C_SetScrollbarInputHint, ScrollWithRS) == 0x000000, "Member 'WBP_NavigableScrollBox_SigilStoneMenu_C_SetScrollbarInputHint::ScrollWithRS' has a wrong offset!");
static_assert(offsetof(WBP_NavigableScrollBox_SigilStoneMenu_C_SetScrollbarInputHint, Local_Key) == 0x000008, "Member 'WBP_NavigableScrollBox_SigilStoneMenu_C_SetScrollbarInputHint::Local_Key' has a wrong offset!");
static_assert(offsetof(WBP_NavigableScrollBox_SigilStoneMenu_C_SetScrollbarInputHint, Local_KeyTexture) == 0x000020, "Member 'WBP_NavigableScrollBox_SigilStoneMenu_C_SetScrollbarInputHint::Local_KeyTexture' has a wrong offset!");
static_assert(offsetof(WBP_NavigableScrollBox_SigilStoneMenu_C_SetScrollbarInputHint, CallFunc_GetScrollBox_ReturnValue) == 0x000028, "Member 'WBP_NavigableScrollBox_SigilStoneMenu_C_SetScrollbarInputHint::CallFunc_GetScrollBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NavigableScrollBox_SigilStoneMenu_C_SetScrollbarInputHint, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000030, "Member 'WBP_NavigableScrollBox_SigilStoneMenu_C_SetScrollbarInputHint::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NavigableScrollBox_SigilStoneMenu_C_SetScrollbarInputHint, CallFunc_TryGetBrushFromKey_OutBrush) == 0x000040, "Member 'WBP_NavigableScrollBox_SigilStoneMenu_C_SetScrollbarInputHint::CallFunc_TryGetBrushFromKey_OutBrush' has a wrong offset!");
static_assert(offsetof(WBP_NavigableScrollBox_SigilStoneMenu_C_SetScrollbarInputHint, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000110, "Member 'WBP_NavigableScrollBox_SigilStoneMenu_C_SetScrollbarInputHint::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NavigableScrollBox_SigilStoneMenu_C_SetScrollbarInputHint, K2Node_DynamicCast_AsTexture) == 0x000118, "Member 'WBP_NavigableScrollBox_SigilStoneMenu_C_SetScrollbarInputHint::K2Node_DynamicCast_AsTexture' has a wrong offset!");
static_assert(offsetof(WBP_NavigableScrollBox_SigilStoneMenu_C_SetScrollbarInputHint, K2Node_DynamicCast_bSuccess) == 0x000120, "Member 'WBP_NavigableScrollBox_SigilStoneMenu_C_SetScrollbarInputHint::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_NavigableScrollBox_SigilStoneMenu.WBP_NavigableScrollBox_SigilStoneMenu_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct WBP_NavigableScrollBox_SigilStoneMenu_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_NavigableScrollBox_SigilStoneMenu_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_NavigableScrollBox_SigilStoneMenu_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_NavigableScrollBox_SigilStoneMenu_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong size on WBP_NavigableScrollBox_SigilStoneMenu_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_NavigableScrollBox_SigilStoneMenu_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_NavigableScrollBox_SigilStoneMenu_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");

}

