#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Modern_Settings_SliderWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Altar_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Modern_Settings_SliderWidget.WBP_Modern_Settings_SliderWidget_C
// 0x0048 (0x0688 - 0x0640)
class UWBP_Modern_Settings_SliderWidget_C final : public UVModernSettingWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0640(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_OriginalImageTile_C*               FocusBackground;                                   // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModernPrefab_ControllerInputHint_C* HintKey;                                          // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AltarTextBlock_C*                  SettingsLabel;                                     // 0x0658(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Modern_Settings_Slider_C*          Slider;                                            // 0x0660(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           FocusColor;                                        // 0x0668(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           UnfocusColor;                                      // 0x0678(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void PreConstruct(bool IsDesignTime);
	void OnUnfocus();
	void OnSliderValueChanged(double NewValue);
	void OnSettingChanged(const struct FModernSettingTableRow& NewSettingRow);
	void OnFocus();
	void OnConsoleVariableChanged();
	void InitializeWidget();
	void ExecuteUbergraph_WBP_Modern_Settings_SliderWidget(int32 EntryPoint);
	void CREATEDELEGATE_PROXYFUNCTION_0(float CommitedValue);
	void Construct();
	void OnRefreshWidgetRequested(float Value);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Modern_Settings_SliderWidget_C">();
	}
	static class UWBP_Modern_Settings_SliderWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Modern_Settings_SliderWidget_C>();
	}
};
static_assert(alignof(UWBP_Modern_Settings_SliderWidget_C) == 0x000008, "Wrong alignment on UWBP_Modern_Settings_SliderWidget_C");
static_assert(sizeof(UWBP_Modern_Settings_SliderWidget_C) == 0x000688, "Wrong size on UWBP_Modern_Settings_SliderWidget_C");
static_assert(offsetof(UWBP_Modern_Settings_SliderWidget_C, UberGraphFrame) == 0x000640, "Member 'UWBP_Modern_Settings_SliderWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_SliderWidget_C, FocusBackground) == 0x000648, "Member 'UWBP_Modern_Settings_SliderWidget_C::FocusBackground' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_SliderWidget_C, HintKey) == 0x000650, "Member 'UWBP_Modern_Settings_SliderWidget_C::HintKey' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_SliderWidget_C, SettingsLabel) == 0x000658, "Member 'UWBP_Modern_Settings_SliderWidget_C::SettingsLabel' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_SliderWidget_C, Slider) == 0x000660, "Member 'UWBP_Modern_Settings_SliderWidget_C::Slider' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_SliderWidget_C, FocusColor) == 0x000668, "Member 'UWBP_Modern_Settings_SliderWidget_C::FocusColor' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_SliderWidget_C, UnfocusColor) == 0x000678, "Member 'UWBP_Modern_Settings_SliderWidget_C::UnfocusColor' has a wrong offset!");

}

