#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Graphics_TogglerButtons2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Altar_structs.hpp"


namespace SDK::Params
{

// Function WBP_Graphics_TogglerButtons2.WBP_Graphics_TogglerButtons2_C.ButtonSwitch
// 0x0004 (0x0004 - 0x0000)
struct WBP_Graphics_TogglerButtons2_C_ButtonSwitch final
{
public:
	bool                                          Btn1On;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Btn2On;                                            // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Graphics_TogglerButtons2_C_ButtonSwitch) == 0x000001, "Wrong alignment on WBP_Graphics_TogglerButtons2_C_ButtonSwitch");
static_assert(sizeof(WBP_Graphics_TogglerButtons2_C_ButtonSwitch) == 0x000004, "Wrong size on WBP_Graphics_TogglerButtons2_C_ButtonSwitch");
static_assert(offsetof(WBP_Graphics_TogglerButtons2_C_ButtonSwitch, Btn1On) == 0x000000, "Member 'WBP_Graphics_TogglerButtons2_C_ButtonSwitch::Btn1On' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons2_C_ButtonSwitch, Btn2On) == 0x000001, "Member 'WBP_Graphics_TogglerButtons2_C_ButtonSwitch::Btn2On' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons2_C_ButtonSwitch, CallFunc_Not_PreBool_ReturnValue) == 0x000002, "Member 'WBP_Graphics_TogglerButtons2_C_ButtonSwitch::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons2_C_ButtonSwitch, CallFunc_Not_PreBool_ReturnValue_1) == 0x000003, "Member 'WBP_Graphics_TogglerButtons2_C_ButtonSwitch::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");

// Function WBP_Graphics_TogglerButtons2.WBP_Graphics_TogglerButtons2_C.ExecuteUbergraph_WBP_Graphics_TogglerButtons2
// 0x02D8 (0x02D8 - 0x0000)
struct WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0018(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0028(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0040(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0058(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_3;                          // 0x0068(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x0078(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_3;                     // 0x0090(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_4;                          // 0x00A8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_4;                     // 0x00B8(0x0018)()
	class FText                                   CallFunc_Array_Get_Item;                           // 0x00D0(0x0018)()
	class FText                                   CallFunc_Array_Get_Item_1;                         // 0x00E8(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_5;                          // 0x0100(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_5;                     // 0x0110(0x0018)()
	class FText                                   CallFunc_GetLabel_ReturnValue;                     // 0x0128(0x0018)(ConstParm)
	class FText                                   CallFunc_GetLabel_ReturnValue_1;                   // 0x0140(0x0018)(ConstParm)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0158(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetLabel_ReturnValue_2;                   // 0x0168(0x0018)(ConstParm)
	class UWBP_GraphicsPanel_C*                   K2Node_DynamicCast_AsWBP_Graphics_Panel;           // 0x0180(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_GraphicsPanel_C*                   K2Node_DynamicCast_AsWBP_Graphics_Panel_1;         // 0x0190(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_6;                          // 0x01A0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_GetLabel_ReturnValue_3;                   // 0x01B0(0x0018)(ConstParm)
	class FText                                   CallFunc_Format_ReturnValue_6;                     // 0x01C8(0x0018)()
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue;          // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue_1;        // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E2[0x6];                                      // 0x01E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_7;                          // 0x01E8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_GetLabel_ReturnValue_4;                   // 0x01F8(0x0018)(ConstParm)
	class FText                                   CallFunc_Format_ReturnValue_7;                     // 0x0210(0x0018)()
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue_2;        // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue_3;        // 0x0229(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22A[0x6];                                      // 0x022A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetLabel_ReturnValue_5;                   // 0x0230(0x0018)(ConstParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_8;                          // 0x0248(0x0010)(ReferenceParm)
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue_4;        // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue_8;                     // 0x0260(0x0018)()
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue_5;        // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_279[0x7];                                      // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetLabel_ReturnValue_6;                   // 0x0280(0x0018)(ConstParm)
	class FText                                   CallFunc_GetLabel_ReturnValue_7;                   // 0x0298(0x0018)(ConstParm)
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue_6;        // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue_7;        // 0x02B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B2[0x6];                                      // 0x02B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetLabel_ReturnValue_8;                   // 0x02B8(0x0018)(ConstParm)
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue_8;        // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2) == 0x000008, "Wrong alignment on WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2");
static_assert(sizeof(WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2) == 0x0002D8, "Wrong size on WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2");
static_assert(offsetof(WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2, EntryPoint) == 0x000000, "Member 'WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2, K2Node_MakeArray_Array) == 0x000008, "Member 'WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2, K2Node_MakeArray_Array_1) == 0x000018, "Member 'WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2, CallFunc_Format_ReturnValue) == 0x000028, "Member 'WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2, CallFunc_Format_ReturnValue_1) == 0x000040, "Member 'WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2, K2Node_MakeArray_Array_2) == 0x000058, "Member 'WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2, K2Node_MakeArray_Array_3) == 0x000068, "Member 'WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2, CallFunc_Format_ReturnValue_2) == 0x000078, "Member 'WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2::CallFunc_Format_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2, CallFunc_Format_ReturnValue_3) == 0x000090, "Member 'WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2::CallFunc_Format_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2, K2Node_MakeArray_Array_4) == 0x0000A8, "Member 'WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2::K2Node_MakeArray_Array_4' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2, CallFunc_Format_ReturnValue_4) == 0x0000B8, "Member 'WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2::CallFunc_Format_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2, CallFunc_Array_Get_Item) == 0x0000D0, "Member 'WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2, CallFunc_Array_Get_Item_1) == 0x0000E8, "Member 'WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2, K2Node_MakeArray_Array_5) == 0x000100, "Member 'WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2::K2Node_MakeArray_Array_5' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2, CallFunc_Format_ReturnValue_5) == 0x000110, "Member 'WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2::CallFunc_Format_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2, CallFunc_GetLabel_ReturnValue) == 0x000128, "Member 'WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2::CallFunc_GetLabel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2, CallFunc_GetLabel_ReturnValue_1) == 0x000140, "Member 'WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2::CallFunc_GetLabel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2, K2Node_CreateDelegate_OutputDelegate) == 0x000158, "Member 'WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2, CallFunc_GetLabel_ReturnValue_2) == 0x000168, "Member 'WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2::CallFunc_GetLabel_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2, K2Node_DynamicCast_AsWBP_Graphics_Panel) == 0x000180, "Member 'WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2::K2Node_DynamicCast_AsWBP_Graphics_Panel' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2, K2Node_DynamicCast_bSuccess) == 0x000188, "Member 'WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2, K2Node_DynamicCast_AsWBP_Graphics_Panel_1) == 0x000190, "Member 'WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2::K2Node_DynamicCast_AsWBP_Graphics_Panel_1' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2, K2Node_DynamicCast_bSuccess_1) == 0x000198, "Member 'WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2, K2Node_MakeArray_Array_6) == 0x0001A0, "Member 'WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2::K2Node_MakeArray_Array_6' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2, CallFunc_GetLabel_ReturnValue_3) == 0x0001B0, "Member 'WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2::CallFunc_GetLabel_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2, CallFunc_Format_ReturnValue_6) == 0x0001C8, "Member 'WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2::CallFunc_Format_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2, CallFunc_EqualEqual_TextText_ReturnValue) == 0x0001E0, "Member 'WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2::CallFunc_EqualEqual_TextText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2, CallFunc_EqualEqual_TextText_ReturnValue_1) == 0x0001E1, "Member 'WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2::CallFunc_EqualEqual_TextText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2, K2Node_MakeArray_Array_7) == 0x0001E8, "Member 'WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2::K2Node_MakeArray_Array_7' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2, CallFunc_GetLabel_ReturnValue_4) == 0x0001F8, "Member 'WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2::CallFunc_GetLabel_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2, CallFunc_Format_ReturnValue_7) == 0x000210, "Member 'WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2::CallFunc_Format_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2, CallFunc_EqualEqual_TextText_ReturnValue_2) == 0x000228, "Member 'WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2::CallFunc_EqualEqual_TextText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2, CallFunc_EqualEqual_TextText_ReturnValue_3) == 0x000229, "Member 'WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2::CallFunc_EqualEqual_TextText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2, CallFunc_GetLabel_ReturnValue_5) == 0x000230, "Member 'WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2::CallFunc_GetLabel_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2, K2Node_MakeArray_Array_8) == 0x000248, "Member 'WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2::K2Node_MakeArray_Array_8' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2, CallFunc_EqualEqual_TextText_ReturnValue_4) == 0x000258, "Member 'WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2::CallFunc_EqualEqual_TextText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2, CallFunc_Format_ReturnValue_8) == 0x000260, "Member 'WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2::CallFunc_Format_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2, CallFunc_EqualEqual_TextText_ReturnValue_5) == 0x000278, "Member 'WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2::CallFunc_EqualEqual_TextText_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2, CallFunc_GetLabel_ReturnValue_6) == 0x000280, "Member 'WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2::CallFunc_GetLabel_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2, CallFunc_GetLabel_ReturnValue_7) == 0x000298, "Member 'WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2::CallFunc_GetLabel_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2, CallFunc_EqualEqual_TextText_ReturnValue_6) == 0x0002B0, "Member 'WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2::CallFunc_EqualEqual_TextText_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2, CallFunc_EqualEqual_TextText_ReturnValue_7) == 0x0002B1, "Member 'WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2::CallFunc_EqualEqual_TextText_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2, CallFunc_GetLabel_ReturnValue_8) == 0x0002B8, "Member 'WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2::CallFunc_GetLabel_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2, CallFunc_EqualEqual_TextText_ReturnValue_8) == 0x0002D0, "Member 'WBP_Graphics_TogglerButtons2_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons2::CallFunc_EqualEqual_TextText_ReturnValue_8' has a wrong offset!");

// Function WBP_Graphics_TogglerButtons2.WBP_Graphics_TogglerButtons2_C.Refresh
// 0x0088 (0x0088 - 0x0000)
struct WBP_Graphics_TogglerButtons2_C_Refresh final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Array_Get_Item;                           // 0x0010(0x0018)()
	TArray<struct FOriginalVideoOption>           CallFunc_GetOptions_ReturnValue;                   // 0x0028(0x0010)(ConstParm, ReferenceParm)
	class FText                                   CallFunc_GetLabel_ReturnValue;                     // 0x0038(0x0018)(ConstParm)
	struct FOriginalVideoOption                   CallFunc_Array_Get_Item_1;                         // 0x0050(0x0028)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Graphics_TogglerButtons2_C_Refresh) == 0x000008, "Wrong alignment on WBP_Graphics_TogglerButtons2_C_Refresh");
static_assert(sizeof(WBP_Graphics_TogglerButtons2_C_Refresh) == 0x000088, "Wrong size on WBP_Graphics_TogglerButtons2_C_Refresh");
static_assert(offsetof(WBP_Graphics_TogglerButtons2_C_Refresh, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_Graphics_TogglerButtons2_C_Refresh::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons2_C_Refresh, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_Graphics_TogglerButtons2_C_Refresh::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons2_C_Refresh, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_Graphics_TogglerButtons2_C_Refresh::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons2_C_Refresh, CallFunc_Array_Get_Item) == 0x000010, "Member 'WBP_Graphics_TogglerButtons2_C_Refresh::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons2_C_Refresh, CallFunc_GetOptions_ReturnValue) == 0x000028, "Member 'WBP_Graphics_TogglerButtons2_C_Refresh::CallFunc_GetOptions_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons2_C_Refresh, CallFunc_GetLabel_ReturnValue) == 0x000038, "Member 'WBP_Graphics_TogglerButtons2_C_Refresh::CallFunc_GetLabel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons2_C_Refresh, CallFunc_Array_Get_Item_1) == 0x000050, "Member 'WBP_Graphics_TogglerButtons2_C_Refresh::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons2_C_Refresh, CallFunc_Array_Length_ReturnValue) == 0x000078, "Member 'WBP_Graphics_TogglerButtons2_C_Refresh::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons2_C_Refresh, CallFunc_Array_Add_ReturnValue) == 0x00007C, "Member 'WBP_Graphics_TogglerButtons2_C_Refresh::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons2_C_Refresh, CallFunc_Less_IntInt_ReturnValue) == 0x000080, "Member 'WBP_Graphics_TogglerButtons2_C_Refresh::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_Graphics_TogglerButtons2.WBP_Graphics_TogglerButtons2_C.RefreshSoftwareRaytracingQualityOptions
// 0x0028 (0x0028 - 0x0000)
struct WBP_Graphics_TogglerButtons2_C_RefreshSoftwareRaytracingQualityOptions final
{
public:
	int32                                         CallFunc_SoftwareRaytracingQuality_ReturnValue;    // 0x0000(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Array_Get_Item;                           // 0x0008(0x0018)()
	bool                                          CallFunc_IsHardwareRayTracingSupportedByBuild_ReturnValue; // 0x0020(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHardrwareRayTracingOn_ReturnValue;      // 0x0021(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Graphics_TogglerButtons2_C_RefreshSoftwareRaytracingQualityOptions) == 0x000008, "Wrong alignment on WBP_Graphics_TogglerButtons2_C_RefreshSoftwareRaytracingQualityOptions");
static_assert(sizeof(WBP_Graphics_TogglerButtons2_C_RefreshSoftwareRaytracingQualityOptions) == 0x000028, "Wrong size on WBP_Graphics_TogglerButtons2_C_RefreshSoftwareRaytracingQualityOptions");
static_assert(offsetof(WBP_Graphics_TogglerButtons2_C_RefreshSoftwareRaytracingQualityOptions, CallFunc_SoftwareRaytracingQuality_ReturnValue) == 0x000000, "Member 'WBP_Graphics_TogglerButtons2_C_RefreshSoftwareRaytracingQualityOptions::CallFunc_SoftwareRaytracingQuality_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons2_C_RefreshSoftwareRaytracingQualityOptions, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000004, "Member 'WBP_Graphics_TogglerButtons2_C_RefreshSoftwareRaytracingQualityOptions::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons2_C_RefreshSoftwareRaytracingQualityOptions, CallFunc_Array_Get_Item) == 0x000008, "Member 'WBP_Graphics_TogglerButtons2_C_RefreshSoftwareRaytracingQualityOptions::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons2_C_RefreshSoftwareRaytracingQualityOptions, CallFunc_IsHardwareRayTracingSupportedByBuild_ReturnValue) == 0x000020, "Member 'WBP_Graphics_TogglerButtons2_C_RefreshSoftwareRaytracingQualityOptions::CallFunc_IsHardwareRayTracingSupportedByBuild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons2_C_RefreshSoftwareRaytracingQualityOptions, CallFunc_IsHardrwareRayTracingOn_ReturnValue) == 0x000021, "Member 'WBP_Graphics_TogglerButtons2_C_RefreshSoftwareRaytracingQualityOptions::CallFunc_IsHardrwareRayTracingOn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons2_C_RefreshSoftwareRaytracingQualityOptions, CallFunc_BooleanAND_ReturnValue) == 0x000022, "Member 'WBP_Graphics_TogglerButtons2_C_RefreshSoftwareRaytracingQualityOptions::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_Graphics_TogglerButtons2.WBP_Graphics_TogglerButtons2_C.RefreshToggleFSRFrameGenerationOptions
// 0x0028 (0x0028 - 0x0000)
struct WBP_Graphics_TogglerButtons2_C_RefreshToggleFSRFrameGenerationOptions final
{
public:
	int32                                         CallFunc_GetConsoleVariableIntValue_ReturnValue;   // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetConsoleVariableIntValue_ReturnValue_1; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Array_Get_Item;                           // 0x0010(0x0018)()
};
static_assert(alignof(WBP_Graphics_TogglerButtons2_C_RefreshToggleFSRFrameGenerationOptions) == 0x000008, "Wrong alignment on WBP_Graphics_TogglerButtons2_C_RefreshToggleFSRFrameGenerationOptions");
static_assert(sizeof(WBP_Graphics_TogglerButtons2_C_RefreshToggleFSRFrameGenerationOptions) == 0x000028, "Wrong size on WBP_Graphics_TogglerButtons2_C_RefreshToggleFSRFrameGenerationOptions");
static_assert(offsetof(WBP_Graphics_TogglerButtons2_C_RefreshToggleFSRFrameGenerationOptions, CallFunc_GetConsoleVariableIntValue_ReturnValue) == 0x000000, "Member 'WBP_Graphics_TogglerButtons2_C_RefreshToggleFSRFrameGenerationOptions::CallFunc_GetConsoleVariableIntValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons2_C_RefreshToggleFSRFrameGenerationOptions, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000004, "Member 'WBP_Graphics_TogglerButtons2_C_RefreshToggleFSRFrameGenerationOptions::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons2_C_RefreshToggleFSRFrameGenerationOptions, CallFunc_GetConsoleVariableIntValue_ReturnValue_1) == 0x000008, "Member 'WBP_Graphics_TogglerButtons2_C_RefreshToggleFSRFrameGenerationOptions::CallFunc_GetConsoleVariableIntValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons2_C_RefreshToggleFSRFrameGenerationOptions, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x00000C, "Member 'WBP_Graphics_TogglerButtons2_C_RefreshToggleFSRFrameGenerationOptions::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons2_C_RefreshToggleFSRFrameGenerationOptions, CallFunc_Array_Get_Item) == 0x000010, "Member 'WBP_Graphics_TogglerButtons2_C_RefreshToggleFSRFrameGenerationOptions::CallFunc_Array_Get_Item' has a wrong offset!");

// Function WBP_Graphics_TogglerButtons2.WBP_Graphics_TogglerButtons2_C.RefreshToggleFSROptions
// 0x0020 (0x0020 - 0x0000)
struct WBP_Graphics_TogglerButtons2_C_RefreshToggleFSROptions final
{
public:
	int32                                         CallFunc_GetConsoleVariableIntValue_ReturnValue;   // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Array_Get_Item;                           // 0x0008(0x0018)()
};
static_assert(alignof(WBP_Graphics_TogglerButtons2_C_RefreshToggleFSROptions) == 0x000008, "Wrong alignment on WBP_Graphics_TogglerButtons2_C_RefreshToggleFSROptions");
static_assert(sizeof(WBP_Graphics_TogglerButtons2_C_RefreshToggleFSROptions) == 0x000020, "Wrong size on WBP_Graphics_TogglerButtons2_C_RefreshToggleFSROptions");
static_assert(offsetof(WBP_Graphics_TogglerButtons2_C_RefreshToggleFSROptions, CallFunc_GetConsoleVariableIntValue_ReturnValue) == 0x000000, "Member 'WBP_Graphics_TogglerButtons2_C_RefreshToggleFSROptions::CallFunc_GetConsoleVariableIntValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons2_C_RefreshToggleFSROptions, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000004, "Member 'WBP_Graphics_TogglerButtons2_C_RefreshToggleFSROptions::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons2_C_RefreshToggleFSROptions, CallFunc_Array_Get_Item) == 0x000008, "Member 'WBP_Graphics_TogglerButtons2_C_RefreshToggleFSROptions::CallFunc_Array_Get_Item' has a wrong offset!");

// Function WBP_Graphics_TogglerButtons2.WBP_Graphics_TogglerButtons2_C.RefreshToggleHardwareRaytracingOptions
// 0x0003 (0x0003 - 0x0000)
struct WBP_Graphics_TogglerButtons2_C_RefreshToggleHardwareRaytracingOptions final
{
public:
	bool                                          CallFunc_IsHardrwareRayTracingOn_ReturnValue;      // 0x0000(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHardwareRayTracingSupportedByHardware_ReturnValue; // 0x0001(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHardwareRayTracingSupportedByBuild_ReturnValue; // 0x0002(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Graphics_TogglerButtons2_C_RefreshToggleHardwareRaytracingOptions) == 0x000001, "Wrong alignment on WBP_Graphics_TogglerButtons2_C_RefreshToggleHardwareRaytracingOptions");
static_assert(sizeof(WBP_Graphics_TogglerButtons2_C_RefreshToggleHardwareRaytracingOptions) == 0x000003, "Wrong size on WBP_Graphics_TogglerButtons2_C_RefreshToggleHardwareRaytracingOptions");
static_assert(offsetof(WBP_Graphics_TogglerButtons2_C_RefreshToggleHardwareRaytracingOptions, CallFunc_IsHardrwareRayTracingOn_ReturnValue) == 0x000000, "Member 'WBP_Graphics_TogglerButtons2_C_RefreshToggleHardwareRaytracingOptions::CallFunc_IsHardrwareRayTracingOn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons2_C_RefreshToggleHardwareRaytracingOptions, CallFunc_IsHardwareRayTracingSupportedByHardware_ReturnValue) == 0x000001, "Member 'WBP_Graphics_TogglerButtons2_C_RefreshToggleHardwareRaytracingOptions::CallFunc_IsHardwareRayTracingSupportedByHardware_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons2_C_RefreshToggleHardwareRaytracingOptions, CallFunc_IsHardwareRayTracingSupportedByBuild_ReturnValue) == 0x000002, "Member 'WBP_Graphics_TogglerButtons2_C_RefreshToggleHardwareRaytracingOptions::CallFunc_IsHardwareRayTracingSupportedByBuild_ReturnValue' has a wrong offset!");

// Function WBP_Graphics_TogglerButtons2.WBP_Graphics_TogglerButtons2_C.RefreshToggleXessOptions
// 0x0020 (0x0020 - 0x0000)
struct WBP_Graphics_TogglerButtons2_C_RefreshToggleXessOptions final
{
public:
	int32                                         CallFunc_GetConsoleVariableIntValue_ReturnValue;   // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Array_Get_Item;                           // 0x0008(0x0018)()
};
static_assert(alignof(WBP_Graphics_TogglerButtons2_C_RefreshToggleXessOptions) == 0x000008, "Wrong alignment on WBP_Graphics_TogglerButtons2_C_RefreshToggleXessOptions");
static_assert(sizeof(WBP_Graphics_TogglerButtons2_C_RefreshToggleXessOptions) == 0x000020, "Wrong size on WBP_Graphics_TogglerButtons2_C_RefreshToggleXessOptions");
static_assert(offsetof(WBP_Graphics_TogglerButtons2_C_RefreshToggleXessOptions, CallFunc_GetConsoleVariableIntValue_ReturnValue) == 0x000000, "Member 'WBP_Graphics_TogglerButtons2_C_RefreshToggleXessOptions::CallFunc_GetConsoleVariableIntValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons2_C_RefreshToggleXessOptions, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000004, "Member 'WBP_Graphics_TogglerButtons2_C_RefreshToggleXessOptions::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons2_C_RefreshToggleXessOptions, CallFunc_Array_Get_Item) == 0x000008, "Member 'WBP_Graphics_TogglerButtons2_C_RefreshToggleXessOptions::CallFunc_Array_Get_Item' has a wrong offset!");

// Function WBP_Graphics_TogglerButtons2.WBP_Graphics_TogglerButtons2_C.SetOptionText
// 0x0018 (0x0018 - 0x0000)
struct WBP_Graphics_TogglerButtons2_C_SetOptionText final
{
public:
	class FText                                   CallFunc_Array_Get_Item;                           // 0x0000(0x0018)()
};
static_assert(alignof(WBP_Graphics_TogglerButtons2_C_SetOptionText) == 0x000008, "Wrong alignment on WBP_Graphics_TogglerButtons2_C_SetOptionText");
static_assert(sizeof(WBP_Graphics_TogglerButtons2_C_SetOptionText) == 0x000018, "Wrong size on WBP_Graphics_TogglerButtons2_C_SetOptionText");
static_assert(offsetof(WBP_Graphics_TogglerButtons2_C_SetOptionText, CallFunc_Array_Get_Item) == 0x000000, "Member 'WBP_Graphics_TogglerButtons2_C_SetOptionText::CallFunc_Array_Get_Item' has a wrong offset!");

// Function WBP_Graphics_TogglerButtons2.WBP_Graphics_TogglerButtons2_C.UpdateValue
// 0x00E8 (0x00E8 - 0x0000)
struct WBP_Graphics_TogglerButtons2_C_UpdateValue final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetConsoleVariableStringValue_ReturnValue; // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetConsoleVariableIntValue_ReturnValue;   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetLabel_ReturnValue;                     // 0x0040(0x0018)(ConstParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0058(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0068(0x0018)()
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue;          // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82[0x2];                                       // 0x0082(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FOriginalVideoOption>           CallFunc_GetOptions_ReturnValue;                   // 0x0088(0x0010)(ConstParm, ReferenceParm)
	struct FOriginalVideoOption                   CallFunc_Array_Get_Item;                           // 0x0098(0x0028)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item_1;                         // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue_1;        // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DE[0x2];                                       // 0x00DE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Graphics_TogglerButtons2_C_UpdateValue) == 0x000008, "Wrong alignment on WBP_Graphics_TogglerButtons2_C_UpdateValue");
static_assert(sizeof(WBP_Graphics_TogglerButtons2_C_UpdateValue) == 0x0000E8, "Wrong size on WBP_Graphics_TogglerButtons2_C_UpdateValue");
static_assert(offsetof(WBP_Graphics_TogglerButtons2_C_UpdateValue, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'WBP_Graphics_TogglerButtons2_C_UpdateValue::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons2_C_UpdateValue, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'WBP_Graphics_TogglerButtons2_C_UpdateValue::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
