#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModernMenu_StatsPage4_ListView

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CommonInput_structs.hpp"
#include "Altar_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_ModernMenu_StatsPage4_ListView.WBP_ModernMenu_StatsPage4_ListView_C.Clear
// 0x0008 (0x0008 - 0x0000)
struct WBP_ModernMenu_StatsPage4_ListView_C_Clear final
{
public:
	class UCommonListView*                        CallFunc_GetListView_ReturnValue;                  // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_StatsPage4_ListView_C_Clear) == 0x000008, "Wrong alignment on WBP_ModernMenu_StatsPage4_ListView_C_Clear");
static_assert(sizeof(WBP_ModernMenu_StatsPage4_ListView_C_Clear) == 0x000008, "Wrong size on WBP_ModernMenu_StatsPage4_ListView_C_Clear");
static_assert(offsetof(WBP_ModernMenu_StatsPage4_ListView_C_Clear, CallFunc_GetListView_ReturnValue) == 0x000000, "Member 'WBP_ModernMenu_StatsPage4_ListView_C_Clear::CallFunc_GetListView_ReturnValue' has a wrong offset!");

// Function WBP_ModernMenu_StatsPage4_ListView.WBP_ModernMenu_StatsPage4_ListView_C.ExecuteUbergraph_WBP_ModernMenu_StatsPage4_ListView
// 0x0068 (0x0068 - 0x0000)
struct WBP_ModernMenu_StatsPage4_ListView_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage4_ListView final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable;                                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_2;                              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_3;                              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonListView*                        CallFunc_GetListView_ReturnValue;                  // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate;            // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              K2Node_CustomEvent_NewInputType;                   // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonListView*                        CallFunc_GetListView_ReturnValue_1;                // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_StatsPage4_ListView_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage4_ListView) == 0x000008, "Wrong alignment on WBP_ModernMenu_StatsPage4_ListView_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage4_ListView");
static_assert(sizeof(WBP_ModernMenu_StatsPage4_ListView_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage4_ListView) == 0x000068, "Wrong size on WBP_ModernMenu_StatsPage4_ListView_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage4_ListView");
static_assert(offsetof(WBP_ModernMenu_StatsPage4_ListView_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage4_ListView, EntryPoint) == 0x000000, "Member 'WBP_ModernMenu_StatsPage4_ListView_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage4_ListView::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage4_ListView_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage4_ListView, Temp_byte_Variable) == 0x000004, "Member 'WBP_ModernMenu_StatsPage4_ListView_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage4_ListView::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage4_ListView_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage4_ListView, Temp_real_Variable) == 0x000008, "Member 'WBP_ModernMenu_StatsPage4_ListView_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage4_ListView::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage4_ListView_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage4_ListView, Temp_real_Variable_1) == 0x00000C, "Member 'WBP_ModernMenu_StatsPage4_ListView_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage4_ListView::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage4_ListView_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage4_ListView, Temp_real_Variable_2) == 0x000010, "Member 'WBP_ModernMenu_StatsPage4_ListView_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage4_ListView::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage4_ListView_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage4_ListView, Temp_real_Variable_3) == 0x000014, "Member 'WBP_ModernMenu_StatsPage4_ListView_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage4_ListView::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage4_ListView_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage4_ListView, K2Node_Event_IsDesignTime) == 0x000018, "Member 'WBP_ModernMenu_StatsPage4_ListView_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage4_ListView::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage4_ListView_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage4_ListView, CallFunc_GetListView_ReturnValue) == 0x000020, "Member 'WBP_ModernMenu_StatsPage4_ListView_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage4_ListView::CallFunc_GetListView_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage4_ListView_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage4_ListView, CallFunc_GetPlayerController_ReturnValue) == 0x000028, "Member 'WBP_ModernMenu_StatsPage4_ListView_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage4_ListView::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage4_ListView_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage4_ListView, K2Node_CreateDelegate_OutputDelegate) == 0x000030, "Member 'WBP_ModernMenu_StatsPage4_ListView_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage4_ListView::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage4_ListView_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage4_ListView, CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue) == 0x000040, "Member 'WBP_ModernMenu_StatsPage4_ListView_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage4_ListView::CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage4_ListView_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage4_ListView, K2Node_CustomEvent_NewInputType) == 0x000048, "Member 'WBP_ModernMenu_StatsPage4_ListView_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage4_ListView::K2Node_CustomEvent_NewInputType' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage4_ListView_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage4_ListView, CallFunc_GetListView_ReturnValue_1) == 0x000050, "Member 'WBP_ModernMenu_StatsPage4_ListView_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage4_ListView::CallFunc_GetListView_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage4_ListView_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage4_ListView, K2Node_Select_Default) == 0x000058, "Member 'WBP_ModernMenu_StatsPage4_ListView_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage4_ListView::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage4_ListView_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage4_ListView, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000060, "Member 'WBP_ModernMenu_StatsPage4_ListView_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage4_ListView::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function WBP_ModernMenu_StatsPage4_ListView.WBP_ModernMenu_StatsPage4_ListView_C.OnInputMethodChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_ModernMenu_StatsPage4_ListView_C_OnInputMethodChanged final
{
public:
	ECommonInputType                              NewInputType;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_StatsPage4_ListView_C_OnInputMethodChanged) == 0x000001, "Wrong alignment on WBP_ModernMenu_StatsPage4_ListView_C_OnInputMethodChanged");
static_assert(sizeof(WBP_ModernMenu_StatsPage4_ListView_C_OnInputMethodChanged) == 0x000001, "Wrong size on WBP_ModernMenu_StatsPage4_ListView_C_OnInputMethodChanged");
static_assert(offsetof(WBP_ModernMenu_StatsPage4_ListView_C_OnInputMethodChanged, NewInputType) == 0x000000, "Member 'WBP_ModernMenu_StatsPage4_ListView_C_OnInputMethodChanged::NewInputType' has a wrong offset!");

// Function WBP_ModernMenu_StatsPage4_ListView.WBP_ModernMenu_StatsPage4_ListView_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_ModernMenu_StatsPage4_ListView_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_StatsPage4_ListView_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_ModernMenu_StatsPage4_ListView_C_PreConstruct");
static_assert(sizeof(WBP_ModernMenu_StatsPage4_ListView_C_PreConstruct) == 0x000001, "Wrong size on WBP_ModernMenu_StatsPage4_ListView_C_PreConstruct");
static_assert(offsetof(WBP_ModernMenu_StatsPage4_ListView_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_ModernMenu_StatsPage4_ListView_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_ModernMenu_StatsPage4_ListView.WBP_ModernMenu_StatsPage4_ListView_C.SetScrollbarInputHint
// 0x0100 (0x0100 - 0x0000)
struct WBP_ModernMenu_StatsPage4_ListView_C_SetScrollbarInputHint final
{
public:
	class UVAltarUISubsystem*                     CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonListView*                        CallFunc_GetListView_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            CallFunc_TryGetBrushFromKey_OutBrush;              // 0x0010(0x00D0)()
	class UTexture*                               K2Node_DynamicCast_AsTexture;                      // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_StatsPage4_ListView_C_SetScrollbarInputHint) == 0x000010, "Wrong alignment on WBP_ModernMenu_StatsPage4_ListView_C_SetScrollbarInputHint");
static_assert(sizeof(WBP_ModernMenu_StatsPage4_ListView_C_SetScrollbarInputHint) == 0x000100, "Wrong size on WBP_ModernMenu_StatsPage4_ListView_C_SetScrollbarInputHint");
static_assert(offsetof(WBP_ModernMenu_StatsPage4_ListView_C_SetScrollbarInputHint, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000000, "Member 'WBP_ModernMenu_StatsPage4_ListView_C_SetScrollbarInputHint::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage4_ListView_C_SetScrollbarInputHint, CallFunc_GetListView_ReturnValue) == 0x000008, "Member 'WBP_ModernMenu_StatsPage4_ListView_C_SetScrollbarInputHint::CallFunc_GetListView_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage4_ListView_C_SetScrollbarInputHint, CallFunc_TryGetBrushFromKey_OutBrush) == 0x000010, "Member 'WBP_ModernMenu_StatsPage4_ListView_C_SetScrollbarInputHint::CallFunc_TryGetBrushFromKey_OutBrush' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage4_ListView_C_SetScrollbarInputHint, K2Node_DynamicCast_AsTexture) == 0x0000E0, "Member 'WBP_ModernMenu_StatsPage4_ListView_C_SetScrollbarInputHint::K2Node_DynamicCast_AsTexture' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage4_ListView_C_SetScrollbarInputHint, K2Node_DynamicCast_bSuccess) == 0x0000E8, "Member 'WBP_ModernMenu_StatsPage4_ListView_C_SetScrollbarInputHint::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage4_ListView_C_SetScrollbarInputHint, CallFunc_GetDynamicMaterial_ReturnValue) == 0x0000F0, "Member 'WBP_ModernMenu_StatsPage4_ListView_C_SetScrollbarInputHint::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function WBP_ModernMenu_StatsPage4_ListView.WBP_ModernMenu_StatsPage4_ListView_C.UpdateFactions
// 0x0128 (0x0128 - 0x0000)
struct WBP_ModernMenu_StatsPage4_ListView_C_UpdateFactions final
{
public:
	TArray<struct FLegacyStatsMenuFactionProperties> NewFactions;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FLegacyStatsMenuFactionProperties      Local_CurrentFaction;                              // 0x0010(0x0058)(Edit, BlueprintVisible)
	class UVLegacyStatsMenuFaction*               Local_CurrentFactionWidget;                        // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFactionEmpty;                                    // 0x0070(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_76[0x2];                                       // 0x0076(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UVLegacyStatsMenuFaction*               CallFunc_SpawnObject_ReturnValue;                  // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonListView*                        CallFunc_GetListView_ReturnValue;                  // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonListView*                        CallFunc_GetListView_ReturnValue_1;                // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonListView*                        CallFunc_GetListView_ReturnValue_2;                // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonListView*                        CallFunc_GetListView_ReturnValue_3;                // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FLegacyStatsMenuFactionProperties      CallFunc_Array_Get_Item;                           // 0x00C8(0x0058)()
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_StatsPage4_ListView_C_UpdateFactions) == 0x000008, "Wrong alignment on WBP_ModernMenu_StatsPage4_ListView_C_UpdateFactions");
static_assert(sizeof(WBP_ModernMenu_StatsPage4_ListView_C_UpdateFactions) == 0x000128, "Wrong size on WBP_ModernMenu_StatsPage4_ListView_C_UpdateFactions");
static_assert(offsetof(WBP_ModernMenu_StatsPage4_ListView_C_UpdateFactions, NewFactions) == 0x000000, "Member 'WBP_ModernMenu_StatsPage4_ListView_C_UpdateFactions::NewFactions' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage4_ListView_C_UpdateFactions, Local_CurrentFaction) == 0x000010, "Member 'WBP_ModernMenu_StatsPage4_ListView_C_UpdateFactions::Local_CurrentFaction' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage4_ListView_C_UpdateFactions, Local_CurrentFactionWidget) == 0x000068, "Member 'WBP_ModernMenu_StatsPage4_ListView_C_UpdateFactions::Local_CurrentFactionWidget' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage4_ListView_C_UpdateFactions, IsFactionEmpty) == 0x000070, "Member 'WBP_ModernMenu_StatsPage4_ListView_C_UpdateFactions::IsFactionEmpty' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage4_ListView_C_UpdateFactions, Temp_byte_Variable) == 0x000071, "Member 'WBP_ModernMenu_StatsPage4_ListView_C_UpdateFactions::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage4_ListView_C_UpdateFactions, Temp_byte_Variable_1) == 0x000072, "Member 'WBP_ModernMenu_StatsPage4_ListView_C_UpdateFactions::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage4_ListView_C_UpdateFactions, Temp_bool_Variable) == 0x000073, "Member 'WBP_ModernMenu_StatsPage4_ListView_C_UpdateFactions::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage4_ListView_C_UpdateFactions, Temp_byte_Variable_2) == 0x000074, "Member 'WBP_ModernMenu_StatsPage4_ListView_C_UpdateFactions::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage4_ListView_C_UpdateFactions, Temp_byte_Variable_3) == 0x000075, "Member 'WBP_ModernMenu_StatsPage4_ListView_C_UpdateFactions::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage4_ListView_C_UpdateFactions, CallFunc_SpawnObject_ReturnValue) == 0x000078, "Member 'WBP_ModernMenu_StatsPage4_ListView_C_UpdateFactions::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage4_ListView_C_UpdateFactions, Temp_int_Array_Index_Variable) == 0x000080, "Member 'WBP_ModernMenu_StatsPage4_ListView_C_UpdateFactions::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage4_ListView_C_UpdateFactions, Temp_int_Loop_Counter_Variable) == 0x000084, "Member 'WBP_ModernMenu_StatsPage4_ListView_C_UpdateFactions::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage4_ListView_C_UpdateFactions, Temp_bool_Variable_1) == 0x000088, "Member 'WBP_ModernMenu_StatsPage4_ListView_C_UpdateFactions::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage4_ListView_C_UpdateFactions, CallFunc_Add_IntInt_ReturnValue) == 0x00008C, "Member 'WBP_ModernMenu_StatsPage4_ListView_C_UpdateFactions::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage4_ListView_C_UpdateFactions, K2Node_Select_Default) == 0x000090, "Member 'WBP_ModernMenu_StatsPage4_ListView_C_UpdateFactions::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage4_ListView_C_UpdateFactions, CallFunc_GetListView_ReturnValue) == 0x000098, "Member 'WBP_ModernMenu_StatsPage4_ListView_C_UpdateFactions::CallFunc_GetListView_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage4_ListView_C_UpdateFactions, K2Node_Select_Default_1) == 0x0000A0, "Member 'WBP_ModernMenu_StatsPage4_ListView_C_UpdateFactions::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage4_ListView_C_UpdateFactions, CallFunc_GetListView_ReturnValue_1) == 0x0000A8, "Member 'WBP_ModernMenu_StatsPage4_ListView_C_UpdateFactions::CallFunc_GetListView_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage4_ListView_C_UpdateFactions, CallFunc_Array_Length_ReturnValue) == 0x0000B0, "Member 'WBP_ModernMenu_StatsPage4_ListView_C_UpdateFactions::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage4_ListView_C_UpdateFactions, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000B4, "Member 'WBP_ModernMenu_StatsPage4_ListView_C_UpdateFactions::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage4_ListView_C_UpdateFactions, CallFunc_GetListView_ReturnValue_2) == 0x0000B8, "Member 'WBP_ModernMenu_StatsPage4_ListView_C_UpdateFactions::CallFunc_GetListView_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage4_ListView_C_UpdateFactions, CallFunc_GetListView_ReturnValue_3) == 0x0000C0, "Member 'WBP_ModernMenu_StatsPage4_ListView_C_UpdateFactions::CallFunc_GetListView_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage4_ListView_C_UpdateFactions, CallFunc_Array_Get_Item) == 0x0000C8, "Member 'WBP_ModernMenu_StatsPage4_ListView_C_UpdateFactions::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage4_ListView_C_UpdateFactions, CallFunc_Array_Length_ReturnValue_1) == 0x000120, "Member 'WBP_ModernMenu_StatsPage4_ListView_C_UpdateFactions::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage4_ListView_C_UpdateFactions, CallFunc_Less_IntInt_ReturnValue) == 0x000124, "Member 'WBP_ModernMenu_StatsPage4_ListView_C_UpdateFactions::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

}

