#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Modern_Settings_PresetsBox

#include "Basic.hpp"

#include "Altar_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_Modern_Settings_PresetsBox.WBP_Modern_Settings_PresetsBox_C.SelectPresets
// 0x0080 (0x0080 - 0x0000)
struct WBP_Modern_Settings_PresetsBox_C_SelectPresets final
{
public:
	int32                                         NewIndex;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDoIgnoreBroadcast;                                // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Local_SelectedLabel;                               // 0x0008(0x0018)(Edit, BlueprintVisible)
	class UWBP_Modern_Settings_Step_C*            Local_Button;                                      // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Local_Index;                                       // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Modern_Settings_Step_C*            CallFunc_Array_Get_Item;                           // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Settings_PresetsBox_C_SelectPresets) == 0x000008, "Wrong alignment on WBP_Modern_Settings_PresetsBox_C_SelectPresets");
static_assert(sizeof(WBP_Modern_Settings_PresetsBox_C_SelectPresets) == 0x000080, "Wrong size on WBP_Modern_Settings_PresetsBox_C_SelectPresets");
static_assert(offsetof(WBP_Modern_Settings_PresetsBox_C_SelectPresets, NewIndex) == 0x000000, "Member 'WBP_Modern_Settings_PresetsBox_C_SelectPresets::NewIndex' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_PresetsBox_C_SelectPresets, bDoIgnoreBroadcast) == 0x000004, "Member 'WBP_Modern_Settings_PresetsBox_C_SelectPresets::bDoIgnoreBroadcast' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_PresetsBox_C_SelectPresets, Local_SelectedLabel) == 0x000008, "Member 'WBP_Modern_Settings_PresetsBox_C_SelectPresets::Local_SelectedLabel' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_PresetsBox_C_SelectPresets, Local_Button) == 0x000020, "Member 'WBP_Modern_Settings_PresetsBox_C_SelectPresets::Local_Button' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_PresetsBox_C_SelectPresets, Local_Index) == 0x000028, "Member 'WBP_Modern_Settings_PresetsBox_C_SelectPresets::Local_Index' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_PresetsBox_C_SelectPresets, Temp_int_Array_Index_Variable) == 0x00002C, "Member 'WBP_Modern_Settings_PresetsBox_C_SelectPresets::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_PresetsBox_C_SelectPresets, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'WBP_Modern_Settings_PresetsBox_C_SelectPresets::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_PresetsBox_C_SelectPresets, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'WBP_Modern_Settings_PresetsBox_C_SelectPresets::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_PresetsBox_C_SelectPresets, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x000038, "Member 'WBP_Modern_Settings_PresetsBox_C_SelectPresets::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_PresetsBox_C_SelectPresets, CallFunc_Array_Length_ReturnValue) == 0x00003C, "Member 'WBP_Modern_Settings_PresetsBox_C_SelectPresets::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_PresetsBox_C_SelectPresets, CallFunc_Subtract_IntInt_ReturnValue) == 0x000040, "Member 'WBP_Modern_Settings_PresetsBox_C_SelectPresets::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_PresetsBox_C_SelectPresets, CallFunc_Conv_TextToString_ReturnValue) == 0x000048, "Member 'WBP_Modern_Settings_PresetsBox_C_SelectPresets::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_PresetsBox_C_SelectPresets, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000058, "Member 'WBP_Modern_Settings_PresetsBox_C_SelectPresets::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_PresetsBox_C_SelectPresets, CallFunc_Array_Length_ReturnValue_1) == 0x00005C, "Member 'WBP_Modern_Settings_PresetsBox_C_SelectPresets::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_PresetsBox_C_SelectPresets, CallFunc_Percent_IntInt_ReturnValue) == 0x000060, "Member 'WBP_Modern_Settings_PresetsBox_C_SelectPresets::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_PresetsBox_C_SelectPresets, CallFunc_Array_Get_Item) == 0x000068, "Member 'WBP_Modern_Settings_PresetsBox_C_SelectPresets::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_PresetsBox_C_SelectPresets, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000070, "Member 'WBP_Modern_Settings_PresetsBox_C_SelectPresets::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_PresetsBox_C_SelectPresets, CallFunc_Array_Length_ReturnValue_2) == 0x000074, "Member 'WBP_Modern_Settings_PresetsBox_C_SelectPresets::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_PresetsBox_C_SelectPresets, CallFunc_Less_IntInt_ReturnValue) == 0x000078, "Member 'WBP_Modern_Settings_PresetsBox_C_SelectPresets::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_Modern_Settings_PresetsBox.WBP_Modern_Settings_PresetsBox_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Modern_Settings_PresetsBox_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Settings_PresetsBox_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_Modern_Settings_PresetsBox_C_PreConstruct");
static_assert(sizeof(WBP_Modern_Settings_PresetsBox_C_PreConstruct) == 0x000001, "Wrong size on WBP_Modern_Settings_PresetsBox_C_PreConstruct");
static_assert(offsetof(WBP_Modern_Settings_PresetsBox_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_Modern_Settings_PresetsBox_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_Modern_Settings_PresetsBox.WBP_Modern_Settings_PresetsBox_C.PopulatePresets
// 0x0070 (0x0070 - 0x0000)
struct WBP_Modern_Settings_PresetsBox_C_PopulatePresets final
{
public:
	int32                                         StartIndex;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FModernSettingMultiCommand>     NewPresetsData;                                    // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UHorizontalBoxSlot*                     Local_CurrentSlot;                                 // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Modern_Settings_Step_C*            Local_CurrentStep;                                 // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Local_CurrentIndex;                                // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateChildSize                        K2Node_MakeStruct_SlateChildSize;                  // 0x002C(0x0008)(NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     K2Node_DynamicCast_AsHorizontal_Box_Slot;          // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Modern_Settings_Step_C*            CallFunc_Create_ReturnValue;                       // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetMaxDesiredHeight_InMaxDesiredHeight_ImplicitCast; // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Settings_PresetsBox_C_PopulatePresets) == 0x000008, "Wrong alignment on WBP_Modern_Settings_PresetsBox_C_PopulatePresets");
static_assert(sizeof(WBP_Modern_Settings_PresetsBox_C_PopulatePresets) == 0x000070, "Wrong size on WBP_Modern_Settings_PresetsBox_C_PopulatePresets");
static_assert(offsetof(WBP_Modern_Settings_PresetsBox_C_PopulatePresets, StartIndex) == 0x000000, "Member 'WBP_Modern_Settings_PresetsBox_C_PopulatePresets::StartIndex' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_PresetsBox_C_PopulatePresets, NewPresetsData) == 0x000008, "Member 'WBP_Modern_Settings_PresetsBox_C_PopulatePresets::NewPresetsData' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_PresetsBox_C_PopulatePresets, Local_CurrentSlot) == 0x000018, "Member 'WBP_Modern_Settings_PresetsBox_C_PopulatePresets::Local_CurrentSlot' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_PresetsBox_C_PopulatePresets, Local_CurrentStep) == 0x000020, "Member 'WBP_Modern_Settings_PresetsBox_C_PopulatePresets::Local_CurrentStep' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_PresetsBox_C_PopulatePresets, Local_CurrentIndex) == 0x000028, "Member 'WBP_Modern_Settings_PresetsBox_C_PopulatePresets::Local_CurrentIndex' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_PresetsBox_C_PopulatePresets, K2Node_MakeStruct_SlateChildSize) == 0x00002C, "Member 'WBP_Modern_Settings_PresetsBox_C_PopulatePresets::K2Node_MakeStruct_SlateChildSize' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_PresetsBox_C_PopulatePresets, Temp_int_Array_Index_Variable) == 0x000034, "Member 'WBP_Modern_Settings_PresetsBox_C_PopulatePresets::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_PresetsBox_C_PopulatePresets, Temp_int_Loop_Counter_Variable) == 0x000038, "Member 'WBP_Modern_Settings_PresetsBox_C_PopulatePresets::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_PresetsBox_C_PopulatePresets, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'WBP_Modern_Settings_PresetsBox_C_PopulatePresets::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_PresetsBox_C_PopulatePresets, CallFunc_AddChild_ReturnValue) == 0x000040, "Member 'WBP_Modern_Settings_PresetsBox_C_PopulatePresets::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_PresetsBox_C_PopulatePresets, K2Node_DynamicCast_AsHorizontal_Box_Slot) == 0x000048, "Member 'WBP_Modern_Settings_PresetsBox_C_PopulatePresets::K2Node_DynamicCast_AsHorizontal_Box_Slot' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_PresetsBox_C_PopulatePresets, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'WBP_Modern_Settings_PresetsBox_C_PopulatePresets::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_PresetsBox_C_PopulatePresets, CallFunc_Array_Add_ReturnValue) == 0x000054, "Member 'WBP_Modern_Settings_PresetsBox_C_PopulatePresets::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_PresetsBox_C_PopulatePresets, CallFunc_Create_ReturnValue) == 0x000058, "Member 'WBP_Modern_Settings_PresetsBox_C_PopulatePresets::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_PresetsBox_C_PopulatePresets, CallFunc_Array_Length_ReturnValue) == 0x000060, "Member 'WBP_Modern_Settings_PresetsBox_C_PopulatePresets::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_PresetsBox_C_PopulatePresets, CallFunc_Less_IntInt_ReturnValue) == 0x000064, "Member 'WBP_Modern_Settings_PresetsBox_C_PopulatePresets::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_PresetsBox_C_PopulatePresets, CallFunc_SetMaxDesiredHeight_InMaxDesiredHeight_ImplicitCast) == 0x000068, "Member 'WBP_Modern_Settings_PresetsBox_C_PopulatePresets::CallFunc_SetMaxDesiredHeight_InMaxDesiredHeight_ImplicitCast' has a wrong offset!");

// Function WBP_Modern_Settings_PresetsBox.WBP_Modern_Settings_PresetsBox_C.OnUnfocus
// 0x0020 (0x0020 - 0x0000)
struct WBP_Modern_Settings_PresetsBox_C_OnUnfocus final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Modern_Settings_Step_C*            CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Settings_PresetsBox_C_OnUnfocus) == 0x000008, "Wrong alignment on WBP_Modern_Settings_PresetsBox_C_OnUnfocus");
static_assert(sizeof(WBP_Modern_Settings_PresetsBox_C_OnUnfocus) == 0x000020, "Wrong size on WBP_Modern_Settings_PresetsBox_C_OnUnfocus");
static_assert(offsetof(WBP_Modern_Settings_PresetsBox_C_OnUnfocus, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_Modern_Settings_PresetsBox_C_OnUnfocus::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_PresetsBox_C_OnUnfocus, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_Modern_Settings_PresetsBox_C_OnUnfocus::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_PresetsBox_C_OnUnfocus, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_Modern_Settings_PresetsBox_C_OnUnfocus::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_PresetsBox_C_OnUnfocus, CallFunc_Array_Get_Item) == 0x000010, "Member 'WBP_Modern_Settings_PresetsBox_C_OnUnfocus::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_PresetsBox_C_OnUnfocus, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'WBP_Modern_Settings_PresetsBox_C_OnUnfocus::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_PresetsBox_C_OnUnfocus, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'WBP_Modern_Settings_PresetsBox_C_OnUnfocus::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_Modern_Settings_PresetsBox.WBP_Modern_Settings_PresetsBox_C.OnFocus
// 0x0020 (0x0020 - 0x0000)
struct WBP_Modern_Settings_PresetsBox_C_OnFocus final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Modern_Settings_Step_C*            CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Settings_PresetsBox_C_OnFocus) == 0x000008, "Wrong alignment on WBP_Modern_Settings_PresetsBox_C_OnFocus");
static_assert(sizeof(WBP_Modern_Settings_PresetsBox_C_OnFocus) == 0x000020, "Wrong size on WBP_Modern_Settings_PresetsBox_C_OnFocus");
static_assert(offsetof(WBP_Modern_Settings_PresetsBox_C_OnFocus, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_Modern_Settings_PresetsBox_C_OnFocus::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_PresetsBox_C_OnFocus, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_Modern_Settings_PresetsBox_C_OnFocus::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_PresetsBox_C_OnFocus, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_Modern_Settings_PresetsBox_C_OnFocus::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_PresetsBox_C_OnFocus, CallFunc_Array_Get_Item) == 0x000010, "Member 'WBP_Modern_Settings_PresetsBox_C_OnFocus::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_PresetsBox_C_OnFocus, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'WBP_Modern_Settings_PresetsBox_C_OnFocus::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_PresetsBox_C_OnFocus, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'WBP_Modern_Settings_PresetsBox_C_OnFocus::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_Modern_Settings_PresetsBox.WBP_Modern_Settings_PresetsBox_C.GetCurrentValue
// 0x0020 (0x0020 - 0x0000)
struct WBP_Modern_Settings_PresetsBox_C_GetCurrentValue final
{
public:
	class FString                                 Value;                                             // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Settings_PresetsBox_C_GetCurrentValue) == 0x000008, "Wrong alignment on WBP_Modern_Settings_PresetsBox_C_GetCurrentValue");
static_assert(sizeof(WBP_Modern_Settings_PresetsBox_C_GetCurrentValue) == 0x000020, "Wrong size on WBP_Modern_Settings_PresetsBox_C_GetCurrentValue");
static_assert(offsetof(WBP_Modern_Settings_PresetsBox_C_GetCurrentValue, Value) == 0x000000, "Member 'WBP_Modern_Settings_PresetsBox_C_GetCurrentValue::Value' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_PresetsBox_C_GetCurrentValue, CallFunc_Conv_TextToString_ReturnValue) == 0x000010, "Member 'WBP_Modern_Settings_PresetsBox_C_GetCurrentValue::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");

// Function WBP_Modern_Settings_PresetsBox.WBP_Modern_Settings_PresetsBox_C.GetCurrentIndex
// 0x0004 (0x0004 - 0x0000)
struct WBP_Modern_Settings_PresetsBox_C_GetCurrentIndex final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Settings_PresetsBox_C_GetCurrentIndex) == 0x000004, "Wrong alignment on WBP_Modern_Settings_PresetsBox_C_GetCurrentIndex");
static_assert(sizeof(WBP_Modern_Settings_PresetsBox_C_GetCurrentIndex) == 0x000004, "Wrong size on WBP_Modern_Settings_PresetsBox_C_GetCurrentIndex");
static_assert(offsetof(WBP_Modern_Settings_PresetsBox_C_GetCurrentIndex, Value) == 0x000000, "Member 'WBP_Modern_Settings_PresetsBox_C_GetCurrentIndex::Value' has a wrong offset!");

// Function WBP_Modern_Settings_PresetsBox.WBP_Modern_Settings_PresetsBox_C.ExecuteUbergraph_WBP_Modern_Settings_PresetsBox
// 0x000C (0x000C - 0x0000)
struct WBP_Modern_Settings_PresetsBox_C_ExecuteUbergraph_WBP_Modern_Settings_PresetsBox final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Settings_PresetsBox_C_ExecuteUbergraph_WBP_Modern_Settings_PresetsBox) == 0x000004, "Wrong alignment on WBP_Modern_Settings_PresetsBox_C_ExecuteUbergraph_WBP_Modern_Settings_PresetsBox");
static_assert(sizeof(WBP_Modern_Settings_PresetsBox_C_ExecuteUbergraph_WBP_Modern_Settings_PresetsBox) == 0x00000C, "Wrong size on WBP_Modern_Settings_PresetsBox_C_ExecuteUbergraph_WBP_Modern_Settings_PresetsBox");
static_assert(offsetof(WBP_Modern_Settings_PresetsBox_C_ExecuteUbergraph_WBP_Modern_Settings_PresetsBox, EntryPoint) == 0x000000, "Member 'WBP_Modern_Settings_PresetsBox_C_ExecuteUbergraph_WBP_Modern_Settings_PresetsBox::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_PresetsBox_C_ExecuteUbergraph_WBP_Modern_Settings_PresetsBox, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'WBP_Modern_Settings_PresetsBox_C_ExecuteUbergraph_WBP_Modern_Settings_PresetsBox::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_PresetsBox_C_ExecuteUbergraph_WBP_Modern_Settings_PresetsBox, K2Node_Event_IsDesignTime) == 0x000008, "Member 'WBP_Modern_Settings_PresetsBox_C_ExecuteUbergraph_WBP_Modern_Settings_PresetsBox::K2Node_Event_IsDesignTime' has a wrong offset!");

}

