#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Modern_QuestListPanel

#include "Basic.hpp"

#include "Altar_structs.hpp"
#include "EnhancedInput_structs.hpp"


namespace SDK::Params
{

// Function WBP_Modern_QuestListPanel.WBP_Modern_QuestListPanel_C.BndEvt__WBP_Modern_QuestListPanel_CompletedQuests_Tab_Button_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Modern_QuestListPanel_C_BndEvt__WBP_Modern_QuestListPanel_CompletedQuests_Tab_Button_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_QuestListPanel_C_BndEvt__WBP_Modern_QuestListPanel_CompletedQuests_Tab_Button_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Modern_QuestListPanel_C_BndEvt__WBP_Modern_QuestListPanel_CompletedQuests_Tab_Button_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_Modern_QuestListPanel_C_BndEvt__WBP_Modern_QuestListPanel_CompletedQuests_Tab_Button_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Modern_QuestListPanel_C_BndEvt__WBP_Modern_QuestListPanel_CompletedQuests_Tab_Button_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_BndEvt__WBP_Modern_QuestListPanel_CompletedQuests_Tab_Button_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_Modern_QuestListPanel_C_BndEvt__WBP_Modern_QuestListPanel_CompletedQuests_Tab_Button_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_Modern_QuestListPanel.WBP_Modern_QuestListPanel_C.BndEvt__WBP_Modern_QuestListPanel_QuestListView_K2Node_ComponentBoundEvent_0_OnItemHovered__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Modern_QuestListPanel_C_BndEvt__WBP_Modern_QuestListPanel_QuestListView_K2Node_ComponentBoundEvent_0_OnItemHovered__DelegateSignature final
{
public:
	class UObject*                                HoveredItem;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_QuestListPanel_C_BndEvt__WBP_Modern_QuestListPanel_QuestListView_K2Node_ComponentBoundEvent_0_OnItemHovered__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Modern_QuestListPanel_C_BndEvt__WBP_Modern_QuestListPanel_QuestListView_K2Node_ComponentBoundEvent_0_OnItemHovered__DelegateSignature");
static_assert(sizeof(WBP_Modern_QuestListPanel_C_BndEvt__WBP_Modern_QuestListPanel_QuestListView_K2Node_ComponentBoundEvent_0_OnItemHovered__DelegateSignature) == 0x000008, "Wrong size on WBP_Modern_QuestListPanel_C_BndEvt__WBP_Modern_QuestListPanel_QuestListView_K2Node_ComponentBoundEvent_0_OnItemHovered__DelegateSignature");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_BndEvt__WBP_Modern_QuestListPanel_QuestListView_K2Node_ComponentBoundEvent_0_OnItemHovered__DelegateSignature, HoveredItem) == 0x000000, "Member 'WBP_Modern_QuestListPanel_C_BndEvt__WBP_Modern_QuestListPanel_QuestListView_K2Node_ComponentBoundEvent_0_OnItemHovered__DelegateSignature::HoveredItem' has a wrong offset!");

// Function WBP_Modern_QuestListPanel.WBP_Modern_QuestListPanel_C.BndEvt__WBP_Modern_QuestListPanel_QuestListView_K2Node_ComponentBoundEvent_3_OnItemClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Modern_QuestListPanel_C_BndEvt__WBP_Modern_QuestListPanel_QuestListView_K2Node_ComponentBoundEvent_3_OnItemClicked__DelegateSignature final
{
public:
	class UObject*                                SelectedItem;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_QuestListPanel_C_BndEvt__WBP_Modern_QuestListPanel_QuestListView_K2Node_ComponentBoundEvent_3_OnItemClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Modern_QuestListPanel_C_BndEvt__WBP_Modern_QuestListPanel_QuestListView_K2Node_ComponentBoundEvent_3_OnItemClicked__DelegateSignature");
static_assert(sizeof(WBP_Modern_QuestListPanel_C_BndEvt__WBP_Modern_QuestListPanel_QuestListView_K2Node_ComponentBoundEvent_3_OnItemClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Modern_QuestListPanel_C_BndEvt__WBP_Modern_QuestListPanel_QuestListView_K2Node_ComponentBoundEvent_3_OnItemClicked__DelegateSignature");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_BndEvt__WBP_Modern_QuestListPanel_QuestListView_K2Node_ComponentBoundEvent_3_OnItemClicked__DelegateSignature, SelectedItem) == 0x000000, "Member 'WBP_Modern_QuestListPanel_C_BndEvt__WBP_Modern_QuestListPanel_QuestListView_K2Node_ComponentBoundEvent_3_OnItemClicked__DelegateSignature::SelectedItem' has a wrong offset!");

// Function WBP_Modern_QuestListPanel.WBP_Modern_QuestListPanel_C.BndEvt__WBP_Modern_QuestListPanel_Quests_Tab_Button_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Modern_QuestListPanel_C_BndEvt__WBP_Modern_QuestListPanel_Quests_Tab_Button_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_QuestListPanel_C_BndEvt__WBP_Modern_QuestListPanel_Quests_Tab_Button_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Modern_QuestListPanel_C_BndEvt__WBP_Modern_QuestListPanel_Quests_Tab_Button_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_Modern_QuestListPanel_C_BndEvt__WBP_Modern_QuestListPanel_Quests_Tab_Button_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Modern_QuestListPanel_C_BndEvt__WBP_Modern_QuestListPanel_Quests_Tab_Button_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_BndEvt__WBP_Modern_QuestListPanel_Quests_Tab_Button_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_Modern_QuestListPanel_C_BndEvt__WBP_Modern_QuestListPanel_Quests_Tab_Button_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_Modern_QuestListPanel.WBP_Modern_QuestListPanel_C.ExecuteUbergraph_WBP_Modern_QuestListPanel
// 0x02D8 (0x02D8 - 0x0000)
struct WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_1;     // 0x0008(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_1;     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_1;   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_1;    // 0x0030(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable;                              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue;  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_0;                              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1_0;                            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue;       // 0x0070(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime;       // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime;     // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction;      // 0x0098(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_1; // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           Temp_object_Variable_1;                            // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2;                              // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2_0;                            // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3;                              // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_3_0;                            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsCurrent;                      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_ComponentBoundEvent_SelectedItem;           // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVLegacyMapMenuQuestItem*               K2Node_DynamicCast_AsVLegacy_Map_Menu_Quest_Item;  // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLegacyMapMenuQuestProperties          CallFunc_GetProperties_ReturnValue;                // 0x00F8(0x0098)(ConstParm)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_NewDate;                        // 0x0198(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x01B0(0x0018)()
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue;          // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CA[0x6];                                      // 0x01CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FLegacyMapMenuQuestProperties>  K2Node_CustomEvent_NewQuestList;                   // 0x01D0(0x0010)(ReferenceParm)
	class UObject*                                K2Node_ComponentBoundEvent_HoveredItem;            // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVLegacyMapMenuQuestItem*               K2Node_DynamicCast_AsVLegacy_Map_Menu_Quest_Item_1; // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsFocussed_ReturnValue;                // 0x01F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F2[0x6];                                      // 0x01F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLegacyMapMenuQuestProperties          CallFunc_GetProperties_ReturnValue_1;              // 0x01F8(0x0098)(ConstParm)
	bool                                          Temp_bool_Variable_2;                              // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsFocussed_ReturnValue_1;              // 0x0291(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_292[0x6];                                      // 0x0292(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0298(0x0018)()
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x02B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x02B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVUINavigationGlobalSubsystem*          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x02C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IVEnhancedInputNavigable> CallFunc_NavigateToWidget_Widget_CastInput;     // 0x02C8(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel) == 0x000008, "Wrong alignment on WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel");
static_assert(sizeof(WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel) == 0x0002D8, "Wrong size on WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel, EntryPoint) == 0x000000, "Member 'WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel, K2Node_EnhancedInputActionEvent_ActionValue_1) == 0x000008, "Member 'WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel::K2Node_EnhancedInputActionEvent_ActionValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel, K2Node_EnhancedInputActionEvent_ElapsedTime_1) == 0x000028, "Member 'WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel::K2Node_EnhancedInputActionEvent_ElapsedTime_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel, K2Node_EnhancedInputActionEvent_TriggeredTime_1) == 0x00002C, "Member 'WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel::K2Node_EnhancedInputActionEvent_TriggeredTime_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel, K2Node_EnhancedInputActionEvent_SourceAction_1) == 0x000030, "Member 'WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel::K2Node_EnhancedInputActionEvent_SourceAction_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel, Temp_object_Variable) == 0x000038, "Member 'WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel, CallFunc_Conv_InputActionValueToBool_ReturnValue) == 0x000040, "Member 'WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel::CallFunc_Conv_InputActionValueToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel, Temp_real_Variable) == 0x000048, "Member 'WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel, Temp_real_Variable_1) == 0x000050, "Member 'WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel, Temp_real_Variable_0) == 0x000058, "Member 'WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel::Temp_real_Variable_0' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel, Temp_real_Variable_1_0) == 0x000060, "Member 'WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel::Temp_real_Variable_1_0' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel, Temp_bool_Variable) == 0x000068, "Member 'WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel, K2Node_EnhancedInputActionEvent_ActionValue) == 0x000070, "Member 'WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel::K2Node_EnhancedInputActionEvent_ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel, K2Node_EnhancedInputActionEvent_ElapsedTime) == 0x000090, "Member 'WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel::K2Node_EnhancedInputActionEvent_ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel, K2Node_EnhancedInputActionEvent_TriggeredTime) == 0x000094, "Member 'WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel::K2Node_EnhancedInputActionEvent_TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel, K2Node_EnhancedInputActionEvent_SourceAction) == 0x000098, "Member 'WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel::K2Node_EnhancedInputActionEvent_SourceAction' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel, CallFunc_Conv_InputActionValueToBool_ReturnValue_1) == 0x0000A0, "Member 'WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel::CallFunc_Conv_InputActionValueToBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel, Temp_object_Variable_1) == 0x0000A8, "Member 'WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel, Temp_real_Variable_2) == 0x0000B0, "Member 'WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel, Temp_real_Variable_2_0) == 0x0000B8, "Member 'WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel::Temp_real_Variable_2_0' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel, Temp_real_Variable_3) == 0x0000C0, "Member 'WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel, Temp_bool_Variable_1) == 0x0000C8, "Member 'WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel, Temp_real_Variable_3_0) == 0x0000D0, "Member 'WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel::Temp_real_Variable_3_0' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel, K2Node_CustomEvent_IsCurrent) == 0x0000D8, "Member 'WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel::K2Node_CustomEvent_IsCurrent' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel, K2Node_ComponentBoundEvent_SelectedItem) == 0x0000E0, "Member 'WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel::K2Node_ComponentBoundEvent_SelectedItem' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel, K2Node_DynamicCast_AsVLegacy_Map_Menu_Quest_Item) == 0x0000E8, "Member 'WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel::K2Node_DynamicCast_AsVLegacy_Map_Menu_Quest_Item' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel, K2Node_DynamicCast_bSuccess) == 0x0000F0, "Member 'WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel, CallFunc_GetProperties_ReturnValue) == 0x0000F8, "Member 'WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel::CallFunc_GetProperties_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel, K2Node_Event_IsDesignTime) == 0x000190, "Member 'WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel, K2Node_CustomEvent_NewDate) == 0x000198, "Member 'WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel::K2Node_CustomEvent_NewDate' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel, CallFunc_MakeLiteralText_ReturnValue) == 0x0001B0, "Member 'WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel, CallFunc_EqualEqual_TextText_ReturnValue) == 0x0001C8, "Member 'WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel::CallFunc_EqualEqual_TextText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel, CallFunc_Not_PreBool_ReturnValue) == 0x0001C9, "Member 'WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel, K2Node_CustomEvent_NewQuestList) == 0x0001D0, "Member 'WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel::K2Node_CustomEvent_NewQuestList' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel, K2Node_ComponentBoundEvent_HoveredItem) == 0x0001E0, "Member 'WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel::K2Node_ComponentBoundEvent_HoveredItem' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel, K2Node_DynamicCast_AsVLegacy_Map_Menu_Quest_Item_1) == 0x0001E8, "Member 'WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel::K2Node_DynamicCast_AsVLegacy_Map_Menu_Quest_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel, K2Node_DynamicCast_bSuccess_1) == 0x0001F0, "Member 'WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel, CallFunc_GetIsFocussed_ReturnValue) == 0x0001F1, "Member 'WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel::CallFunc_GetIsFocussed_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel, CallFunc_GetProperties_ReturnValue_1) == 0x0001F8, "Member 'WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel::CallFunc_GetProperties_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel, Temp_bool_Variable_2) == 0x000290, "Member 'WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel, CallFunc_GetIsFocussed_ReturnValue_1) == 0x000291, "Member 'WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel::CallFunc_GetIsFocussed_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel, K2Node_Select_Default) == 0x000298, "Member 'WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel, K2Node_ComponentBoundEvent_Button_1) == 0x0002B0, "Member 'WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel, K2Node_ComponentBoundEvent_Button) == 0x0002B8, "Member 'WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x0002C0, "Member 'WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel, CallFunc_NavigateToWidget_Widget_CastInput) == 0x0002C8, "Member 'WBP_Modern_QuestListPanel_C_ExecuteUbergraph_WBP_Modern_QuestListPanel::CallFunc_NavigateToWidget_Widget_CastInput' has a wrong offset!");

// Function WBP_Modern_QuestListPanel.WBP_Modern_QuestListPanel_C.InpActEvt_IA_UI_Specific_Common_NextTab_K2Node_EnhancedInputActionEvent_0
// 0x0030 (0x0030 - 0x0000)
struct WBP_Modern_QuestListPanel_C_InpActEvt_IA_UI_Specific_Common_NextTab_K2Node_EnhancedInputActionEvent_0 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_QuestListPanel_C_InpActEvt_IA_UI_Specific_Common_NextTab_K2Node_EnhancedInputActionEvent_0) == 0x000008, "Wrong alignment on WBP_Modern_QuestListPanel_C_InpActEvt_IA_UI_Specific_Common_NextTab_K2Node_EnhancedInputActionEvent_0");
static_assert(sizeof(WBP_Modern_QuestListPanel_C_InpActEvt_IA_UI_Specific_Common_NextTab_K2Node_EnhancedInputActionEvent_0) == 0x000030, "Wrong size on WBP_Modern_QuestListPanel_C_InpActEvt_IA_UI_Specific_Common_NextTab_K2Node_EnhancedInputActionEvent_0");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_InpActEvt_IA_UI_Specific_Common_NextTab_K2Node_EnhancedInputActionEvent_0, ActionValue) == 0x000000, "Member 'WBP_Modern_QuestListPanel_C_InpActEvt_IA_UI_Specific_Common_NextTab_K2Node_EnhancedInputActionEvent_0::ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_InpActEvt_IA_UI_Specific_Common_NextTab_K2Node_EnhancedInputActionEvent_0, ElapsedTime) == 0x000020, "Member 'WBP_Modern_QuestListPanel_C_InpActEvt_IA_UI_Specific_Common_NextTab_K2Node_EnhancedInputActionEvent_0::ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_InpActEvt_IA_UI_Specific_Common_NextTab_K2Node_EnhancedInputActionEvent_0, TriggeredTime) == 0x000024, "Member 'WBP_Modern_QuestListPanel_C_InpActEvt_IA_UI_Specific_Common_NextTab_K2Node_EnhancedInputActionEvent_0::TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_InpActEvt_IA_UI_Specific_Common_NextTab_K2Node_EnhancedInputActionEvent_0, SourceAction) == 0x000028, "Member 'WBP_Modern_QuestListPanel_C_InpActEvt_IA_UI_Specific_Common_NextTab_K2Node_EnhancedInputActionEvent_0::SourceAction' has a wrong offset!");

// Function WBP_Modern_QuestListPanel.WBP_Modern_QuestListPanel_C.InpActEvt_IA_UI_Specific_Common_PreviousTab_K2Node_EnhancedInputActionEvent_1
// 0x0030 (0x0030 - 0x0000)
struct WBP_Modern_QuestListPanel_C_InpActEvt_IA_UI_Specific_Common_PreviousTab_K2Node_EnhancedInputActionEvent_1 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_QuestListPanel_C_InpActEvt_IA_UI_Specific_Common_PreviousTab_K2Node_EnhancedInputActionEvent_1) == 0x000008, "Wrong alignment on WBP_Modern_QuestListPanel_C_InpActEvt_IA_UI_Specific_Common_PreviousTab_K2Node_EnhancedInputActionEvent_1");
static_assert(sizeof(WBP_Modern_QuestListPanel_C_InpActEvt_IA_UI_Specific_Common_PreviousTab_K2Node_EnhancedInputActionEvent_1) == 0x000030, "Wrong size on WBP_Modern_QuestListPanel_C_InpActEvt_IA_UI_Specific_Common_PreviousTab_K2Node_EnhancedInputActionEvent_1");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_InpActEvt_IA_UI_Specific_Common_PreviousTab_K2Node_EnhancedInputActionEvent_1, ActionValue) == 0x000000, "Member 'WBP_Modern_QuestListPanel_C_InpActEvt_IA_UI_Specific_Common_PreviousTab_K2Node_EnhancedInputActionEvent_1::ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_InpActEvt_IA_UI_Specific_Common_PreviousTab_K2Node_EnhancedInputActionEvent_1, ElapsedTime) == 0x000020, "Member 'WBP_Modern_QuestListPanel_C_InpActEvt_IA_UI_Specific_Common_PreviousTab_K2Node_EnhancedInputActionEvent_1::ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_InpActEvt_IA_UI_Specific_Common_PreviousTab_K2Node_EnhancedInputActionEvent_1, TriggeredTime) == 0x000024, "Member 'WBP_Modern_QuestListPanel_C_InpActEvt_IA_UI_Specific_Common_PreviousTab_K2Node_EnhancedInputActionEvent_1::TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_InpActEvt_IA_UI_Specific_Common_PreviousTab_K2Node_EnhancedInputActionEvent_1, SourceAction) == 0x000028, "Member 'WBP_Modern_QuestListPanel_C_InpActEvt_IA_UI_Specific_Common_PreviousTab_K2Node_EnhancedInputActionEvent_1::SourceAction' has a wrong offset!");

// Function WBP_Modern_QuestListPanel.WBP_Modern_QuestListPanel_C.IsCurrentQuestPage
// 0x0001 (0x0001 - 0x0000)
struct WBP_Modern_QuestListPanel_C_IsCurrentQuestPage final
{
public:
	bool                                          IsCurrentQuestPage_0;                              // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_QuestListPanel_C_IsCurrentQuestPage) == 0x000001, "Wrong alignment on WBP_Modern_QuestListPanel_C_IsCurrentQuestPage");
static_assert(sizeof(WBP_Modern_QuestListPanel_C_IsCurrentQuestPage) == 0x000001, "Wrong size on WBP_Modern_QuestListPanel_C_IsCurrentQuestPage");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_IsCurrentQuestPage, IsCurrentQuestPage_0) == 0x000000, "Member 'WBP_Modern_QuestListPanel_C_IsCurrentQuestPage::IsCurrentQuestPage_0' has a wrong offset!");

// Function WBP_Modern_QuestListPanel.WBP_Modern_QuestListPanel_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Modern_QuestListPanel_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_QuestListPanel_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_Modern_QuestListPanel_C_PreConstruct");
static_assert(sizeof(WBP_Modern_QuestListPanel_C_PreConstruct) == 0x000001, "Wrong size on WBP_Modern_QuestListPanel_C_PreConstruct");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_Modern_QuestListPanel_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_Modern_QuestListPanel.WBP_Modern_QuestListPanel_C.SetCurrentIndex
// 0x0004 (0x0004 - 0x0000)
struct WBP_Modern_QuestListPanel_C_SetCurrentIndex final
{
public:
	int32                                         CallFunc_GetCurrentElementIndex_ReturnValue;       // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_QuestListPanel_C_SetCurrentIndex) == 0x000004, "Wrong alignment on WBP_Modern_QuestListPanel_C_SetCurrentIndex");
static_assert(sizeof(WBP_Modern_QuestListPanel_C_SetCurrentIndex) == 0x000004, "Wrong size on WBP_Modern_QuestListPanel_C_SetCurrentIndex");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_SetCurrentIndex, CallFunc_GetCurrentElementIndex_ReturnValue) == 0x000000, "Member 'WBP_Modern_QuestListPanel_C_SetCurrentIndex::CallFunc_GetCurrentElementIndex_ReturnValue' has a wrong offset!");

// Function WBP_Modern_QuestListPanel.WBP_Modern_QuestListPanel_C.SetItems
// 0x0228 (0x0228 - 0x0000)
struct WBP_Modern_QuestListPanel_C_SetItems final
{
public:
	class UCommonListView*                        ListView;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FLegacyMapMenuQuestProperties>  Items;                                             // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         Index_0;                                           // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVLegacyMapMenuQuestItem*               Local_CurrentQuestItem;                            // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FLegacyMapMenuQuestProperties          Local_CurrentItemData;                             // 0x0028(0x0098)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVLegacyMapMenuQuestItem*               CallFunc_SpawnObject_ReturnValue;                  // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLegacyMapMenuQuestProperties          K2Node_MakeStruct_LegacyMapMenuQuestProperties;    // 0x00E0(0x0098)()
	class UVLegacyMapMenuQuestItem*               CallFunc_SpawnObject_ReturnValue_1;                // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_182[0x6];                                      // 0x0182(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLegacyMapMenuQuestProperties          CallFunc_Array_Get_Item;                           // 0x0188(0x0098)()
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0224(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_QuestListPanel_C_SetItems) == 0x000008, "Wrong alignment on WBP_Modern_QuestListPanel_C_SetItems");
static_assert(sizeof(WBP_Modern_QuestListPanel_C_SetItems) == 0x000228, "Wrong size on WBP_Modern_QuestListPanel_C_SetItems");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_SetItems, ListView) == 0x000000, "Member 'WBP_Modern_QuestListPanel_C_SetItems::ListView' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_SetItems, Items) == 0x000008, "Member 'WBP_Modern_QuestListPanel_C_SetItems::Items' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_SetItems, Index_0) == 0x000018, "Member 'WBP_Modern_QuestListPanel_C_SetItems::Index_0' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_SetItems, Local_CurrentQuestItem) == 0x000020, "Member 'WBP_Modern_QuestListPanel_C_SetItems::Local_CurrentQuestItem' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_SetItems, Local_CurrentItemData) == 0x000028, "Member 'WBP_Modern_QuestListPanel_C_SetItems::Local_CurrentItemData' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_SetItems, Temp_int_Array_Index_Variable) == 0x0000C0, "Member 'WBP_Modern_QuestListPanel_C_SetItems::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_SetItems, Temp_int_Loop_Counter_Variable) == 0x0000C4, "Member 'WBP_Modern_QuestListPanel_C_SetItems::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_SetItems, CallFunc_Add_IntInt_ReturnValue) == 0x0000C8, "Member 'WBP_Modern_QuestListPanel_C_SetItems::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_SetItems, CallFunc_SpawnObject_ReturnValue) == 0x0000D0, "Member 'WBP_Modern_QuestListPanel_C_SetItems::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_SetItems, CallFunc_Array_Length_ReturnValue) == 0x0000D8, "Member 'WBP_Modern_QuestListPanel_C_SetItems::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_SetItems, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000DC, "Member 'WBP_Modern_QuestListPanel_C_SetItems::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_SetItems, K2Node_MakeStruct_LegacyMapMenuQuestProperties) == 0x0000E0, "Member 'WBP_Modern_QuestListPanel_C_SetItems::K2Node_MakeStruct_LegacyMapMenuQuestProperties' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_SetItems, CallFunc_SpawnObject_ReturnValue_1) == 0x000178, "Member 'WBP_Modern_QuestListPanel_C_SetItems::CallFunc_SpawnObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_SetItems, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000180, "Member 'WBP_Modern_QuestListPanel_C_SetItems::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_SetItems, CallFunc_BooleanAND_ReturnValue) == 0x000181, "Member 'WBP_Modern_QuestListPanel_C_SetItems::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_SetItems, CallFunc_Array_Get_Item) == 0x000188, "Member 'WBP_Modern_QuestListPanel_C_SetItems::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_SetItems, CallFunc_Array_Length_ReturnValue_1) == 0x000220, "Member 'WBP_Modern_QuestListPanel_C_SetItems::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_SetItems, CallFunc_Less_IntInt_ReturnValue) == 0x000224, "Member 'WBP_Modern_QuestListPanel_C_SetItems::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_Modern_QuestListPanel.WBP_Modern_QuestListPanel_C.UpdateDate
// 0x0018 (0x0018 - 0x0000)
struct WBP_Modern_QuestListPanel_C_UpdateDate final
{
public:
	class FText                                   NewDate;                                           // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Modern_QuestListPanel_C_UpdateDate) == 0x000008, "Wrong alignment on WBP_Modern_QuestListPanel_C_UpdateDate");
static_assert(sizeof(WBP_Modern_QuestListPanel_C_UpdateDate) == 0x000018, "Wrong size on WBP_Modern_QuestListPanel_C_UpdateDate");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_UpdateDate, NewDate) == 0x000000, "Member 'WBP_Modern_QuestListPanel_C_UpdateDate::NewDate' has a wrong offset!");

// Function WBP_Modern_QuestListPanel.WBP_Modern_QuestListPanel_C.UpdateListView
// 0x0018 (0x0018 - 0x0000)
struct WBP_Modern_QuestListPanel_C_UpdateListView final
{
public:
	TArray<struct FLegacyMapMenuQuestProperties>  NewItemsData;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UCommonListView*                        CallFunc_GetListView_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_QuestListPanel_C_UpdateListView) == 0x000008, "Wrong alignment on WBP_Modern_QuestListPanel_C_UpdateListView");
static_assert(sizeof(WBP_Modern_QuestListPanel_C_UpdateListView) == 0x000018, "Wrong size on WBP_Modern_QuestListPanel_C_UpdateListView");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_UpdateListView, NewItemsData) == 0x000000, "Member 'WBP_Modern_QuestListPanel_C_UpdateListView::NewItemsData' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_UpdateListView, CallFunc_GetListView_ReturnValue) == 0x000010, "Member 'WBP_Modern_QuestListPanel_C_UpdateListView::CallFunc_GetListView_ReturnValue' has a wrong offset!");

// Function WBP_Modern_QuestListPanel.WBP_Modern_QuestListPanel_C.UpdatePageTabDesign
// 0x0010 (0x0010 - 0x0000)
struct WBP_Modern_QuestListPanel_C_UpdatePageTabDesign final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default;                             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_QuestListPanel_C_UpdatePageTabDesign) == 0x000008, "Wrong alignment on WBP_Modern_QuestListPanel_C_UpdatePageTabDesign");
static_assert(sizeof(WBP_Modern_QuestListPanel_C_UpdatePageTabDesign) == 0x000010, "Wrong size on WBP_Modern_QuestListPanel_C_UpdatePageTabDesign");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_UpdatePageTabDesign, Temp_bool_Variable) == 0x000000, "Member 'WBP_Modern_QuestListPanel_C_UpdatePageTabDesign::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_UpdatePageTabDesign, K2Node_Select_Default) == 0x000008, "Member 'WBP_Modern_QuestListPanel_C_UpdatePageTabDesign::K2Node_Select_Default' has a wrong offset!");

// Function WBP_Modern_QuestListPanel.WBP_Modern_QuestListPanel_C.UpdateQuestList
// 0x0010 (0x0010 - 0x0000)
struct WBP_Modern_QuestListPanel_C_UpdateQuestList final
{
public:
	TArray<struct FLegacyMapMenuQuestProperties>  NewQuestList;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_Modern_QuestListPanel_C_UpdateQuestList) == 0x000008, "Wrong alignment on WBP_Modern_QuestListPanel_C_UpdateQuestList");
static_assert(sizeof(WBP_Modern_QuestListPanel_C_UpdateQuestList) == 0x000010, "Wrong size on WBP_Modern_QuestListPanel_C_UpdateQuestList");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_UpdateQuestList, NewQuestList) == 0x000000, "Member 'WBP_Modern_QuestListPanel_C_UpdateQuestList::NewQuestList' has a wrong offset!");

// Function WBP_Modern_QuestListPanel.WBP_Modern_QuestListPanel_C.UpdateTitle
// 0x0001 (0x0001 - 0x0000)
struct WBP_Modern_QuestListPanel_C_UpdateTitle final
{
public:
	bool                                          IsCurrent;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_QuestListPanel_C_UpdateTitle) == 0x000001, "Wrong alignment on WBP_Modern_QuestListPanel_C_UpdateTitle");
static_assert(sizeof(WBP_Modern_QuestListPanel_C_UpdateTitle) == 0x000001, "Wrong size on WBP_Modern_QuestListPanel_C_UpdateTitle");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_UpdateTitle, IsCurrent) == 0x000000, "Member 'WBP_Modern_QuestListPanel_C_UpdateTitle::IsCurrent' has a wrong offset!");

// Function WBP_Modern_QuestListPanel.WBP_Modern_QuestListPanel_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct WBP_Modern_QuestListPanel_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_QuestListPanel_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_Modern_QuestListPanel_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_Modern_QuestListPanel_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong size on WBP_Modern_QuestListPanel_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_Modern_QuestListPanel_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_Modern_QuestListPanel_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");

}

