#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModernMenu_StatsPage5

#include "Basic.hpp"

#include "CommonInput_structs.hpp"
#include "Altar_structs.hpp"
#include "Altar_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ModernMenu_StatsPage5.WBP_ModernMenu_StatsPage5_C
// 0x0040 (0x0508 - 0x04C8)
class UWBP_ModernMenu_StatsPage5_C final : public UVLegacyStatsMenuPage5
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVStatsMenuViewModel*                   VStatsMenuViewModel;                               // 0x04D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       StatsPage5FadeInOut;                               // 0x04D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonListView*                        stat_p5_window;                                    // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        ScrollSpeed;                                       // 0x04E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FLegacyStatsMenuMiscItemProperties> MiscItems;                                     // 0x04F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          DoPlayAnimation;                                   // 0x0500(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnActivated();
	void BP_OnDeactivated();
	void Construct();
	void CreateMiscItem(const TArray<struct FLegacyStatsMenuMiscItemProperties>& NewMiscItem);
	void ExecuteUbergraph_WBP_ModernMenu_StatsPage5(int32 EntryPoint);
	void InpActEvt_IA_UI_Specific_Common_Scroll_K2Node_EnhancedInputActionEvent_0(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void OnInputMethodChanged(ECommonInputType bNewInputType);
	void PreConstruct(bool IsDesignTime);
	void UpdateMiscItems(const TArray<struct FLegacyStatsMenuMiscItemProperties>& NewMiscItems);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ModernMenu_StatsPage5_C">();
	}
	static class UWBP_ModernMenu_StatsPage5_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ModernMenu_StatsPage5_C>();
	}
};
static_assert(alignof(UWBP_ModernMenu_StatsPage5_C) == 0x000008, "Wrong alignment on UWBP_ModernMenu_StatsPage5_C");
static_assert(sizeof(UWBP_ModernMenu_StatsPage5_C) == 0x000508, "Wrong size on UWBP_ModernMenu_StatsPage5_C");
static_assert(offsetof(UWBP_ModernMenu_StatsPage5_C, UberGraphFrame) == 0x0004C8, "Member 'UWBP_ModernMenu_StatsPage5_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsPage5_C, VStatsMenuViewModel) == 0x0004D0, "Member 'UWBP_ModernMenu_StatsPage5_C::VStatsMenuViewModel' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsPage5_C, StatsPage5FadeInOut) == 0x0004D8, "Member 'UWBP_ModernMenu_StatsPage5_C::StatsPage5FadeInOut' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsPage5_C, stat_p5_window) == 0x0004E0, "Member 'UWBP_ModernMenu_StatsPage5_C::stat_p5_window' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsPage5_C, ScrollSpeed) == 0x0004E8, "Member 'UWBP_ModernMenu_StatsPage5_C::ScrollSpeed' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsPage5_C, MiscItems) == 0x0004F0, "Member 'UWBP_ModernMenu_StatsPage5_C::MiscItems' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsPage5_C, DoPlayAnimation) == 0x000500, "Member 'UWBP_ModernMenu_StatsPage5_C::DoPlayAnimation' has a wrong offset!");

}

