#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModernHud_ActiveEffect

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_ModernHud_ActiveEffect.WBP_ModernHud_ActiveEffect_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_ModernHud_ActiveEffect_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_ActiveEffect_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong alignment on WBP_ModernHud_ActiveEffect_C_BP_OnItemExpansionChanged");
static_assert(sizeof(WBP_ModernHud_ActiveEffect_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong size on WBP_ModernHud_ActiveEffect_C_BP_OnItemExpansionChanged");
static_assert(offsetof(WBP_ModernHud_ActiveEffect_C_BP_OnItemExpansionChanged, bIsExpanded) == 0x000000, "Member 'WBP_ModernHud_ActiveEffect_C_BP_OnItemExpansionChanged::bIsExpanded' has a wrong offset!");

// Function WBP_ModernHud_ActiveEffect.WBP_ModernHud_ActiveEffect_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_ModernHud_ActiveEffect_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_ActiveEffect_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong alignment on WBP_ModernHud_ActiveEffect_C_BP_OnItemSelectionChanged");
static_assert(sizeof(WBP_ModernHud_ActiveEffect_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong size on WBP_ModernHud_ActiveEffect_C_BP_OnItemSelectionChanged");
static_assert(offsetof(WBP_ModernHud_ActiveEffect_C_BP_OnItemSelectionChanged, bIsSelected) == 0x000000, "Member 'WBP_ModernHud_ActiveEffect_C_BP_OnItemSelectionChanged::bIsSelected' has a wrong offset!");

// Function WBP_ModernHud_ActiveEffect.WBP_ModernHud_ActiveEffect_C.ExecuteUbergraph_WBP_ModernHud_ActiveEffect
// 0x0060 (0x0060 - 0x0000)
struct WBP_ModernHud_ActiveEffect_C_ExecuteUbergraph_WBP_ModernHud_ActiveEffect final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0010(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIActiveSpellEffectData_C*             K2Node_DynamicCast_AsUIActive_Spell_Effect_Data;   // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_ActiveEffect_C_ExecuteUbergraph_WBP_ModernHud_ActiveEffect) == 0x000008, "Wrong alignment on WBP_ModernHud_ActiveEffect_C_ExecuteUbergraph_WBP_ModernHud_ActiveEffect");
static_assert(sizeof(WBP_ModernHud_ActiveEffect_C_ExecuteUbergraph_WBP_ModernHud_ActiveEffect) == 0x000060, "Wrong size on WBP_ModernHud_ActiveEffect_C_ExecuteUbergraph_WBP_ModernHud_ActiveEffect");
static_assert(offsetof(WBP_ModernHud_ActiveEffect_C_ExecuteUbergraph_WBP_ModernHud_ActiveEffect, EntryPoint) == 0x000000, "Member 'WBP_ModernHud_ActiveEffect_C_ExecuteUbergraph_WBP_ModernHud_ActiveEffect::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_ActiveEffect_C_ExecuteUbergraph_WBP_ModernHud_ActiveEffect, K2Node_Event_bIsExpanded) == 0x000004, "Member 'WBP_ModernHud_ActiveEffect_C_ExecuteUbergraph_WBP_ModernHud_ActiveEffect::K2Node_Event_bIsExpanded' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_ActiveEffect_C_ExecuteUbergraph_WBP_ModernHud_ActiveEffect, K2Node_Event_bIsSelected) == 0x000005, "Member 'WBP_ModernHud_ActiveEffect_C_ExecuteUbergraph_WBP_ModernHud_ActiveEffect::K2Node_Event_bIsSelected' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_ActiveEffect_C_ExecuteUbergraph_WBP_ModernHud_ActiveEffect, K2Node_Event_ListItemObject) == 0x000008, "Member 'WBP_ModernHud_ActiveEffect_C_ExecuteUbergraph_WBP_ModernHud_ActiveEffect::K2Node_Event_ListItemObject' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_ActiveEffect_C_ExecuteUbergraph_WBP_ModernHud_ActiveEffect, K2Node_Event_MyGeometry) == 0x000010, "Member 'WBP_ModernHud_ActiveEffect_C_ExecuteUbergraph_WBP_ModernHud_ActiveEffect::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_ActiveEffect_C_ExecuteUbergraph_WBP_ModernHud_ActiveEffect, K2Node_Event_InDeltaTime) == 0x000048, "Member 'WBP_ModernHud_ActiveEffect_C_ExecuteUbergraph_WBP_ModernHud_ActiveEffect::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_ActiveEffect_C_ExecuteUbergraph_WBP_ModernHud_ActiveEffect, K2Node_DynamicCast_AsUIActive_Spell_Effect_Data) == 0x000050, "Member 'WBP_ModernHud_ActiveEffect_C_ExecuteUbergraph_WBP_ModernHud_ActiveEffect::K2Node_DynamicCast_AsUIActive_Spell_Effect_Data' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_ActiveEffect_C_ExecuteUbergraph_WBP_ModernHud_ActiveEffect, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'WBP_ModernHud_ActiveEffect_C_ExecuteUbergraph_WBP_ModernHud_ActiveEffect::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_ModernHud_ActiveEffect.WBP_ModernHud_ActiveEffect_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct WBP_ModernHud_ActiveEffect_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_ActiveEffect_C_OnListItemObjectSet) == 0x000008, "Wrong alignment on WBP_ModernHud_ActiveEffect_C_OnListItemObjectSet");
static_assert(sizeof(WBP_ModernHud_ActiveEffect_C_OnListItemObjectSet) == 0x000008, "Wrong size on WBP_ModernHud_ActiveEffect_C_OnListItemObjectSet");
static_assert(offsetof(WBP_ModernHud_ActiveEffect_C_OnListItemObjectSet, ListItemObject) == 0x000000, "Member 'WBP_ModernHud_ActiveEffect_C_OnListItemObjectSet::ListItemObject' has a wrong offset!");

// Function WBP_ModernHud_ActiveEffect.WBP_ModernHud_ActiveEffect_C.SetLowProgress
// 0x0001 (0x0001 - 0x0000)
struct WBP_ModernHud_ActiveEffect_C_SetLowProgress final
{
public:
	bool                                          InLowProgress;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_ActiveEffect_C_SetLowProgress) == 0x000001, "Wrong alignment on WBP_ModernHud_ActiveEffect_C_SetLowProgress");
static_assert(sizeof(WBP_ModernHud_ActiveEffect_C_SetLowProgress) == 0x000001, "Wrong size on WBP_ModernHud_ActiveEffect_C_SetLowProgress");
static_assert(offsetof(WBP_ModernHud_ActiveEffect_C_SetLowProgress, InLowProgress) == 0x000000, "Member 'WBP_ModernHud_ActiveEffect_C_SetLowProgress::InLowProgress' has a wrong offset!");

// Function WBP_ModernHud_ActiveEffect.WBP_ModernHud_ActiveEffect_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_ModernHud_ActiveEffect_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_ActiveEffect_C_Tick) == 0x000004, "Wrong alignment on WBP_ModernHud_ActiveEffect_C_Tick");
static_assert(sizeof(WBP_ModernHud_ActiveEffect_C_Tick) == 0x00003C, "Wrong size on WBP_ModernHud_ActiveEffect_C_Tick");
static_assert(offsetof(WBP_ModernHud_ActiveEffect_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_ModernHud_ActiveEffect_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_ActiveEffect_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_ModernHud_ActiveEffect_C_Tick::InDeltaTime' has a wrong offset!");

// Function WBP_ModernHud_ActiveEffect.WBP_ModernHud_ActiveEffect_C.UpdateData
// 0x0020 (0x0020 - 0x0000)
struct WBP_ModernHud_ActiveEffect_C_UpdateData final
{
public:
	class UUIActiveSpellEffectData_C*             InData;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_ActiveEffect_C_UpdateData) == 0x000008, "Wrong alignment on WBP_ModernHud_ActiveEffect_C_UpdateData");
static_assert(sizeof(WBP_ModernHud_ActiveEffect_C_UpdateData) == 0x000020, "Wrong size on WBP_ModernHud_ActiveEffect_C_UpdateData");
static_assert(offsetof(WBP_ModernHud_ActiveEffect_C_UpdateData, InData) == 0x000000, "Member 'WBP_ModernHud_ActiveEffect_C_UpdateData::InData' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_ActiveEffect_C_UpdateData, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WBP_ModernHud_ActiveEffect_C_UpdateData::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_ActiveEffect_C_UpdateData, CallFunc_PlayAnimation_ReturnValue) == 0x000010, "Member 'WBP_ModernHud_ActiveEffect_C_UpdateData::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_ActiveEffect_C_UpdateData, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000018, "Member 'WBP_ModernHud_ActiveEffect_C_UpdateData::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function WBP_ModernHud_ActiveEffect.WBP_ModernHud_ActiveEffect_C.UpdateProgress
// 0x0018 (0x0018 - 0x0000)
struct WBP_ModernHud_ActiveEffect_C_UpdateProgress final
{
public:
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_ActiveEffect_C_UpdateProgress) == 0x000008, "Wrong alignment on WBP_ModernHud_ActiveEffect_C_UpdateProgress");
static_assert(sizeof(WBP_ModernHud_ActiveEffect_C_UpdateProgress) == 0x000018, "Wrong size on WBP_ModernHud_ActiveEffect_C_UpdateProgress");
static_assert(offsetof(WBP_ModernHud_ActiveEffect_C_UpdateProgress, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000000, "Member 'WBP_ModernHud_ActiveEffect_C_UpdateProgress::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_ActiveEffect_C_UpdateProgress, CallFunc_Less_DoubleDouble_ReturnValue_1) == 0x000001, "Member 'WBP_ModernHud_ActiveEffect_C_UpdateProgress::CallFunc_Less_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_ActiveEffect_C_UpdateProgress, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000002, "Member 'WBP_ModernHud_ActiveEffect_C_UpdateProgress::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_ActiveEffect_C_UpdateProgress, CallFunc_IsValid_ReturnValue) == 0x000003, "Member 'WBP_ModernHud_ActiveEffect_C_UpdateProgress::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_ActiveEffect_C_UpdateProgress, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'WBP_ModernHud_ActiveEffect_C_UpdateProgress::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_ActiveEffect_C_UpdateProgress, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000010, "Member 'WBP_ModernHud_ActiveEffect_C_UpdateProgress::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

}

