#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Modern_FilterIcon

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Altar_structs.hpp"


namespace SDK::Params
{

// Function WBP_Modern_FilterIcon.WBP_Modern_FilterIcon_C.ExecuteUbergraph_WBP_Modern_FilterIcon
// 0x0008 (0x0008 - 0x0000)
struct WBP_Modern_FilterIcon_C_ExecuteUbergraph_WBP_Modern_FilterIcon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsFocused_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_FilterIcon_C_ExecuteUbergraph_WBP_Modern_FilterIcon) == 0x000004, "Wrong alignment on WBP_Modern_FilterIcon_C_ExecuteUbergraph_WBP_Modern_FilterIcon");
static_assert(sizeof(WBP_Modern_FilterIcon_C_ExecuteUbergraph_WBP_Modern_FilterIcon) == 0x000008, "Wrong size on WBP_Modern_FilterIcon_C_ExecuteUbergraph_WBP_Modern_FilterIcon");
static_assert(offsetof(WBP_Modern_FilterIcon_C_ExecuteUbergraph_WBP_Modern_FilterIcon, EntryPoint) == 0x000000, "Member 'WBP_Modern_FilterIcon_C_ExecuteUbergraph_WBP_Modern_FilterIcon::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Modern_FilterIcon_C_ExecuteUbergraph_WBP_Modern_FilterIcon, CallFunc_GetIsFocused_ReturnValue) == 0x000004, "Member 'WBP_Modern_FilterIcon_C_ExecuteUbergraph_WBP_Modern_FilterIcon::CallFunc_GetIsFocused_ReturnValue' has a wrong offset!");

// Function WBP_Modern_FilterIcon.WBP_Modern_FilterIcon_C.InitializeFilterIcon
// 0x0DD0 (0x0DD0 - 0x0000)
struct WBP_Modern_FilterIcon_C_InitializeFilterIcon final
{
public:
	class UWBP_Modern_MapIconFilter_C*            AssociatedFilter;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FModern_AltarMapIconDesignTableRow     Design;                                            // 0x0010(0x0DB0)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          IsControl;                                         // 0x0DC0(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_FilterIcon_C_InitializeFilterIcon) == 0x000010, "Wrong alignment on WBP_Modern_FilterIcon_C_InitializeFilterIcon");
static_assert(sizeof(WBP_Modern_FilterIcon_C_InitializeFilterIcon) == 0x000DD0, "Wrong size on WBP_Modern_FilterIcon_C_InitializeFilterIcon");
static_assert(offsetof(WBP_Modern_FilterIcon_C_InitializeFilterIcon, AssociatedFilter) == 0x000000, "Member 'WBP_Modern_FilterIcon_C_InitializeFilterIcon::AssociatedFilter' has a wrong offset!");
static_assert(offsetof(WBP_Modern_FilterIcon_C_InitializeFilterIcon, Design) == 0x000010, "Member 'WBP_Modern_FilterIcon_C_InitializeFilterIcon::Design' has a wrong offset!");
static_assert(offsetof(WBP_Modern_FilterIcon_C_InitializeFilterIcon, IsControl) == 0x000DC0, "Member 'WBP_Modern_FilterIcon_C_InitializeFilterIcon::IsControl' has a wrong offset!");

// Function WBP_Modern_FilterIcon.WBP_Modern_FilterIcon_C.OnNumberOfFilteredChanged
// 0x0008 (0x0008 - 0x0000)
struct WBP_Modern_FilterIcon_C_OnNumberOfFilteredChanged final
{
public:
	int32                                         NewNumber;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_FilterIcon_C_OnNumberOfFilteredChanged) == 0x000004, "Wrong alignment on WBP_Modern_FilterIcon_C_OnNumberOfFilteredChanged");
static_assert(sizeof(WBP_Modern_FilterIcon_C_OnNumberOfFilteredChanged) == 0x000008, "Wrong size on WBP_Modern_FilterIcon_C_OnNumberOfFilteredChanged");
static_assert(offsetof(WBP_Modern_FilterIcon_C_OnNumberOfFilteredChanged, NewNumber) == 0x000000, "Member 'WBP_Modern_FilterIcon_C_OnNumberOfFilteredChanged::NewNumber' has a wrong offset!");
static_assert(offsetof(WBP_Modern_FilterIcon_C_OnNumberOfFilteredChanged, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000004, "Member 'WBP_Modern_FilterIcon_C_OnNumberOfFilteredChanged::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_FilterIcon_C_OnNumberOfFilteredChanged, CallFunc_Not_PreBool_ReturnValue) == 0x000005, "Member 'WBP_Modern_FilterIcon_C_OnNumberOfFilteredChanged::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function WBP_Modern_FilterIcon.WBP_Modern_FilterIcon_C.ToggleActivatedState
// 0x00A8 (0x00A8 - 0x0000)
struct WBP_Modern_FilterIcon_C_ToggleActivatedState final
{
public:
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0000(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0010(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0020(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0038(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0050(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_3;                          // 0x0060(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x0070(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_3;                     // 0x0088(0x0018)()
	bool                                          CallFunc_IsFilterHasAtLeastOneDisplayedIcon_ReturnValue; // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFilterHasAtLeastOneDisplayedIcon_ReturnValue_1; // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_FilterIcon_C_ToggleActivatedState) == 0x000008, "Wrong alignment on WBP_Modern_FilterIcon_C_ToggleActivatedState");
static_assert(sizeof(WBP_Modern_FilterIcon_C_ToggleActivatedState) == 0x0000A8, "Wrong size on WBP_Modern_FilterIcon_C_ToggleActivatedState");
static_assert(offsetof(WBP_Modern_FilterIcon_C_ToggleActivatedState, K2Node_MakeArray_Array) == 0x000000, "Member 'WBP_Modern_FilterIcon_C_ToggleActivatedState::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Modern_FilterIcon_C_ToggleActivatedState, K2Node_MakeArray_Array_1) == 0x000010, "Member 'WBP_Modern_FilterIcon_C_ToggleActivatedState::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_FilterIcon_C_ToggleActivatedState, CallFunc_Format_ReturnValue) == 0x000020, "Member 'WBP_Modern_FilterIcon_C_ToggleActivatedState::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_FilterIcon_C_ToggleActivatedState, CallFunc_Format_ReturnValue_1) == 0x000038, "Member 'WBP_Modern_FilterIcon_C_ToggleActivatedState::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_FilterIcon_C_ToggleActivatedState, K2Node_MakeArray_Array_2) == 0x000050, "Member 'WBP_Modern_FilterIcon_C_ToggleActivatedState::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(WBP_Modern_FilterIcon_C_ToggleActivatedState, K2Node_MakeArray_Array_3) == 0x000060, "Member 'WBP_Modern_FilterIcon_C_ToggleActivatedState::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(WBP_Modern_FilterIcon_C_ToggleActivatedState, CallFunc_Format_ReturnValue_2) == 0x000070, "Member 'WBP_Modern_FilterIcon_C_ToggleActivatedState::CallFunc_Format_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Modern_FilterIcon_C_ToggleActivatedState, CallFunc_Format_ReturnValue_3) == 0x000088, "Member 'WBP_Modern_FilterIcon_C_ToggleActivatedState::CallFunc_Format_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Modern_FilterIcon_C_ToggleActivatedState, CallFunc_IsFilterHasAtLeastOneDisplayedIcon_ReturnValue) == 0x0000A0, "Member 'WBP_Modern_FilterIcon_C_ToggleActivatedState::CallFunc_IsFilterHasAtLeastOneDisplayedIcon_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_FilterIcon_C_ToggleActivatedState, CallFunc_IsFilterHasAtLeastOneDisplayedIcon_ReturnValue_1) == 0x0000A1, "Member 'WBP_Modern_FilterIcon_C_ToggleActivatedState::CallFunc_IsFilterHasAtLeastOneDisplayedIcon_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_FilterIcon_C_ToggleActivatedState, CallFunc_Not_PreBool_ReturnValue) == 0x0000A2, "Member 'WBP_Modern_FilterIcon_C_ToggleActivatedState::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_FilterIcon_C_ToggleActivatedState, CallFunc_Not_PreBool_ReturnValue_1) == 0x0000A3, "Member 'WBP_Modern_FilterIcon_C_ToggleActivatedState::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");

// Function WBP_Modern_FilterIcon.WBP_Modern_FilterIcon_C.UpdateDesign
// 0x0004 (0x0004 - 0x0000)
struct WBP_Modern_FilterIcon_C_UpdateDesign final
{
public:
	bool                                          ActivatedState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_FilterIcon_C_UpdateDesign) == 0x000001, "Wrong alignment on WBP_Modern_FilterIcon_C_UpdateDesign");
static_assert(sizeof(WBP_Modern_FilterIcon_C_UpdateDesign) == 0x000004, "Wrong size on WBP_Modern_FilterIcon_C_UpdateDesign");
static_assert(offsetof(WBP_Modern_FilterIcon_C_UpdateDesign, ActivatedState) == 0x000000, "Member 'WBP_Modern_FilterIcon_C_UpdateDesign::ActivatedState' has a wrong offset!");
static_assert(offsetof(WBP_Modern_FilterIcon_C_UpdateDesign, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'WBP_Modern_FilterIcon_C_UpdateDesign::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_FilterIcon_C_UpdateDesign, CallFunc_BooleanAND_ReturnValue) == 0x000002, "Member 'WBP_Modern_FilterIcon_C_UpdateDesign::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_FilterIcon_C_UpdateDesign, CallFunc_BooleanOR_ReturnValue) == 0x000003, "Member 'WBP_Modern_FilterIcon_C_UpdateDesign::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function WBP_Modern_FilterIcon.WBP_Modern_FilterIcon_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct WBP_Modern_FilterIcon_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_FilterIcon_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_Modern_FilterIcon_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_Modern_FilterIcon_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong size on WBP_Modern_FilterIcon_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_Modern_FilterIcon_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_Modern_FilterIcon_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");

// Function WBP_Modern_FilterIcon.WBP_Modern_FilterIcon_C.IsNavigable
// 0x0003 (0x0003 - 0x0000)
struct WBP_Modern_FilterIcon_C_IsNavigable final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_FilterIcon_C_IsNavigable) == 0x000001, "Wrong alignment on WBP_Modern_FilterIcon_C_IsNavigable");
static_assert(sizeof(WBP_Modern_FilterIcon_C_IsNavigable) == 0x000003, "Wrong size on WBP_Modern_FilterIcon_C_IsNavigable");
static_assert(offsetof(WBP_Modern_FilterIcon_C_IsNavigable, ReturnValue) == 0x000000, "Member 'WBP_Modern_FilterIcon_C_IsNavigable::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_FilterIcon_C_IsNavigable, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'WBP_Modern_FilterIcon_C_IsNavigable::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_FilterIcon_C_IsNavigable, CallFunc_BooleanOR_ReturnValue) == 0x000002, "Member 'WBP_Modern_FilterIcon_C_IsNavigable::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

}

