#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LegacyMenu_StatsMiscEntry

#include "Basic.hpp"

#include "Altar_structs.hpp"
#include "Altar_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_LegacyMenu_StatsMiscEntry.WBP_LegacyMenu_StatsMiscEntry_C
// 0x0040 (0x0310 - 0x02D0)
class UWBP_LegacyMenu_StatsMiscEntry_C final : public UNavigationListviewEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             stat_misc_label;                                   // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             stat_misc_value;                                   // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_LegacyPrefab_FocusBox_C*           stat_p2_attribute_focus;                           // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLegacyStatsMenuMiscItemProperties     Properties;                                        // 0x02F0(0x0020)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_WBP_LegacyMenu_StatsMiscEntry(int32 EntryPoint);
	void OnListItemObjectSet(class UObject* ListItemObject);
	void OnSynchronizeProperties();
	void UpdateEntry();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_LegacyMenu_StatsMiscEntry_C">();
	}
	static class UWBP_LegacyMenu_StatsMiscEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_LegacyMenu_StatsMiscEntry_C>();
	}
};
static_assert(alignof(UWBP_LegacyMenu_StatsMiscEntry_C) == 0x000008, "Wrong alignment on UWBP_LegacyMenu_StatsMiscEntry_C");
static_assert(sizeof(UWBP_LegacyMenu_StatsMiscEntry_C) == 0x000310, "Wrong size on UWBP_LegacyMenu_StatsMiscEntry_C");
static_assert(offsetof(UWBP_LegacyMenu_StatsMiscEntry_C, UberGraphFrame) == 0x0002D0, "Member 'UWBP_LegacyMenu_StatsMiscEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_LegacyMenu_StatsMiscEntry_C, stat_misc_label) == 0x0002D8, "Member 'UWBP_LegacyMenu_StatsMiscEntry_C::stat_misc_label' has a wrong offset!");
static_assert(offsetof(UWBP_LegacyMenu_StatsMiscEntry_C, stat_misc_value) == 0x0002E0, "Member 'UWBP_LegacyMenu_StatsMiscEntry_C::stat_misc_value' has a wrong offset!");
static_assert(offsetof(UWBP_LegacyMenu_StatsMiscEntry_C, stat_p2_attribute_focus) == 0x0002E8, "Member 'UWBP_LegacyMenu_StatsMiscEntry_C::stat_p2_attribute_focus' has a wrong offset!");
static_assert(offsetof(UWBP_LegacyMenu_StatsMiscEntry_C, Properties) == 0x0002F0, "Member 'UWBP_LegacyMenu_StatsMiscEntry_C::Properties' has a wrong offset!");

}

