#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Modern_Settings_GamepadRebindWidget

#include "Basic.hpp"

#include "Altar_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_Modern_Settings_GamepadRebindWidget.WBP_Modern_Settings_GamepadRebindWidget_C.BindToRebindSubsystem
// 0x00A0 (0x00A0 - 0x0000)
struct WBP_Modern_Settings_GamepadRebindWidget_C_BindToRebindSubsystem final
{
public:
	struct FModernRebindSettingTableRow           CallFunc_GetRebindData_ReturnValue;                // 0x0000(0x0098)(ConstParm)
	class UVRebindGlobalSubsystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Settings_GamepadRebindWidget_C_BindToRebindSubsystem) == 0x000008, "Wrong alignment on WBP_Modern_Settings_GamepadRebindWidget_C_BindToRebindSubsystem");
static_assert(sizeof(WBP_Modern_Settings_GamepadRebindWidget_C_BindToRebindSubsystem) == 0x0000A0, "Wrong size on WBP_Modern_Settings_GamepadRebindWidget_C_BindToRebindSubsystem");
static_assert(offsetof(WBP_Modern_Settings_GamepadRebindWidget_C_BindToRebindSubsystem, CallFunc_GetRebindData_ReturnValue) == 0x000000, "Member 'WBP_Modern_Settings_GamepadRebindWidget_C_BindToRebindSubsystem::CallFunc_GetRebindData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_GamepadRebindWidget_C_BindToRebindSubsystem, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000098, "Member 'WBP_Modern_Settings_GamepadRebindWidget_C_BindToRebindSubsystem::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");

// Function WBP_Modern_Settings_GamepadRebindWidget.WBP_Modern_Settings_GamepadRebindWidget_C.ChangeErrorState
// 0x0001 (0x0001 - 0x0000)
struct WBP_Modern_Settings_GamepadRebindWidget_C_ChangeErrorState final
{
public:
	bool                                          bErrorState;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Settings_GamepadRebindWidget_C_ChangeErrorState) == 0x000001, "Wrong alignment on WBP_Modern_Settings_GamepadRebindWidget_C_ChangeErrorState");
static_assert(sizeof(WBP_Modern_Settings_GamepadRebindWidget_C_ChangeErrorState) == 0x000001, "Wrong size on WBP_Modern_Settings_GamepadRebindWidget_C_ChangeErrorState");
static_assert(offsetof(WBP_Modern_Settings_GamepadRebindWidget_C_ChangeErrorState, bErrorState) == 0x000000, "Member 'WBP_Modern_Settings_GamepadRebindWidget_C_ChangeErrorState::bErrorState' has a wrong offset!");

// Function WBP_Modern_Settings_GamepadRebindWidget.WBP_Modern_Settings_GamepadRebindWidget_C.ExecuteUbergraph_WBP_Modern_Settings_GamepadRebindWidget
// 0x00D0 (0x00D0 - 0x0000)
struct WBP_Modern_Settings_GamepadRebindWidget_C_ExecuteUbergraph_WBP_Modern_Settings_GamepadRebindWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bErrorState;                          // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Modern_Settings_NavigableKeySelector_C* K2Node_DynamicCast_AsWBP_Modern_Settings_Navigable_Key_Selector; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FModernRebindSettingTableRow           CallFunc_GetRebindData_ReturnValue;                // 0x0018(0x0098)(ConstParm)
	class UVUINavigationGlobalSubsystem*          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IVEnhancedInputNavigable> CallFunc_NavigateToWidget_Widget_CastInput;     // 0x00B8(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsCorrectInputType_ReturnValue;           // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Settings_GamepadRebindWidget_C_ExecuteUbergraph_WBP_Modern_Settings_GamepadRebindWidget) == 0x000008, "Wrong alignment on WBP_Modern_Settings_GamepadRebindWidget_C_ExecuteUbergraph_WBP_Modern_Settings_GamepadRebindWidget");
static_assert(sizeof(WBP_Modern_Settings_GamepadRebindWidget_C_ExecuteUbergraph_WBP_Modern_Settings_GamepadRebindWidget) == 0x0000D0, "Wrong size on WBP_Modern_Settings_GamepadRebindWidget_C_ExecuteUbergraph_WBP_Modern_Settings_GamepadRebindWidget");
static_assert(offsetof(WBP_Modern_Settings_GamepadRebindWidget_C_ExecuteUbergraph_WBP_Modern_Settings_GamepadRebindWidget, EntryPoint) == 0x000000, "Member 'WBP_Modern_Settings_GamepadRebindWidget_C_ExecuteUbergraph_WBP_Modern_Settings_GamepadRebindWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_GamepadRebindWidget_C_ExecuteUbergraph_WBP_Modern_Settings_GamepadRebindWidget, Temp_byte_Variable) == 0x000004, "Member 'WBP_Modern_Settings_GamepadRebindWidget_C_ExecuteUbergraph_WBP_Modern_Settings_GamepadRebindWidget::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_GamepadRebindWidget_C_ExecuteUbergraph_WBP_Modern_Settings_GamepadRebindWidget, Temp_byte_Variable_1) == 0x000005, "Member 'WBP_Modern_Settings_GamepadRebindWidget_C_ExecuteUbergraph_WBP_Modern_Settings_GamepadRebindWidget::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_GamepadRebindWidget_C_ExecuteUbergraph_WBP_Modern_Settings_GamepadRebindWidget, K2Node_Event_bErrorState) == 0x000006, "Member 'WBP_Modern_Settings_GamepadRebindWidget_C_ExecuteUbergraph_WBP_Modern_Settings_GamepadRebindWidget::K2Node_Event_bErrorState' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_GamepadRebindWidget_C_ExecuteUbergraph_WBP_Modern_Settings_GamepadRebindWidget, Temp_bool_Variable) == 0x000007, "Member 'WBP_Modern_Settings_GamepadRebindWidget_C_ExecuteUbergraph_WBP_Modern_Settings_GamepadRebindWidget::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_GamepadRebindWidget_C_ExecuteUbergraph_WBP_Modern_Settings_GamepadRebindWidget, K2Node_DynamicCast_AsWBP_Modern_Settings_Navigable_Key_Selector) == 0x000008, "Member 'WBP_Modern_Settings_GamepadRebindWidget_C_ExecuteUbergraph_WBP_Modern_Settings_GamepadRebindWidget::K2Node_DynamicCast_AsWBP_Modern_Settings_Navigable_Key_Selector' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_GamepadRebindWidget_C_ExecuteUbergraph_WBP_Modern_Settings_GamepadRebindWidget, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'WBP_Modern_Settings_GamepadRebindWidget_C_ExecuteUbergraph_WBP_Modern_Settings_GamepadRebindWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_GamepadRebindWidget_C_ExecuteUbergraph_WBP_Modern_Settings_GamepadRebindWidget, K2Node_Event_IsDesignTime) == 0x000011, "Member 'WBP_Modern_Settings_GamepadRebindWidget_C_ExecuteUbergraph_WBP_Modern_Settings_GamepadRebindWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_GamepadRebindWidget_C_ExecuteUbergraph_WBP_Modern_Settings_GamepadRebindWidget, CallFunc_GetRebindData_ReturnValue) == 0x000018, "Member 'WBP_Modern_Settings_GamepadRebindWidget_C_ExecuteUbergraph_WBP_Modern_Settings_GamepadRebindWidget::CallFunc_GetRebindData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_GamepadRebindWidget_C_ExecuteUbergraph_WBP_Modern_Settings_GamepadRebindWidget, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x0000B0, "Member 'WBP_Modern_Settings_GamepadRebindWidget_C_ExecuteUbergraph_WBP_Modern_Settings_GamepadRebindWidget::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_GamepadRebindWidget_C_ExecuteUbergraph_WBP_Modern_Settings_GamepadRebindWidget, CallFunc_NavigateToWidget_Widget_CastInput) == 0x0000B8, "Member 'WBP_Modern_Settings_GamepadRebindWidget_C_ExecuteUbergraph_WBP_Modern_Settings_GamepadRebindWidget::CallFunc_NavigateToWidget_Widget_CastInput' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_GamepadRebindWidget_C_ExecuteUbergraph_WBP_Modern_Settings_GamepadRebindWidget, CallFunc_IsCorrectInputType_ReturnValue) == 0x0000C8, "Member 'WBP_Modern_Settings_GamepadRebindWidget_C_ExecuteUbergraph_WBP_Modern_Settings_GamepadRebindWidget::CallFunc_IsCorrectInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_GamepadRebindWidget_C_ExecuteUbergraph_WBP_Modern_Settings_GamepadRebindWidget, K2Node_Select_Default) == 0x0000C9, "Member 'WBP_Modern_Settings_GamepadRebindWidget_C_ExecuteUbergraph_WBP_Modern_Settings_GamepadRebindWidget::K2Node_Select_Default' has a wrong offset!");

// Function WBP_Modern_Settings_GamepadRebindWidget.WBP_Modern_Settings_GamepadRebindWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Modern_Settings_GamepadRebindWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Settings_GamepadRebindWidget_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_Modern_Settings_GamepadRebindWidget_C_PreConstruct");
static_assert(sizeof(WBP_Modern_Settings_GamepadRebindWidget_C_PreConstruct) == 0x000001, "Wrong size on WBP_Modern_Settings_GamepadRebindWidget_C_PreConstruct");
static_assert(offsetof(WBP_Modern_Settings_GamepadRebindWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_Modern_Settings_GamepadRebindWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_Modern_Settings_GamepadRebindWidget.WBP_Modern_Settings_GamepadRebindWidget_C.UnbindToRebindSubsystem
// 0x0008 (0x0008 - 0x0000)
struct WBP_Modern_Settings_GamepadRebindWidget_C_UnbindToRebindSubsystem final
{
public:
	class UVRebindGlobalSubsystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Settings_GamepadRebindWidget_C_UnbindToRebindSubsystem) == 0x000008, "Wrong alignment on WBP_Modern_Settings_GamepadRebindWidget_C_UnbindToRebindSubsystem");
static_assert(sizeof(WBP_Modern_Settings_GamepadRebindWidget_C_UnbindToRebindSubsystem) == 0x000008, "Wrong size on WBP_Modern_Settings_GamepadRebindWidget_C_UnbindToRebindSubsystem");
static_assert(offsetof(WBP_Modern_Settings_GamepadRebindWidget_C_UnbindToRebindSubsystem, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000000, "Member 'WBP_Modern_Settings_GamepadRebindWidget_C_UnbindToRebindSubsystem::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");

// Function WBP_Modern_Settings_GamepadRebindWidget.WBP_Modern_Settings_GamepadRebindWidget_C.UpdateTexts
// 0x0018 (0x0018 - 0x0000)
struct WBP_Modern_Settings_GamepadRebindWidget_C_UpdateTexts final
{
public:
	class FText                                   NewText;                                           // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Modern_Settings_GamepadRebindWidget_C_UpdateTexts) == 0x000008, "Wrong alignment on WBP_Modern_Settings_GamepadRebindWidget_C_UpdateTexts");
static_assert(sizeof(WBP_Modern_Settings_GamepadRebindWidget_C_UpdateTexts) == 0x000018, "Wrong size on WBP_Modern_Settings_GamepadRebindWidget_C_UpdateTexts");
static_assert(offsetof(WBP_Modern_Settings_GamepadRebindWidget_C_UpdateTexts, NewText) == 0x000000, "Member 'WBP_Modern_Settings_GamepadRebindWidget_C_UpdateTexts::NewText' has a wrong offset!");

// Function WBP_Modern_Settings_GamepadRebindWidget.WBP_Modern_Settings_GamepadRebindWidget_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct WBP_Modern_Settings_GamepadRebindWidget_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Settings_GamepadRebindWidget_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_Modern_Settings_GamepadRebindWidget_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_Modern_Settings_GamepadRebindWidget_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong size on WBP_Modern_Settings_GamepadRebindWidget_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_Modern_Settings_GamepadRebindWidget_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_Modern_Settings_GamepadRebindWidget_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");

}

