#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_OriginalMenu_InventoryItemSpecificContentPotion

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_OriginalMenu_InventoryItemSpecificContentPotion.WBP_OriginalMenu_InventoryItemSpecificContentPotion_C
// 0x0018 (0x0300 - 0x02E8)
class UWBP_OriginalMenu_InventoryItemSpecificContentPotion_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_LegacyMenu_Added_Effects_List_C*   inv_potion_effctsList;                             // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        ScrollEffectsSpeed;                                // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_OriginalMenu_InventoryItemSpecificContentPotion(int32 EntryPoint);
	void InpActEvt_IA_UI_Specific_InventoryContainerMenu_ScrollEffects_K2Node_EnhancedInputActionEvent_0(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_OriginalMenu_InventoryItemSpecificContentPotion_C">();
	}
	static class UWBP_OriginalMenu_InventoryItemSpecificContentPotion_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_OriginalMenu_InventoryItemSpecificContentPotion_C>();
	}
};
static_assert(alignof(UWBP_OriginalMenu_InventoryItemSpecificContentPotion_C) == 0x000008, "Wrong alignment on UWBP_OriginalMenu_InventoryItemSpecificContentPotion_C");
static_assert(sizeof(UWBP_OriginalMenu_InventoryItemSpecificContentPotion_C) == 0x000300, "Wrong size on UWBP_OriginalMenu_InventoryItemSpecificContentPotion_C");
static_assert(offsetof(UWBP_OriginalMenu_InventoryItemSpecificContentPotion_C, UberGraphFrame) == 0x0002E8, "Member 'UWBP_OriginalMenu_InventoryItemSpecificContentPotion_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryItemSpecificContentPotion_C, inv_potion_effctsList) == 0x0002F0, "Member 'UWBP_OriginalMenu_InventoryItemSpecificContentPotion_C::inv_potion_effctsList' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryItemSpecificContentPotion_C, ScrollEffectsSpeed) == 0x0002F8, "Member 'UWBP_OriginalMenu_InventoryItemSpecificContentPotion_C::ScrollEffectsSpeed' has a wrong offset!");

}

