#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LegacyMenu_AddedEffects

#include "Basic.hpp"

#include "CommonInput_structs.hpp"
#include "Altar_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "WBP_ModernPrefab_NavigableButton_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_LegacyMenu_AddedEffects.WBP_LegacyMenu_AddedEffects_C
// 0x0200 (0x18C0 - 0x16C0)
class UWBP_LegacyMenu_AddedEffects_C final : public UWBP_ModernPrefab_NavigableButton_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_LegacyMenu_AddedEffects_C;      // 0x16C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         AreaBox;                                           // 0x16C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AltarTextBlock_C*                  AreaText;                                          // 0x16D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         DurationBox;                                       // 0x16D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AltarTextBlock_C*                  DurationText;                                      // 0x16E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               Effect_Icon;                                       // 0x16E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AltarTextBlock_C*                  Effect_Name;                                       // 0x16F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                EffectName_Spacer;                                 // 0x16F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         MagickaBox;                                        // 0x1700(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AltarTextBlock_C*                  MagickaCost_Text;                                  // 0x1708(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AltarTextBlock_C*                  MagicTypeName;                                     // 0x1710(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AltarTextBlock_C*                  Magnitude_Text;                                    // 0x1718(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         MagnitudeBox;                                      // 0x1720(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModernPrefab_Focusbox_C*           spell_item_focusbox;                               // 0x1728(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Stats_Box;                                         // 0x1730(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAkAudioEvent*                          FocusSound;                                        // 0x1738(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FModernEffectItemData                  EffectItemProperty;                                // 0x1740(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMulticastInlineDelegate<void(const struct FModernEffectItemData& NewParam)> OnClick;            // 0x17A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMap<EModernEffectItemRange, class FText>     RangeText;                                         // 0x17B0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bShouldCollapsedOnUnfocus;                         // 0x1800(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1801[0x7];                                     // 0x1801(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EModernSpellType, class FText>           SpellTypeText;                                     // 0x1808(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<EModernSpellType, class UTexture2D*>     SpellTypeIcon;                                     // 0x1858(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMulticastInlineDelegate<void(const struct FModernEffectItemData& Properties)> OnRelease;        // 0x18A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BP_OnClicked();
	void BP_OnInputMethodChanged(ECommonInputType CurrentInputType);
	void BP_OnReleased();
	void Construct();
	void ExecuteUbergraph_WBP_LegacyMenu_AddedEffects(int32 EntryPoint);
	void OnFocus();
	void OnInitButtonWidgets();
	void OnListItemObjectSet(class UObject* ListItemObject);
	void OnUnfocus();
	void SetProperties(const struct FModernEffectItemData& NewProperties);
	void SetPropertiesText();
	void SetPropertiesVisibility();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_LegacyMenu_AddedEffects_C">();
	}
	static class UWBP_LegacyMenu_AddedEffects_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_LegacyMenu_AddedEffects_C>();
	}
};
static_assert(alignof(UWBP_LegacyMenu_AddedEffects_C) == 0x000010, "Wrong alignment on UWBP_LegacyMenu_AddedEffects_C");
static_assert(sizeof(UWBP_LegacyMenu_AddedEffects_C) == 0x0018C0, "Wrong size on UWBP_LegacyMenu_AddedEffects_C");
static_assert(offsetof(UWBP_LegacyMenu_AddedEffects_C, UberGraphFrame_WBP_LegacyMenu_AddedEffects_C) == 0x0016C0, "Member 'UWBP_LegacyMenu_AddedEffects_C::UberGraphFrame_WBP_LegacyMenu_AddedEffects_C' has a wrong offset!");
static_assert(offsetof(UWBP_LegacyMenu_AddedEffects_C, AreaBox) == 0x0016C8, "Member 'UWBP_LegacyMenu_AddedEffects_C::AreaBox' has a wrong offset!");
static_assert(offsetof(UWBP_LegacyMenu_AddedEffects_C, AreaText) == 0x0016D0, "Member 'UWBP_LegacyMenu_AddedEffects_C::AreaText' has a wrong offset!");
static_assert(offsetof(UWBP_LegacyMenu_AddedEffects_C, DurationBox) == 0x0016D8, "Member 'UWBP_LegacyMenu_AddedEffects_C::DurationBox' has a wrong offset!");
static_assert(offsetof(UWBP_LegacyMenu_AddedEffects_C, DurationText) == 0x0016E0, "Member 'UWBP_LegacyMenu_AddedEffects_C::DurationText' has a wrong offset!");
static_assert(offsetof(UWBP_LegacyMenu_AddedEffects_C, Effect_Icon) == 0x0016E8, "Member 'UWBP_LegacyMenu_AddedEffects_C::Effect_Icon' has a wrong offset!");
static_assert(offsetof(UWBP_LegacyMenu_AddedEffects_C, Effect_Name) == 0x0016F0, "Member 'UWBP_LegacyMenu_AddedEffects_C::Effect_Name' has a wrong offset!");
static_assert(offsetof(UWBP_LegacyMenu_AddedEffects_C, EffectName_Spacer) == 0x0016F8, "Member 'UWBP_LegacyMenu_AddedEffects_C::EffectName_Spacer' has a wrong offset!");
static_assert(offsetof(UWBP_LegacyMenu_AddedEffects_C, MagickaBox) == 0x001700, "Member 'UWBP_LegacyMenu_AddedEffects_C::MagickaBox' has a wrong offset!");
static_assert(offsetof(UWBP_LegacyMenu_AddedEffects_C, MagickaCost_Text) == 0x001708, "Member 'UWBP_LegacyMenu_AddedEffects_C::MagickaCost_Text' has a wrong offset!");
static_assert(offsetof(UWBP_LegacyMenu_AddedEffects_C, MagicTypeName) == 0x001710, "Member 'UWBP_LegacyMenu_AddedEffects_C::MagicTypeName' has a wrong offset!");
static_assert(offsetof(UWBP_LegacyMenu_AddedEffects_C, Magnitude_Text) == 0x001718, "Member 'UWBP_LegacyMenu_AddedEffects_C::Magnitude_Text' has a wrong offset!");
static_assert(offsetof(UWBP_LegacyMenu_AddedEffects_C, MagnitudeBox) == 0x001720, "Member 'UWBP_LegacyMenu_AddedEffects_C::MagnitudeBox' has a wrong offset!");
static_assert(offsetof(UWBP_LegacyMenu_AddedEffects_C, spell_item_focusbox) == 0x001728, "Member 'UWBP_LegacyMenu_AddedEffects_C::spell_item_focusbox' has a wrong offset!");
static_assert(offsetof(UWBP_LegacyMenu_AddedEffects_C, Stats_Box) == 0x001730, "Member 'UWBP_LegacyMenu_AddedEffects_C::Stats_Box' has a wrong offset!");
static_assert(offsetof(UWBP_LegacyMenu_AddedEffects_C, FocusSound) == 0x001738, "Member 'UWBP_LegacyMenu_AddedEffects_C::FocusSound' has a wrong offset!");
static_assert(offsetof(UWBP_LegacyMenu_AddedEffects_C, EffectItemProperty) == 0x001740, "Member 'UWBP_LegacyMenu_AddedEffects_C::EffectItemProperty' has a wrong offset!");
static_assert(offsetof(UWBP_LegacyMenu_AddedEffects_C, OnClick) == 0x0017A0, "Member 'UWBP_LegacyMenu_AddedEffects_C::OnClick' has a wrong offset!");
static_assert(offsetof(UWBP_LegacyMenu_AddedEffects_C, RangeText) == 0x0017B0, "Member 'UWBP_LegacyMenu_AddedEffects_C::RangeText' has a wrong offset!");
static_assert(offsetof(UWBP_LegacyMenu_AddedEffects_C, bShouldCollapsedOnUnfocus) == 0x001800, "Member 'UWBP_LegacyMenu_AddedEffects_C::bShouldCollapsedOnUnfocus' has a wrong offset!");
static_assert(offsetof(UWBP_LegacyMenu_AddedEffects_C, SpellTypeText) == 0x001808, "Member 'UWBP_LegacyMenu_AddedEffects_C::SpellTypeText' has a wrong offset!");
static_assert(offsetof(UWBP_LegacyMenu_AddedEffects_C, SpellTypeIcon) == 0x001858, "Member 'UWBP_LegacyMenu_AddedEffects_C::SpellTypeIcon' has a wrong offset!");
static_assert(offsetof(UWBP_LegacyMenu_AddedEffects_C, OnRelease) == 0x0018A8, "Member 'UWBP_LegacyMenu_AddedEffects_C::OnRelease' has a wrong offset!");

}

