#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Modern_MapIconFilter

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Altar_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Modern_MapIconFilter.WBP_Modern_MapIconFilter_C
// 0x0030 (0x0628 - 0x05F8)
class UWBP_Modern_MapIconFilter_C final : public UVModern_MapIconFilter
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_ModernPrefab_ControllerInputHint_C* FilterInputHint;                                  // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(bool IsFocus)>  OnFilterFocussed;                                  // 0x0608(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          IsShowingAll;                                      // 0x0618(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_619[0x7];                                      // 0x0619(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Modern_FilterIcon_C*               ControlIcon;                                       // 0x0620(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Modern_MapIconFilter(int32 EntryPoint);
	void InitializeFilterIcon(class UCommonUserWidget* Icon, const struct FModern_AltarMapIconDesignTableRow& Design, bool IsControl);
	void OnFilterIconCreated(class UCommonUserWidget* NewFilter, const struct FModern_AltarMapIconDesignTableRow& FilterDesign, bool bIsControlFilter);
	void OnFocus();
	void OnPostTryRegisterWidgetToFilter();
	void OnUnfocus();
	void OnWidgetRegisterToFilter(class UCommonUserWidget* Filter, class UCommonUserWidget* NewWidgetToFilter, int32 NumberOfFilteredObjects);
	void OnWidgetUnregisterToFilter(class UCommonUserWidget* Filter, class UCommonUserWidget* RemovedWidget, int32 NumberOfFilteredObjects);
	void RequestUpdateFilteredWidget(class UCommonUserWidget* FilteredWidget, bool bCanBeDisplay);
	void RequestUpdateFilterWidget(class UCommonUserWidget* Filter, bool bIsEnable);
	void UpdateFilteredWidgetVisibility(class UCommonUserWidget* Filtered, bool CanBeDisplay);
	void UpdateFilterIcon(class UCommonUserWidget* Icon, bool IsIconEnable);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Modern_MapIconFilter_C">();
	}
	static class UWBP_Modern_MapIconFilter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Modern_MapIconFilter_C>();
	}
};
static_assert(alignof(UWBP_Modern_MapIconFilter_C) == 0x000008, "Wrong alignment on UWBP_Modern_MapIconFilter_C");
static_assert(sizeof(UWBP_Modern_MapIconFilter_C) == 0x000628, "Wrong size on UWBP_Modern_MapIconFilter_C");
static_assert(offsetof(UWBP_Modern_MapIconFilter_C, UberGraphFrame) == 0x0005F8, "Member 'UWBP_Modern_MapIconFilter_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_MapIconFilter_C, FilterInputHint) == 0x000600, "Member 'UWBP_Modern_MapIconFilter_C::FilterInputHint' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_MapIconFilter_C, OnFilterFocussed) == 0x000608, "Member 'UWBP_Modern_MapIconFilter_C::OnFilterFocussed' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_MapIconFilter_C, IsShowingAll) == 0x000618, "Member 'UWBP_Modern_MapIconFilter_C::IsShowingAll' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_MapIconFilter_C, ControlIcon) == 0x000620, "Member 'UWBP_Modern_MapIconFilter_C::ControlIcon' has a wrong offset!");

}

