#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Modern_Menu_Dialog_Button

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Modern_Menu_Dialog_Button.WBP_Modern_Menu_Dialog_Button_C.BndEvt__WBP_Modern_Menu_Dialog_Button_dialog_button_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Modern_Menu_Dialog_Button_C_BndEvt__WBP_Modern_Menu_Dialog_Button_dialog_button_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Menu_Dialog_Button_C_BndEvt__WBP_Modern_Menu_Dialog_Button_dialog_button_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Modern_Menu_Dialog_Button_C_BndEvt__WBP_Modern_Menu_Dialog_Button_dialog_button_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_Modern_Menu_Dialog_Button_C_BndEvt__WBP_Modern_Menu_Dialog_Button_dialog_button_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Modern_Menu_Dialog_Button_C_BndEvt__WBP_Modern_Menu_Dialog_Button_dialog_button_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_Modern_Menu_Dialog_Button_C_BndEvt__WBP_Modern_Menu_Dialog_Button_dialog_button_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_Modern_Menu_Dialog_Button_C_BndEvt__WBP_Modern_Menu_Dialog_Button_dialog_button_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_Modern_Menu_Dialog_Button.WBP_Modern_Menu_Dialog_Button_C.ExecuteUbergraph_WBP_Modern_Menu_Dialog_Button
// 0x0018 (0x0018 - 0x0000)
struct WBP_Modern_Menu_Dialog_Button_C_ExecuteUbergraph_WBP_Modern_Menu_Dialog_Button final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsFocussed_ReturnValue;                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Menu_Dialog_Button_C_ExecuteUbergraph_WBP_Modern_Menu_Dialog_Button) == 0x000008, "Wrong alignment on WBP_Modern_Menu_Dialog_Button_C_ExecuteUbergraph_WBP_Modern_Menu_Dialog_Button");
static_assert(sizeof(WBP_Modern_Menu_Dialog_Button_C_ExecuteUbergraph_WBP_Modern_Menu_Dialog_Button) == 0x000018, "Wrong size on WBP_Modern_Menu_Dialog_Button_C_ExecuteUbergraph_WBP_Modern_Menu_Dialog_Button");
static_assert(offsetof(WBP_Modern_Menu_Dialog_Button_C_ExecuteUbergraph_WBP_Modern_Menu_Dialog_Button, EntryPoint) == 0x000000, "Member 'WBP_Modern_Menu_Dialog_Button_C_ExecuteUbergraph_WBP_Modern_Menu_Dialog_Button::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Dialog_Button_C_ExecuteUbergraph_WBP_Modern_Menu_Dialog_Button, K2Node_ComponentBoundEvent_Button) == 0x000008, "Member 'WBP_Modern_Menu_Dialog_Button_C_ExecuteUbergraph_WBP_Modern_Menu_Dialog_Button::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Dialog_Button_C_ExecuteUbergraph_WBP_Modern_Menu_Dialog_Button, CallFunc_GetIsFocussed_ReturnValue) == 0x000010, "Member 'WBP_Modern_Menu_Dialog_Button_C_ExecuteUbergraph_WBP_Modern_Menu_Dialog_Button::CallFunc_GetIsFocussed_ReturnValue' has a wrong offset!");

// Function WBP_Modern_Menu_Dialog_Button.WBP_Modern_Menu_Dialog_Button_C.IsButtonHovered
// 0x0002 (0x0002 - 0x0000)
struct WBP_Modern_Menu_Dialog_Button_C_IsButtonHovered final
{
public:
	bool                                          IsHovered_0;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHovered_ReturnValue;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Menu_Dialog_Button_C_IsButtonHovered) == 0x000001, "Wrong alignment on WBP_Modern_Menu_Dialog_Button_C_IsButtonHovered");
static_assert(sizeof(WBP_Modern_Menu_Dialog_Button_C_IsButtonHovered) == 0x000002, "Wrong size on WBP_Modern_Menu_Dialog_Button_C_IsButtonHovered");
static_assert(offsetof(WBP_Modern_Menu_Dialog_Button_C_IsButtonHovered, IsHovered_0) == 0x000000, "Member 'WBP_Modern_Menu_Dialog_Button_C_IsButtonHovered::IsHovered_0' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Dialog_Button_C_IsButtonHovered, CallFunc_IsHovered_ReturnValue) == 0x000001, "Member 'WBP_Modern_Menu_Dialog_Button_C_IsButtonHovered::CallFunc_IsHovered_ReturnValue' has a wrong offset!");

// Function WBP_Modern_Menu_Dialog_Button.WBP_Modern_Menu_Dialog_Button_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct WBP_Modern_Menu_Dialog_Button_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Menu_Dialog_Button_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_Modern_Menu_Dialog_Button_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_Modern_Menu_Dialog_Button_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong size on WBP_Modern_Menu_Dialog_Button_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_Modern_Menu_Dialog_Button_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_Modern_Menu_Dialog_Button_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");

}

