#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Modern_Onboarding_TitleScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Altar_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Modern_Onboarding_TitleScreen.WBP_Modern_Onboarding_TitleScreen_C
// 0x0038 (0x0530 - 0x04F8)
class UWBP_Modern_Onboarding_TitleScreen_C final : public UVModernOnboardingPage
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ExitAnimation;                                     // 0x0500(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       EnterAnimation;                                    // 0x0508(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Gradient;                                          // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                MouseClickCatcher;                                 // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AltarTextBlock_C*                  PressText;                                         // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          CanContinue;                                       // 0x0528(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEndAnimationFinished;                            // 0x0529(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_Modern_Onboarding_TitleScreen_MouseClickCatcher_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BP_OnTirggeringActionCommited();
	void Construct();
	void ExecuteUbergraph_WBP_Modern_Onboarding_TitleScreen(int32 EntryPoint);
	void InpActEvt_IA_UI_Specific_OnboardingTitleScreen_Any_K2Node_EnhancedInputActionEvent_0(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void LaunchExitAnimation();
	void OnEnter();
	void OnExitAnimationEnded();

	class UWidget* BP_GetDesiredFocusTarget() const;
	bool CanEnter() const;
	bool CanExit() const;
	bool DoesNeedEnterAnimation() const;
	bool DoesNeedExitAnimation() const;
	bool ShouldBeSkiped() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Modern_Onboarding_TitleScreen_C">();
	}
	static class UWBP_Modern_Onboarding_TitleScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Modern_Onboarding_TitleScreen_C>();
	}
};
static_assert(alignof(UWBP_Modern_Onboarding_TitleScreen_C) == 0x000008, "Wrong alignment on UWBP_Modern_Onboarding_TitleScreen_C");
static_assert(sizeof(UWBP_Modern_Onboarding_TitleScreen_C) == 0x000530, "Wrong size on UWBP_Modern_Onboarding_TitleScreen_C");
static_assert(offsetof(UWBP_Modern_Onboarding_TitleScreen_C, UberGraphFrame) == 0x0004F8, "Member 'UWBP_Modern_Onboarding_TitleScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Onboarding_TitleScreen_C, ExitAnimation) == 0x000500, "Member 'UWBP_Modern_Onboarding_TitleScreen_C::ExitAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Onboarding_TitleScreen_C, EnterAnimation) == 0x000508, "Member 'UWBP_Modern_Onboarding_TitleScreen_C::EnterAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Onboarding_TitleScreen_C, Gradient) == 0x000510, "Member 'UWBP_Modern_Onboarding_TitleScreen_C::Gradient' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Onboarding_TitleScreen_C, MouseClickCatcher) == 0x000518, "Member 'UWBP_Modern_Onboarding_TitleScreen_C::MouseClickCatcher' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Onboarding_TitleScreen_C, PressText) == 0x000520, "Member 'UWBP_Modern_Onboarding_TitleScreen_C::PressText' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Onboarding_TitleScreen_C, CanContinue) == 0x000528, "Member 'UWBP_Modern_Onboarding_TitleScreen_C::CanContinue' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Onboarding_TitleScreen_C, IsEndAnimationFinished) == 0x000529, "Member 'UWBP_Modern_Onboarding_TitleScreen_C::IsEndAnimationFinished' has a wrong offset!");

}

