#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PairedPawnLocomotionDebugInfo

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Altar_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_PairedPawnLocomotionDebugInfo.WBP_PairedPawnLocomotionDebugInfo_C.Get_WidgetTitle_Text
// 0x0060 (0x0060 - 0x0000)
struct WBP_PairedPawnLocomotionDebugInfo_C_Get_WidgetTitle_Text final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AVPairedPawn*                           K2Node_DynamicCast_AsVPaired_Pawn;                 // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0048(0x0018)()
};
static_assert(alignof(WBP_PairedPawnLocomotionDebugInfo_C_Get_WidgetTitle_Text) == 0x000008, "Wrong alignment on WBP_PairedPawnLocomotionDebugInfo_C_Get_WidgetTitle_Text");
static_assert(sizeof(WBP_PairedPawnLocomotionDebugInfo_C_Get_WidgetTitle_Text) == 0x000060, "Wrong size on WBP_PairedPawnLocomotionDebugInfo_C_Get_WidgetTitle_Text");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_WidgetTitle_Text, ReturnValue) == 0x000000, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_WidgetTitle_Text::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_WidgetTitle_Text, CallFunc_GetOwningPlayerPawn_ReturnValue) == 0x000018, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_WidgetTitle_Text::CallFunc_GetOwningPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_WidgetTitle_Text, K2Node_DynamicCast_AsVPaired_Pawn) == 0x000020, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_WidgetTitle_Text::K2Node_DynamicCast_AsVPaired_Pawn' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_WidgetTitle_Text, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_WidgetTitle_Text::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_WidgetTitle_Text, CallFunc_GetDisplayName_ReturnValue) == 0x000030, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_WidgetTitle_Text::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_WidgetTitle_Text, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_WidgetTitle_Text::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_WidgetTitle_Text, CallFunc_Conv_StringToText_ReturnValue) == 0x000048, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_WidgetTitle_Text::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function WBP_PairedPawnLocomotionDebugInfo.WBP_PairedPawnLocomotionDebugInfo_C.Get_SpeedValue_Text
// 0x00A0 (0x00A0 - 0x0000)
struct WBP_PairedPawnLocomotionDebugInfo_C_Get_SpeedValue_Text final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AVPairedPawn*                           K2Node_DynamicCast_AsVPaired_Pawn;                 // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue;          // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0088(0x0018)()
};
static_assert(alignof(WBP_PairedPawnLocomotionDebugInfo_C_Get_SpeedValue_Text) == 0x000008, "Wrong alignment on WBP_PairedPawnLocomotionDebugInfo_C_Get_SpeedValue_Text");
static_assert(sizeof(WBP_PairedPawnLocomotionDebugInfo_C_Get_SpeedValue_Text) == 0x0000A0, "Wrong size on WBP_PairedPawnLocomotionDebugInfo_C_Get_SpeedValue_Text");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_SpeedValue_Text, ReturnValue) == 0x000000, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_SpeedValue_Text::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_SpeedValue_Text, CallFunc_GetOwningPlayerPawn_ReturnValue) == 0x000018, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_SpeedValue_Text::CallFunc_GetOwningPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_SpeedValue_Text, K2Node_DynamicCast_AsVPaired_Pawn) == 0x000020, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_SpeedValue_Text::K2Node_DynamicCast_AsVPaired_Pawn' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_SpeedValue_Text, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_SpeedValue_Text::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_SpeedValue_Text, CallFunc_GetVelocity_ReturnValue) == 0x000030, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_SpeedValue_Text::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_SpeedValue_Text, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_SpeedValue_Text::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_SpeedValue_Text, CallFunc_VSize_ReturnValue) == 0x000050, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_SpeedValue_Text::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_SpeedValue_Text, CallFunc_Conv_DoubleToString_ReturnValue) == 0x000058, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_SpeedValue_Text::CallFunc_Conv_DoubleToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_SpeedValue_Text, CallFunc_Concat_StrStr_ReturnValue) == 0x000068, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_SpeedValue_Text::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_SpeedValue_Text, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000078, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_SpeedValue_Text::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_SpeedValue_Text, CallFunc_Conv_StringToText_ReturnValue) == 0x000088, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_SpeedValue_Text::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function WBP_PairedPawnLocomotionDebugInfo.WBP_PairedPawnLocomotionDebugInfo_C.Get_ObvSpeedValue_Text
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvSpeedValue_Text final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AVPairedPawn*                           K2Node_DynamicCast_AsVPaired_Pawn;                 // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatModifiedActorValue_ReturnValue;   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue;          // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatBaseActorValue_ReturnValue;       // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue_1;        // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0088(0x0018)()
	double                                        CallFunc_Conv_DoubleToString_InDouble_ImplicitCast; // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_DoubleToString_InDouble_ImplicitCast_1; // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvSpeedValue_Text) == 0x000008, "Wrong alignment on WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvSpeedValue_Text");
static_assert(sizeof(WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvSpeedValue_Text) == 0x0000B0, "Wrong size on WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvSpeedValue_Text");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvSpeedValue_Text, ReturnValue) == 0x000000, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvSpeedValue_Text::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvSpeedValue_Text, CallFunc_GetOwningPlayerPawn_ReturnValue) == 0x000018, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvSpeedValue_Text::CallFunc_GetOwningPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvSpeedValue_Text, K2Node_DynamicCast_AsVPaired_Pawn) == 0x000020, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvSpeedValue_Text::K2Node_DynamicCast_AsVPaired_Pawn' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvSpeedValue_Text, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvSpeedValue_Text::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvSpeedValue_Text, CallFunc_IsValid_ReturnValue) == 0x000029, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvSpeedValue_Text::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvSpeedValue_Text, CallFunc_GetFloatModifiedActorValue_ReturnValue) == 0x00002C, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvSpeedValue_Text::CallFunc_GetFloatModifiedActorValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvSpeedValue_Text, CallFunc_Conv_DoubleToString_ReturnValue) == 0x000030, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvSpeedValue_Text::CallFunc_Conv_DoubleToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvSpeedValue_Text, CallFunc_GetFloatBaseActorValue_ReturnValue) == 0x000040, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvSpeedValue_Text::CallFunc_GetFloatBaseActorValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvSpeedValue_Text, CallFunc_Conv_DoubleToString_ReturnValue_1) == 0x000048, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvSpeedValue_Text::CallFunc_Conv_DoubleToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvSpeedValue_Text, CallFunc_Concat_StrStr_ReturnValue) == 0x000058, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvSpeedValue_Text::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvSpeedValue_Text, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000068, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvSpeedValue_Text::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvSpeedValue_Text, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000078, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvSpeedValue_Text::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvSpeedValue_Text, CallFunc_Conv_StringToText_ReturnValue) == 0x000088, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvSpeedValue_Text::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvSpeedValue_Text, CallFunc_Conv_DoubleToString_InDouble_ImplicitCast) == 0x0000A0, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvSpeedValue_Text::CallFunc_Conv_DoubleToString_InDouble_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvSpeedValue_Text, CallFunc_Conv_DoubleToString_InDouble_ImplicitCast_1) == 0x0000A8, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvSpeedValue_Text::CallFunc_Conv_DoubleToString_InDouble_ImplicitCast_1' has a wrong offset!");

// Function WBP_PairedPawnLocomotionDebugInfo.WBP_PairedPawnLocomotionDebugInfo_C.Get_ObvAthleticsValue_Text
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAthleticsValue_Text final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AVPairedPawn*                           K2Node_DynamicCast_AsVPaired_Pawn;                 // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatModifiedActorValue_ReturnValue;   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue;          // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatBaseActorValue_ReturnValue;       // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue_1;        // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0088(0x0018)()
	double                                        CallFunc_Conv_DoubleToString_InDouble_ImplicitCast; // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_DoubleToString_InDouble_ImplicitCast_1; // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAthleticsValue_Text) == 0x000008, "Wrong alignment on WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAthleticsValue_Text");
static_assert(sizeof(WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAthleticsValue_Text) == 0x0000B0, "Wrong size on WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAthleticsValue_Text");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAthleticsValue_Text, ReturnValue) == 0x000000, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAthleticsValue_Text::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAthleticsValue_Text, CallFunc_GetOwningPlayerPawn_ReturnValue) == 0x000018, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAthleticsValue_Text::CallFunc_GetOwningPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAthleticsValue_Text, K2Node_DynamicCast_AsVPaired_Pawn) == 0x000020, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAthleticsValue_Text::K2Node_DynamicCast_AsVPaired_Pawn' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAthleticsValue_Text, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAthleticsValue_Text::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAthleticsValue_Text, CallFunc_IsValid_ReturnValue) == 0x000029, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAthleticsValue_Text::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAthleticsValue_Text, CallFunc_GetFloatModifiedActorValue_ReturnValue) == 0x00002C, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAthleticsValue_Text::CallFunc_GetFloatModifiedActorValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAthleticsValue_Text, CallFunc_Conv_DoubleToString_ReturnValue) == 0x000030, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAthleticsValue_Text::CallFunc_Conv_DoubleToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAthleticsValue_Text, CallFunc_GetFloatBaseActorValue_ReturnValue) == 0x000040, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAthleticsValue_Text::CallFunc_GetFloatBaseActorValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAthleticsValue_Text, CallFunc_Conv_DoubleToString_ReturnValue_1) == 0x000048, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAthleticsValue_Text::CallFunc_Conv_DoubleToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAthleticsValue_Text, CallFunc_Concat_StrStr_ReturnValue) == 0x000058, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAthleticsValue_Text::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAthleticsValue_Text, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000068, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAthleticsValue_Text::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAthleticsValue_Text, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000078, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAthleticsValue_Text::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAthleticsValue_Text, CallFunc_Conv_StringToText_ReturnValue) == 0x000088, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAthleticsValue_Text::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAthleticsValue_Text, CallFunc_Conv_DoubleToString_InDouble_ImplicitCast) == 0x0000A0, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAthleticsValue_Text::CallFunc_Conv_DoubleToString_InDouble_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAthleticsValue_Text, CallFunc_Conv_DoubleToString_InDouble_ImplicitCast_1) == 0x0000A8, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAthleticsValue_Text::CallFunc_Conv_DoubleToString_InDouble_ImplicitCast_1' has a wrong offset!");

// Function WBP_PairedPawnLocomotionDebugInfo.WBP_PairedPawnLocomotionDebugInfo_C.Get_ObvAnimActionValue_Text
// 0x0058 (0x0058 - 0x0000)
struct WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAnimActionValue_Text final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AVPairedPawn*                           K2Node_DynamicCast_AsVPaired_Pawn;                 // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVAnimAction                                  CallFunc_GetOblivionAnimAction_ReturnValue;        // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0040(0x0018)()
};
static_assert(alignof(WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAnimActionValue_Text) == 0x000008, "Wrong alignment on WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAnimActionValue_Text");
static_assert(sizeof(WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAnimActionValue_Text) == 0x000058, "Wrong size on WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAnimActionValue_Text");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAnimActionValue_Text, ReturnValue) == 0x000000, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAnimActionValue_Text::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAnimActionValue_Text, CallFunc_GetOwningPlayerPawn_ReturnValue) == 0x000018, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAnimActionValue_Text::CallFunc_GetOwningPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAnimActionValue_Text, K2Node_DynamicCast_AsVPaired_Pawn) == 0x000020, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAnimActionValue_Text::K2Node_DynamicCast_AsVPaired_Pawn' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAnimActionValue_Text, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAnimActionValue_Text::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAnimActionValue_Text, CallFunc_GetOblivionAnimAction_ReturnValue) == 0x000029, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAnimActionValue_Text::CallFunc_GetOblivionAnimAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAnimActionValue_Text, CallFunc_IsValid_ReturnValue) == 0x00002A, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAnimActionValue_Text::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAnimActionValue_Text, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000030, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAnimActionValue_Text::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAnimActionValue_Text, CallFunc_Conv_StringToText_ReturnValue) == 0x000040, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAnimActionValue_Text::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function WBP_PairedPawnLocomotionDebugInfo.WBP_PairedPawnLocomotionDebugInfo_C.Get_ObvAcrobaticsValue_Text
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAcrobaticsValue_Text final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AVPairedPawn*                           K2Node_DynamicCast_AsVPaired_Pawn;                 // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatModifiedActorValue_ReturnValue;   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue;          // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatBaseActorValue_ReturnValue;       // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue_1;        // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0088(0x0018)()
	double                                        CallFunc_Conv_DoubleToString_InDouble_ImplicitCast; // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_DoubleToString_InDouble_ImplicitCast_1; // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAcrobaticsValue_Text) == 0x000008, "Wrong alignment on WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAcrobaticsValue_Text");
static_assert(sizeof(WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAcrobaticsValue_Text) == 0x0000B0, "Wrong size on WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAcrobaticsValue_Text");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAcrobaticsValue_Text, ReturnValue) == 0x000000, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAcrobaticsValue_Text::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAcrobaticsValue_Text, CallFunc_GetOwningPlayerPawn_ReturnValue) == 0x000018, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAcrobaticsValue_Text::CallFunc_GetOwningPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAcrobaticsValue_Text, K2Node_DynamicCast_AsVPaired_Pawn) == 0x000020, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAcrobaticsValue_Text::K2Node_DynamicCast_AsVPaired_Pawn' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAcrobaticsValue_Text, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAcrobaticsValue_Text::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAcrobaticsValue_Text, CallFunc_IsValid_ReturnValue) == 0x000029, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAcrobaticsValue_Text::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAcrobaticsValue_Text, CallFunc_GetFloatModifiedActorValue_ReturnValue) == 0x00002C, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAcrobaticsValue_Text::CallFunc_GetFloatModifiedActorValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAcrobaticsValue_Text, CallFunc_Conv_DoubleToString_ReturnValue) == 0x000030, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAcrobaticsValue_Text::CallFunc_Conv_DoubleToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAcrobaticsValue_Text, CallFunc_GetFloatBaseActorValue_ReturnValue) == 0x000040, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAcrobaticsValue_Text::CallFunc_GetFloatBaseActorValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAcrobaticsValue_Text, CallFunc_Conv_DoubleToString_ReturnValue_1) == 0x000048, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAcrobaticsValue_Text::CallFunc_Conv_DoubleToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAcrobaticsValue_Text, CallFunc_Concat_StrStr_ReturnValue) == 0x000058, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAcrobaticsValue_Text::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAcrobaticsValue_Text, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000068, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAcrobaticsValue_Text::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAcrobaticsValue_Text, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000078, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAcrobaticsValue_Text::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAcrobaticsValue_Text, CallFunc_Conv_StringToText_ReturnValue) == 0x000088, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAcrobaticsValue_Text::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAcrobaticsValue_Text, CallFunc_Conv_DoubleToString_InDouble_ImplicitCast) == 0x0000A0, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAcrobaticsValue_Text::CallFunc_Conv_DoubleToString_InDouble_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAcrobaticsValue_Text, CallFunc_Conv_DoubleToString_InDouble_ImplicitCast_1) == 0x0000A8, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_ObvAcrobaticsValue_Text::CallFunc_Conv_DoubleToString_InDouble_ImplicitCast_1' has a wrong offset!");

// Function WBP_PairedPawnLocomotionDebugInfo.WBP_PairedPawnLocomotionDebugInfo_C.Get_MaxSwimWalkSpeedValue_Text
// 0x0080 (0x0080 - 0x0000)
struct WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxSwimWalkSpeedValue_Text final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AVPairedPawn*                           K2Node_DynamicCast_AsVPaired_Pawn;                 // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetMaxSwimWalkSpeed_ReturnValue;          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue;          // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0060(0x0018)()
	double                                        CallFunc_Conv_DoubleToString_InDouble_ImplicitCast; // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxSwimWalkSpeedValue_Text) == 0x000008, "Wrong alignment on WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxSwimWalkSpeedValue_Text");
static_assert(sizeof(WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxSwimWalkSpeedValue_Text) == 0x000080, "Wrong size on WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxSwimWalkSpeedValue_Text");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxSwimWalkSpeedValue_Text, ReturnValue) == 0x000000, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxSwimWalkSpeedValue_Text::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxSwimWalkSpeedValue_Text, CallFunc_GetOwningPlayerPawn_ReturnValue) == 0x000018, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxSwimWalkSpeedValue_Text::CallFunc_GetOwningPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxSwimWalkSpeedValue_Text, K2Node_DynamicCast_AsVPaired_Pawn) == 0x000020, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxSwimWalkSpeedValue_Text::K2Node_DynamicCast_AsVPaired_Pawn' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxSwimWalkSpeedValue_Text, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxSwimWalkSpeedValue_Text::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxSwimWalkSpeedValue_Text, CallFunc_IsValid_ReturnValue) == 0x000029, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxSwimWalkSpeedValue_Text::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxSwimWalkSpeedValue_Text, CallFunc_GetMaxSwimWalkSpeed_ReturnValue) == 0x00002C, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxSwimWalkSpeedValue_Text::CallFunc_GetMaxSwimWalkSpeed_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxSwimWalkSpeedValue_Text, CallFunc_Conv_DoubleToString_ReturnValue) == 0x000030, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxSwimWalkSpeedValue_Text::CallFunc_Conv_DoubleToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxSwimWalkSpeedValue_Text, CallFunc_Concat_StrStr_ReturnValue) == 0x000040, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxSwimWalkSpeedValue_Text::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxSwimWalkSpeedValue_Text, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000050, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxSwimWalkSpeedValue_Text::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxSwimWalkSpeedValue_Text, CallFunc_Conv_StringToText_ReturnValue) == 0x000060, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxSwimWalkSpeedValue_Text::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxSwimWalkSpeedValue_Text, CallFunc_Conv_DoubleToString_InDouble_ImplicitCast) == 0x000078, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxSwimWalkSpeedValue_Text::CallFunc_Conv_DoubleToString_InDouble_ImplicitCast' has a wrong offset!");

// Function WBP_PairedPawnLocomotionDebugInfo.WBP_PairedPawnLocomotionDebugInfo_C.Get_MaxSwimRunSpeedValue_Text
// 0x0080 (0x0080 - 0x0000)
struct WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxSwimRunSpeedValue_Text final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AVPairedPawn*                           K2Node_DynamicCast_AsVPaired_Pawn;                 // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetMaxSwimRunSpeed_ReturnValue;           // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue;          // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0060(0x0018)()
	double                                        CallFunc_Conv_DoubleToString_InDouble_ImplicitCast; // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxSwimRunSpeedValue_Text) == 0x000008, "Wrong alignment on WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxSwimRunSpeedValue_Text");
static_assert(sizeof(WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxSwimRunSpeedValue_Text) == 0x000080, "Wrong size on WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxSwimRunSpeedValue_Text");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxSwimRunSpeedValue_Text, ReturnValue) == 0x000000, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxSwimRunSpeedValue_Text::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxSwimRunSpeedValue_Text, CallFunc_GetOwningPlayerPawn_ReturnValue) == 0x000018, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxSwimRunSpeedValue_Text::CallFunc_GetOwningPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxSwimRunSpeedValue_Text, K2Node_DynamicCast_AsVPaired_Pawn) == 0x000020, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxSwimRunSpeedValue_Text::K2Node_DynamicCast_AsVPaired_Pawn' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxSwimRunSpeedValue_Text, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxSwimRunSpeedValue_Text::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxSwimRunSpeedValue_Text, CallFunc_IsValid_ReturnValue) == 0x000029, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxSwimRunSpeedValue_Text::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxSwimRunSpeedValue_Text, CallFunc_GetMaxSwimRunSpeed_ReturnValue) == 0x00002C, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxSwimRunSpeedValue_Text::CallFunc_GetMaxSwimRunSpeed_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxSwimRunSpeedValue_Text, CallFunc_Conv_DoubleToString_ReturnValue) == 0x000030, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxSwimRunSpeedValue_Text::CallFunc_Conv_DoubleToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxSwimRunSpeedValue_Text, CallFunc_Concat_StrStr_ReturnValue) == 0x000040, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxSwimRunSpeedValue_Text::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxSwimRunSpeedValue_Text, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000050, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxSwimRunSpeedValue_Text::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxSwimRunSpeedValue_Text, CallFunc_Conv_StringToText_ReturnValue) == 0x000060, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxSwimRunSpeedValue_Text::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxSwimRunSpeedValue_Text, CallFunc_Conv_DoubleToString_InDouble_ImplicitCast) == 0x000078, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxSwimRunSpeedValue_Text::CallFunc_Conv_DoubleToString_InDouble_ImplicitCast' has a wrong offset!");

// Function WBP_PairedPawnLocomotionDebugInfo.WBP_PairedPawnLocomotionDebugInfo_C.Get_MaxGroundWalkSpeedValue_Text
// 0x0080 (0x0080 - 0x0000)
struct WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxGroundWalkSpeedValue_Text final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AVPairedPawn*                           K2Node_DynamicCast_AsVPaired_Pawn;                 // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetMaxGroundWalkSpeed_ReturnValue;        // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue;          // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0060(0x0018)()
	double                                        CallFunc_Conv_DoubleToString_InDouble_ImplicitCast; // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxGroundWalkSpeedValue_Text) == 0x000008, "Wrong alignment on WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxGroundWalkSpeedValue_Text");
static_assert(sizeof(WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxGroundWalkSpeedValue_Text) == 0x000080, "Wrong size on WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxGroundWalkSpeedValue_Text");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxGroundWalkSpeedValue_Text, ReturnValue) == 0x000000, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxGroundWalkSpeedValue_Text::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxGroundWalkSpeedValue_Text, CallFunc_GetOwningPlayerPawn_ReturnValue) == 0x000018, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxGroundWalkSpeedValue_Text::CallFunc_GetOwningPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxGroundWalkSpeedValue_Text, K2Node_DynamicCast_AsVPaired_Pawn) == 0x000020, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxGroundWalkSpeedValue_Text::K2Node_DynamicCast_AsVPaired_Pawn' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxGroundWalkSpeedValue_Text, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxGroundWalkSpeedValue_Text::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxGroundWalkSpeedValue_Text, CallFunc_IsValid_ReturnValue) == 0x000029, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxGroundWalkSpeedValue_Text::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxGroundWalkSpeedValue_Text, CallFunc_GetMaxGroundWalkSpeed_ReturnValue) == 0x00002C, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxGroundWalkSpeedValue_Text::CallFunc_GetMaxGroundWalkSpeed_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxGroundWalkSpeedValue_Text, CallFunc_Conv_DoubleToString_ReturnValue) == 0x000030, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxGroundWalkSpeedValue_Text::CallFunc_Conv_DoubleToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxGroundWalkSpeedValue_Text, CallFunc_Concat_StrStr_ReturnValue) == 0x000040, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxGroundWalkSpeedValue_Text::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxGroundWalkSpeedValue_Text, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000050, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxGroundWalkSpeedValue_Text::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxGroundWalkSpeedValue_Text, CallFunc_Conv_StringToText_ReturnValue) == 0x000060, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxGroundWalkSpeedValue_Text::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxGroundWalkSpeedValue_Text, CallFunc_Conv_DoubleToString_InDouble_ImplicitCast) == 0x000078, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxGroundWalkSpeedValue_Text::CallFunc_Conv_DoubleToString_InDouble_ImplicitCast' has a wrong offset!");

// Function WBP_PairedPawnLocomotionDebugInfo.WBP_PairedPawnLocomotionDebugInfo_C.Get_MaxGroundTrotSpeedValue_Text
// 0x0090 (0x0090 - 0x0000)
struct WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxGroundTrotSpeedValue_Text final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AVPairedPawn*                           K2Node_DynamicCast_AsVPaired_Pawn;                 // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UVHorseMovementComponent*               K2Node_DynamicCast_AsVHorse_Movement_Component;    // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetMaxGroundTrotSpeed_ReturnValue;        // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue;          // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0070(0x0018)()
	double                                        CallFunc_Conv_DoubleToString_InDouble_ImplicitCast; // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxGroundTrotSpeedValue_Text) == 0x000008, "Wrong alignment on WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxGroundTrotSpeedValue_Text");
static_assert(sizeof(WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxGroundTrotSpeedValue_Text) == 0x000090, "Wrong size on WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxGroundTrotSpeedValue_Text");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxGroundTrotSpeedValue_Text, ReturnValue) == 0x000000, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxGroundTrotSpeedValue_Text::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxGroundTrotSpeedValue_Text, CallFunc_GetOwningPlayerPawn_ReturnValue) == 0x000018, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxGroundTrotSpeedValue_Text::CallFunc_GetOwningPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxGroundTrotSpeedValue_Text, K2Node_DynamicCast_AsVPaired_Pawn) == 0x000020, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxGroundTrotSpeedValue_Text::K2Node_DynamicCast_AsVPaired_Pawn' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxGroundTrotSpeedValue_Text, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxGroundTrotSpeedValue_Text::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxGroundTrotSpeedValue_Text, CallFunc_IsValid_ReturnValue) == 0x000029, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxGroundTrotSpeedValue_Text::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxGroundTrotSpeedValue_Text, K2Node_DynamicCast_AsVHorse_Movement_Component) == 0x000030, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxGroundTrotSpeedValue_Text::K2Node_DynamicCast_AsVHorse_Movement_Component' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxGroundTrotSpeedValue_Text, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxGroundTrotSpeedValue_Text::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxGroundTrotSpeedValue_Text, CallFunc_GetMaxGroundTrotSpeed_ReturnValue) == 0x00003C, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxGroundTrotSpeedValue_Text::CallFunc_GetMaxGroundTrotSpeed_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxGroundTrotSpeedValue_Text, CallFunc_Conv_DoubleToString_ReturnValue) == 0x000040, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxGroundTrotSpeedValue_Text::CallFunc_Conv_DoubleToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxGroundTrotSpeedValue_Text, CallFunc_Concat_StrStr_ReturnValue) == 0x000050, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxGroundTrotSpeedValue_Text::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxGroundTrotSpeedValue_Text, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000060, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxGroundTrotSpeedValue_Text::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxGroundTrotSpeedValue_Text, CallFunc_Conv_StringToText_ReturnValue) == 0x000070, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxGroundTrotSpeedValue_Text::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxGroundTrotSpeedValue_Text, CallFunc_Conv_DoubleToString_InDouble_ImplicitCast) == 0x000088, "Member 'WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxGroundTrotSpeedValue_Text::CallFunc_Conv_DoubleToString_InDouble_ImplicitCast' has a wrong offset!");

// Function WBP_PairedPawnLocomotionDebugInfo.WBP_PairedPawnLocomotionDebugInfo_C.Get_MaxGroundSprintSpeedValue_Text
// 0x0080 (0x0080 - 0x0000)
struct WBP_PairedPawnLocomotionDebugInfo_C_Get_MaxGroundSprintSpeedValue_Text final
{
public:
