#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_OriginalMenu_InventoryItemSpecificContentWeapon

#include "Basic.hpp"

#include "EnhancedInput_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_OriginalMenu_InventoryItemSpecificContentWeapon.WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C.ExecuteUbergraph_WBP_OriginalMenu_InventoryItemSpecificContentWeapon
// 0x0160 (0x0160 - 0x0000)
struct WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryItemSpecificContentWeapon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue;       // 0x0008(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime;       // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime;     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction;      // 0x0030(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable;                              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_InputActionValueToAxis1D_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable;                                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_0;                              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1_0;                            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2;                              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_NewMaxCharge;                   // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_NewUse;                         // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0090(0x0050)(HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_NewCharge;                      // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00E8(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0138(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0148(0x0018)()
};
static_assert(alignof(WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryItemSpecificContentWeapon) == 0x000008, "Wrong alignment on WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryItemSpecificContentWeapon");
static_assert(sizeof(WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryItemSpecificContentWeapon) == 0x000160, "Wrong size on WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryItemSpecificContentWeapon");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryItemSpecificContentWeapon, EntryPoint) == 0x000000, "Member 'WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryItemSpecificContentWeapon::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryItemSpecificContentWeapon, K2Node_EnhancedInputActionEvent_ActionValue) == 0x000008, "Member 'WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryItemSpecificContentWeapon::K2Node_EnhancedInputActionEvent_ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryItemSpecificContentWeapon, K2Node_EnhancedInputActionEvent_ElapsedTime) == 0x000028, "Member 'WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryItemSpecificContentWeapon::K2Node_EnhancedInputActionEvent_ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryItemSpecificContentWeapon, K2Node_EnhancedInputActionEvent_TriggeredTime) == 0x00002C, "Member 'WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryItemSpecificContentWeapon::K2Node_EnhancedInputActionEvent_TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryItemSpecificContentWeapon, K2Node_EnhancedInputActionEvent_SourceAction) == 0x000030, "Member 'WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryItemSpecificContentWeapon::K2Node_EnhancedInputActionEvent_SourceAction' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryItemSpecificContentWeapon, Temp_object_Variable) == 0x000038, "Member 'WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryItemSpecificContentWeapon::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryItemSpecificContentWeapon, CallFunc_Conv_InputActionValueToAxis1D_ReturnValue) == 0x000040, "Member 'WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryItemSpecificContentWeapon::CallFunc_Conv_InputActionValueToAxis1D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryItemSpecificContentWeapon, Temp_real_Variable) == 0x000048, "Member 'WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryItemSpecificContentWeapon::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryItemSpecificContentWeapon, Temp_real_Variable_1) == 0x000050, "Member 'WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryItemSpecificContentWeapon::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryItemSpecificContentWeapon, Temp_real_Variable_0) == 0x000058, "Member 'WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryItemSpecificContentWeapon::Temp_real_Variable_0' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryItemSpecificContentWeapon, Temp_real_Variable_1_0) == 0x000060, "Member 'WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryItemSpecificContentWeapon::Temp_real_Variable_1_0' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryItemSpecificContentWeapon, Temp_real_Variable_2) == 0x000068, "Member 'WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryItemSpecificContentWeapon::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryItemSpecificContentWeapon, K2Node_CustomEvent_NewMaxCharge) == 0x000070, "Member 'WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryItemSpecificContentWeapon::K2Node_CustomEvent_NewMaxCharge' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryItemSpecificContentWeapon, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000078, "Member 'WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryItemSpecificContentWeapon::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryItemSpecificContentWeapon, K2Node_CustomEvent_NewUse) == 0x000080, "Member 'WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryItemSpecificContentWeapon::K2Node_CustomEvent_NewUse' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryItemSpecificContentWeapon, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000088, "Member 'WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryItemSpecificContentWeapon::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryItemSpecificContentWeapon, K2Node_MakeStruct_FormatArgumentData) == 0x000090, "Member 'WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryItemSpecificContentWeapon::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryItemSpecificContentWeapon, K2Node_CustomEvent_NewCharge) == 0x0000E0, "Member 'WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryItemSpecificContentWeapon::K2Node_CustomEvent_NewCharge' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryItemSpecificContentWeapon, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000E8, "Member 'WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryItemSpecificContentWeapon::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryItemSpecificContentWeapon, K2Node_MakeArray_Array) == 0x000138, "Member 'WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryItemSpecificContentWeapon::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryItemSpecificContentWeapon, CallFunc_Format_ReturnValue) == 0x000148, "Member 'WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryItemSpecificContentWeapon::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function WBP_OriginalMenu_InventoryItemSpecificContentWeapon.WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C.InpActEvt_IA_UI_Specific_InventoryContainerMenu_ScrollEffects_K2Node_EnhancedInputActionEvent_0
// 0x0030 (0x0030 - 0x0000)
struct WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_InpActEvt_IA_UI_Specific_InventoryContainerMenu_ScrollEffects_K2Node_EnhancedInputActionEvent_0 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_InpActEvt_IA_UI_Specific_InventoryContainerMenu_ScrollEffects_K2Node_EnhancedInputActionEvent_0) == 0x000008, "Wrong alignment on WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_InpActEvt_IA_UI_Specific_InventoryContainerMenu_ScrollEffects_K2Node_EnhancedInputActionEvent_0");
static_assert(sizeof(WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_InpActEvt_IA_UI_Specific_InventoryContainerMenu_ScrollEffects_K2Node_EnhancedInputActionEvent_0) == 0x000030, "Wrong size on WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_InpActEvt_IA_UI_Specific_InventoryContainerMenu_ScrollEffects_K2Node_EnhancedInputActionEvent_0");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_InpActEvt_IA_UI_Specific_InventoryContainerMenu_ScrollEffects_K2Node_EnhancedInputActionEvent_0, ActionValue) == 0x000000, "Member 'WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_InpActEvt_IA_UI_Specific_InventoryContainerMenu_ScrollEffects_K2Node_EnhancedInputActionEvent_0::ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_InpActEvt_IA_UI_Specific_InventoryContainerMenu_ScrollEffects_K2Node_EnhancedInputActionEvent_0, ElapsedTime) == 0x000020, "Member 'WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_InpActEvt_IA_UI_Specific_InventoryContainerMenu_ScrollEffects_K2Node_EnhancedInputActionEvent_0::ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_InpActEvt_IA_UI_Specific_InventoryContainerMenu_ScrollEffects_K2Node_EnhancedInputActionEvent_0, TriggeredTime) == 0x000024, "Member 'WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_InpActEvt_IA_UI_Specific_InventoryContainerMenu_ScrollEffects_K2Node_EnhancedInputActionEvent_0::TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_InpActEvt_IA_UI_Specific_InventoryContainerMenu_ScrollEffects_K2Node_EnhancedInputActionEvent_0, SourceAction) == 0x000028, "Member 'WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_InpActEvt_IA_UI_Specific_InventoryContainerMenu_ScrollEffects_K2Node_EnhancedInputActionEvent_0::SourceAction' has a wrong offset!");

// Function WBP_OriginalMenu_InventoryItemSpecificContentWeapon.WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C.UpdateBar
// 0x0020 (0x0020 - 0x0000)
struct WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_UpdateBar final
{
public:
	int32                                         CallFunc_GetWeaponMaxCharge_ReturnValue;           // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetWeaponCharge_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_UpdateBar) == 0x000008, "Wrong alignment on WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_UpdateBar");
static_assert(sizeof(WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_UpdateBar) == 0x000020, "Wrong size on WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_UpdateBar");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_UpdateBar, CallFunc_GetWeaponMaxCharge_ReturnValue) == 0x000000, "Member 'WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_UpdateBar::CallFunc_GetWeaponMaxCharge_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_UpdateBar, CallFunc_GetWeaponCharge_ReturnValue) == 0x000004, "Member 'WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_UpdateBar::CallFunc_GetWeaponCharge_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_UpdateBar, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000008, "Member 'WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_UpdateBar::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_UpdateBar, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000010, "Member 'WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_UpdateBar::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_UpdateBar, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000018, "Member 'WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_UpdateBar::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");

// Function WBP_OriginalMenu_InventoryItemSpecificContentWeapon.WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C.UpdateCharge
// 0x0004 (0x0004 - 0x0000)
struct WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_UpdateCharge final
{
public:
	int32                                         NewCharge;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_UpdateCharge) == 0x000004, "Wrong alignment on WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_UpdateCharge");
static_assert(sizeof(WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_UpdateCharge) == 0x000004, "Wrong size on WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_UpdateCharge");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_UpdateCharge, NewCharge) == 0x000000, "Member 'WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_UpdateCharge::NewCharge' has a wrong offset!");

// Function WBP_OriginalMenu_InventoryItemSpecificContentWeapon.WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C.UpdateChargeAndMaxChargeText
// 0x0138 (0x0138 - 0x0000)
struct WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_UpdateChargeAndMaxChargeText final
{
public:
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0000(0x0050)(HasGetValueTypeHash)
	int32                                         CallFunc_GetWeaponMaxCharge_ReturnValue;           // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetWeaponCharge_ReturnValue;              // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0068(0x0050)(HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x00C0(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0110(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0120(0x0018)()
};
static_assert(alignof(WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_UpdateChargeAndMaxChargeText) == 0x000008, "Wrong alignment on WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_UpdateChargeAndMaxChargeText");
static_assert(sizeof(WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_UpdateChargeAndMaxChargeText) == 0x000138, "Wrong size on WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_UpdateChargeAndMaxChargeText");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_UpdateChargeAndMaxChargeText, K2Node_MakeStruct_FormatArgumentData) == 0x000000, "Member 'WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_UpdateChargeAndMaxChargeText::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_UpdateChargeAndMaxChargeText, CallFunc_GetWeaponMaxCharge_ReturnValue) == 0x000050, "Member 'WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_UpdateChargeAndMaxChargeText::CallFunc_GetWeaponMaxCharge_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_UpdateChargeAndMaxChargeText, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000058, "Member 'WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_UpdateChargeAndMaxChargeText::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_UpdateChargeAndMaxChargeText, CallFunc_GetWeaponCharge_ReturnValue) == 0x000060, "Member 'WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_UpdateChargeAndMaxChargeText::CallFunc_GetWeaponCharge_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_UpdateChargeAndMaxChargeText, K2Node_MakeStruct_FormatArgumentData_1) == 0x000068, "Member 'WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_UpdateChargeAndMaxChargeText::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_UpdateChargeAndMaxChargeText, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x0000B8, "Member 'WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_UpdateChargeAndMaxChargeText::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_UpdateChargeAndMaxChargeText, K2Node_MakeStruct_FormatArgumentData_2) == 0x0000C0, "Member 'WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_UpdateChargeAndMaxChargeText::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_UpdateChargeAndMaxChargeText, K2Node_MakeArray_Array) == 0x000110, "Member 'WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_UpdateChargeAndMaxChargeText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_UpdateChargeAndMaxChargeText, CallFunc_Format_ReturnValue) == 0x000120, "Member 'WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_UpdateChargeAndMaxChargeText::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function WBP_OriginalMenu_InventoryItemSpecificContentWeapon.WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C.UpdateMaxCharge
// 0x0004 (0x0004 - 0x0000)
struct WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_UpdateMaxCharge final
{
public:
	int32                                         NewMaxCharge;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_UpdateMaxCharge) == 0x000004, "Wrong alignment on WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_UpdateMaxCharge");
static_assert(sizeof(WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_UpdateMaxCharge) == 0x000004, "Wrong size on WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_UpdateMaxCharge");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_UpdateMaxCharge, NewMaxCharge) == 0x000000, "Member 'WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_UpdateMaxCharge::NewMaxCharge' has a wrong offset!");

// Function WBP_OriginalMenu_InventoryItemSpecificContentWeapon.WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C.UpdateUse
// 0x0004 (0x0004 - 0x0000)
struct WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_UpdateUse final
{
public:
	int32                                         NewUse;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_UpdateUse) == 0x000004, "Wrong alignment on WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_UpdateUse");
static_assert(sizeof(WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_UpdateUse) == 0x000004, "Wrong size on WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_UpdateUse");
static_assert(offsetof(WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_UpdateUse, NewUse) == 0x000000, "Member 'WBP_OriginalMenu_InventoryItemSpecificContentWeapon_C_UpdateUse::NewUse' has a wrong offset!");

}

