#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ObivionDebug

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Slate_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_ObivionDebug.WBP_ObivionDebug_C.UpdatePreferences
// 0x0020 (0x0020 - 0x0000)
struct WBP_ObivionDebug_C_UpdatePreferences final
{
public:
	bool                                          CallFunc_SaveGameToSlot_ReturnValue;               // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_R;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_G;                             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_B;                             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_A;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_OpacityValue_ImplicitCast;      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ObivionDebug_C_UpdatePreferences) == 0x000008, "Wrong alignment on WBP_ObivionDebug_C_UpdatePreferences");
static_assert(sizeof(WBP_ObivionDebug_C_UpdatePreferences) == 0x000020, "Wrong size on WBP_ObivionDebug_C_UpdatePreferences");
static_assert(offsetof(WBP_ObivionDebug_C_UpdatePreferences, CallFunc_SaveGameToSlot_ReturnValue) == 0x000000, "Member 'WBP_ObivionDebug_C_UpdatePreferences::CallFunc_SaveGameToSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_UpdatePreferences, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000004, "Member 'WBP_ObivionDebug_C_UpdatePreferences::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_UpdatePreferences, CallFunc_BreakColor_R) == 0x000008, "Member 'WBP_ObivionDebug_C_UpdatePreferences::CallFunc_BreakColor_R' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_UpdatePreferences, CallFunc_BreakColor_G) == 0x00000C, "Member 'WBP_ObivionDebug_C_UpdatePreferences::CallFunc_BreakColor_G' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_UpdatePreferences, CallFunc_BreakColor_B) == 0x000010, "Member 'WBP_ObivionDebug_C_UpdatePreferences::CallFunc_BreakColor_B' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_UpdatePreferences, CallFunc_BreakColor_A) == 0x000014, "Member 'WBP_ObivionDebug_C_UpdatePreferences::CallFunc_BreakColor_A' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_UpdatePreferences, K2Node_VariableSet_OpacityValue_ImplicitCast) == 0x000018, "Member 'WBP_ObivionDebug_C_UpdatePreferences::K2Node_VariableSet_OpacityValue_ImplicitCast' has a wrong offset!");

// Function WBP_ObivionDebug.WBP_ObivionDebug_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_ObivionDebug_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ObivionDebug_C_Tick) == 0x000004, "Wrong alignment on WBP_ObivionDebug_C_Tick");
static_assert(sizeof(WBP_ObivionDebug_C_Tick) == 0x00003C, "Wrong size on WBP_ObivionDebug_C_Tick");
static_assert(offsetof(WBP_ObivionDebug_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_ObivionDebug_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_ObivionDebug_C_Tick::InDeltaTime' has a wrong offset!");

// Function WBP_ObivionDebug.WBP_ObivionDebug_C.ShowHideAllFunc
// 0x0050 (0x0050 - 0x0000)
struct WBP_ObivionDebug_C_ShowHideAllFunc final
{
public:
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRenderOpacity_ReturnValue;             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue_1;    // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_BoolToDouble_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast;   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast;  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_1; // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_2; // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_3; // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_4; // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_5; // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_6; // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_7; // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_8; // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_9; // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_10; // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ObivionDebug_C_ShowHideAllFunc) == 0x000008, "Wrong alignment on WBP_ObivionDebug_C_ShowHideAllFunc");
static_assert(sizeof(WBP_ObivionDebug_C_ShowHideAllFunc) == 0x000050, "Wrong size on WBP_ObivionDebug_C_ShowHideAllFunc");
static_assert(offsetof(WBP_ObivionDebug_C_ShowHideAllFunc, CallFunc_EqualEqual_DoubleDouble_ReturnValue) == 0x000000, "Member 'WBP_ObivionDebug_C_ShowHideAllFunc::CallFunc_EqualEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_ShowHideAllFunc, CallFunc_GetRenderOpacity_ReturnValue) == 0x000004, "Member 'WBP_ObivionDebug_C_ShowHideAllFunc::CallFunc_GetRenderOpacity_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_ShowHideAllFunc, CallFunc_EqualEqual_DoubleDouble_ReturnValue_1) == 0x000008, "Member 'WBP_ObivionDebug_C_ShowHideAllFunc::CallFunc_EqualEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_ShowHideAllFunc, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000009, "Member 'WBP_ObivionDebug_C_ShowHideAllFunc::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_ShowHideAllFunc, CallFunc_Conv_BoolToDouble_ReturnValue) == 0x000010, "Member 'WBP_ObivionDebug_C_ShowHideAllFunc::CallFunc_Conv_BoolToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_ShowHideAllFunc, CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast) == 0x000018, "Member 'WBP_ObivionDebug_C_ShowHideAllFunc::CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_ShowHideAllFunc, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast) == 0x000020, "Member 'WBP_ObivionDebug_C_ShowHideAllFunc::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_ShowHideAllFunc, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_1) == 0x000024, "Member 'WBP_ObivionDebug_C_ShowHideAllFunc::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_ShowHideAllFunc, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_2) == 0x000028, "Member 'WBP_ObivionDebug_C_ShowHideAllFunc::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_ShowHideAllFunc, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_3) == 0x00002C, "Member 'WBP_ObivionDebug_C_ShowHideAllFunc::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_ShowHideAllFunc, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_4) == 0x000030, "Member 'WBP_ObivionDebug_C_ShowHideAllFunc::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_4' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_ShowHideAllFunc, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_5) == 0x000034, "Member 'WBP_ObivionDebug_C_ShowHideAllFunc::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_5' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_ShowHideAllFunc, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_6) == 0x000038, "Member 'WBP_ObivionDebug_C_ShowHideAllFunc::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_6' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_ShowHideAllFunc, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_7) == 0x00003C, "Member 'WBP_ObivionDebug_C_ShowHideAllFunc::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_7' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_ShowHideAllFunc, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_8) == 0x000040, "Member 'WBP_ObivionDebug_C_ShowHideAllFunc::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_8' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_ShowHideAllFunc, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_9) == 0x000044, "Member 'WBP_ObivionDebug_C_ShowHideAllFunc::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_9' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_ShowHideAllFunc, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_10) == 0x000048, "Member 'WBP_ObivionDebug_C_ShowHideAllFunc::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_10' has a wrong offset!");

// Function WBP_ObivionDebug.WBP_ObivionDebug_C.SetTexMainAlpha
// 0x0048 (0x0048 - 0x0000)
struct WBP_ObivionDebug_C_SetTexMainAlpha final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue;                    // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue_1;                  // 0x001C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue_2;                  // 0x002C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeColor_A_ImplicitCast;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeColor_A_ImplicitCast_1;               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ObivionDebug_C_SetTexMainAlpha) == 0x000008, "Wrong alignment on WBP_ObivionDebug_C_SetTexMainAlpha");
static_assert(sizeof(WBP_ObivionDebug_C_SetTexMainAlpha) == 0x000048, "Wrong size on WBP_ObivionDebug_C_SetTexMainAlpha");
static_assert(offsetof(WBP_ObivionDebug_C_SetTexMainAlpha, Value) == 0x000000, "Member 'WBP_ObivionDebug_C_SetTexMainAlpha::Value' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_SetTexMainAlpha, CallFunc_MakeColor_ReturnValue) == 0x000008, "Member 'WBP_ObivionDebug_C_SetTexMainAlpha::CallFunc_MakeColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_SetTexMainAlpha, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000018, "Member 'WBP_ObivionDebug_C_SetTexMainAlpha::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_SetTexMainAlpha, CallFunc_MakeColor_ReturnValue_1) == 0x00001C, "Member 'WBP_ObivionDebug_C_SetTexMainAlpha::CallFunc_MakeColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_SetTexMainAlpha, CallFunc_MakeColor_ReturnValue_2) == 0x00002C, "Member 'WBP_ObivionDebug_C_SetTexMainAlpha::CallFunc_MakeColor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_SetTexMainAlpha, CallFunc_MakeColor_A_ImplicitCast) == 0x00003C, "Member 'WBP_ObivionDebug_C_SetTexMainAlpha::CallFunc_MakeColor_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_SetTexMainAlpha, CallFunc_MakeColor_A_ImplicitCast_1) == 0x000040, "Member 'WBP_ObivionDebug_C_SetTexMainAlpha::CallFunc_MakeColor_A_ImplicitCast_1' has a wrong offset!");

// Function WBP_ObivionDebug.WBP_ObivionDebug_C.SetAnchorRightUp
// 0x0060 (0x0060 - 0x0000)
struct WBP_ObivionDebug_C_SetAnchorRightUp final
{
public:
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnchors                               K2Node_MakeStruct_Anchors;                         // 0x0038(0x0020)(NoDestructor)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ObivionDebug_C_SetAnchorRightUp) == 0x000008, "Wrong alignment on WBP_ObivionDebug_C_SetAnchorRightUp");
static_assert(sizeof(WBP_ObivionDebug_C_SetAnchorRightUp) == 0x000060, "Wrong size on WBP_ObivionDebug_C_SetAnchorRightUp");
static_assert(offsetof(WBP_ObivionDebug_C_SetAnchorRightUp, K2Node_MakeStruct_Margin) == 0x000000, "Member 'WBP_ObivionDebug_C_SetAnchorRightUp::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_SetAnchorRightUp, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000010, "Member 'WBP_ObivionDebug_C_SetAnchorRightUp::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_SetAnchorRightUp, CallFunc_MakeVector2D_ReturnValue) == 0x000018, "Member 'WBP_ObivionDebug_C_SetAnchorRightUp::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_SetAnchorRightUp, CallFunc_MakeVector2D_ReturnValue_1) == 0x000028, "Member 'WBP_ObivionDebug_C_SetAnchorRightUp::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_SetAnchorRightUp, K2Node_MakeStruct_Anchors) == 0x000038, "Member 'WBP_ObivionDebug_C_SetAnchorRightUp::K2Node_MakeStruct_Anchors' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_SetAnchorRightUp, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000058, "Member 'WBP_ObivionDebug_C_SetAnchorRightUp::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");

// Function WBP_ObivionDebug.WBP_ObivionDebug_C.SetAnchorRightBottom
// 0x0060 (0x0060 - 0x0000)
struct WBP_ObivionDebug_C_SetAnchorRightBottom final
{
public:
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FAnchors                               K2Node_MakeStruct_Anchors;                         // 0x0040(0x0020)(NoDestructor)
};
static_assert(alignof(WBP_ObivionDebug_C_SetAnchorRightBottom) == 0x000008, "Wrong alignment on WBP_ObivionDebug_C_SetAnchorRightBottom");
static_assert(sizeof(WBP_ObivionDebug_C_SetAnchorRightBottom) == 0x000060, "Wrong size on WBP_ObivionDebug_C_SetAnchorRightBottom");
static_assert(offsetof(WBP_ObivionDebug_C_SetAnchorRightBottom, CallFunc_MakeVector2D_ReturnValue) == 0x000000, "Member 'WBP_ObivionDebug_C_SetAnchorRightBottom::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_SetAnchorRightBottom, K2Node_MakeStruct_Margin) == 0x000010, "Member 'WBP_ObivionDebug_C_SetAnchorRightBottom::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_SetAnchorRightBottom, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000020, "Member 'WBP_ObivionDebug_C_SetAnchorRightBottom::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_SetAnchorRightBottom, CallFunc_MakeVector2D_ReturnValue_1) == 0x000028, "Member 'WBP_ObivionDebug_C_SetAnchorRightBottom::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_SetAnchorRightBottom, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000038, "Member 'WBP_ObivionDebug_C_SetAnchorRightBottom::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_SetAnchorRightBottom, K2Node_MakeStruct_Anchors) == 0x000040, "Member 'WBP_ObivionDebug_C_SetAnchorRightBottom::K2Node_MakeStruct_Anchors' has a wrong offset!");

// Function WBP_ObivionDebug.WBP_ObivionDebug_C.SetAnchorLeftUp
// 0x0048 (0x0048 - 0x0000)
struct WBP_ObivionDebug_C_SetAnchorLeftUp final
{
public:
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnchors                               K2Node_MakeStruct_Anchors;                         // 0x0020(0x0020)(NoDestructor)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ObivionDebug_C_SetAnchorLeftUp) == 0x000008, "Wrong alignment on WBP_ObivionDebug_C_SetAnchorLeftUp");
static_assert(sizeof(WBP_ObivionDebug_C_SetAnchorLeftUp) == 0x000048, "Wrong size on WBP_ObivionDebug_C_SetAnchorLeftUp");
static_assert(offsetof(WBP_ObivionDebug_C_SetAnchorLeftUp, K2Node_MakeStruct_Margin) == 0x000000, "Member 'WBP_ObivionDebug_C_SetAnchorLeftUp::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_SetAnchorLeftUp, CallFunc_MakeVector2D_ReturnValue) == 0x000010, "Member 'WBP_ObivionDebug_C_SetAnchorLeftUp::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_SetAnchorLeftUp, K2Node_MakeStruct_Anchors) == 0x000020, "Member 'WBP_ObivionDebug_C_SetAnchorLeftUp::K2Node_MakeStruct_Anchors' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_SetAnchorLeftUp, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000040, "Member 'WBP_ObivionDebug_C_SetAnchorLeftUp::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");

// Function WBP_ObivionDebug.WBP_ObivionDebug_C.SetAnchorLeftBottom
// 0x0060 (0x0060 - 0x0000)
struct WBP_ObivionDebug_C_SetAnchorLeftBottom final
{
public:
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnchors                               K2Node_MakeStruct_Anchors;                         // 0x0038(0x0020)(NoDestructor)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ObivionDebug_C_SetAnchorLeftBottom) == 0x000008, "Wrong alignment on WBP_ObivionDebug_C_SetAnchorLeftBottom");
static_assert(sizeof(WBP_ObivionDebug_C_SetAnchorLeftBottom) == 0x000060, "Wrong size on WBP_ObivionDebug_C_SetAnchorLeftBottom");
static_assert(offsetof(WBP_ObivionDebug_C_SetAnchorLeftBottom, K2Node_MakeStruct_Margin) == 0x000000, "Member 'WBP_ObivionDebug_C_SetAnchorLeftBottom::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_SetAnchorLeftBottom, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000010, "Member 'WBP_ObivionDebug_C_SetAnchorLeftBottom::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_SetAnchorLeftBottom, CallFunc_MakeVector2D_ReturnValue) == 0x000018, "Member 'WBP_ObivionDebug_C_SetAnchorLeftBottom::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_SetAnchorLeftBottom, CallFunc_MakeVector2D_ReturnValue_1) == 0x000028, "Member 'WBP_ObivionDebug_C_SetAnchorLeftBottom::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_SetAnchorLeftBottom, K2Node_MakeStruct_Anchors) == 0x000038, "Member 'WBP_ObivionDebug_C_SetAnchorLeftBottom::K2Node_MakeStruct_Anchors' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_SetAnchorLeftBottom, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000058, "Member 'WBP_ObivionDebug_C_SetAnchorLeftBottom::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");

// Function WBP_ObivionDebug.WBP_ObivionDebug_C.InpActEvt_Ctrl+Alt_Two_K2Node_InputKeyEvent_7
// 0x0018 (0x0018 - 0x0000)
struct WBP_ObivionDebug_C_InpActEvt_Ctrl_Alt_Two_K2Node_InputKeyEvent_7 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ObivionDebug_C_InpActEvt_Ctrl_Alt_Two_K2Node_InputKeyEvent_7) == 0x000008, "Wrong alignment on WBP_ObivionDebug_C_InpActEvt_Ctrl_Alt_Two_K2Node_InputKeyEvent_7");
static_assert(sizeof(WBP_ObivionDebug_C_InpActEvt_Ctrl_Alt_Two_K2Node_InputKeyEvent_7) == 0x000018, "Wrong size on WBP_ObivionDebug_C_InpActEvt_Ctrl_Alt_Two_K2Node_InputKeyEvent_7");
static_assert(offsetof(WBP_ObivionDebug_C_InpActEvt_Ctrl_Alt_Two_K2Node_InputKeyEvent_7, Key) == 0x000000, "Member 'WBP_ObivionDebug_C_InpActEvt_Ctrl_Alt_Two_K2Node_InputKeyEvent_7::Key' has a wrong offset!");

// Function WBP_ObivionDebug.WBP_ObivionDebug_C.InpActEvt_Ctrl+Alt_Three_K2Node_InputKeyEvent_5
// 0x0018 (0x0018 - 0x0000)
struct WBP_ObivionDebug_C_InpActEvt_Ctrl_Alt_Three_K2Node_InputKeyEvent_5 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ObivionDebug_C_InpActEvt_Ctrl_Alt_Three_K2Node_InputKeyEvent_5) == 0x000008, "Wrong alignment on WBP_ObivionDebug_C_InpActEvt_Ctrl_Alt_Three_K2Node_InputKeyEvent_5");
static_assert(sizeof(WBP_ObivionDebug_C_InpActEvt_Ctrl_Alt_Three_K2Node_InputKeyEvent_5) == 0x000018, "Wrong size on WBP_ObivionDebug_C_InpActEvt_Ctrl_Alt_Three_K2Node_InputKeyEvent_5");
static_assert(offsetof(WBP_ObivionDebug_C_InpActEvt_Ctrl_Alt_Three_K2Node_InputKeyEvent_5, Key) == 0x000000, "Member 'WBP_ObivionDebug_C_InpActEvt_Ctrl_Alt_Three_K2Node_InputKeyEvent_5::Key' has a wrong offset!");

// Function WBP_ObivionDebug.WBP_ObivionDebug_C.InpActEvt_Ctrl+Alt_Six_K2Node_InputKeyEvent_1
// 0x0018 (0x0018 - 0x0000)
struct WBP_ObivionDebug_C_InpActEvt_Ctrl_Alt_Six_K2Node_InputKeyEvent_1 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ObivionDebug_C_InpActEvt_Ctrl_Alt_Six_K2Node_InputKeyEvent_1) == 0x000008, "Wrong alignment on WBP_ObivionDebug_C_InpActEvt_Ctrl_Alt_Six_K2Node_InputKeyEvent_1");
static_assert(sizeof(WBP_ObivionDebug_C_InpActEvt_Ctrl_Alt_Six_K2Node_InputKeyEvent_1) == 0x000018, "Wrong size on WBP_ObivionDebug_C_InpActEvt_Ctrl_Alt_Six_K2Node_InputKeyEvent_1");
static_assert(offsetof(WBP_ObivionDebug_C_InpActEvt_Ctrl_Alt_Six_K2Node_InputKeyEvent_1, Key) == 0x000000, "Member 'WBP_ObivionDebug_C_InpActEvt_Ctrl_Alt_Six_K2Node_InputKeyEvent_1::Key' has a wrong offset!");

// Function WBP_ObivionDebug.WBP_ObivionDebug_C.InpActEvt_Ctrl+Alt_One_K2Node_InputKeyEvent_10
// 0x0018 (0x0018 - 0x0000)
struct WBP_ObivionDebug_C_InpActEvt_Ctrl_Alt_One_K2Node_InputKeyEvent_10 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ObivionDebug_C_InpActEvt_Ctrl_Alt_One_K2Node_InputKeyEvent_10) == 0x000008, "Wrong alignment on WBP_ObivionDebug_C_InpActEvt_Ctrl_Alt_One_K2Node_InputKeyEvent_10");
static_assert(sizeof(WBP_ObivionDebug_C_InpActEvt_Ctrl_Alt_One_K2Node_InputKeyEvent_10) == 0x000018, "Wrong size on WBP_ObivionDebug_C_InpActEvt_Ctrl_Alt_One_K2Node_InputKeyEvent_10");
static_assert(offsetof(WBP_ObivionDebug_C_InpActEvt_Ctrl_Alt_One_K2Node_InputKeyEvent_10, Key) == 0x000000, "Member 'WBP_ObivionDebug_C_InpActEvt_Ctrl_Alt_One_K2Node_InputKeyEvent_10::Key' has a wrong offset!");

// Function WBP_ObivionDebug.WBP_ObivionDebug_C.InpActEvt_Ctrl+Alt_NumPadTwo_K2Node_InputKeyEvent_8
// 0x0018 (0x0018 - 0x0000)
struct WBP_ObivionDebug_C_InpActEvt_Ctrl_Alt_NumPadTwo_K2Node_InputKeyEvent_8 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ObivionDebug_C_InpActEvt_Ctrl_Alt_NumPadTwo_K2Node_InputKeyEvent_8) == 0x000008, "Wrong alignment on WBP_ObivionDebug_C_InpActEvt_Ctrl_Alt_NumPadTwo_K2Node_InputKeyEvent_8");
static_assert(sizeof(WBP_ObivionDebug_C_InpActEvt_Ctrl_Alt_NumPadTwo_K2Node_InputKeyEvent_8) == 0x000018, "Wrong size on WBP_ObivionDebug_C_InpActEvt_Ctrl_Alt_NumPadTwo_K2Node_InputKeyEvent_8");
static_assert(offsetof(WBP_ObivionDebug_C_InpActEvt_Ctrl_Alt_NumPadTwo_K2Node_InputKeyEvent_8, Key) == 0x000000, "Member 'WBP_ObivionDebug_C_InpActEvt_Ctrl_Alt_NumPadTwo_K2Node_InputKeyEvent_8::Key' has a wrong offset!");

// Function WBP_ObivionDebug.WBP_ObivionDebug_C.InpActEvt_Ctrl+Alt_NumPadThree_K2Node_InputKeyEvent_6
// 0x0018 (0x0018 - 0x0000)
struct WBP_ObivionDebug_C_InpActEvt_Ctrl_Alt_NumPadThree_K2Node_InputKeyEvent_6 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ObivionDebug_C_InpActEvt_Ctrl_Alt_NumPadThree_K2Node_InputKeyEvent_6) == 0x000008, "Wrong alignment on WBP_ObivionDebug_C_InpActEvt_Ctrl_Alt_NumPadThree_K2Node_InputKeyEvent_6");
static_assert(sizeof(WBP_ObivionDebug_C_InpActEvt_Ctrl_Alt_NumPadThree_K2Node_InputKeyEvent_6) == 0x000018, "Wrong size on WBP_ObivionDebug_C_InpActEvt_Ctrl_Alt_NumPadThree_K2Node_InputKeyEvent_6");
static_assert(offsetof(WBP_ObivionDebug_C_InpActEvt_Ctrl_Alt_NumPadThree_K2Node_InputKeyEvent_6, Key) == 0x000000, "Member 'WBP_ObivionDebug_C_InpActEvt_Ctrl_Alt_NumPadThree_K2Node_InputKeyEvent_6::Key' has a wrong offset!");

// Function WBP_ObivionDebug.WBP_ObivionDebug_C.InpActEvt_Ctrl+Alt_NumPadSix_K2Node_InputKeyEvent_0
// 0x0018 (0x0018 - 0x0000)
struct WBP_ObivionDebug_C_InpActEvt_Ctrl_Alt_NumPadSix_K2Node_InputKeyEvent_0 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ObivionDebug_C_InpActEvt_Ctrl_Alt_NumPadSix_K2Node_InputKeyEvent_0) == 0x000008, "Wrong alignment on WBP_ObivionDebug_C_InpActEvt_Ctrl_Alt_NumPadSix_K2Node_InputKeyEvent_0");
static_assert(sizeof(WBP_ObivionDebug_C_InpActEvt_Ctrl_Alt_NumPadSix_K2Node_InputKeyEvent_0) == 0x000018, "Wrong size on WBP_ObivionDebug_C_InpActEvt_Ctrl_Alt_NumPadSix_K2Node_InputKeyEvent_0");
static_assert(offsetof(WBP_ObivionDebug_C_InpActEvt_Ctrl_Alt_NumPadSix_K2Node_InputKeyEvent_0, Key) == 0x000000, "Member 'WBP_ObivionDebug_C_InpActEvt_Ctrl_Alt_NumPadSix_K2Node_InputKeyEvent_0::Key' has a wrong offset!");

// Function WBP_ObivionDebug.WBP_ObivionDebug_C.InpActEvt_Ctrl+Alt_NumPadOne_K2Node_InputKeyEvent_9
// 0x0018 (0x0018 - 0x0000)
struct WBP_ObivionDebug_C_InpActEvt_Ctrl_Alt_NumPadOne_K2Node_InputKeyEvent_9 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ObivionDebug_C_InpActEvt_Ctrl_Alt_NumPadOne_K2Node_InputKeyEvent_9) == 0x000008, "Wrong alignment on WBP_ObivionDebug_C_InpActEvt_Ctrl_Alt_NumPadOne_K2Node_InputKeyEvent_9");
static_assert(sizeof(WBP_ObivionDebug_C_InpActEvt_Ctrl_Alt_NumPadOne_K2Node_InputKeyEvent_9) == 0x000018, "Wrong size on WBP_ObivionDebug_C_InpActEvt_Ctrl_Alt_NumPadOne_K2Node_InputKeyEvent_9");
static_assert(offsetof(WBP_ObivionDebug_C_InpActEvt_Ctrl_Alt_NumPadOne_K2Node_InputKeyEvent_9, Key) == 0x000000, "Member 'WBP_ObivionDebug_C_InpActEvt_Ctrl_Alt_NumPadOne_K2Node_InputKeyEvent_9::Key' has a wrong offset!");

// Function WBP_ObivionDebug.WBP_ObivionDebug_C.InpActEvt_Ctrl+Alt_NumPadFour_K2Node_InputKeyEvent_4
// 0x0018 (0x0018 - 0x0000)
struct WBP_ObivionDebug_C_InpActEvt_Ctrl_Alt_NumPadFour_K2Node_InputKeyEvent_4 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ObivionDebug_C_InpActEvt_Ctrl_Alt_NumPadFour_K2Node_InputKeyEvent_4) == 0x000008, "Wrong alignment on WBP_ObivionDebug_C_InpActEvt_Ctrl_Alt_NumPadFour_K2Node_InputKeyEvent_4");
static_assert(sizeof(WBP_ObivionDebug_C_InpActEvt_Ctrl_Alt_NumPadFour_K2Node_InputKeyEvent_4) == 0x000018, "Wrong size on WBP_ObivionDebug_C_InpActEvt_Ctrl_Alt_NumPadFour_K2Node_InputKeyEvent_4");
static_assert(offsetof(WBP_ObivionDebug_C_InpActEvt_Ctrl_Alt_NumPadFour_K2Node_InputKeyEvent_4, Key) == 0x000000, "Member 'WBP_ObivionDebug_C_InpActEvt_Ctrl_Alt_NumPadFour_K2Node_InputKeyEvent_4::Key' has a wrong offset!");

// Function WBP_ObivionDebug.WBP_ObivionDebug_C.InpActEvt_Ctrl+Alt_NumPadFive_K2Node_InputKeyEvent_2
// 0x0018 (0x0018 - 0x0000)
struct WBP_ObivionDebug_C_InpActEvt_Ctrl_Alt_NumPadFive_K2Node_InputKeyEvent_2 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ObivionDebug_C_InpActEvt_Ctrl_Alt_NumPadFive_K2Node_InputKeyEvent_2) == 0x000008, "Wrong alignment on WBP_ObivionDebug_C_InpActEvt_Ctrl_Alt_NumPadFive_K2Node_InputKeyEvent_2");
static_assert(sizeof(WBP_ObivionDebug_C_InpActEvt_Ctrl_Alt_NumPadFive_K2Node_InputKeyEvent_2) == 0x000018, "Wrong size on WBP_ObivionDebug_C_InpActEvt_Ctrl_Alt_NumPadFive_K2Node_InputKeyEvent_2");
static_assert(offsetof(WBP_ObivionDebug_C_InpActEvt_Ctrl_Alt_NumPadFive_K2Node_InputKeyEvent_2, Key) == 0x000000, "Member 'WBP_ObivionDebug_C_InpActEvt_Ctrl_Alt_NumPadFive_K2Node_InputKeyEvent_2::Key' has a wrong offset!");

// Function WBP_ObivionDebug.WBP_ObivionDebug_C.InpActEvt_Ctrl+Alt_Four_K2Node_InputKeyEvent_3
// 0x0018 (0x0018 - 0x0000)
struct WBP_ObivionDebug_C_InpActEvt_Ctrl_Alt_Four_K2Node_InputKeyEvent_3 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ObivionDebug_C_InpActEvt_Ctrl_Alt_Four_K2Node_InputKeyEvent_3) == 0x000008, "Wrong alignment on WBP_ObivionDebug_C_InpActEvt_Ctrl_Alt_Four_K2Node_InputKeyEvent_3");
static_assert(sizeof(WBP_ObivionDebug_C_InpActEvt_Ctrl_Alt_Four_K2Node_InputKeyEvent_3) == 0x000018, "Wrong size on WBP_ObivionDebug_C_InpActEvt_Ctrl_Alt_Four_K2Node_InputKeyEvent_3");
static_assert(offsetof(WBP_ObivionDebug_C_InpActEvt_Ctrl_Alt_Four_K2Node_InputKeyEvent_3, Key) == 0x000000, "Member 'WBP_ObivionDebug_C_InpActEvt_Ctrl_Alt_Four_K2Node_InputKeyEvent_3::Key' has a wrong offset!");

// Function WBP_ObivionDebug.WBP_ObivionDebug_C.ExecuteUbergraph_WBP_ObivionDebug
// 0x0210 (0x0210 - 0x0000)
struct WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AVAltarPlayerController*                K2Node_DynamicCast_AsVAltar_Player_Controller;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SaveGameToSlot_ReturnValue;               // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Value;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key;                          // 0x0030(0x0018)(HasGetValueTypeHash)
	float                                         CallFunc_GetRenderOpacity_ReturnValue;             // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           CallFunc_GetPlayerState_ReturnValue;               // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AVAltarPlayerController*                K2Node_DynamicCast_AsVAltar_Player_Controller_1;   // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key_3;                        // 0x0070(0x0018)(HasGetValueTypeHash)
	float                                         CallFunc_GetValue_ReturnValue;                     // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key_1;                        // 0x0090(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key_4;                        // 0x00A8(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key_5;                        // 0x00C0(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key_6;                        // 0x00D8(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key_7;                        // 0x00F0(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key_8;                        // 0x0108(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key_9;                        // 0x0120(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key_10;                       // 0x0138(0x0018)(HasGetValueTypeHash)
	class UVOblivionGameInstanceSubSystem*        CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_162[0x2];                                      // 0x0162(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0164(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USaveGame*                              CallFunc_LoadGameFromSlot_ReturnValue;             // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key_2;                        // 0x01A8(0x0018)(HasGetValueTypeHash)
	class USG_OblivionDebugToolPreferences_C*     K2Node_DynamicCast_AsSG_Oblivion_Debug_Tool_Preferences; // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USG_OblivionDebugToolPreferences_C*     CallFunc_CreateSaveGameObject_ReturnValue;         // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesSaveGameExist_ReturnValue;            // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DA[0x2];                                      // 0x01DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetValue_InValue_ImplicitCast;            // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetValue_InValue_ImplicitCast_1;          // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetValue_InValue_ImplicitCast_2;          // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SetTexMainAlpha_Value_ImplicitCast;       // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast;   // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_CanvasSize_ImplicitCast;        // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetValue_InValue_ImplicitCast_3;          // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast;  // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_1; // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug) == 0x000008, "Wrong alignment on WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug");
static_assert(sizeof(WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug) == 0x000210, "Wrong size on WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug");
static_assert(offsetof(WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug, EntryPoint) == 0x000000, "Member 'WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug, K2Node_DynamicCast_AsVAltar_Player_Controller) == 0x000010, "Member 'WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug::K2Node_DynamicCast_AsVAltar_Player_Controller' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug, K2Node_SwitchEnum_CmpSuccess) == 0x000019, "Member 'WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug, CallFunc_SaveGameToSlot_ReturnValue) == 0x00001A, "Member 'WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug::CallFunc_SaveGameToSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug, CallFunc_Conv_IntToByte_ReturnValue) == 0x00001B, "Member 'WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug, CallFunc_GetValidValue_ReturnValue) == 0x00001C, "Member 'WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000020, "Member 'WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug, K2Node_ComponentBoundEvent_Value) == 0x000028, "Member 'WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug::K2Node_ComponentBoundEvent_Value' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug, K2Node_InputKeyEvent_Key) == 0x000030, "Member 'WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug::K2Node_InputKeyEvent_Key' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug, CallFunc_GetRenderOpacity_ReturnValue) == 0x000048, "Member 'WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug::CallFunc_GetRenderOpacity_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug, CallFunc_EqualEqual_DoubleDouble_ReturnValue) == 0x00004C, "Member 'WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug::CallFunc_EqualEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug, CallFunc_GetPlayerState_ReturnValue) == 0x000050, "Member 'WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug::CallFunc_GetPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug, CallFunc_GetPlayerController_ReturnValue_1) == 0x000058, "Member 'WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug, K2Node_DynamicCast_AsVAltar_Player_Controller_1) == 0x000060, "Member 'WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug::K2Node_DynamicCast_AsVAltar_Player_Controller_1' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug, K2Node_SwitchEnum_CmpSuccess_1) == 0x000069, "Member 'WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug, K2Node_InputKeyEvent_Key_3) == 0x000070, "Member 'WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug::K2Node_InputKeyEvent_Key_3' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug, CallFunc_GetValue_ReturnValue) == 0x000088, "Member 'WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug::CallFunc_GetValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug, K2Node_SwitchEnum_CmpSuccess_2) == 0x00008C, "Member 'WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug, K2Node_InputKeyEvent_Key_1) == 0x000090, "Member 'WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug::K2Node_InputKeyEvent_Key_1' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug, K2Node_InputKeyEvent_Key_4) == 0x0000A8, "Member 'WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug::K2Node_InputKeyEvent_Key_4' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug, K2Node_InputKeyEvent_Key_5) == 0x0000C0, "Member 'WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug::K2Node_InputKeyEvent_Key_5' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug, K2Node_InputKeyEvent_Key_6) == 0x0000D8, "Member 'WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug::K2Node_InputKeyEvent_Key_6' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug, K2Node_InputKeyEvent_Key_7) == 0x0000F0, "Member 'WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug::K2Node_InputKeyEvent_Key_7' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug, K2Node_InputKeyEvent_Key_8) == 0x000108, "Member 'WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug::K2Node_InputKeyEvent_Key_8' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug, K2Node_InputKeyEvent_Key_9) == 0x000120, "Member 'WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug::K2Node_InputKeyEvent_Key_9' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug, K2Node_InputKeyEvent_Key_10) == 0x000138, "Member 'WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug::K2Node_InputKeyEvent_Key_10' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000150, "Member 'WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug, CallFunc_GetPlayerController_ReturnValue_2) == 0x000158, "Member 'WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug, CallFunc_IsValid_ReturnValue) == 0x000160, "Member 'WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug, CallFunc_Not_PreBool_ReturnValue) == 0x000161, "Member 'WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug, K2Node_Event_MyGeometry) == 0x000164, "Member 'WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug, K2Node_Event_InDeltaTime) == 0x00019C, "Member 'WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug, CallFunc_LoadGameFromSlot_ReturnValue) == 0x0001A0, "Member 'WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug::CallFunc_LoadGameFromSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug, K2Node_InputKeyEvent_Key_2) == 0x0001A8, "Member 'WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug::K2Node_InputKeyEvent_Key_2' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug, K2Node_DynamicCast_AsSG_Oblivion_Debug_Tool_Preferences) == 0x0001C0, "Member 'WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug::K2Node_DynamicCast_AsSG_Oblivion_Debug_Tool_Preferences' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug, K2Node_DynamicCast_bSuccess_2) == 0x0001C8, "Member 'WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug, CallFunc_CreateSaveGameObject_ReturnValue) == 0x0001D0, "Member 'WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug::CallFunc_CreateSaveGameObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug, CallFunc_DoesSaveGameExist_ReturnValue) == 0x0001D8, "Member 'WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug::CallFunc_DoesSaveGameExist_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug, CallFunc_Not_PreBool_ReturnValue_1) == 0x0001D9, "Member 'WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug, CallFunc_SetValue_InValue_ImplicitCast) == 0x0001DC, "Member 'WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug::CallFunc_SetValue_InValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug, CallFunc_SetValue_InValue_ImplicitCast_1) == 0x0001E0, "Member 'WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug::CallFunc_SetValue_InValue_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug, CallFunc_SetValue_InValue_ImplicitCast_2) == 0x0001E4, "Member 'WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug::CallFunc_SetValue_InValue_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug, CallFunc_SetTexMainAlpha_Value_ImplicitCast) == 0x0001E8, "Member 'WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug::CallFunc_SetTexMainAlpha_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug, CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast) == 0x0001F0, "Member 'WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug::CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug, K2Node_VariableSet_CanvasSize_ImplicitCast) == 0x0001F8, "Member 'WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug::K2Node_VariableSet_CanvasSize_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug, CallFunc_SetValue_InValue_ImplicitCast_3) == 0x000200, "Member 'WBP_ObivionDebug_C_ExecuteUbergraph_WBP_ObivionDebug::CallFunc_SetValue_InValue_ImplicitCast_3' has a wrong offset!");
