#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Graphics_TogglerButtons3

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Altar_structs.hpp"


namespace SDK::Params
{

// Function WBP_Graphics_TogglerButtons3.WBP_Graphics_TogglerButtons3_C.ButtonSwitch
// 0x0006 (0x0006 - 0x0000)
struct WBP_Graphics_TogglerButtons3_C_ButtonSwitch final
{
public:
	bool                                          Btn1On;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Btn2On;                                            // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Btn3On;                                            // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Graphics_TogglerButtons3_C_ButtonSwitch) == 0x000001, "Wrong alignment on WBP_Graphics_TogglerButtons3_C_ButtonSwitch");
static_assert(sizeof(WBP_Graphics_TogglerButtons3_C_ButtonSwitch) == 0x000006, "Wrong size on WBP_Graphics_TogglerButtons3_C_ButtonSwitch");
static_assert(offsetof(WBP_Graphics_TogglerButtons3_C_ButtonSwitch, Btn1On) == 0x000000, "Member 'WBP_Graphics_TogglerButtons3_C_ButtonSwitch::Btn1On' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons3_C_ButtonSwitch, Btn2On) == 0x000001, "Member 'WBP_Graphics_TogglerButtons3_C_ButtonSwitch::Btn2On' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons3_C_ButtonSwitch, Btn3On) == 0x000002, "Member 'WBP_Graphics_TogglerButtons3_C_ButtonSwitch::Btn3On' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons3_C_ButtonSwitch, CallFunc_Not_PreBool_ReturnValue) == 0x000003, "Member 'WBP_Graphics_TogglerButtons3_C_ButtonSwitch::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons3_C_ButtonSwitch, CallFunc_Not_PreBool_ReturnValue_1) == 0x000004, "Member 'WBP_Graphics_TogglerButtons3_C_ButtonSwitch::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons3_C_ButtonSwitch, CallFunc_Not_PreBool_ReturnValue_2) == 0x000005, "Member 'WBP_Graphics_TogglerButtons3_C_ButtonSwitch::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");

// Function WBP_Graphics_TogglerButtons3.WBP_Graphics_TogglerButtons3_C.ExecuteUbergraph_WBP_Graphics_TogglerButtons3
// 0x0050 (0x0050 - 0x0000)
struct WBP_Graphics_TogglerButtons3_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons3 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Array_Get_Item;                           // 0x0008(0x0018)()
	class FText                                   CallFunc_Array_Get_Item_1;                         // 0x0020(0x0018)()
	class FText                                   CallFunc_Array_Get_Item_2;                         // 0x0038(0x0018)()
};
static_assert(alignof(WBP_Graphics_TogglerButtons3_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons3) == 0x000008, "Wrong alignment on WBP_Graphics_TogglerButtons3_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons3");
static_assert(sizeof(WBP_Graphics_TogglerButtons3_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons3) == 0x000050, "Wrong size on WBP_Graphics_TogglerButtons3_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons3");
static_assert(offsetof(WBP_Graphics_TogglerButtons3_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons3, EntryPoint) == 0x000000, "Member 'WBP_Graphics_TogglerButtons3_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons3::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons3_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons3, CallFunc_Array_Get_Item) == 0x000008, "Member 'WBP_Graphics_TogglerButtons3_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons3::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons3_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons3, CallFunc_Array_Get_Item_1) == 0x000020, "Member 'WBP_Graphics_TogglerButtons3_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons3::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons3_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons3, CallFunc_Array_Get_Item_2) == 0x000038, "Member 'WBP_Graphics_TogglerButtons3_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons3::CallFunc_Array_Get_Item_2' has a wrong offset!");

// Function WBP_Graphics_TogglerButtons3.WBP_Graphics_TogglerButtons3_C.PrepareScreenModeCMD
// 0x01F0 (0x01F0 - 0x0000)
struct WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD final
{
public:
	class FString                                 OptionLabel;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 NewCMD;                                            // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	struct FIntPoint                              Local_CurrentScreenResolution;                     // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetEnumeratorValueFromIndex_ReturnValue;  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x2];                                       // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_2;           // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_3;           // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_6;              // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_7;              // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_4;           // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_5;           // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetLabel_ReturnValue;                     // 0x0140(0x0018)(ConstParm)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_8;              // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0168(0x0018)()
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_9;              // 0x0180(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue;          // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_10;             // 0x0198(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_11;             // 0x01A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue_1;        // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue_2;        // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue_3;        // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E1[0x3];                                      // 0x01E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIntPoint                              CallFunc_GetScreenResolution_ReturnValue;          // 0x01E4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD) == 0x000008, "Wrong alignment on WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD");
static_assert(sizeof(WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD) == 0x0001F0, "Wrong size on WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD");
static_assert(offsetof(WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD, OptionLabel) == 0x000000, "Member 'WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD::OptionLabel' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD, NewCMD) == 0x000010, "Member 'WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD::NewCMD' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD, Local_CurrentScreenResolution) == 0x000020, "Member 'WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD::Local_CurrentScreenResolution' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD, Temp_int_Variable) == 0x000028, "Member 'WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD, Temp_int_Variable_1) == 0x00002C, "Member 'WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD, CallFunc_Conv_IntToByte_ReturnValue) == 0x000030, "Member 'WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD, CallFunc_GetValidValue_ReturnValue) == 0x000038, "Member 'WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD, CallFunc_Conv_IntToByte_ReturnValue_1) == 0x000039, "Member 'WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD::CallFunc_Conv_IntToByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000040, "Member 'WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD, CallFunc_GetEnumeratorValueFromIndex_ReturnValue) == 0x000050, "Member 'WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD::CallFunc_GetEnumeratorValueFromIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD, K2Node_SwitchEnum_CmpSuccess) == 0x000051, "Member 'WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000054, "Member 'WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000058, "Member 'WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD, CallFunc_Conv_IntToString_ReturnValue) == 0x000060, "Member 'WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000070, "Member 'WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD, CallFunc_Concat_StrStr_ReturnValue) == 0x000080, "Member 'WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000090, "Member 'WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD, CallFunc_Conv_IntToString_ReturnValue_2) == 0x0000A0, "Member 'WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD::CallFunc_Conv_IntToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0000B0, "Member 'WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD, CallFunc_Conv_IntToString_ReturnValue_3) == 0x0000C0, "Member 'WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD::CallFunc_Conv_IntToString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD, CallFunc_Concat_StrStr_ReturnValue_3) == 0x0000D0, "Member 'WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD, CallFunc_Concat_StrStr_ReturnValue_4) == 0x0000E0, "Member 'WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD, CallFunc_Concat_StrStr_ReturnValue_5) == 0x0000F0, "Member 'WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD, CallFunc_Concat_StrStr_ReturnValue_6) == 0x000100, "Member 'WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD::CallFunc_Concat_StrStr_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD, CallFunc_Concat_StrStr_ReturnValue_7) == 0x000110, "Member 'WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD::CallFunc_Concat_StrStr_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD, CallFunc_Conv_IntToString_ReturnValue_4) == 0x000120, "Member 'WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD::CallFunc_Conv_IntToString_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD, CallFunc_Conv_IntToString_ReturnValue_5) == 0x000130, "Member 'WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD::CallFunc_Conv_IntToString_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD, CallFunc_GetLabel_ReturnValue) == 0x000140, "Member 'WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD::CallFunc_GetLabel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD, CallFunc_Concat_StrStr_ReturnValue_8) == 0x000158, "Member 'WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD::CallFunc_Concat_StrStr_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD, CallFunc_Conv_StringToText_ReturnValue) == 0x000168, "Member 'WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD, CallFunc_Concat_StrStr_ReturnValue_9) == 0x000180, "Member 'WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD::CallFunc_Concat_StrStr_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD, CallFunc_EqualEqual_TextText_ReturnValue) == 0x000190, "Member 'WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD::CallFunc_EqualEqual_TextText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD, CallFunc_Concat_StrStr_ReturnValue_10) == 0x000198, "Member 'WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD::CallFunc_Concat_StrStr_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD, CallFunc_Concat_StrStr_ReturnValue_11) == 0x0001A8, "Member 'WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD::CallFunc_Concat_StrStr_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD, CallFunc_GetGameUserSettings_ReturnValue) == 0x0001B8, "Member 'WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD, CallFunc_GetGameUserSettings_ReturnValue_1) == 0x0001C0, "Member 'WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD::CallFunc_GetGameUserSettings_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD, CallFunc_GetGameUserSettings_ReturnValue_2) == 0x0001C8, "Member 'WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD::CallFunc_GetGameUserSettings_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD, CallFunc_MakeLiteralInt_ReturnValue) == 0x0001D0, "Member 'WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD, CallFunc_GetGameUserSettings_ReturnValue_3) == 0x0001D8, "Member 'WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD::CallFunc_GetGameUserSettings_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD, CallFunc_Less_IntInt_ReturnValue) == 0x0001E0, "Member 'WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD, CallFunc_GetScreenResolution_ReturnValue) == 0x0001E4, "Member 'WBP_Graphics_TogglerButtons3_C_PrepareScreenModeCMD::CallFunc_GetScreenResolution_ReturnValue' has a wrong offset!");

// Function WBP_Graphics_TogglerButtons3.WBP_Graphics_TogglerButtons3_C.Refresh
// 0x0088 (0x0088 - 0x0000)
struct WBP_Graphics_TogglerButtons3_C_Refresh final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Array_Get_Item;                           // 0x0010(0x0018)()
	TArray<struct FOriginalVideoOption>           CallFunc_GetOptions_ReturnValue;                   // 0x0028(0x0010)(ConstParm, ReferenceParm)
	class FText                                   CallFunc_GetLabel_ReturnValue;                     // 0x0038(0x0018)(ConstParm)
	struct FOriginalVideoOption                   CallFunc_Array_Get_Item_1;                         // 0x0050(0x0028)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Graphics_TogglerButtons3_C_Refresh) == 0x000008, "Wrong alignment on WBP_Graphics_TogglerButtons3_C_Refresh");
static_assert(sizeof(WBP_Graphics_TogglerButtons3_C_Refresh) == 0x000088, "Wrong size on WBP_Graphics_TogglerButtons3_C_Refresh");
static_assert(offsetof(WBP_Graphics_TogglerButtons3_C_Refresh, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_Graphics_TogglerButtons3_C_Refresh::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons3_C_Refresh, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_Graphics_TogglerButtons3_C_Refresh::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons3_C_Refresh, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_Graphics_TogglerButtons3_C_Refresh::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons3_C_Refresh, CallFunc_Array_Get_Item) == 0x000010, "Member 'WBP_Graphics_TogglerButtons3_C_Refresh::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons3_C_Refresh, CallFunc_GetOptions_ReturnValue) == 0x000028, "Member 'WBP_Graphics_TogglerButtons3_C_Refresh::CallFunc_GetOptions_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons3_C_Refresh, CallFunc_GetLabel_ReturnValue) == 0x000038, "Member 'WBP_Graphics_TogglerButtons3_C_Refresh::CallFunc_GetLabel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons3_C_Refresh, CallFunc_Array_Get_Item_1) == 0x000050, "Member 'WBP_Graphics_TogglerButtons3_C_Refresh::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons3_C_Refresh, CallFunc_Array_Length_ReturnValue) == 0x000078, "Member 'WBP_Graphics_TogglerButtons3_C_Refresh::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons3_C_Refresh, CallFunc_Array_Add_ReturnValue) == 0x00007C, "Member 'WBP_Graphics_TogglerButtons3_C_Refresh::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons3_C_Refresh, CallFunc_Less_IntInt_ReturnValue) == 0x000080, "Member 'WBP_Graphics_TogglerButtons3_C_Refresh::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_Graphics_TogglerButtons3.WBP_Graphics_TogglerButtons3_C.UpdateValue
// 0x00E0 (0x00E0 - 0x0000)
struct WBP_Graphics_TogglerButtons3_C_UpdateValue final
{
public:
	class FString                                 Local_CMD;                                         // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         IlluminationQuality;                               // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_PrepareScreenModeCMD_NewCMD;              // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetLabel_ReturnValue;                     // 0x0048(0x0018)(ConstParm)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0060(0x0018)()
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue;          // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FOriginalVideoOption>           CallFunc_GetOptions_ReturnValue;                   // 0x0080(0x0010)(ConstParm, ReferenceParm)
	struct FOriginalVideoOption                   CallFunc_Array_Get_Item;                           // 0x0090(0x0028)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item_1;                         // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue_1;        // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D6[0x2];                                       // 0x00D6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Graphics_TogglerButtons3_C_UpdateValue) == 0x000008, "Wrong alignment on WBP_Graphics_TogglerButtons3_C_UpdateValue");
static_assert(sizeof(WBP_Graphics_TogglerButtons3_C_UpdateValue) == 0x0000E0, "Wrong size on WBP_Graphics_TogglerButtons3_C_UpdateValue");
static_assert(offsetof(WBP_Graphics_TogglerButtons3_C_UpdateValue, Local_CMD) == 0x000000, "Member 'WBP_Graphics_TogglerButtons3_C_UpdateValue::Local_CMD' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons3_C_UpdateValue, IlluminationQuality) == 0x000010, "Member 'WBP_Graphics_TogglerButtons3_C_UpdateValue::IlluminationQuality' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons3_C_UpdateValue, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'WBP_Graphics_TogglerButtons3_C_UpdateValue::Temp_int_Loop_Counter_Variable' has a wrong offset!");
