#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Modern_Settings_DetailsPanel

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "Engine_structs.hpp"
#include "Altar_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Modern_Settings_DetailsPanel.WBP_Modern_Settings_DetailsPanel_C
// 0x0160 (0x0420 - 0x02C0)
class UWBP_Modern_Settings_DetailsPanel_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_OriginalImageTile_C*               DescriptionImage;                                  // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               DescriptionObjectSlot;                             // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Modern_Settings_DetailsPanel_TextScrollBox_C* SettingsDetails;                        // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AltarTextBlock_C*                  SettingsTitleLabel;                                // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FModernSettingTableRow                 SettingData;                                       // 0x02E8(0x0138)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void ExecuteUbergraph_WBP_Modern_Settings_DetailsPanel(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void UpdateDetails(const struct FModernSettingTableRow& NewSettingData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Modern_Settings_DetailsPanel_C">();
	}
	static class UWBP_Modern_Settings_DetailsPanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Modern_Settings_DetailsPanel_C>();
	}
};
static_assert(alignof(UWBP_Modern_Settings_DetailsPanel_C) == 0x000008, "Wrong alignment on UWBP_Modern_Settings_DetailsPanel_C");
static_assert(sizeof(UWBP_Modern_Settings_DetailsPanel_C) == 0x000420, "Wrong size on UWBP_Modern_Settings_DetailsPanel_C");
static_assert(offsetof(UWBP_Modern_Settings_DetailsPanel_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_Modern_Settings_DetailsPanel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_DetailsPanel_C, DescriptionImage) == 0x0002C8, "Member 'UWBP_Modern_Settings_DetailsPanel_C::DescriptionImage' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_DetailsPanel_C, DescriptionObjectSlot) == 0x0002D0, "Member 'UWBP_Modern_Settings_DetailsPanel_C::DescriptionObjectSlot' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_DetailsPanel_C, SettingsDetails) == 0x0002D8, "Member 'UWBP_Modern_Settings_DetailsPanel_C::SettingsDetails' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_DetailsPanel_C, SettingsTitleLabel) == 0x0002E0, "Member 'UWBP_Modern_Settings_DetailsPanel_C::SettingsTitleLabel' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_DetailsPanel_C, SettingData) == 0x0002E8, "Member 'UWBP_Modern_Settings_DetailsPanel_C::SettingData' has a wrong offset!");

}

