#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModernMenu_AddedEffects

#include "Basic.hpp"

#include "Altar_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ModernMenu_AddedEffects.WBP_ModernMenu_AddedEffects_C
// 0x0150 (0x0438 - 0x02E8)
class UWBP_ModernMenu_AddedEffects_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         DurationBox;                                       // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AltarTextBlock_C*                  DurationText;                                      // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               Effect_Icon;                                       // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AltarTextBlock_C*                  Effect_Name;                                       // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AltarTextBlock_C*                  Magnitude_Text;                                    // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         MagnitudeBox;                                      // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Stats_Box;                                         // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAkAudioEvent*                          FocusSound;                                        // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMap<EModernEffectItemRange, class FText>     RangeText;                                         // 0x0330(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<EModernSpellType, class UTexture2D*>     SpellTypeIcon;                                     // 0x0380(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FModernEffectItemData                  EffectItemProperty;                                // 0x03D0(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bShouldCollapsedOnUnfocus;                         // 0x0430(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_ModernMenu_AddedEffects(int32 EntryPoint);
	void OnListItemObjectSet(class UObject* ListItemObject);
	void SetProperties(const struct FModernEffectItemData& NewProperties);
	void SetPropertiesText();
	void SetPropertiesVisibility();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ModernMenu_AddedEffects_C">();
	}
	static class UWBP_ModernMenu_AddedEffects_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ModernMenu_AddedEffects_C>();
	}
};
static_assert(alignof(UWBP_ModernMenu_AddedEffects_C) == 0x000008, "Wrong alignment on UWBP_ModernMenu_AddedEffects_C");
static_assert(sizeof(UWBP_ModernMenu_AddedEffects_C) == 0x000438, "Wrong size on UWBP_ModernMenu_AddedEffects_C");
static_assert(offsetof(UWBP_ModernMenu_AddedEffects_C, UberGraphFrame) == 0x0002E8, "Member 'UWBP_ModernMenu_AddedEffects_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_AddedEffects_C, DurationBox) == 0x0002F0, "Member 'UWBP_ModernMenu_AddedEffects_C::DurationBox' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_AddedEffects_C, DurationText) == 0x0002F8, "Member 'UWBP_ModernMenu_AddedEffects_C::DurationText' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_AddedEffects_C, Effect_Icon) == 0x000300, "Member 'UWBP_ModernMenu_AddedEffects_C::Effect_Icon' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_AddedEffects_C, Effect_Name) == 0x000308, "Member 'UWBP_ModernMenu_AddedEffects_C::Effect_Name' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_AddedEffects_C, Magnitude_Text) == 0x000310, "Member 'UWBP_ModernMenu_AddedEffects_C::Magnitude_Text' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_AddedEffects_C, MagnitudeBox) == 0x000318, "Member 'UWBP_ModernMenu_AddedEffects_C::MagnitudeBox' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_AddedEffects_C, Stats_Box) == 0x000320, "Member 'UWBP_ModernMenu_AddedEffects_C::Stats_Box' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_AddedEffects_C, FocusSound) == 0x000328, "Member 'UWBP_ModernMenu_AddedEffects_C::FocusSound' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_AddedEffects_C, RangeText) == 0x000330, "Member 'UWBP_ModernMenu_AddedEffects_C::RangeText' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_AddedEffects_C, SpellTypeIcon) == 0x000380, "Member 'UWBP_ModernMenu_AddedEffects_C::SpellTypeIcon' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_AddedEffects_C, EffectItemProperty) == 0x0003D0, "Member 'UWBP_ModernMenu_AddedEffects_C::EffectItemProperty' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_AddedEffects_C, bShouldCollapsedOnUnfocus) == 0x000430, "Member 'UWBP_ModernMenu_AddedEffects_C::bShouldCollapsedOnUnfocus' has a wrong offset!");

}

