#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_OriginalMenu_Inventory_Filter

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "Altar_structs.hpp"
#include "Altar_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_OriginalMenu_Inventory_Filter.WBP_OriginalMenu_Inventory_Filter_C
// 0x0048 (0x05B0 - 0x0568)
class UWBP_OriginalMenu_Inventory_Filter_C final : public UVOriginal_InventoryFilter
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0568(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         Filter_InputHint_HorizontalBox;                    // 0x0570(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalMenu_Inventory_FilterIcon_C* CurrentActiveFilter;                             // 0x0578(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnExitFilter;                                      // 0x0580(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<EOriginalInventoryMenuSortType>        CurrentEnabled_Filters;                            // 0x0590(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UWBP_OriginalMenu_Inventory_FilterIcon_C* EnabledFilterWidget;                             // 0x05A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              AlphabeticalIconVisibility;                        // 0x05A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool BP_OnHandleBackAction();
	void Construct();
	void ExecuteUbergraph_WBP_OriginalMenu_Inventory_Filter(int32 EntryPoint);
	void Initialize_Filter_Icon(class UCommonUserWidget* Icon, const struct FOriginal_InventoryFilterTableRow& Design);
	void OnFilterIconCreated(class UCommonUserWidget* NewFilter, const struct FOriginal_InventoryFilterTableRow& FilterDesign);
	void OnFocus();
	void RequestUpdateFilterWidget(class UCommonUserWidget* Filter, bool bIsDisplayed, bool bIsEnable);
	void ResetFilter(EOriginalInventoryMenuSortType ActiveFilter);
	void Set_Alphabetical_Icon_Visibility(ESlateVisibility NewVisibility);
	void SortIsReversedUpdated(bool bIsReversed);
	void UpdateFilter(TArray<EOriginalInventoryMenuSortType>& EnabledFilters);
	void UpdateFilterIcon(class UCommonUserWidget* Icon, bool InIsDisplayed, bool InIsEnabled);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_OriginalMenu_Inventory_Filter_C">();
	}
	static class UWBP_OriginalMenu_Inventory_Filter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_OriginalMenu_Inventory_Filter_C>();
	}
};
static_assert(alignof(UWBP_OriginalMenu_Inventory_Filter_C) == 0x000008, "Wrong alignment on UWBP_OriginalMenu_Inventory_Filter_C");
static_assert(sizeof(UWBP_OriginalMenu_Inventory_Filter_C) == 0x0005B0, "Wrong size on UWBP_OriginalMenu_Inventory_Filter_C");
static_assert(offsetof(UWBP_OriginalMenu_Inventory_Filter_C, UberGraphFrame) == 0x000568, "Member 'UWBP_OriginalMenu_Inventory_Filter_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_Inventory_Filter_C, Filter_InputHint_HorizontalBox) == 0x000570, "Member 'UWBP_OriginalMenu_Inventory_Filter_C::Filter_InputHint_HorizontalBox' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_Inventory_Filter_C, CurrentActiveFilter) == 0x000578, "Member 'UWBP_OriginalMenu_Inventory_Filter_C::CurrentActiveFilter' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_Inventory_Filter_C, OnExitFilter) == 0x000580, "Member 'UWBP_OriginalMenu_Inventory_Filter_C::OnExitFilter' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_Inventory_Filter_C, CurrentEnabled_Filters) == 0x000590, "Member 'UWBP_OriginalMenu_Inventory_Filter_C::CurrentEnabled_Filters' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_Inventory_Filter_C, EnabledFilterWidget) == 0x0005A0, "Member 'UWBP_OriginalMenu_Inventory_Filter_C::EnabledFilterWidget' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_Inventory_Filter_C, AlphabeticalIconVisibility) == 0x0005A8, "Member 'UWBP_OriginalMenu_Inventory_Filter_C::AlphabeticalIconVisibility' has a wrong offset!");

}

