#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Modern_Settings_GamepadRebindWidget

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Altar_structs.hpp"
#include "Altar_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Modern_Settings_GamepadRebindWidget.WBP_Modern_Settings_GamepadRebindWidget_C
// 0x00D8 (0x0700 - 0x0628)
class UWBP_Modern_Settings_GamepadRebindWidget_C final : public UVModernGamepadRebindWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0628(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_OriginalImageTile_C*               FocusBackground;                                   // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModernPrefab_ControllerInputHint_C* HintKey;                                          // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AltarTextBlock_C*                  RebindLabel;                                       // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           FocusColor;                                        // 0x0648(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           UnfocusColor;                                      // 0x0658(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FModernRebindSettingTableRow           RebindSettings;                                    // 0x0668(0x0098)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void BindToRebindSubsystem();
	void ChangeErrorState(bool bErrorState);
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WBP_Modern_Settings_GamepadRebindWidget(int32 EntryPoint);
	void OnFocus();
	void OnUnfocus();
	void PreConstruct(bool IsDesignTime);
	void UnbindToRebindSubsystem();
	void UpdateTexts(const class FText& NewText);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Modern_Settings_GamepadRebindWidget_C">();
	}
	static class UWBP_Modern_Settings_GamepadRebindWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Modern_Settings_GamepadRebindWidget_C>();
	}
};
static_assert(alignof(UWBP_Modern_Settings_GamepadRebindWidget_C) == 0x000008, "Wrong alignment on UWBP_Modern_Settings_GamepadRebindWidget_C");
static_assert(sizeof(UWBP_Modern_Settings_GamepadRebindWidget_C) == 0x000700, "Wrong size on UWBP_Modern_Settings_GamepadRebindWidget_C");
static_assert(offsetof(UWBP_Modern_Settings_GamepadRebindWidget_C, UberGraphFrame) == 0x000628, "Member 'UWBP_Modern_Settings_GamepadRebindWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_GamepadRebindWidget_C, FocusBackground) == 0x000630, "Member 'UWBP_Modern_Settings_GamepadRebindWidget_C::FocusBackground' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_GamepadRebindWidget_C, HintKey) == 0x000638, "Member 'UWBP_Modern_Settings_GamepadRebindWidget_C::HintKey' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_GamepadRebindWidget_C, RebindLabel) == 0x000640, "Member 'UWBP_Modern_Settings_GamepadRebindWidget_C::RebindLabel' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_GamepadRebindWidget_C, FocusColor) == 0x000648, "Member 'UWBP_Modern_Settings_GamepadRebindWidget_C::FocusColor' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_GamepadRebindWidget_C, UnfocusColor) == 0x000658, "Member 'UWBP_Modern_Settings_GamepadRebindWidget_C::UnfocusColor' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_GamepadRebindWidget_C, RebindSettings) == 0x000668, "Member 'UWBP_Modern_Settings_GamepadRebindWidget_C::RebindSettings' has a wrong offset!");

}

