#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_OptionsMenu

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_OptionsMenu.WBP_OptionsMenu_1_C.ExecuteUbergraph_WBP_OptionsMenu_1
// 0x0020 (0x0020 - 0x0000)
struct WBP_OptionsMenu_1_C_ExecuteUbergraph_WBP_OptionsMenu_1 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Value;                          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(float Value)>                  K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OptionsMenu_1_C_ExecuteUbergraph_WBP_OptionsMenu_1) == 0x000008, "Wrong alignment on WBP_OptionsMenu_1_C_ExecuteUbergraph_WBP_OptionsMenu_1");
static_assert(sizeof(WBP_OptionsMenu_1_C_ExecuteUbergraph_WBP_OptionsMenu_1) == 0x000020, "Wrong size on WBP_OptionsMenu_1_C_ExecuteUbergraph_WBP_OptionsMenu_1");
static_assert(offsetof(WBP_OptionsMenu_1_C_ExecuteUbergraph_WBP_OptionsMenu_1, EntryPoint) == 0x000000, "Member 'WBP_OptionsMenu_1_C_ExecuteUbergraph_WBP_OptionsMenu_1::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenu_1_C_ExecuteUbergraph_WBP_OptionsMenu_1, K2Node_CustomEvent_Value) == 0x000004, "Member 'WBP_OptionsMenu_1_C_ExecuteUbergraph_WBP_OptionsMenu_1::K2Node_CustomEvent_Value' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenu_1_C_ExecuteUbergraph_WBP_OptionsMenu_1, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_OptionsMenu_1_C_ExecuteUbergraph_WBP_OptionsMenu_1::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenu_1_C_ExecuteUbergraph_WBP_OptionsMenu_1, CallFunc_GetPlayerController_ReturnValue) == 0x000018, "Member 'WBP_OptionsMenu_1_C_ExecuteUbergraph_WBP_OptionsMenu_1::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");

// Function WBP_OptionsMenu.WBP_OptionsMenu_1_C.On Opacity Slider Change
// 0x0004 (0x0004 - 0x0000)
struct WBP_OptionsMenu_1_C_On_Opacity_Slider_Change final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OptionsMenu_1_C_On_Opacity_Slider_Change) == 0x000004, "Wrong alignment on WBP_OptionsMenu_1_C_On_Opacity_Slider_Change");
static_assert(sizeof(WBP_OptionsMenu_1_C_On_Opacity_Slider_Change) == 0x000004, "Wrong size on WBP_OptionsMenu_1_C_On_Opacity_Slider_Change");
static_assert(offsetof(WBP_OptionsMenu_1_C_On_Opacity_Slider_Change, Value) == 0x000000, "Member 'WBP_OptionsMenu_1_C_On_Opacity_Slider_Change::Value' has a wrong offset!");

// Function WBP_OptionsMenu.WBP_OptionsMenu_C.ExecuteUbergraph_WBP_OptionsMenu
// 0x0040 (0x0040 - 0x0000)
struct WBP_OptionsMenu_C_ExecuteUbergraph_WBP_OptionsMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(float Value)>                  K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAltarCheatManager*                     K2Node_DynamicCast_AsAltar_Cheat_Manager;          // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_Value;                          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAltarGameUserSetting*                  CallFunc_GetInstance_ReturnValue;                  // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OptionsMenu_C_ExecuteUbergraph_WBP_OptionsMenu) == 0x000008, "Wrong alignment on WBP_OptionsMenu_C_ExecuteUbergraph_WBP_OptionsMenu");
static_assert(sizeof(WBP_OptionsMenu_C_ExecuteUbergraph_WBP_OptionsMenu) == 0x000040, "Wrong size on WBP_OptionsMenu_C_ExecuteUbergraph_WBP_OptionsMenu");
static_assert(offsetof(WBP_OptionsMenu_C_ExecuteUbergraph_WBP_OptionsMenu, EntryPoint) == 0x000000, "Member 'WBP_OptionsMenu_C_ExecuteUbergraph_WBP_OptionsMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenu_C_ExecuteUbergraph_WBP_OptionsMenu, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_OptionsMenu_C_ExecuteUbergraph_WBP_OptionsMenu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenu_C_ExecuteUbergraph_WBP_OptionsMenu, CallFunc_GetPlayerController_ReturnValue) == 0x000018, "Member 'WBP_OptionsMenu_C_ExecuteUbergraph_WBP_OptionsMenu::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenu_C_ExecuteUbergraph_WBP_OptionsMenu, K2Node_DynamicCast_AsAltar_Cheat_Manager) == 0x000020, "Member 'WBP_OptionsMenu_C_ExecuteUbergraph_WBP_OptionsMenu::K2Node_DynamicCast_AsAltar_Cheat_Manager' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenu_C_ExecuteUbergraph_WBP_OptionsMenu, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WBP_OptionsMenu_C_ExecuteUbergraph_WBP_OptionsMenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenu_C_ExecuteUbergraph_WBP_OptionsMenu, K2Node_CustomEvent_Value) == 0x00002C, "Member 'WBP_OptionsMenu_C_ExecuteUbergraph_WBP_OptionsMenu::K2Node_CustomEvent_Value' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenu_C_ExecuteUbergraph_WBP_OptionsMenu, CallFunc_GetInstance_ReturnValue) == 0x000030, "Member 'WBP_OptionsMenu_C_ExecuteUbergraph_WBP_OptionsMenu::CallFunc_GetInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OptionsMenu_C_ExecuteUbergraph_WBP_OptionsMenu, CallFunc_GetPlayerController_ReturnValue_1) == 0x000038, "Member 'WBP_OptionsMenu_C_ExecuteUbergraph_WBP_OptionsMenu::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");

// Function WBP_OptionsMenu.WBP_OptionsMenu_C.On Opacity Slider Change
// 0x0004 (0x0004 - 0x0000)
struct WBP_OptionsMenu_C_On_Opacity_Slider_Change final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OptionsMenu_C_On_Opacity_Slider_Change) == 0x000004, "Wrong alignment on WBP_OptionsMenu_C_On_Opacity_Slider_Change");
static_assert(sizeof(WBP_OptionsMenu_C_On_Opacity_Slider_Change) == 0x000004, "Wrong size on WBP_OptionsMenu_C_On_Opacity_Slider_Change");
static_assert(offsetof(WBP_OptionsMenu_C_On_Opacity_Slider_Change, Value) == 0x000000, "Member 'WBP_OptionsMenu_C_On_Opacity_Slider_Change::Value' has a wrong offset!");

}

