#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Modern_MapWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CommonInput_structs.hpp"
#include "Altar_structs.hpp"
#include "EnhancedInput_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_Modern_MapWidget.WBP_Modern_MapWidget_C.UpdateBorderWidthOnZoom
// 0x0098 (0x0098 - 0x0000)
struct WBP_Modern_MapWidget_C_UpdateBorderWidthOnZoom final
{
public:
	float                                         Zoom;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1;   // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_B_ImplicitCast;     // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_2;   // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Bottom_ImplicitCast;             // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_B_ImplicitCast_1;   // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_B_ImplicitCast_2;   // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Right_ImplicitCast;              // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Top_ImplicitCast;                // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_B_ImplicitCast_3;   // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_3;   // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Left_ImplicitCast;               // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_MapWidget_C_UpdateBorderWidthOnZoom) == 0x000008, "Wrong alignment on WBP_Modern_MapWidget_C_UpdateBorderWidthOnZoom");
static_assert(sizeof(WBP_Modern_MapWidget_C_UpdateBorderWidthOnZoom) == 0x000098, "Wrong size on WBP_Modern_MapWidget_C_UpdateBorderWidthOnZoom");
static_assert(offsetof(WBP_Modern_MapWidget_C_UpdateBorderWidthOnZoom, Zoom) == 0x000000, "Member 'WBP_Modern_MapWidget_C_UpdateBorderWidthOnZoom::Zoom' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_UpdateBorderWidthOnZoom, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000008, "Member 'WBP_Modern_MapWidget_C_UpdateBorderWidthOnZoom::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_UpdateBorderWidthOnZoom, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000010, "Member 'WBP_Modern_MapWidget_C_UpdateBorderWidthOnZoom::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_UpdateBorderWidthOnZoom, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000018, "Member 'WBP_Modern_MapWidget_C_UpdateBorderWidthOnZoom::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_UpdateBorderWidthOnZoom, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000020, "Member 'WBP_Modern_MapWidget_C_UpdateBorderWidthOnZoom::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_UpdateBorderWidthOnZoom, CallFunc_Multiply_DoubleDouble_ReturnValue_3) == 0x000028, "Member 'WBP_Modern_MapWidget_C_UpdateBorderWidthOnZoom::CallFunc_Multiply_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_UpdateBorderWidthOnZoom, K2Node_MakeStruct_Margin) == 0x000030, "Member 'WBP_Modern_MapWidget_C_UpdateBorderWidthOnZoom::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_UpdateBorderWidthOnZoom, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000040, "Member 'WBP_Modern_MapWidget_C_UpdateBorderWidthOnZoom::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_UpdateBorderWidthOnZoom, CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1) == 0x000048, "Member 'WBP_Modern_MapWidget_C_UpdateBorderWidthOnZoom::CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_UpdateBorderWidthOnZoom, CallFunc_Multiply_DoubleDouble_B_ImplicitCast) == 0x000050, "Member 'WBP_Modern_MapWidget_C_UpdateBorderWidthOnZoom::CallFunc_Multiply_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_UpdateBorderWidthOnZoom, CallFunc_Multiply_DoubleDouble_A_ImplicitCast_2) == 0x000058, "Member 'WBP_Modern_MapWidget_C_UpdateBorderWidthOnZoom::CallFunc_Multiply_DoubleDouble_A_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_UpdateBorderWidthOnZoom, K2Node_MakeStruct_Bottom_ImplicitCast) == 0x000060, "Member 'WBP_Modern_MapWidget_C_UpdateBorderWidthOnZoom::K2Node_MakeStruct_Bottom_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_UpdateBorderWidthOnZoom, CallFunc_Multiply_DoubleDouble_B_ImplicitCast_1) == 0x000068, "Member 'WBP_Modern_MapWidget_C_UpdateBorderWidthOnZoom::CallFunc_Multiply_DoubleDouble_B_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_UpdateBorderWidthOnZoom, CallFunc_Multiply_DoubleDouble_B_ImplicitCast_2) == 0x000070, "Member 'WBP_Modern_MapWidget_C_UpdateBorderWidthOnZoom::CallFunc_Multiply_DoubleDouble_B_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_UpdateBorderWidthOnZoom, K2Node_MakeStruct_Right_ImplicitCast) == 0x000078, "Member 'WBP_Modern_MapWidget_C_UpdateBorderWidthOnZoom::K2Node_MakeStruct_Right_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_UpdateBorderWidthOnZoom, K2Node_MakeStruct_Top_ImplicitCast) == 0x00007C, "Member 'WBP_Modern_MapWidget_C_UpdateBorderWidthOnZoom::K2Node_MakeStruct_Top_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_UpdateBorderWidthOnZoom, CallFunc_Multiply_DoubleDouble_B_ImplicitCast_3) == 0x000080, "Member 'WBP_Modern_MapWidget_C_UpdateBorderWidthOnZoom::CallFunc_Multiply_DoubleDouble_B_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_UpdateBorderWidthOnZoom, CallFunc_Multiply_DoubleDouble_A_ImplicitCast_3) == 0x000088, "Member 'WBP_Modern_MapWidget_C_UpdateBorderWidthOnZoom::CallFunc_Multiply_DoubleDouble_A_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_UpdateBorderWidthOnZoom, K2Node_MakeStruct_Left_ImplicitCast) == 0x000090, "Member 'WBP_Modern_MapWidget_C_UpdateBorderWidthOnZoom::K2Node_MakeStruct_Left_ImplicitCast' has a wrong offset!");

// Function WBP_Modern_MapWidget.WBP_Modern_MapWidget_C.SetZoomSliderEnabled
// 0x0003 (0x0003 - 0x0000)
struct WBP_Modern_MapWidget_C_SetZoomSliderEnabled final
{
public:
	bool                                          InIsEnabled;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_MapWidget_C_SetZoomSliderEnabled) == 0x000001, "Wrong alignment on WBP_Modern_MapWidget_C_SetZoomSliderEnabled");
static_assert(sizeof(WBP_Modern_MapWidget_C_SetZoomSliderEnabled) == 0x000003, "Wrong size on WBP_Modern_MapWidget_C_SetZoomSliderEnabled");
static_assert(offsetof(WBP_Modern_MapWidget_C_SetZoomSliderEnabled, InIsEnabled) == 0x000000, "Member 'WBP_Modern_MapWidget_C_SetZoomSliderEnabled::InIsEnabled' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_SetZoomSliderEnabled, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'WBP_Modern_MapWidget_C_SetZoomSliderEnabled::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_SetZoomSliderEnabled, CallFunc_Not_PreBool_ReturnValue_1) == 0x000002, "Member 'WBP_Modern_MapWidget_C_SetZoomSliderEnabled::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");

// Function WBP_Modern_MapWidget.WBP_Modern_MapWidget_C.GetCorrectedMousePosition
// 0x00F8 (0x00F8 - 0x0000)
struct WBP_Modern_MapWidget_C_GetCorrectedMousePosition final
{
public:
	struct FVector2D                              ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_1;           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSize_ReturnValue;                      // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetAlignment_ReturnValue;                 // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurrentZoomValue_ReturnValue;          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Multiply_Vector2DVector2D_ReturnValue;    // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_DoubleToVector2D_ReturnValue;        // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              CallFunc_GetViewportWidgetGeometry_ReturnValue;    // 0x0068(0x0038)(IsPlainOldData, NoDestructor)
	struct FVector2D                              CallFunc_GetMousePositionOnViewport_ReturnValue;   // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_LocalToAbsolute_ReturnValue;              // 0x00B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue;         // 0x00C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_AbsoluteSpaceToMapSpace_ReturnValue;      // 0x00D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Divide_Vector2DVector2D_ReturnValue;      // 0x00E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_DoubleToVector2D_InDouble_ImplicitCast; // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_MapWidget_C_GetCorrectedMousePosition) == 0x000008, "Wrong alignment on WBP_Modern_MapWidget_C_GetCorrectedMousePosition");
static_assert(sizeof(WBP_Modern_MapWidget_C_GetCorrectedMousePosition) == 0x0000F8, "Wrong size on WBP_Modern_MapWidget_C_GetCorrectedMousePosition");
static_assert(offsetof(WBP_Modern_MapWidget_C_GetCorrectedMousePosition, ReturnValue) == 0x000000, "Member 'WBP_Modern_MapWidget_C_GetCorrectedMousePosition::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_GetCorrectedMousePosition, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000010, "Member 'WBP_Modern_MapWidget_C_GetCorrectedMousePosition::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_GetCorrectedMousePosition, CallFunc_SlotAsCanvasSlot_ReturnValue_1) == 0x000018, "Member 'WBP_Modern_MapWidget_C_GetCorrectedMousePosition::CallFunc_SlotAsCanvasSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_GetCorrectedMousePosition, CallFunc_GetSize_ReturnValue) == 0x000020, "Member 'WBP_Modern_MapWidget_C_GetCorrectedMousePosition::CallFunc_GetSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_GetCorrectedMousePosition, CallFunc_GetAlignment_ReturnValue) == 0x000030, "Member 'WBP_Modern_MapWidget_C_GetCorrectedMousePosition::CallFunc_GetAlignment_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_GetCorrectedMousePosition, CallFunc_GetCurrentZoomValue_ReturnValue) == 0x000040, "Member 'WBP_Modern_MapWidget_C_GetCorrectedMousePosition::CallFunc_GetCurrentZoomValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_GetCorrectedMousePosition, CallFunc_Multiply_Vector2DVector2D_ReturnValue) == 0x000048, "Member 'WBP_Modern_MapWidget_C_GetCorrectedMousePosition::CallFunc_Multiply_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_GetCorrectedMousePosition, CallFunc_Conv_DoubleToVector2D_ReturnValue) == 0x000058, "Member 'WBP_Modern_MapWidget_C_GetCorrectedMousePosition::CallFunc_Conv_DoubleToVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_GetCorrectedMousePosition, CallFunc_GetViewportWidgetGeometry_ReturnValue) == 0x000068, "Member 'WBP_Modern_MapWidget_C_GetCorrectedMousePosition::CallFunc_GetViewportWidgetGeometry_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_GetCorrectedMousePosition, CallFunc_GetMousePositionOnViewport_ReturnValue) == 0x0000A0, "Member 'WBP_Modern_MapWidget_C_GetCorrectedMousePosition::CallFunc_GetMousePositionOnViewport_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_GetCorrectedMousePosition, CallFunc_LocalToAbsolute_ReturnValue) == 0x0000B0, "Member 'WBP_Modern_MapWidget_C_GetCorrectedMousePosition::CallFunc_LocalToAbsolute_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_GetCorrectedMousePosition, CallFunc_Add_Vector2DVector2D_ReturnValue) == 0x0000C0, "Member 'WBP_Modern_MapWidget_C_GetCorrectedMousePosition::CallFunc_Add_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_GetCorrectedMousePosition, CallFunc_AbsoluteSpaceToMapSpace_ReturnValue) == 0x0000D0, "Member 'WBP_Modern_MapWidget_C_GetCorrectedMousePosition::CallFunc_AbsoluteSpaceToMapSpace_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_GetCorrectedMousePosition, CallFunc_Divide_Vector2DVector2D_ReturnValue) == 0x0000E0, "Member 'WBP_Modern_MapWidget_C_GetCorrectedMousePosition::CallFunc_Divide_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_GetCorrectedMousePosition, CallFunc_Conv_DoubleToVector2D_InDouble_ImplicitCast) == 0x0000F0, "Member 'WBP_Modern_MapWidget_C_GetCorrectedMousePosition::CallFunc_Conv_DoubleToVector2D_InDouble_ImplicitCast' has a wrong offset!");

// Function WBP_Modern_MapWidget.WBP_Modern_MapWidget_C.AudioZoomCheckZoomIn
// 0x0020 (0x0020 - 0x0000)
struct WBP_Modern_MapWidget_C_AudioZoomCheckZoomIn final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsFocussed_ReturnValue;                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurrentZoomValue_ReturnValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Less_DoubleDouble_B_ImplicitCast;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_MapWidget_C_AudioZoomCheckZoomIn) == 0x000008, "Wrong alignment on WBP_Modern_MapWidget_C_AudioZoomCheckZoomIn");
static_assert(sizeof(WBP_Modern_MapWidget_C_AudioZoomCheckZoomIn) == 0x000020, "Wrong size on WBP_Modern_MapWidget_C_AudioZoomCheckZoomIn");
static_assert(offsetof(WBP_Modern_MapWidget_C_AudioZoomCheckZoomIn, ReturnValue) == 0x000000, "Member 'WBP_Modern_MapWidget_C_AudioZoomCheckZoomIn::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_AudioZoomCheckZoomIn, CallFunc_GetIsFocussed_ReturnValue) == 0x000001, "Member 'WBP_Modern_MapWidget_C_AudioZoomCheckZoomIn::CallFunc_GetIsFocussed_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_AudioZoomCheckZoomIn, CallFunc_GetCurrentZoomValue_ReturnValue) == 0x000004, "Member 'WBP_Modern_MapWidget_C_AudioZoomCheckZoomIn::CallFunc_GetCurrentZoomValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_AudioZoomCheckZoomIn, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000008, "Member 'WBP_Modern_MapWidget_C_AudioZoomCheckZoomIn::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_AudioZoomCheckZoomIn, CallFunc_BooleanAND_ReturnValue) == 0x000009, "Member 'WBP_Modern_MapWidget_C_AudioZoomCheckZoomIn::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_AudioZoomCheckZoomIn, CallFunc_BooleanAND_ReturnValue_1) == 0x00000A, "Member 'WBP_Modern_MapWidget_C_AudioZoomCheckZoomIn::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_AudioZoomCheckZoomIn, CallFunc_Less_DoubleDouble_B_ImplicitCast) == 0x000010, "Member 'WBP_Modern_MapWidget_C_AudioZoomCheckZoomIn::CallFunc_Less_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_AudioZoomCheckZoomIn, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x000018, "Member 'WBP_Modern_MapWidget_C_AudioZoomCheckZoomIn::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function WBP_Modern_MapWidget.WBP_Modern_MapWidget_C.AudioPlaySFXZoomIn
// 0x0001 (0x0001 - 0x0000)
struct WBP_Modern_MapWidget_C_AudioPlaySFXZoomIn final
{
public:
	bool                                          CallFunc_AudioZoomCheckZoomIn_ReturnValue;         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_MapWidget_C_AudioPlaySFXZoomIn) == 0x000001, "Wrong alignment on WBP_Modern_MapWidget_C_AudioPlaySFXZoomIn");
static_assert(sizeof(WBP_Modern_MapWidget_C_AudioPlaySFXZoomIn) == 0x000001, "Wrong size on WBP_Modern_MapWidget_C_AudioPlaySFXZoomIn");
static_assert(offsetof(WBP_Modern_MapWidget_C_AudioPlaySFXZoomIn, CallFunc_AudioZoomCheckZoomIn_ReturnValue) == 0x000000, "Member 'WBP_Modern_MapWidget_C_AudioPlaySFXZoomIn::CallFunc_AudioZoomCheckZoomIn_ReturnValue' has a wrong offset!");

// Function WBP_Modern_MapWidget.WBP_Modern_MapWidget_C.AudioZoomCheckZoomOut
// 0x0020 (0x0020 - 0x0000)
struct WBP_Modern_MapWidget_C_AudioZoomCheckZoomOut final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsFocussed_ReturnValue;                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurrentZoomValue_ReturnValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Greater_DoubleDouble_B_ImplicitCast;      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_MapWidget_C_AudioZoomCheckZoomOut) == 0x000008, "Wrong alignment on WBP_Modern_MapWidget_C_AudioZoomCheckZoomOut");
static_assert(sizeof(WBP_Modern_MapWidget_C_AudioZoomCheckZoomOut) == 0x000020, "Wrong size on WBP_Modern_MapWidget_C_AudioZoomCheckZoomOut");
static_assert(offsetof(WBP_Modern_MapWidget_C_AudioZoomCheckZoomOut, ReturnValue) == 0x000000, "Member 'WBP_Modern_MapWidget_C_AudioZoomCheckZoomOut::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_AudioZoomCheckZoomOut, CallFunc_GetIsFocussed_ReturnValue) == 0x000001, "Member 'WBP_Modern_MapWidget_C_AudioZoomCheckZoomOut::CallFunc_GetIsFocussed_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_AudioZoomCheckZoomOut, CallFunc_GetCurrentZoomValue_ReturnValue) == 0x000004, "Member 'WBP_Modern_MapWidget_C_AudioZoomCheckZoomOut::CallFunc_GetCurrentZoomValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_AudioZoomCheckZoomOut, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000008, "Member 'WBP_Modern_MapWidget_C_AudioZoomCheckZoomOut::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_AudioZoomCheckZoomOut, CallFunc_BooleanAND_ReturnValue) == 0x000009, "Member 'WBP_Modern_MapWidget_C_AudioZoomCheckZoomOut::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_AudioZoomCheckZoomOut, CallFunc_BooleanAND_ReturnValue_1) == 0x00000A, "Member 'WBP_Modern_MapWidget_C_AudioZoomCheckZoomOut::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_AudioZoomCheckZoomOut, CallFunc_Greater_DoubleDouble_B_ImplicitCast) == 0x000010, "Member 'WBP_Modern_MapWidget_C_AudioZoomCheckZoomOut::CallFunc_Greater_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_AudioZoomCheckZoomOut, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000018, "Member 'WBP_Modern_MapWidget_C_AudioZoomCheckZoomOut::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function WBP_Modern_MapWidget.WBP_Modern_MapWidget_C.AudioPlaySFXZoomOut
// 0x0001 (0x0001 - 0x0000)
struct WBP_Modern_MapWidget_C_AudioPlaySFXZoomOut final
{
public:
	bool                                          CallFunc_AudioZoomCheckZoomOut_ReturnValue;        // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_MapWidget_C_AudioPlaySFXZoomOut) == 0x000001, "Wrong alignment on WBP_Modern_MapWidget_C_AudioPlaySFXZoomOut");
static_assert(sizeof(WBP_Modern_MapWidget_C_AudioPlaySFXZoomOut) == 0x000001, "Wrong size on WBP_Modern_MapWidget_C_AudioPlaySFXZoomOut");
static_assert(offsetof(WBP_Modern_MapWidget_C_AudioPlaySFXZoomOut, CallFunc_AudioZoomCheckZoomOut_ReturnValue) == 0x000000, "Member 'WBP_Modern_MapWidget_C_AudioPlaySFXZoomOut::CallFunc_AudioZoomCheckZoomOut_ReturnValue' has a wrong offset!");

// Function WBP_Modern_MapWidget.WBP_Modern_MapWidget_C.AdaptCoordsToWideScreen
// 0x00F8 (0x00F8 - 0x0000)
struct WBP_Modern_MapWidget_C_AdaptCoordsToWideScreen final
{
public:
	struct FVector2D                              Pos;                                               // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              NewPos;                                            // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              CallFunc_GetPaintSpaceGeometry_ReturnValue;        // 0x0020(0x0038)(ConstParm, IsPlainOldData, NoDestructor)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetLocalSize_ReturnValue;                 // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetViewSize_ReturnValue;                  // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_1;                        // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_1;                        // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_2;                        // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_2;                        // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_2;        // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_3;        // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_2;      // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_3;      // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x00E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_MapWidget_C_AdaptCoordsToWideScreen) == 0x000008, "Wrong alignment on WBP_Modern_MapWidget_C_AdaptCoordsToWideScreen");
static_assert(sizeof(WBP_Modern_MapWidget_C_AdaptCoordsToWideScreen) == 0x0000F8, "Wrong size on WBP_Modern_MapWidget_C_AdaptCoordsToWideScreen");
static_assert(offsetof(WBP_Modern_MapWidget_C_AdaptCoordsToWideScreen, Pos) == 0x000000, "Member 'WBP_Modern_MapWidget_C_AdaptCoordsToWideScreen::Pos' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_AdaptCoordsToWideScreen, NewPos) == 0x000010, "Member 'WBP_Modern_MapWidget_C_AdaptCoordsToWideScreen::NewPos' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_AdaptCoordsToWideScreen, CallFunc_GetPaintSpaceGeometry_ReturnValue) == 0x000020, "Member 'WBP_Modern_MapWidget_C_AdaptCoordsToWideScreen::CallFunc_GetPaintSpaceGeometry_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_AdaptCoordsToWideScreen, CallFunc_BreakVector2D_X) == 0x000058, "Member 'WBP_Modern_MapWidget_C_AdaptCoordsToWideScreen::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_AdaptCoordsToWideScreen, CallFunc_BreakVector2D_Y) == 0x000060, "Member 'WBP_Modern_MapWidget_C_AdaptCoordsToWideScreen::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_AdaptCoordsToWideScreen, CallFunc_GetLocalSize_ReturnValue) == 0x000068, "Member 'WBP_Modern_MapWidget_C_AdaptCoordsToWideScreen::CallFunc_GetLocalSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_AdaptCoordsToWideScreen, CallFunc_GetViewSize_ReturnValue) == 0x000078, "Member 'WBP_Modern_MapWidget_C_AdaptCoordsToWideScreen::CallFunc_GetViewSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_AdaptCoordsToWideScreen, CallFunc_BreakVector2D_X_1) == 0x000088, "Member 'WBP_Modern_MapWidget_C_AdaptCoordsToWideScreen::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_AdaptCoordsToWideScreen, CallFunc_BreakVector2D_Y_1) == 0x000090, "Member 'WBP_Modern_MapWidget_C_AdaptCoordsToWideScreen::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_AdaptCoordsToWideScreen, CallFunc_BreakVector2D_X_2) == 0x000098, "Member 'WBP_Modern_MapWidget_C_AdaptCoordsToWideScreen::CallFunc_BreakVector2D_X_2' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_AdaptCoordsToWideScreen, CallFunc_BreakVector2D_Y_2) == 0x0000A0, "Member 'WBP_Modern_MapWidget_C_AdaptCoordsToWideScreen::CallFunc_BreakVector2D_Y_2' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_AdaptCoordsToWideScreen, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x0000A8, "Member 'WBP_Modern_MapWidget_C_AdaptCoordsToWideScreen::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_AdaptCoordsToWideScreen, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x0000B0, "Member 'WBP_Modern_MapWidget_C_AdaptCoordsToWideScreen::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_AdaptCoordsToWideScreen, CallFunc_Divide_DoubleDouble_ReturnValue_2) == 0x0000B8, "Member 'WBP_Modern_MapWidget_C_AdaptCoordsToWideScreen::CallFunc_Divide_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_AdaptCoordsToWideScreen, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x0000C0, "Member 'WBP_Modern_MapWidget_C_AdaptCoordsToWideScreen::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_AdaptCoordsToWideScreen, CallFunc_Divide_DoubleDouble_ReturnValue_3) == 0x0000C8, "Member 'WBP_Modern_MapWidget_C_AdaptCoordsToWideScreen::CallFunc_Divide_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_AdaptCoordsToWideScreen, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x0000D0, "Member 'WBP_Modern_MapWidget_C_AdaptCoordsToWideScreen::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_AdaptCoordsToWideScreen, CallFunc_Subtract_DoubleDouble_ReturnValue_2) == 0x0000D8, "Member 'WBP_Modern_MapWidget_C_AdaptCoordsToWideScreen::CallFunc_Subtract_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_AdaptCoordsToWideScreen, CallFunc_Subtract_DoubleDouble_ReturnValue_3) == 0x0000E0, "Member 'WBP_Modern_MapWidget_C_AdaptCoordsToWideScreen::CallFunc_Subtract_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_AdaptCoordsToWideScreen, CallFunc_MakeVector2D_ReturnValue) == 0x0000E8, "Member 'WBP_Modern_MapWidget_C_AdaptCoordsToWideScreen::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");

// Function WBP_Modern_MapWidget.WBP_Modern_MapWidget_C.HandleZoomSmoothChanged
// 0x0090 (0x0090 - 0x0000)
struct WBP_Modern_MapWidget_C_HandleZoomSmoothChanged final
{
public:
	double                                        NewValue;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NeedZoomOnMouse;                                   // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsFocussed_ReturnValue;                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetPosition_ReturnValue;                  // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurrentZoomValue_ReturnValue;          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_1;           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetPosition_ReturnValue_1;                // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_5;                // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B[0x5];                                       // 0x005B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue; // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInputMethodActive_ReturnValue;          // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsFocussed_ReturnValue_1;              // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_5;                 // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_73[0x5];                                       // 0x0073(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GreaterEqual_DoubleDouble_B_ImplicitCast; // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast; // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetMapZoom_ZoomValue_ImplicitCast;        // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetMapZoom_ZoomValue_ImplicitCast_1;      // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_MapWidget_C_HandleZoomSmoothChanged) == 0x000008, "Wrong alignment on WBP_Modern_MapWidget_C_HandleZoomSmoothChanged");
static_assert(sizeof(WBP_Modern_MapWidget_C_HandleZoomSmoothChanged) == 0x000090, "Wrong size on WBP_Modern_MapWidget_C_HandleZoomSmoothChanged");
static_assert(offsetof(WBP_Modern_MapWidget_C_HandleZoomSmoothChanged, NewValue) == 0x000000, "Member 'WBP_Modern_MapWidget_C_HandleZoomSmoothChanged::NewValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_HandleZoomSmoothChanged, NeedZoomOnMouse) == 0x000008, "Member 'WBP_Modern_MapWidget_C_HandleZoomSmoothChanged::NeedZoomOnMouse' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_HandleZoomSmoothChanged, CallFunc_GetIsFocussed_ReturnValue) == 0x000009, "Member 'WBP_Modern_MapWidget_C_HandleZoomSmoothChanged::CallFunc_GetIsFocussed_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_HandleZoomSmoothChanged, CallFunc_Not_PreBool_ReturnValue) == 0x00000A, "Member 'WBP_Modern_MapWidget_C_HandleZoomSmoothChanged::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_HandleZoomSmoothChanged, CallFunc_BooleanAND_ReturnValue) == 0x00000B, "Member 'WBP_Modern_MapWidget_C_HandleZoomSmoothChanged::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_HandleZoomSmoothChanged, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000010, "Member 'WBP_Modern_MapWidget_C_HandleZoomSmoothChanged::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_HandleZoomSmoothChanged, CallFunc_GetPosition_ReturnValue) == 0x000018, "Member 'WBP_Modern_MapWidget_C_HandleZoomSmoothChanged::CallFunc_GetPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_HandleZoomSmoothChanged, CallFunc_Not_PreBool_ReturnValue_1) == 0x000028, "Member 'WBP_Modern_MapWidget_C_HandleZoomSmoothChanged::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_HandleZoomSmoothChanged, CallFunc_BooleanAND_ReturnValue_1) == 0x000029, "Member 'WBP_Modern_MapWidget_C_HandleZoomSmoothChanged::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_HandleZoomSmoothChanged, CallFunc_Not_PreBool_ReturnValue_2) == 0x00002A, "Member 'WBP_Modern_MapWidget_C_HandleZoomSmoothChanged::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_HandleZoomSmoothChanged, CallFunc_BooleanAND_ReturnValue_2) == 0x00002B, "Member 'WBP_Modern_MapWidget_C_HandleZoomSmoothChanged::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_HandleZoomSmoothChanged, CallFunc_Not_PreBool_ReturnValue_3) == 0x00002C, "Member 'WBP_Modern_MapWidget_C_HandleZoomSmoothChanged::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_HandleZoomSmoothChanged, CallFunc_GetCurrentZoomValue_ReturnValue) == 0x000030, "Member 'WBP_Modern_MapWidget_C_HandleZoomSmoothChanged::CallFunc_GetCurrentZoomValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_HandleZoomSmoothChanged, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000034, "Member 'WBP_Modern_MapWidget_C_HandleZoomSmoothChanged::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_HandleZoomSmoothChanged, CallFunc_SlotAsCanvasSlot_ReturnValue_1) == 0x000038, "Member 'WBP_Modern_MapWidget_C_HandleZoomSmoothChanged::CallFunc_SlotAsCanvasSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_HandleZoomSmoothChanged, CallFunc_BooleanAND_ReturnValue_3) == 0x000040, "Member 'WBP_Modern_MapWidget_C_HandleZoomSmoothChanged::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_HandleZoomSmoothChanged, CallFunc_GetPosition_ReturnValue_1) == 0x000048, "Member 'WBP_Modern_MapWidget_C_HandleZoomSmoothChanged::CallFunc_GetPosition_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_HandleZoomSmoothChanged, CallFunc_Not_PreBool_ReturnValue_4) == 0x000058, "Member 'WBP_Modern_MapWidget_C_HandleZoomSmoothChanged::CallFunc_Not_PreBool_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_HandleZoomSmoothChanged, CallFunc_BooleanAND_ReturnValue_4) == 0x000059, "Member 'WBP_Modern_MapWidget_C_HandleZoomSmoothChanged::CallFunc_BooleanAND_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_HandleZoomSmoothChanged, CallFunc_Not_PreBool_ReturnValue_5) == 0x00005A, "Member 'WBP_Modern_MapWidget_C_HandleZoomSmoothChanged::CallFunc_Not_PreBool_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_HandleZoomSmoothChanged, CallFunc_GetPlayerController_ReturnValue) == 0x000060, "Member 'WBP_Modern_MapWidget_C_HandleZoomSmoothChanged::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_HandleZoomSmoothChanged, CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue) == 0x000068, "Member 'WBP_Modern_MapWidget_C_HandleZoomSmoothChanged::CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_HandleZoomSmoothChanged, CallFunc_IsInputMethodActive_ReturnValue) == 0x000070, "Member 'WBP_Modern_MapWidget_C_HandleZoomSmoothChanged::CallFunc_IsInputMethodActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_HandleZoomSmoothChanged, CallFunc_GetIsFocussed_ReturnValue_1) == 0x000071, "Member 'WBP_Modern_MapWidget_C_HandleZoomSmoothChanged::CallFunc_GetIsFocussed_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_HandleZoomSmoothChanged, CallFunc_BooleanAND_ReturnValue_5) == 0x000072, "Member 'WBP_Modern_MapWidget_C_HandleZoomSmoothChanged::CallFunc_BooleanAND_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_HandleZoomSmoothChanged, CallFunc_GreaterEqual_DoubleDouble_B_ImplicitCast) == 0x000078, "Member 'WBP_Modern_MapWidget_C_HandleZoomSmoothChanged::CallFunc_GreaterEqual_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_HandleZoomSmoothChanged, CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast) == 0x000080, "Member 'WBP_Modern_MapWidget_C_HandleZoomSmoothChanged::CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_HandleZoomSmoothChanged, CallFunc_SetMapZoom_ZoomValue_ImplicitCast) == 0x000088, "Member 'WBP_Modern_MapWidget_C_HandleZoomSmoothChanged::CallFunc_SetMapZoom_ZoomValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_HandleZoomSmoothChanged, CallFunc_SetMapZoom_ZoomValue_ImplicitCast_1) == 0x00008C, "Member 'WBP_Modern_MapWidget_C_HandleZoomSmoothChanged::CallFunc_SetMapZoom_ZoomValue_ImplicitCast_1' has a wrong offset!");

// Function WBP_Modern_MapWidget.WBP_Modern_MapWidget_C.CanUseInput
// 0x0028 (0x0028 - 0x0000)
struct WBP_Modern_MapWidget_C_CanUseInput final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVUINavigationGlobalSubsystem*          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IVEnhancedInputNavigable> CallFunc_IsWidgetInTopMostFocusedStack_Widget_CastInput; // 0x0010(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsWidgetInTopMostFocusedStack_ReturnValue; // 0x0020(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_MapWidget_C_CanUseInput) == 0x000008, "Wrong alignment on WBP_Modern_MapWidget_C_CanUseInput");
static_assert(sizeof(WBP_Modern_MapWidget_C_CanUseInput) == 0x000028, "Wrong size on WBP_Modern_MapWidget_C_CanUseInput");
static_assert(offsetof(WBP_Modern_MapWidget_C_CanUseInput, ReturnValue) == 0x000000, "Member 'WBP_Modern_MapWidget_C_CanUseInput::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_CanUseInput, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'WBP_Modern_MapWidget_C_CanUseInput::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_CanUseInput, CallFunc_IsWidgetInTopMostFocusedStack_Widget_CastInput) == 0x000010, "Member 'WBP_Modern_MapWidget_C_CanUseInput::CallFunc_IsWidgetInTopMostFocusedStack_Widget_CastInput' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_CanUseInput, CallFunc_IsWidgetInTopMostFocusedStack_ReturnValue) == 0x000020, "Member 'WBP_Modern_MapWidget_C_CanUseInput::CallFunc_IsWidgetInTopMostFocusedStack_ReturnValue' has a wrong offset!");

// Function WBP_Modern_MapWidget.WBP_Modern_MapWidget_C.PluginCompilation
// 0x0001 (0x0001 - 0x0000)
struct WBP_Modern_MapWidget_C_PluginCompilation final
{
public:
	bool                                          NewParam;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_MapWidget_C_PluginCompilation) == 0x000001, "Wrong alignment on WBP_Modern_MapWidget_C_PluginCompilation");
static_assert(sizeof(WBP_Modern_MapWidget_C_PluginCompilation) == 0x000001, "Wrong size on WBP_Modern_MapWidget_C_PluginCompilation");
static_assert(offsetof(WBP_Modern_MapWidget_C_PluginCompilation, NewParam) == 0x000000, "Member 'WBP_Modern_MapWidget_C_PluginCompilation::NewParam' has a wrong offset!");

// Function WBP_Modern_MapWidget.WBP_Modern_MapWidget_C.UpdateFooter
// 0x0048 (0x0048 - 0x0000)
struct WBP_Modern_MapWidget_C_UpdateFooter final
{
public:
	bool                                          bInFilterMode;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFooterInputActionVisibility           K2Node_MakeStruct_FooterInputActionVisibility;     // 0x0008(0x0010)(NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFooterInputActionVisibility           K2Node_MakeStruct_FooterInputActionVisibility_1;   // 0x0020(0x0010)(NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFooterInputActionVisibility           K2Node_MakeStruct_FooterInputActionVisibility_2;   // 0x0038(0x0010)(NoDestructor)
};
static_assert(alignof(WBP_Modern_MapWidget_C_UpdateFooter) == 0x000008, "Wrong alignment on WBP_Modern_MapWidget_C_UpdateFooter");
static_assert(sizeof(WBP_Modern_MapWidget_C_UpdateFooter) == 0x000048, "Wrong size on WBP_Modern_MapWidget_C_UpdateFooter");
static_assert(offsetof(WBP_Modern_MapWidget_C_UpdateFooter, bInFilterMode) == 0x000000, "Member 'WBP_Modern_MapWidget_C_UpdateFooter::bInFilterMode' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_UpdateFooter, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'WBP_Modern_MapWidget_C_UpdateFooter::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_UpdateFooter, K2Node_MakeStruct_FooterInputActionVisibility) == 0x000008, "Member 'WBP_Modern_MapWidget_C_UpdateFooter::K2Node_MakeStruct_FooterInputActionVisibility' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_UpdateFooter, CallFunc_Not_PreBool_ReturnValue) == 0x000018, "Member 'WBP_Modern_MapWidget_C_UpdateFooter::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_UpdateFooter, K2Node_MakeStruct_FooterInputActionVisibility_1) == 0x000020, "Member 'WBP_Modern_MapWidget_C_UpdateFooter::K2Node_MakeStruct_FooterInputActionVisibility_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_UpdateFooter, CallFunc_Not_PreBool_ReturnValue_1) == 0x000030, "Member 'WBP_Modern_MapWidget_C_UpdateFooter::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_UpdateFooter, K2Node_MakeStruct_FooterInputActionVisibility_2) == 0x000038, "Member 'WBP_Modern_MapWidget_C_UpdateFooter::K2Node_MakeStruct_FooterInputActionVisibility_2' has a wrong offset!");

// Function WBP_Modern_MapWidget.WBP_Modern_MapWidget_C.InitFooter
// 0x0010 (0x0010 - 0x0000)
struct WBP_Modern_MapWidget_C_InitFooter final
{
public:
	class UWBP_Modern_Menu_Player_Footer_C*       Footer;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_MapWidget_C_InitFooter) == 0x000008, "Wrong alignment on WBP_Modern_MapWidget_C_InitFooter");
static_assert(sizeof(WBP_Modern_MapWidget_C_InitFooter) == 0x000010, "Wrong size on WBP_Modern_MapWidget_C_InitFooter");
static_assert(offsetof(WBP_Modern_MapWidget_C_InitFooter, Footer) == 0x000000, "Member 'WBP_Modern_MapWidget_C_InitFooter::Footer' has a wrong offset!");
static_assert(offsetof(WBP_Modern_MapWidget_C_InitFooter, CallFunc_BooleanAND_ReturnValue) == 0x000008, "Member 'WBP_Modern_MapWidget_C_InitFooter::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_Modern_MapWidget.WBP_Modern_MapWidget_C.SetDefaultMapDetailValues
// 0x0020 (0x0020 - 0x0000)
struct WBP_Modern_MapWidget_C_SetDefaultMapDetailValues final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_GetEffectMaterial_ReturnValue;            // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetEffectMaterial_ReturnValue_1;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetEffectMaterial_ReturnValue_2;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
