#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_OriginalMenu_InventoryItemDetailsSubTabsButton

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "WBP_ModernPrefab_NavigableButton_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_OriginalMenu_InventoryItemDetailsSubTabsButton.WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C
// 0x0200 (0x18C0 - 0x16C0)
class UWBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C final : public UWBP_ModernPrefab_NavigableButton_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C; // 0x16C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       SelectFadeOut;                                     // 0x16C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BackGroundFadeInOut;                               // 0x16D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SelectFadeIn;                                      // 0x16D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PopOut;                                            // 0x16E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               inv_subtabs_button_background;                     // 0x16E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               inv_subtabs_button_icon;                           // 0x16F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               inv_subtabs_button_Select;                         // 0x16F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsActiveByDefault;                                 // 0x1700(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1701[0xF];                                     // 0x1701(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            IconActiveBrush;                                   // 0x1710(0x00D0)(Edit, BlueprintVisible)
	struct FSlateBrush                            IconInactiveBrush;                                 // 0x17E0(0x00D0)(Edit, BlueprintVisible)
	double                                        AnimationSpeed;                                    // 0x18B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_OriginalMenu_InventoryItemDetailsSubTabsButton(int32 EntryPoint);
	void PlayPopOutAnimation(bool Forward, bool Instant);
	void PreConstruct(bool IsDesignTime);
	void SetIsActive(bool IsActive, bool IsOnConstruct);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C">();
	}
	static class UWBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C>();
	}
};
static_assert(alignof(UWBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C) == 0x000010, "Wrong alignment on UWBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C");
static_assert(sizeof(UWBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C) == 0x0018C0, "Wrong size on UWBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C");
static_assert(offsetof(UWBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C, UberGraphFrame_WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C) == 0x0016C0, "Member 'UWBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C::UberGraphFrame_WBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C, SelectFadeOut) == 0x0016C8, "Member 'UWBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C::SelectFadeOut' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C, BackGroundFadeInOut) == 0x0016D0, "Member 'UWBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C::BackGroundFadeInOut' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C, SelectFadeIn) == 0x0016D8, "Member 'UWBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C::SelectFadeIn' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C, PopOut) == 0x0016E0, "Member 'UWBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C::PopOut' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C, inv_subtabs_button_background) == 0x0016E8, "Member 'UWBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C::inv_subtabs_button_background' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C, inv_subtabs_button_icon) == 0x0016F0, "Member 'UWBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C::inv_subtabs_button_icon' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C, inv_subtabs_button_Select) == 0x0016F8, "Member 'UWBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C::inv_subtabs_button_Select' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C, IsActiveByDefault) == 0x001700, "Member 'UWBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C::IsActiveByDefault' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C, IconActiveBrush) == 0x001710, "Member 'UWBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C::IconActiveBrush' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C, IconInactiveBrush) == 0x0017E0, "Member 'UWBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C::IconInactiveBrush' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C, AnimationSpeed) == 0x0018B0, "Member 'UWBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C::AnimationSpeed' has a wrong offset!");

}

