#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModernMenu_Message

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Altar_structs.hpp"
#include "Altar_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ModernMenu_Message.WBP_ModernMenu_Message_C
// 0x0030 (0x0518 - 0x04E8)
class UWBP_ModernMenu_Message_C final : public UVLegacyMessageMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVMessageMenuViewModel*                 VMessageMenuViewModel;                             // 0x04F0(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeIn;                                            // 0x04F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_MessageMenu_Specific_Default_C*    WBP_MessageMenuSpecific_Default;                   // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher;                                    // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVModernMessageMenuSpecific*            CurrentMenu;                                       // 0x0510(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateMessage(const class FText& InNewMessage);
	void UpdateMenuType(EModalMenuLayoutType NewMenuType);
	void UpdateButtons(const TArray<class FText>& InNewButtonsData);
	void Update_Widget_Data_and_Binding(int32 WidgetIndex, class FText& Title);
	void SetVMessageMenuViewModel(class UVMessageMenuViewModel* ViewModel);
	void SetViewModelReference(class UVViewModelBase* ViewModelRef);
	void SendClickedButton(const int32& ButtonIndex);
	void OnFocus();
	void ExecuteUbergraph_WBP_ModernMenu_Message(int32 EntryPoint);
	void CREATEDELEGATE_PROXYFUNCTION_1(int32 InButtonIndex);
	void CREATEDELEGATE_PROXYFUNCTION_0(int32 InButtonIndex);
	void BP_OnActivated();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ModernMenu_Message_C">();
	}
	static class UWBP_ModernMenu_Message_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ModernMenu_Message_C>();
	}
};
static_assert(alignof(UWBP_ModernMenu_Message_C) == 0x000008, "Wrong alignment on UWBP_ModernMenu_Message_C");
static_assert(sizeof(UWBP_ModernMenu_Message_C) == 0x000518, "Wrong size on UWBP_ModernMenu_Message_C");
static_assert(offsetof(UWBP_ModernMenu_Message_C, UberGraphFrame) == 0x0004E8, "Member 'UWBP_ModernMenu_Message_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_Message_C, VMessageMenuViewModel) == 0x0004F0, "Member 'UWBP_ModernMenu_Message_C::VMessageMenuViewModel' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_Message_C, FadeIn) == 0x0004F8, "Member 'UWBP_ModernMenu_Message_C::FadeIn' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_Message_C, WBP_MessageMenuSpecific_Default) == 0x000500, "Member 'UWBP_ModernMenu_Message_C::WBP_MessageMenuSpecific_Default' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_Message_C, WidgetSwitcher) == 0x000508, "Member 'UWBP_ModernMenu_Message_C::WidgetSwitcher' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_Message_C, CurrentMenu) == 0x000510, "Member 'UWBP_ModernMenu_Message_C::CurrentMenu' has a wrong offset!");

}

