#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Modern_Settings_SettingsPanel

#include "Basic.hpp"

#include "CommonInput_structs.hpp"
#include "Altar_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Modern_Settings_SettingsPanel.WBP_Modern_Settings_SettingsPanel_C.BP_Update Lock State
// 0x0028 (0x0028 - 0x0000)
struct WBP_Modern_Settings_SettingsPanel_C_BP_Update_Lock_State final
{
public:
	bool                                          NewLockState;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVModernSettingWidget*                  CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Settings_SettingsPanel_C_BP_Update_Lock_State) == 0x000008, "Wrong alignment on WBP_Modern_Settings_SettingsPanel_C_BP_Update_Lock_State");
static_assert(sizeof(WBP_Modern_Settings_SettingsPanel_C_BP_Update_Lock_State) == 0x000028, "Wrong size on WBP_Modern_Settings_SettingsPanel_C_BP_Update_Lock_State");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_BP_Update_Lock_State, NewLockState) == 0x000000, "Member 'WBP_Modern_Settings_SettingsPanel_C_BP_Update_Lock_State::NewLockState' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_BP_Update_Lock_State, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WBP_Modern_Settings_SettingsPanel_C_BP_Update_Lock_State::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_BP_Update_Lock_State, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'WBP_Modern_Settings_SettingsPanel_C_BP_Update_Lock_State::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_BP_Update_Lock_State, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_Modern_Settings_SettingsPanel_C_BP_Update_Lock_State::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_BP_Update_Lock_State, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'WBP_Modern_Settings_SettingsPanel_C_BP_Update_Lock_State::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_BP_Update_Lock_State, CallFunc_Array_Get_Item) == 0x000018, "Member 'WBP_Modern_Settings_SettingsPanel_C_BP_Update_Lock_State::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_BP_Update_Lock_State, CallFunc_Less_IntInt_ReturnValue) == 0x000020, "Member 'WBP_Modern_Settings_SettingsPanel_C_BP_Update_Lock_State::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_Modern_Settings_SettingsPanel.WBP_Modern_Settings_SettingsPanel_C.CreateSettingCategoryWidget
// 0x0058 (0x0058 - 0x0000)
struct WBP_Modern_Settings_SettingsPanel_C_CreateSettingCategoryWidget final
{
public:
	struct FModernSettingCategoryTableRow         CurrentData;                                       // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UVModernSettingCategoryWidget*          Local_CurrentCategoryHeader;                       // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_Modern_Settings_CategoryLabelWidget_C* CallFunc_Create_ReturnValue;                   // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UScrollBoxSlot*                         K2Node_DynamicCast_AsScroll_Box_Slot;              // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Settings_SettingsPanel_C_CreateSettingCategoryWidget) == 0x000008, "Wrong alignment on WBP_Modern_Settings_SettingsPanel_C_CreateSettingCategoryWidget");
static_assert(sizeof(WBP_Modern_Settings_SettingsPanel_C_CreateSettingCategoryWidget) == 0x000058, "Wrong size on WBP_Modern_Settings_SettingsPanel_C_CreateSettingCategoryWidget");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_CreateSettingCategoryWidget, CurrentData) == 0x000000, "Member 'WBP_Modern_Settings_SettingsPanel_C_CreateSettingCategoryWidget::CurrentData' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_CreateSettingCategoryWidget, Local_CurrentCategoryHeader) == 0x000028, "Member 'WBP_Modern_Settings_SettingsPanel_C_CreateSettingCategoryWidget::Local_CurrentCategoryHeader' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_CreateSettingCategoryWidget, CallFunc_GetOwningPlayer_ReturnValue) == 0x000030, "Member 'WBP_Modern_Settings_SettingsPanel_C_CreateSettingCategoryWidget::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_CreateSettingCategoryWidget, CallFunc_Create_ReturnValue) == 0x000038, "Member 'WBP_Modern_Settings_SettingsPanel_C_CreateSettingCategoryWidget::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_CreateSettingCategoryWidget, CallFunc_AddChild_ReturnValue) == 0x000040, "Member 'WBP_Modern_Settings_SettingsPanel_C_CreateSettingCategoryWidget::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_CreateSettingCategoryWidget, K2Node_DynamicCast_AsScroll_Box_Slot) == 0x000048, "Member 'WBP_Modern_Settings_SettingsPanel_C_CreateSettingCategoryWidget::K2Node_DynamicCast_AsScroll_Box_Slot' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_CreateSettingCategoryWidget, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'WBP_Modern_Settings_SettingsPanel_C_CreateSettingCategoryWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_Modern_Settings_SettingsPanel.WBP_Modern_Settings_SettingsPanel_C.CreateSettingWidget
// 0x01E8 (0x01E8 - 0x0000)
struct WBP_Modern_Settings_SettingsPanel_C_CreateSettingWidget final
{
public:
	struct FModernSettingTableRow                 CurrentSettingData;                                // 0x0000(0x0138)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UUserWidget*                            Local_CurrentWidget;                               // 0x0138(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVModernSettingWidget*                  Local_CurrentSettingWidget;                        // 0x0140(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable;                               // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable_1;                             // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable_2;                             // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable_3;                             // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable_4;                             // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EModernSettingWidgetType                      Temp_byte_Variable;                                // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x3];                                      // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool NewState)>                K2Node_CreateDelegate_OutputDelegate;              // 0x0174(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UVModernSettingWidget* FocussedSettings)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0184(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A1[0x3];                                      // 0x01A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_Select_Default;                             // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_Create_ReturnValue;                       // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlatformValidForSetting_ReturnValue;    // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BA[0x6];                                      // 0x01BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x01C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UScrollBoxSlot*                         K2Node_DynamicCast_AsScroll_Box_Slot;              // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVModernSettingWidget*                  K2Node_DynamicCast_AsVModern_Setting_Widget;       // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Settings_SettingsPanel_C_CreateSettingWidget) == 0x000008, "Wrong alignment on WBP_Modern_Settings_SettingsPanel_C_CreateSettingWidget");
static_assert(sizeof(WBP_Modern_Settings_SettingsPanel_C_CreateSettingWidget) == 0x0001E8, "Wrong size on WBP_Modern_Settings_SettingsPanel_C_CreateSettingWidget");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_CreateSettingWidget, CurrentSettingData) == 0x000000, "Member 'WBP_Modern_Settings_SettingsPanel_C_CreateSettingWidget::CurrentSettingData' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_CreateSettingWidget, Local_CurrentWidget) == 0x000138, "Member 'WBP_Modern_Settings_SettingsPanel_C_CreateSettingWidget::Local_CurrentWidget' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_CreateSettingWidget, Local_CurrentSettingWidget) == 0x000140, "Member 'WBP_Modern_Settings_SettingsPanel_C_CreateSettingWidget::Local_CurrentSettingWidget' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_CreateSettingWidget, Temp_class_Variable) == 0x000148, "Member 'WBP_Modern_Settings_SettingsPanel_C_CreateSettingWidget::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_CreateSettingWidget, Temp_class_Variable_1) == 0x000150, "Member 'WBP_Modern_Settings_SettingsPanel_C_CreateSettingWidget::Temp_class_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_CreateSettingWidget, Temp_class_Variable_2) == 0x000158, "Member 'WBP_Modern_Settings_SettingsPanel_C_CreateSettingWidget::Temp_class_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_CreateSettingWidget, Temp_class_Variable_3) == 0x000160, "Member 'WBP_Modern_Settings_SettingsPanel_C_CreateSettingWidget::Temp_class_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_CreateSettingWidget, Temp_class_Variable_4) == 0x000168, "Member 'WBP_Modern_Settings_SettingsPanel_C_CreateSettingWidget::Temp_class_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_CreateSettingWidget, Temp_byte_Variable) == 0x000170, "Member 'WBP_Modern_Settings_SettingsPanel_C_CreateSettingWidget::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_CreateSettingWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000174, "Member 'WBP_Modern_Settings_SettingsPanel_C_CreateSettingWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_CreateSettingWidget, K2Node_CreateDelegate_OutputDelegate_1) == 0x000184, "Member 'WBP_Modern_Settings_SettingsPanel_C_CreateSettingWidget::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_CreateSettingWidget, CallFunc_GetOwningPlayer_ReturnValue) == 0x000198, "Member 'WBP_Modern_Settings_SettingsPanel_C_CreateSettingWidget::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_CreateSettingWidget, CallFunc_Not_PreBool_ReturnValue) == 0x0001A0, "Member 'WBP_Modern_Settings_SettingsPanel_C_CreateSettingWidget::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_CreateSettingWidget, CallFunc_Array_Add_ReturnValue) == 0x0001A4, "Member 'WBP_Modern_Settings_SettingsPanel_C_CreateSettingWidget::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_CreateSettingWidget, K2Node_Select_Default) == 0x0001A8, "Member 'WBP_Modern_Settings_SettingsPanel_C_CreateSettingWidget::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_CreateSettingWidget, CallFunc_Create_ReturnValue) == 0x0001B0, "Member 'WBP_Modern_Settings_SettingsPanel_C_CreateSettingWidget::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_CreateSettingWidget, CallFunc_IsPlatformValidForSetting_ReturnValue) == 0x0001B8, "Member 'WBP_Modern_Settings_SettingsPanel_C_CreateSettingWidget::CallFunc_IsPlatformValidForSetting_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_CreateSettingWidget, CallFunc_BooleanAND_ReturnValue) == 0x0001B9, "Member 'WBP_Modern_Settings_SettingsPanel_C_CreateSettingWidget::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_CreateSettingWidget, CallFunc_AddChild_ReturnValue) == 0x0001C0, "Member 'WBP_Modern_Settings_SettingsPanel_C_CreateSettingWidget::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_CreateSettingWidget, K2Node_DynamicCast_AsScroll_Box_Slot) == 0x0001C8, "Member 'WBP_Modern_Settings_SettingsPanel_C_CreateSettingWidget::K2Node_DynamicCast_AsScroll_Box_Slot' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_CreateSettingWidget, K2Node_DynamicCast_bSuccess) == 0x0001D0, "Member 'WBP_Modern_Settings_SettingsPanel_C_CreateSettingWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_CreateSettingWidget, K2Node_DynamicCast_AsVModern_Setting_Widget) == 0x0001D8, "Member 'WBP_Modern_Settings_SettingsPanel_C_CreateSettingWidget::K2Node_DynamicCast_AsVModern_Setting_Widget' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_CreateSettingWidget, K2Node_DynamicCast_bSuccess_1) == 0x0001E0, "Member 'WBP_Modern_Settings_SettingsPanel_C_CreateSettingWidget::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function WBP_Modern_Settings_SettingsPanel.WBP_Modern_Settings_SettingsPanel_C.ExecuteUbergraph_WBP_Modern_Settings_SettingsPanel
// 0x0338 (0x0338 - 0x0000)
struct WBP_Modern_Settings_SettingsPanel_C_ExecuteUbergraph_WBP_Modern_Settings_SettingsPanel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable_1;                              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IVEnhancedInputNavigable> K2Node_Event_HoveredWidget;                     // 0x0018(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UVModernSettingWidget*                  K2Node_DynamicCast_AsVModern_Setting_Widget;       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FModernSettingTableRow                 CallFunc_GetSettingRow_ReturnValue;                // 0x0038(0x0138)(ConstParm)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate;            // 0x0178(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue; // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_2;                              // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate_1;          // 0x0194(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              K2Node_CustomEvent_bNewInputType;                  // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A5[0x3];                                      // 0x01A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UScrollBox*                             CallFunc_GetScrollBox_ReturnValue;                 // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue_1; // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVModernSettingWidget*                  K2Node_CustomEvent_FocussedSettings;               // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FModernSettingTableRow                 CallFunc_GetSettingRow_ReturnValue_1;              // 0x01D8(0x0138)(ConstParm)
	bool                                          K2Node_CustomEvent_NewState;                       // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_311[0x7];                                      // 0x0311(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UScrollBox*                             CallFunc_GetScrollBox_ReturnValue_1;               // 0x0318(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UScrollBox*                             CallFunc_GetScrollBox_ReturnValue_2;               // 0x0320(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_3;                              // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              Temp_byte_Variable;                                // 0x032C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32D[0x3];                                      // 0x032D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Settings_SettingsPanel_C_ExecuteUbergraph_WBP_Modern_Settings_SettingsPanel) == 0x000008, "Wrong alignment on WBP_Modern_Settings_SettingsPanel_C_ExecuteUbergraph_WBP_Modern_Settings_SettingsPanel");
static_assert(sizeof(WBP_Modern_Settings_SettingsPanel_C_ExecuteUbergraph_WBP_Modern_Settings_SettingsPanel) == 0x000338, "Wrong size on WBP_Modern_Settings_SettingsPanel_C_ExecuteUbergraph_WBP_Modern_Settings_SettingsPanel");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_ExecuteUbergraph_WBP_Modern_Settings_SettingsPanel, EntryPoint) == 0x000000, "Member 'WBP_Modern_Settings_SettingsPanel_C_ExecuteUbergraph_WBP_Modern_Settings_SettingsPanel::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_ExecuteUbergraph_WBP_Modern_Settings_SettingsPanel, Temp_real_Variable) == 0x000004, "Member 'WBP_Modern_Settings_SettingsPanel_C_ExecuteUbergraph_WBP_Modern_Settings_SettingsPanel::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_ExecuteUbergraph_WBP_Modern_Settings_SettingsPanel, CallFunc_Not_PreBool_ReturnValue) == 0x000008, "Member 'WBP_Modern_Settings_SettingsPanel_C_ExecuteUbergraph_WBP_Modern_Settings_SettingsPanel::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_ExecuteUbergraph_WBP_Modern_Settings_SettingsPanel, Temp_real_Variable_1) == 0x00000C, "Member 'WBP_Modern_Settings_SettingsPanel_C_ExecuteUbergraph_WBP_Modern_Settings_SettingsPanel::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_ExecuteUbergraph_WBP_Modern_Settings_SettingsPanel, K2Node_Event_IsDesignTime) == 0x000010, "Member 'WBP_Modern_Settings_SettingsPanel_C_ExecuteUbergraph_WBP_Modern_Settings_SettingsPanel::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_ExecuteUbergraph_WBP_Modern_Settings_SettingsPanel, K2Node_Event_HoveredWidget) == 0x000018, "Member 'WBP_Modern_Settings_SettingsPanel_C_ExecuteUbergraph_WBP_Modern_Settings_SettingsPanel::K2Node_Event_HoveredWidget' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_ExecuteUbergraph_WBP_Modern_Settings_SettingsPanel, K2Node_DynamicCast_AsVModern_Setting_Widget) == 0x000028, "Member 'WBP_Modern_Settings_SettingsPanel_C_ExecuteUbergraph_WBP_Modern_Settings_SettingsPanel::K2Node_DynamicCast_AsVModern_Setting_Widget' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_ExecuteUbergraph_WBP_Modern_Settings_SettingsPanel, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'WBP_Modern_Settings_SettingsPanel_C_ExecuteUbergraph_WBP_Modern_Settings_SettingsPanel::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_ExecuteUbergraph_WBP_Modern_Settings_SettingsPanel, CallFunc_GetSettingRow_ReturnValue) == 0x000038, "Member 'WBP_Modern_Settings_SettingsPanel_C_ExecuteUbergraph_WBP_Modern_Settings_SettingsPanel::CallFunc_GetSettingRow_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_ExecuteUbergraph_WBP_Modern_Settings_SettingsPanel, CallFunc_GetPlayerController_ReturnValue) == 0x000170, "Member 'WBP_Modern_Settings_SettingsPanel_C_ExecuteUbergraph_WBP_Modern_Settings_SettingsPanel::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_ExecuteUbergraph_WBP_Modern_Settings_SettingsPanel, K2Node_CreateDelegate_OutputDelegate) == 0x000178, "Member 'WBP_Modern_Settings_SettingsPanel_C_ExecuteUbergraph_WBP_Modern_Settings_SettingsPanel::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_ExecuteUbergraph_WBP_Modern_Settings_SettingsPanel, CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue) == 0x000188, "Member 'WBP_Modern_Settings_SettingsPanel_C_ExecuteUbergraph_WBP_Modern_Settings_SettingsPanel::CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_ExecuteUbergraph_WBP_Modern_Settings_SettingsPanel, Temp_real_Variable_2) == 0x000190, "Member 'WBP_Modern_Settings_SettingsPanel_C_ExecuteUbergraph_WBP_Modern_Settings_SettingsPanel::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_ExecuteUbergraph_WBP_Modern_Settings_SettingsPanel, K2Node_CreateDelegate_OutputDelegate_1) == 0x000194, "Member 'WBP_Modern_Settings_SettingsPanel_C_ExecuteUbergraph_WBP_Modern_Settings_SettingsPanel::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_ExecuteUbergraph_WBP_Modern_Settings_SettingsPanel, K2Node_CustomEvent_bNewInputType) == 0x0001A4, "Member 'WBP_Modern_Settings_SettingsPanel_C_ExecuteUbergraph_WBP_Modern_Settings_SettingsPanel::K2Node_CustomEvent_bNewInputType' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_ExecuteUbergraph_WBP_Modern_Settings_SettingsPanel, CallFunc_GetScrollBox_ReturnValue) == 0x0001A8, "Member 'WBP_Modern_Settings_SettingsPanel_C_ExecuteUbergraph_WBP_Modern_Settings_SettingsPanel::CallFunc_GetScrollBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_ExecuteUbergraph_WBP_Modern_Settings_SettingsPanel, CallFunc_GetPlayerController_ReturnValue_1) == 0x0001B0, "Member 'WBP_Modern_Settings_SettingsPanel_C_ExecuteUbergraph_WBP_Modern_Settings_SettingsPanel::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_ExecuteUbergraph_WBP_Modern_Settings_SettingsPanel, CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue_1) == 0x0001B8, "Member 'WBP_Modern_Settings_SettingsPanel_C_ExecuteUbergraph_WBP_Modern_Settings_SettingsPanel::CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_ExecuteUbergraph_WBP_Modern_Settings_SettingsPanel, CallFunc_GetDynamicMaterial_ReturnValue) == 0x0001C0, "Member 'WBP_Modern_Settings_SettingsPanel_C_ExecuteUbergraph_WBP_Modern_Settings_SettingsPanel::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_ExecuteUbergraph_WBP_Modern_Settings_SettingsPanel, CallFunc_IsValid_ReturnValue) == 0x0001C8, "Member 'WBP_Modern_Settings_SettingsPanel_C_ExecuteUbergraph_WBP_Modern_Settings_SettingsPanel::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_ExecuteUbergraph_WBP_Modern_Settings_SettingsPanel, K2Node_CustomEvent_FocussedSettings) == 0x0001D0, "Member 'WBP_Modern_Settings_SettingsPanel_C_ExecuteUbergraph_WBP_Modern_Settings_SettingsPanel::K2Node_CustomEvent_FocussedSettings' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_ExecuteUbergraph_WBP_Modern_Settings_SettingsPanel, CallFunc_GetSettingRow_ReturnValue_1) == 0x0001D8, "Member 'WBP_Modern_Settings_SettingsPanel_C_ExecuteUbergraph_WBP_Modern_Settings_SettingsPanel::CallFunc_GetSettingRow_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_ExecuteUbergraph_WBP_Modern_Settings_SettingsPanel, K2Node_CustomEvent_NewState) == 0x000310, "Member 'WBP_Modern_Settings_SettingsPanel_C_ExecuteUbergraph_WBP_Modern_Settings_SettingsPanel::K2Node_CustomEvent_NewState' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_ExecuteUbergraph_WBP_Modern_Settings_SettingsPanel, CallFunc_GetScrollBox_ReturnValue_1) == 0x000318, "Member 'WBP_Modern_Settings_SettingsPanel_C_ExecuteUbergraph_WBP_Modern_Settings_SettingsPanel::CallFunc_GetScrollBox_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_ExecuteUbergraph_WBP_Modern_Settings_SettingsPanel, CallFunc_GetScrollBox_ReturnValue_2) == 0x000320, "Member 'WBP_Modern_Settings_SettingsPanel_C_ExecuteUbergraph_WBP_Modern_Settings_SettingsPanel::CallFunc_GetScrollBox_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_ExecuteUbergraph_WBP_Modern_Settings_SettingsPanel, Temp_real_Variable_3) == 0x000328, "Member 'WBP_Modern_Settings_SettingsPanel_C_ExecuteUbergraph_WBP_Modern_Settings_SettingsPanel::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_ExecuteUbergraph_WBP_Modern_Settings_SettingsPanel, Temp_byte_Variable) == 0x00032C, "Member 'WBP_Modern_Settings_SettingsPanel_C_ExecuteUbergraph_WBP_Modern_Settings_SettingsPanel::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_ExecuteUbergraph_WBP_Modern_Settings_SettingsPanel, K2Node_Select_Default) == 0x000330, "Member 'WBP_Modern_Settings_SettingsPanel_C_ExecuteUbergraph_WBP_Modern_Settings_SettingsPanel::K2Node_Select_Default' has a wrong offset!");

// Function WBP_Modern_Settings_SettingsPanel.WBP_Modern_Settings_SettingsPanel_C.HaveAnySettingsForCurrentPlatform
// 0x0180 (0x0180 - 0x0000)
struct WBP_Modern_Settings_SettingsPanel_C_HaveAnySettingsForCurrentPlatform final
{
public:
	struct FModernSettingCategoryTableRow         Category;                                          // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          Value;                                             // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FModernSettingTableRow                 CallFunc_Array_Get_Item;                           // 0x0040(0x0138)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlatformValidForSetting_ReturnValue;    // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Settings_SettingsPanel_C_HaveAnySettingsForCurrentPlatform) == 0x000008, "Wrong alignment on WBP_Modern_Settings_SettingsPanel_C_HaveAnySettingsForCurrentPlatform");
static_assert(sizeof(WBP_Modern_Settings_SettingsPanel_C_HaveAnySettingsForCurrentPlatform) == 0x000180, "Wrong size on WBP_Modern_Settings_SettingsPanel_C_HaveAnySettingsForCurrentPlatform");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_HaveAnySettingsForCurrentPlatform, Category) == 0x000000, "Member 'WBP_Modern_Settings_SettingsPanel_C_HaveAnySettingsForCurrentPlatform::Category' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_HaveAnySettingsForCurrentPlatform, Value) == 0x000028, "Member 'WBP_Modern_Settings_SettingsPanel_C_HaveAnySettingsForCurrentPlatform::Value' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_HaveAnySettingsForCurrentPlatform, Temp_int_Array_Index_Variable) == 0x00002C, "Member 'WBP_Modern_Settings_SettingsPanel_C_HaveAnySettingsForCurrentPlatform::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_HaveAnySettingsForCurrentPlatform, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'WBP_Modern_Settings_SettingsPanel_C_HaveAnySettingsForCurrentPlatform::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_HaveAnySettingsForCurrentPlatform, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'WBP_Modern_Settings_SettingsPanel_C_HaveAnySettingsForCurrentPlatform::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_HaveAnySettingsForCurrentPlatform, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'WBP_Modern_Settings_SettingsPanel_C_HaveAnySettingsForCurrentPlatform::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_HaveAnySettingsForCurrentPlatform, CallFunc_Array_Get_Item) == 0x000040, "Member 'WBP_Modern_Settings_SettingsPanel_C_HaveAnySettingsForCurrentPlatform::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_HaveAnySettingsForCurrentPlatform, CallFunc_Less_IntInt_ReturnValue) == 0x000178, "Member 'WBP_Modern_Settings_SettingsPanel_C_HaveAnySettingsForCurrentPlatform::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_HaveAnySettingsForCurrentPlatform, CallFunc_IsPlatformValidForSetting_ReturnValue) == 0x000179, "Member 'WBP_Modern_Settings_SettingsPanel_C_HaveAnySettingsForCurrentPlatform::CallFunc_IsPlatformValidForSetting_ReturnValue' has a wrong offset!");

// Function WBP_Modern_Settings_SettingsPanel.WBP_Modern_Settings_SettingsPanel_C.OnChildHoveredBP
// 0x0010 (0x0010 - 0x0000)
struct WBP_Modern_Settings_SettingsPanel_C_OnChildHoveredBP final
{
public:
	TScriptInterface<class IVEnhancedInputNavigable> HoveredWidget;                                  // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Settings_SettingsPanel_C_OnChildHoveredBP) == 0x000008, "Wrong alignment on WBP_Modern_Settings_SettingsPanel_C_OnChildHoveredBP");
static_assert(sizeof(WBP_Modern_Settings_SettingsPanel_C_OnChildHoveredBP) == 0x000010, "Wrong size on WBP_Modern_Settings_SettingsPanel_C_OnChildHoveredBP");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_OnChildHoveredBP, HoveredWidget) == 0x000000, "Member 'WBP_Modern_Settings_SettingsPanel_C_OnChildHoveredBP::HoveredWidget' has a wrong offset!");

// Function WBP_Modern_Settings_SettingsPanel.WBP_Modern_Settings_SettingsPanel_C.OnInputMethodChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_Modern_Settings_SettingsPanel_C_OnInputMethodChanged final
{
public:
	ECommonInputType                              bNewInputType;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Settings_SettingsPanel_C_OnInputMethodChanged) == 0x000001, "Wrong alignment on WBP_Modern_Settings_SettingsPanel_C_OnInputMethodChanged");
static_assert(sizeof(WBP_Modern_Settings_SettingsPanel_C_OnInputMethodChanged) == 0x000001, "Wrong size on WBP_Modern_Settings_SettingsPanel_C_OnInputMethodChanged");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_OnInputMethodChanged, bNewInputType) == 0x000000, "Member 'WBP_Modern_Settings_SettingsPanel_C_OnInputMethodChanged::bNewInputType' has a wrong offset!");

// Function WBP_Modern_Settings_SettingsPanel.WBP_Modern_Settings_SettingsPanel_C.OnRequestChangeScrollState
// 0x0001 (0x0001 - 0x0000)
struct WBP_Modern_Settings_SettingsPanel_C_OnRequestChangeScrollState final
{
public:
	bool                                          NewState;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Settings_SettingsPanel_C_OnRequestChangeScrollState) == 0x000001, "Wrong alignment on WBP_Modern_Settings_SettingsPanel_C_OnRequestChangeScrollState");
static_assert(sizeof(WBP_Modern_Settings_SettingsPanel_C_OnRequestChangeScrollState) == 0x000001, "Wrong size on WBP_Modern_Settings_SettingsPanel_C_OnRequestChangeScrollState");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_OnRequestChangeScrollState, NewState) == 0x000000, "Member 'WBP_Modern_Settings_SettingsPanel_C_OnRequestChangeScrollState::NewState' has a wrong offset!");

// Function WBP_Modern_Settings_SettingsPanel.WBP_Modern_Settings_SettingsPanel_C.OnSettingFocussed
// 0x0008 (0x0008 - 0x0000)
struct WBP_Modern_Settings_SettingsPanel_C_OnSettingFocussed final
{
public:
	class UVModernSettingWidget*                  FocussedSettings;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Settings_SettingsPanel_C_OnSettingFocussed) == 0x000008, "Wrong alignment on WBP_Modern_Settings_SettingsPanel_C_OnSettingFocussed");
static_assert(sizeof(WBP_Modern_Settings_SettingsPanel_C_OnSettingFocussed) == 0x000008, "Wrong size on WBP_Modern_Settings_SettingsPanel_C_OnSettingFocussed");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_OnSettingFocussed, FocussedSettings) == 0x000000, "Member 'WBP_Modern_Settings_SettingsPanel_C_OnSettingFocussed::FocussedSettings' has a wrong offset!");

// Function WBP_Modern_Settings_SettingsPanel.WBP_Modern_Settings_SettingsPanel_C.Populate
// 0x01E8 (0x01E8 - 0x0000)
struct WBP_Modern_Settings_SettingsPanel_C_Populate final
{
public:
	TArray<struct FModernSettingCategoryTableRow> NewData;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FModernSettingCategoryTableRow         Local_CurrentData;                                 // 0x0010(0x0028)(Edit, BlueprintVisible)
	class UVModernSettingTable*                   Local_CurrentSettingDataTable;                     // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UScrollBox*                             CallFunc_GetScrollBox_ReturnValue;                 // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HaveAnySettingsForCurrentPlatform_Value;  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScrollBox*                             CallFunc_GetScrollBox_ReturnValue_1;               // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FModernSettingCategoryTableRow         CallFunc_Array_Get_Item;                           // 0x0070(0x0028)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9E[0x2];                                       // 0x009E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FModernSettingTableRow                 CallFunc_Array_Get_Item_1;                         // 0x00A0(0x0138)()
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E1[0x3];                                      // 0x01E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Settings_SettingsPanel_C_Populate) == 0x000008, "Wrong alignment on WBP_Modern_Settings_SettingsPanel_C_Populate");
static_assert(sizeof(WBP_Modern_Settings_SettingsPanel_C_Populate) == 0x0001E8, "Wrong size on WBP_Modern_Settings_SettingsPanel_C_Populate");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_Populate, NewData) == 0x000000, "Member 'WBP_Modern_Settings_SettingsPanel_C_Populate::NewData' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_Populate, Local_CurrentData) == 0x000010, "Member 'WBP_Modern_Settings_SettingsPanel_C_Populate::Local_CurrentData' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_Populate, Local_CurrentSettingDataTable) == 0x000038, "Member 'WBP_Modern_Settings_SettingsPanel_C_Populate::Local_CurrentSettingDataTable' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_Populate, Temp_int_Loop_Counter_Variable) == 0x000040, "Member 'WBP_Modern_Settings_SettingsPanel_C_Populate::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_Populate, CallFunc_Add_IntInt_ReturnValue) == 0x000044, "Member 'WBP_Modern_Settings_SettingsPanel_C_Populate::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_Populate, Temp_int_Array_Index_Variable) == 0x000048, "Member 'WBP_Modern_Settings_SettingsPanel_C_Populate::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_Populate, CallFunc_GetScrollBox_ReturnValue) == 0x000050, "Member 'WBP_Modern_Settings_SettingsPanel_C_Populate::CallFunc_GetScrollBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_Populate, CallFunc_HaveAnySettingsForCurrentPlatform_Value) == 0x000058, "Member 'WBP_Modern_Settings_SettingsPanel_C_Populate::CallFunc_HaveAnySettingsForCurrentPlatform_Value' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_Populate, Temp_int_Array_Index_Variable_1) == 0x00005C, "Member 'WBP_Modern_Settings_SettingsPanel_C_Populate::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_Populate, CallFunc_GetScrollBox_ReturnValue_1) == 0x000060, "Member 'WBP_Modern_Settings_SettingsPanel_C_Populate::CallFunc_GetScrollBox_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_Populate, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000068, "Member 'WBP_Modern_Settings_SettingsPanel_C_Populate::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_Populate, CallFunc_Array_Get_Item) == 0x000070, "Member 'WBP_Modern_Settings_SettingsPanel_C_Populate::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_Populate, CallFunc_Array_Length_ReturnValue) == 0x000098, "Member 'WBP_Modern_Settings_SettingsPanel_C_Populate::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_Populate, CallFunc_Less_IntInt_ReturnValue) == 0x00009C, "Member 'WBP_Modern_Settings_SettingsPanel_C_Populate::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_Populate, CallFunc_IsValid_ReturnValue) == 0x00009D, "Member 'WBP_Modern_Settings_SettingsPanel_C_Populate::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_Populate, CallFunc_Array_Get_Item_1) == 0x0000A0, "Member 'WBP_Modern_Settings_SettingsPanel_C_Populate::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_Populate, CallFunc_Array_Length_ReturnValue_1) == 0x0001D8, "Member 'WBP_Modern_Settings_SettingsPanel_C_Populate::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_Populate, Temp_int_Loop_Counter_Variable_1) == 0x0001DC, "Member 'WBP_Modern_Settings_SettingsPanel_C_Populate::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_Populate, CallFunc_Less_IntInt_ReturnValue_1) == 0x0001E0, "Member 'WBP_Modern_Settings_SettingsPanel_C_Populate::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_Populate, CallFunc_Add_IntInt_ReturnValue_1) == 0x0001E4, "Member 'WBP_Modern_Settings_SettingsPanel_C_Populate::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");

// Function WBP_Modern_Settings_SettingsPanel.WBP_Modern_Settings_SettingsPanel_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Modern_Settings_SettingsPanel_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Settings_SettingsPanel_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_Modern_Settings_SettingsPanel_C_PreConstruct");
static_assert(sizeof(WBP_Modern_Settings_SettingsPanel_C_PreConstruct) == 0x000001, "Wrong size on WBP_Modern_Settings_SettingsPanel_C_PreConstruct");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_Modern_Settings_SettingsPanel_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_Modern_Settings_SettingsPanel.WBP_Modern_Settings_SettingsPanel_C.ResetSettingsToDefault
// 0x0020 (0x0020 - 0x0000)
struct WBP_Modern_Settings_SettingsPanel_C_ResetSettingsToDefault final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVModernSettingWidget*                  CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Settings_SettingsPanel_C_ResetSettingsToDefault) == 0x000008, "Wrong alignment on WBP_Modern_Settings_SettingsPanel_C_ResetSettingsToDefault");
static_assert(sizeof(WBP_Modern_Settings_SettingsPanel_C_ResetSettingsToDefault) == 0x000020, "Wrong size on WBP_Modern_Settings_SettingsPanel_C_ResetSettingsToDefault");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_ResetSettingsToDefault, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_Modern_Settings_SettingsPanel_C_ResetSettingsToDefault::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_ResetSettingsToDefault, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_Modern_Settings_SettingsPanel_C_ResetSettingsToDefault::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_ResetSettingsToDefault, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_Modern_Settings_SettingsPanel_C_ResetSettingsToDefault::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_ResetSettingsToDefault, CallFunc_Array_Length_ReturnValue) == 0x00000C, "Member 'WBP_Modern_Settings_SettingsPanel_C_ResetSettingsToDefault::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_ResetSettingsToDefault, CallFunc_Array_Get_Item) == 0x000010, "Member 'WBP_Modern_Settings_SettingsPanel_C_ResetSettingsToDefault::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_ResetSettingsToDefault, CallFunc_Less_IntInt_ReturnValue) == 0x000018, "Member 'WBP_Modern_Settings_SettingsPanel_C_ResetSettingsToDefault::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_Modern_Settings_SettingsPanel.WBP_Modern_Settings_SettingsPanel_C.SetScrollbarInputHint
// 0x0100 (0x0100 - 0x0000)
struct WBP_Modern_Settings_SettingsPanel_C_SetScrollbarInputHint final
{
public:
	class UScrollBox*                             CallFunc_GetScrollBox_ReturnValue;                 // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVAltarUISubsystem*                     CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            CallFunc_TryGetBrushFromKey_OutBrush;              // 0x0010(0x00D0)()
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               K2Node_DynamicCast_AsTexture;                      // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Settings_SettingsPanel_C_SetScrollbarInputHint) == 0x000010, "Wrong alignment on WBP_Modern_Settings_SettingsPanel_C_SetScrollbarInputHint");
static_assert(sizeof(WBP_Modern_Settings_SettingsPanel_C_SetScrollbarInputHint) == 0x000100, "Wrong size on WBP_Modern_Settings_SettingsPanel_C_SetScrollbarInputHint");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_SetScrollbarInputHint, CallFunc_GetScrollBox_ReturnValue) == 0x000000, "Member 'WBP_Modern_Settings_SettingsPanel_C_SetScrollbarInputHint::CallFunc_GetScrollBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_SetScrollbarInputHint, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'WBP_Modern_Settings_SettingsPanel_C_SetScrollbarInputHint::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_SetScrollbarInputHint, CallFunc_TryGetBrushFromKey_OutBrush) == 0x000010, "Member 'WBP_Modern_Settings_SettingsPanel_C_SetScrollbarInputHint::CallFunc_TryGetBrushFromKey_OutBrush' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_SetScrollbarInputHint, CallFunc_GetDynamicMaterial_ReturnValue) == 0x0000E0, "Member 'WBP_Modern_Settings_SettingsPanel_C_SetScrollbarInputHint::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_SettingsPanel_C_SetScrollbarInputHint, K2Node_DynamicCast_AsTexture) == 0x0000E8, "Member 'WBP_Modern_Settings_SettingsPanel_C_SetScrollbarInputHint::K2Node_DynamicCast_AsTexture' has a wrong offset!");
