#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PrimitiveComponentEntry

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_PrimitiveComponentEntry.WBP_PrimitiveComponentEntry_C.DisplayBoolValue
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_PrimitiveComponentEntry_C_DisplayBoolValue final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextBlock*                             Text;                                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             LinkedText;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x001C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x002C(0x0014)()
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue_1;                // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0050(0x0014)()
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0068(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0080(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x0098(0x0018)()
};
static_assert(alignof(WBP_PrimitiveComponentEntry_C_DisplayBoolValue) == 0x000008, "Wrong alignment on WBP_PrimitiveComponentEntry_C_DisplayBoolValue");
static_assert(sizeof(WBP_PrimitiveComponentEntry_C_DisplayBoolValue) == 0x0000B0, "Wrong size on WBP_PrimitiveComponentEntry_C_DisplayBoolValue");
static_assert(offsetof(WBP_PrimitiveComponentEntry_C_DisplayBoolValue, Value) == 0x000000, "Member 'WBP_PrimitiveComponentEntry_C_DisplayBoolValue::Value' has a wrong offset!");
static_assert(offsetof(WBP_PrimitiveComponentEntry_C_DisplayBoolValue, Text) == 0x000008, "Member 'WBP_PrimitiveComponentEntry_C_DisplayBoolValue::Text' has a wrong offset!");
static_assert(offsetof(WBP_PrimitiveComponentEntry_C_DisplayBoolValue, LinkedText) == 0x000010, "Member 'WBP_PrimitiveComponentEntry_C_DisplayBoolValue::LinkedText' has a wrong offset!");
static_assert(offsetof(WBP_PrimitiveComponentEntry_C_DisplayBoolValue, Temp_bool_Variable) == 0x000018, "Member 'WBP_PrimitiveComponentEntry_C_DisplayBoolValue::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PrimitiveComponentEntry_C_DisplayBoolValue, CallFunc_SelectColor_ReturnValue) == 0x00001C, "Member 'WBP_PrimitiveComponentEntry_C_DisplayBoolValue::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PrimitiveComponentEntry_C_DisplayBoolValue, K2Node_MakeStruct_SlateColor) == 0x00002C, "Member 'WBP_PrimitiveComponentEntry_C_DisplayBoolValue::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_PrimitiveComponentEntry_C_DisplayBoolValue, CallFunc_SelectColor_ReturnValue_1) == 0x000040, "Member 'WBP_PrimitiveComponentEntry_C_DisplayBoolValue::CallFunc_SelectColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PrimitiveComponentEntry_C_DisplayBoolValue, K2Node_MakeStruct_SlateColor_1) == 0x000050, "Member 'WBP_PrimitiveComponentEntry_C_DisplayBoolValue::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(WBP_PrimitiveComponentEntry_C_DisplayBoolValue, Temp_text_Variable) == 0x000068, "Member 'WBP_PrimitiveComponentEntry_C_DisplayBoolValue::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PrimitiveComponentEntry_C_DisplayBoolValue, Temp_text_Variable_1) == 0x000080, "Member 'WBP_PrimitiveComponentEntry_C_DisplayBoolValue::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PrimitiveComponentEntry_C_DisplayBoolValue, K2Node_Select_Default) == 0x000098, "Member 'WBP_PrimitiveComponentEntry_C_DisplayBoolValue::K2Node_Select_Default' has a wrong offset!");

// Function WBP_PrimitiveComponentEntry.WBP_PrimitiveComponentEntry_C.ExecuteUbergraph_WBP_PrimitiveComponentEntry
// 0x0098 (0x0098 - 0x0000)
struct WBP_PrimitiveComponentEntry_C_ExecuteUbergraph_WBP_PrimitiveComponentEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVPrimitiveComponentDebugData*          K2Node_DynamicCast_AsVPrimitive_Component_Debug_Data; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0020(0x0018)()
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_RightChop_ReturnValue;                    // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0058(0x0018)()
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_NameToText_ReturnValue_1;            // 0x0080(0x0018)()
};
static_assert(alignof(WBP_PrimitiveComponentEntry_C_ExecuteUbergraph_WBP_PrimitiveComponentEntry) == 0x000008, "Wrong alignment on WBP_PrimitiveComponentEntry_C_ExecuteUbergraph_WBP_PrimitiveComponentEntry");
static_assert(sizeof(WBP_PrimitiveComponentEntry_C_ExecuteUbergraph_WBP_PrimitiveComponentEntry) == 0x000098, "Wrong size on WBP_PrimitiveComponentEntry_C_ExecuteUbergraph_WBP_PrimitiveComponentEntry");
static_assert(offsetof(WBP_PrimitiveComponentEntry_C_ExecuteUbergraph_WBP_PrimitiveComponentEntry, EntryPoint) == 0x000000, "Member 'WBP_PrimitiveComponentEntry_C_ExecuteUbergraph_WBP_PrimitiveComponentEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_PrimitiveComponentEntry_C_ExecuteUbergraph_WBP_PrimitiveComponentEntry, K2Node_Event_ListItemObject) == 0x000008, "Member 'WBP_PrimitiveComponentEntry_C_ExecuteUbergraph_WBP_PrimitiveComponentEntry::K2Node_Event_ListItemObject' has a wrong offset!");
static_assert(offsetof(WBP_PrimitiveComponentEntry_C_ExecuteUbergraph_WBP_PrimitiveComponentEntry, K2Node_DynamicCast_AsVPrimitive_Component_Debug_Data) == 0x000010, "Member 'WBP_PrimitiveComponentEntry_C_ExecuteUbergraph_WBP_PrimitiveComponentEntry::K2Node_DynamicCast_AsVPrimitive_Component_Debug_Data' has a wrong offset!");
static_assert(offsetof(WBP_PrimitiveComponentEntry_C_ExecuteUbergraph_WBP_PrimitiveComponentEntry, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_PrimitiveComponentEntry_C_ExecuteUbergraph_WBP_PrimitiveComponentEntry::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_PrimitiveComponentEntry_C_ExecuteUbergraph_WBP_PrimitiveComponentEntry, CallFunc_Conv_NameToText_ReturnValue) == 0x000020, "Member 'WBP_PrimitiveComponentEntry_C_ExecuteUbergraph_WBP_PrimitiveComponentEntry::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PrimitiveComponentEntry_C_ExecuteUbergraph_WBP_PrimitiveComponentEntry, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000038, "Member 'WBP_PrimitiveComponentEntry_C_ExecuteUbergraph_WBP_PrimitiveComponentEntry::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PrimitiveComponentEntry_C_ExecuteUbergraph_WBP_PrimitiveComponentEntry, CallFunc_RightChop_ReturnValue) == 0x000048, "Member 'WBP_PrimitiveComponentEntry_C_ExecuteUbergraph_WBP_PrimitiveComponentEntry::CallFunc_RightChop_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PrimitiveComponentEntry_C_ExecuteUbergraph_WBP_PrimitiveComponentEntry, CallFunc_Conv_StringToText_ReturnValue) == 0x000058, "Member 'WBP_PrimitiveComponentEntry_C_ExecuteUbergraph_WBP_PrimitiveComponentEntry::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PrimitiveComponentEntry_C_ExecuteUbergraph_WBP_PrimitiveComponentEntry, CallFunc_SelectColor_ReturnValue) == 0x000070, "Member 'WBP_PrimitiveComponentEntry_C_ExecuteUbergraph_WBP_PrimitiveComponentEntry::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PrimitiveComponentEntry_C_ExecuteUbergraph_WBP_PrimitiveComponentEntry, CallFunc_Conv_NameToText_ReturnValue_1) == 0x000080, "Member 'WBP_PrimitiveComponentEntry_C_ExecuteUbergraph_WBP_PrimitiveComponentEntry::CallFunc_Conv_NameToText_ReturnValue_1' has a wrong offset!");

// Function WBP_PrimitiveComponentEntry.WBP_PrimitiveComponentEntry_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct WBP_PrimitiveComponentEntry_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PrimitiveComponentEntry_C_OnListItemObjectSet) == 0x000008, "Wrong alignment on WBP_PrimitiveComponentEntry_C_OnListItemObjectSet");
static_assert(sizeof(WBP_PrimitiveComponentEntry_C_OnListItemObjectSet) == 0x000008, "Wrong size on WBP_PrimitiveComponentEntry_C_OnListItemObjectSet");
static_assert(offsetof(WBP_PrimitiveComponentEntry_C_OnListItemObjectSet, ListItemObject) == 0x000000, "Member 'WBP_PrimitiveComponentEntry_C_OnListItemObjectSet::ListItemObject' has a wrong offset!");

}

