#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_VideoMenu_ValueSwitcher

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Altar_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_VideoMenu_ValueSwitcher.WBP_VideoMenu_ValueSwitcher_C
// 0x0018 (0x0510 - 0x04F8)
class UWBP_VideoMenu_ValueSwitcher_C final : public UVOriginalVideoSettingWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             RowLabel_Text;                                     // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_LegacyPrefab_ValueSwitcher_C*      RowOption_ValueSwitcher;                           // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__WBP_VideoMenu_ValueSwitcher_RowOption_K2Node_ComponentBoundEvent_0_OnValueUpdated__DelegateSignature(const class FText& Value, int32 Index_0);
	void ExecuteUbergraph_WBP_VideoMenu_ValueSwitcher(int32 EntryPoint);
	void OnFocus();
	void OnRefresh();
	void Prepare_Screen_Mode_CMD(const class FString& OptionLabel, class FString* NewCMD);
	void Prepare_Supported_Resolution_Options();
	void Refresh();
	void Update_Resolution_in_Game_User_Settings(const class FString& Option_Label);
	void Update_Selected_Resolution(TArray<class FText>& OptionsText);
	void UpdateValue(const class FText& Value);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_VideoMenu_ValueSwitcher_C">();
	}
	static class UWBP_VideoMenu_ValueSwitcher_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_VideoMenu_ValueSwitcher_C>();
	}
};
static_assert(alignof(UWBP_VideoMenu_ValueSwitcher_C) == 0x000008, "Wrong alignment on UWBP_VideoMenu_ValueSwitcher_C");
static_assert(sizeof(UWBP_VideoMenu_ValueSwitcher_C) == 0x000510, "Wrong size on UWBP_VideoMenu_ValueSwitcher_C");
static_assert(offsetof(UWBP_VideoMenu_ValueSwitcher_C, UberGraphFrame) == 0x0004F8, "Member 'UWBP_VideoMenu_ValueSwitcher_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_VideoMenu_ValueSwitcher_C, RowLabel_Text) == 0x000500, "Member 'UWBP_VideoMenu_ValueSwitcher_C::RowLabel_Text' has a wrong offset!");
static_assert(offsetof(UWBP_VideoMenu_ValueSwitcher_C, RowOption_ValueSwitcher) == 0x000508, "Member 'UWBP_VideoMenu_ValueSwitcher_C::RowOption_ValueSwitcher' has a wrong offset!");

}

