#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Modern_LoadingImage

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Altar_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Modern_LoadingImage.WBP_Modern_LoadingImage_C
// 0x0028 (0x04F0 - 0x04C8)
class UWBP_Modern_LoadingImage_C final : public UVAltarWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       LoadingIconAnimation;                              // 0x04D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 LoadingScreenIcon;                                 // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               LoadingMaterialInstance;                           // 0x04E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Interp, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	class UMaterialInterface*                     Material;                                          // 0x04E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_Modern_LoadingImage(int32 EntryPoint);
	void PlayLoadingAnimation();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Modern_LoadingImage_C">();
	}
	static class UWBP_Modern_LoadingImage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Modern_LoadingImage_C>();
	}
};
static_assert(alignof(UWBP_Modern_LoadingImage_C) == 0x000008, "Wrong alignment on UWBP_Modern_LoadingImage_C");
static_assert(sizeof(UWBP_Modern_LoadingImage_C) == 0x0004F0, "Wrong size on UWBP_Modern_LoadingImage_C");
static_assert(offsetof(UWBP_Modern_LoadingImage_C, UberGraphFrame) == 0x0004C8, "Member 'UWBP_Modern_LoadingImage_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_LoadingImage_C, LoadingIconAnimation) == 0x0004D0, "Member 'UWBP_Modern_LoadingImage_C::LoadingIconAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_LoadingImage_C, LoadingScreenIcon) == 0x0004D8, "Member 'UWBP_Modern_LoadingImage_C::LoadingScreenIcon' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_LoadingImage_C, LoadingMaterialInstance) == 0x0004E0, "Member 'UWBP_Modern_LoadingImage_C::LoadingMaterialInstance' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_LoadingImage_C, Material) == 0x0004E8, "Member 'UWBP_Modern_LoadingImage_C::Material' has a wrong offset!");

}

