#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModernHud_StatusBarEnemy

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "Altar_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ModernHud_StatusBarEnemy.WBP_ModernHud_StatusBarEnemy_C
// 0x0080 (0x0368 - 0x02E8)
class UWBP_ModernHud_StatusBarEnemy_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       LeaveFatigue;                                      // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Fatigued;                                          // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       TriggerHighlighAnimation;                          // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ToggleHighlightAnimation;                          // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       DelayedProgressAnimation;                          // 0x0310(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ProgressAnimation;                                 // 0x0318(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 ChevronLeft;                                       // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ChevronRight;                                      // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ProgressBar;                                       // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Shine;                                             // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInterface*                     ProgressMaterial;                                  // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        Progress;                                          // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        OldProgress;                                       // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsFatigued;                                       // 0x0358(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_359[0x7];                                      // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        FatigueThreshold;                                  // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void EnterFatigue();
	void ExecuteUbergraph_WBP_ModernHud_StatusBarEnemy(int32 EntryPoint);
	void ExitFatigue();
	void OnFatigueChange(EVActorValues ActorValue, float PreviousBaseValue, float PreviousModifiedValue, float NewBaseValue, float NewModifiedValue);
	void PreConstruct(bool IsDesignTime);
	void RefComponentChanged(class UVTESObjectRefComponent* OldRef, class UVTESObjectRefComponent* NewRef);
	void SetImmediateProgress(double In_Progress);
	void SetProgress(double InProgress, bool IsPreview);
	void ToggleBlinking(bool bOn);
	void TriggerBlinking();
	void TriggerFatigue(double NewFatigue, double MaxFatigue);
	void UpdateActorValueTarget(class UVTESObjectRefComponent* OldRef, class UVTESObjectRefComponent* NewRef, const TDelegate<void(EVActorValues ActorValue, float PreviousBaseValue, float PreviousModifiedValue, float NewBaseValue, float NewModifiedValue)>& EventCallback);

	void GetProgress(double* Progress_0) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ModernHud_StatusBarEnemy_C">();
	}
	static class UWBP_ModernHud_StatusBarEnemy_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ModernHud_StatusBarEnemy_C>();
	}
};
static_assert(alignof(UWBP_ModernHud_StatusBarEnemy_C) == 0x000008, "Wrong alignment on UWBP_ModernHud_StatusBarEnemy_C");
static_assert(sizeof(UWBP_ModernHud_StatusBarEnemy_C) == 0x000368, "Wrong size on UWBP_ModernHud_StatusBarEnemy_C");
static_assert(offsetof(UWBP_ModernHud_StatusBarEnemy_C, UberGraphFrame) == 0x0002E8, "Member 'UWBP_ModernHud_StatusBarEnemy_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_StatusBarEnemy_C, LeaveFatigue) == 0x0002F0, "Member 'UWBP_ModernHud_StatusBarEnemy_C::LeaveFatigue' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_StatusBarEnemy_C, Fatigued) == 0x0002F8, "Member 'UWBP_ModernHud_StatusBarEnemy_C::Fatigued' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_StatusBarEnemy_C, TriggerHighlighAnimation) == 0x000300, "Member 'UWBP_ModernHud_StatusBarEnemy_C::TriggerHighlighAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_StatusBarEnemy_C, ToggleHighlightAnimation) == 0x000308, "Member 'UWBP_ModernHud_StatusBarEnemy_C::ToggleHighlightAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_StatusBarEnemy_C, DelayedProgressAnimation) == 0x000310, "Member 'UWBP_ModernHud_StatusBarEnemy_C::DelayedProgressAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_StatusBarEnemy_C, ProgressAnimation) == 0x000318, "Member 'UWBP_ModernHud_StatusBarEnemy_C::ProgressAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_StatusBarEnemy_C, ChevronLeft) == 0x000320, "Member 'UWBP_ModernHud_StatusBarEnemy_C::ChevronLeft' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_StatusBarEnemy_C, ChevronRight) == 0x000328, "Member 'UWBP_ModernHud_StatusBarEnemy_C::ChevronRight' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_StatusBarEnemy_C, ProgressBar) == 0x000330, "Member 'UWBP_ModernHud_StatusBarEnemy_C::ProgressBar' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_StatusBarEnemy_C, Shine) == 0x000338, "Member 'UWBP_ModernHud_StatusBarEnemy_C::Shine' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_StatusBarEnemy_C, ProgressMaterial) == 0x000340, "Member 'UWBP_ModernHud_StatusBarEnemy_C::ProgressMaterial' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_StatusBarEnemy_C, Progress) == 0x000348, "Member 'UWBP_ModernHud_StatusBarEnemy_C::Progress' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_StatusBarEnemy_C, OldProgress) == 0x000350, "Member 'UWBP_ModernHud_StatusBarEnemy_C::OldProgress' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_StatusBarEnemy_C, bIsFatigued) == 0x000358, "Member 'UWBP_ModernHud_StatusBarEnemy_C::bIsFatigued' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_StatusBarEnemy_C, FatigueThreshold) == 0x000360, "Member 'UWBP_ModernHud_StatusBarEnemy_C::FatigueThreshold' has a wrong offset!");

}

