#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModernMenu_HelpEntry

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Altar_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ModernMenu_HelpEntry.WBP_ModernMenu_HelpEntry_C
// 0x0138 (0x0418 - 0x02E0)
class UWBP_ModernMenu_HelpEntry_C final : public UVModernHelpMenuListEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ExpandCategoryAnim;                                // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       NewItemAnim;                                       // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               Arrow;                                             // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               EntryFocusBackground;                              // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         EntryTextContainer;                                // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               HeaderBackground;                                  // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               HeaderFocusBackground;                             // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HeaderTextContainer;                               // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AltarTextBlock_C*                  TextBlock;                                         // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AltarTextBlock_C*                  TextBlock_1;                                       // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher;                                    // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTexture2D*                             ArrowIcon;                                         // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             EmptyIcon;                                         // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FSlateFontInfo                         EntryFont;                                         // 0x0350(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSlateFontInfo                         HeaderFont;                                        // 0x03A8(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSlateColor                            HeaderFocusBrush;                                  // 0x0400(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void AnimateToView();
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void ExecuteUbergraph_WBP_ModernMenu_HelpEntry(int32 EntryPoint);
	void ForceUpdateAnimationCurrentTime();
	void OnListItemObjectSet(class UObject* ListItemObject);
	void PlayArrowToggleAnimation();
	void SetData(class UObject* InData);
	void UpdateSelection(bool bNewSelected);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ModernMenu_HelpEntry_C">();
	}
	static class UWBP_ModernMenu_HelpEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ModernMenu_HelpEntry_C>();
	}
};
static_assert(alignof(UWBP_ModernMenu_HelpEntry_C) == 0x000008, "Wrong alignment on UWBP_ModernMenu_HelpEntry_C");
static_assert(sizeof(UWBP_ModernMenu_HelpEntry_C) == 0x000418, "Wrong size on UWBP_ModernMenu_HelpEntry_C");
static_assert(offsetof(UWBP_ModernMenu_HelpEntry_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_ModernMenu_HelpEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_HelpEntry_C, ExpandCategoryAnim) == 0x0002E8, "Member 'UWBP_ModernMenu_HelpEntry_C::ExpandCategoryAnim' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_HelpEntry_C, NewItemAnim) == 0x0002F0, "Member 'UWBP_ModernMenu_HelpEntry_C::NewItemAnim' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_HelpEntry_C, Arrow) == 0x0002F8, "Member 'UWBP_ModernMenu_HelpEntry_C::Arrow' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_HelpEntry_C, EntryFocusBackground) == 0x000300, "Member 'UWBP_ModernMenu_HelpEntry_C::EntryFocusBackground' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_HelpEntry_C, EntryTextContainer) == 0x000308, "Member 'UWBP_ModernMenu_HelpEntry_C::EntryTextContainer' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_HelpEntry_C, HeaderBackground) == 0x000310, "Member 'UWBP_ModernMenu_HelpEntry_C::HeaderBackground' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_HelpEntry_C, HeaderFocusBackground) == 0x000318, "Member 'UWBP_ModernMenu_HelpEntry_C::HeaderFocusBackground' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_HelpEntry_C, HeaderTextContainer) == 0x000320, "Member 'UWBP_ModernMenu_HelpEntry_C::HeaderTextContainer' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_HelpEntry_C, TextBlock) == 0x000328, "Member 'UWBP_ModernMenu_HelpEntry_C::TextBlock' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_HelpEntry_C, TextBlock_1) == 0x000330, "Member 'UWBP_ModernMenu_HelpEntry_C::TextBlock_1' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_HelpEntry_C, WidgetSwitcher) == 0x000338, "Member 'UWBP_ModernMenu_HelpEntry_C::WidgetSwitcher' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_HelpEntry_C, ArrowIcon) == 0x000340, "Member 'UWBP_ModernMenu_HelpEntry_C::ArrowIcon' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_HelpEntry_C, EmptyIcon) == 0x000348, "Member 'UWBP_ModernMenu_HelpEntry_C::EmptyIcon' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_HelpEntry_C, EntryFont) == 0x000350, "Member 'UWBP_ModernMenu_HelpEntry_C::EntryFont' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_HelpEntry_C, HeaderFont) == 0x0003A8, "Member 'UWBP_ModernMenu_HelpEntry_C::HeaderFont' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_HelpEntry_C, HeaderFocusBrush) == 0x000400, "Member 'UWBP_ModernMenu_HelpEntry_C::HeaderFocusBrush' has a wrong offset!");

}

