#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Modern_QuestHistoryPanel

#include "Basic.hpp"

#include "Altar_structs.hpp"
#include "EnhancedInput_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Modern_QuestHistoryPanel.WBP_Modern_QuestHistoryPanel_C.BndEvt__WBP_Modern_QuestHistoryPanel_WBP_ModernMenu_Button_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Modern_QuestHistoryPanel_C_BndEvt__WBP_Modern_QuestHistoryPanel_WBP_ModernMenu_Button_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_QuestHistoryPanel_C_BndEvt__WBP_Modern_QuestHistoryPanel_WBP_ModernMenu_Button_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Modern_QuestHistoryPanel_C_BndEvt__WBP_Modern_QuestHistoryPanel_WBP_ModernMenu_Button_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_Modern_QuestHistoryPanel_C_BndEvt__WBP_Modern_QuestHistoryPanel_WBP_ModernMenu_Button_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Modern_QuestHistoryPanel_C_BndEvt__WBP_Modern_QuestHistoryPanel_WBP_ModernMenu_Button_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_BndEvt__WBP_Modern_QuestHistoryPanel_WBP_ModernMenu_Button_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_Modern_QuestHistoryPanel_C_BndEvt__WBP_Modern_QuestHistoryPanel_WBP_ModernMenu_Button_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_Modern_QuestHistoryPanel.WBP_Modern_QuestHistoryPanel_C.BndEvt__WBP_Modern_QuestHistoryPanel_WBP_ModernMenu_Button_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Modern_QuestHistoryPanel_C_BndEvt__WBP_Modern_QuestHistoryPanel_WBP_ModernMenu_Button_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_QuestHistoryPanel_C_BndEvt__WBP_Modern_QuestHistoryPanel_WBP_ModernMenu_Button_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Modern_QuestHistoryPanel_C_BndEvt__WBP_Modern_QuestHistoryPanel_WBP_ModernMenu_Button_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_Modern_QuestHistoryPanel_C_BndEvt__WBP_Modern_QuestHistoryPanel_WBP_ModernMenu_Button_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Modern_QuestHistoryPanel_C_BndEvt__WBP_Modern_QuestHistoryPanel_WBP_ModernMenu_Button_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_BndEvt__WBP_Modern_QuestHistoryPanel_WBP_ModernMenu_Button_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_Modern_QuestHistoryPanel_C_BndEvt__WBP_Modern_QuestHistoryPanel_WBP_ModernMenu_Button_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_Modern_QuestHistoryPanel.WBP_Modern_QuestHistoryPanel_C.BndEvt__WBP_Modern_QuestHistoryPanel_WBP_ModernMenu_Button_SetActive_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Modern_QuestHistoryPanel_C_BndEvt__WBP_Modern_QuestHistoryPanel_WBP_ModernMenu_Button_SetActive_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_QuestHistoryPanel_C_BndEvt__WBP_Modern_QuestHistoryPanel_WBP_ModernMenu_Button_SetActive_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Modern_QuestHistoryPanel_C_BndEvt__WBP_Modern_QuestHistoryPanel_WBP_ModernMenu_Button_SetActive_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_Modern_QuestHistoryPanel_C_BndEvt__WBP_Modern_QuestHistoryPanel_WBP_ModernMenu_Button_SetActive_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Modern_QuestHistoryPanel_C_BndEvt__WBP_Modern_QuestHistoryPanel_WBP_ModernMenu_Button_SetActive_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_BndEvt__WBP_Modern_QuestHistoryPanel_WBP_ModernMenu_Button_SetActive_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_Modern_QuestHistoryPanel_C_BndEvt__WBP_Modern_QuestHistoryPanel_WBP_ModernMenu_Button_SetActive_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_Modern_QuestHistoryPanel.WBP_Modern_QuestHistoryPanel_C.BP_OnHandleBackAction
// 0x0001 (0x0001 - 0x0000)
struct WBP_Modern_QuestHistoryPanel_C_BP_OnHandleBackAction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_QuestHistoryPanel_C_BP_OnHandleBackAction) == 0x000001, "Wrong alignment on WBP_Modern_QuestHistoryPanel_C_BP_OnHandleBackAction");
static_assert(sizeof(WBP_Modern_QuestHistoryPanel_C_BP_OnHandleBackAction) == 0x000001, "Wrong size on WBP_Modern_QuestHistoryPanel_C_BP_OnHandleBackAction");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_BP_OnHandleBackAction, ReturnValue) == 0x000000, "Member 'WBP_Modern_QuestHistoryPanel_C_BP_OnHandleBackAction::ReturnValue' has a wrong offset!");

// Function WBP_Modern_QuestHistoryPanel.WBP_Modern_QuestHistoryPanel_C.ExecuteUbergraph_WBP_Modern_QuestHistoryPanel
// 0x0138 (0x0138 - 0x0000)
struct WBP_Modern_QuestHistoryPanel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryPanel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_1;     // 0x0008(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_1;     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_1;   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_1;    // 0x0030(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable;                              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue;  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_0;                              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1_0;                            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue;       // 0x0070(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime;       // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime;     // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction;      // 0x0098(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_1; // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           Temp_object_Variable_1;                            // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2;                              // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2_0;                            // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3;                              // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_3_0;                            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FLegacyMapMenuQuestProperties>  K2Node_CustomEvent_NewQuestsHistoric;              // 0x00D8(0x0010)(ConstParm, ReferenceParm)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_2;               // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Current_Page_Index;             // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 EntryIndex)>             K2Node_CreateDelegate_OutputDelegate;              // 0x0104(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldDisplayLastStep_ShouldDisplayLastStep; // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_115[0x3];                                      // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFooterInputActionVisibility           K2Node_MakeStruct_FooterInputActionVisibility;     // 0x0118(0x0010)(NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0128(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_QuestHistoryPanel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryPanel) == 0x000008, "Wrong alignment on WBP_Modern_QuestHistoryPanel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryPanel");
static_assert(sizeof(WBP_Modern_QuestHistoryPanel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryPanel) == 0x000138, "Wrong size on WBP_Modern_QuestHistoryPanel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryPanel");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryPanel, EntryPoint) == 0x000000, "Member 'WBP_Modern_QuestHistoryPanel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryPanel::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryPanel, K2Node_EnhancedInputActionEvent_ActionValue_1) == 0x000008, "Member 'WBP_Modern_QuestHistoryPanel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryPanel::K2Node_EnhancedInputActionEvent_ActionValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryPanel, K2Node_EnhancedInputActionEvent_ElapsedTime_1) == 0x000028, "Member 'WBP_Modern_QuestHistoryPanel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryPanel::K2Node_EnhancedInputActionEvent_ElapsedTime_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryPanel, K2Node_EnhancedInputActionEvent_TriggeredTime_1) == 0x00002C, "Member 'WBP_Modern_QuestHistoryPanel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryPanel::K2Node_EnhancedInputActionEvent_TriggeredTime_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryPanel, K2Node_EnhancedInputActionEvent_SourceAction_1) == 0x000030, "Member 'WBP_Modern_QuestHistoryPanel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryPanel::K2Node_EnhancedInputActionEvent_SourceAction_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryPanel, Temp_object_Variable) == 0x000038, "Member 'WBP_Modern_QuestHistoryPanel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryPanel::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryPanel, CallFunc_Conv_InputActionValueToBool_ReturnValue) == 0x000040, "Member 'WBP_Modern_QuestHistoryPanel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryPanel::CallFunc_Conv_InputActionValueToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryPanel, Temp_real_Variable) == 0x000048, "Member 'WBP_Modern_QuestHistoryPanel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryPanel::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryPanel, Temp_real_Variable_1) == 0x000050, "Member 'WBP_Modern_QuestHistoryPanel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryPanel::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryPanel, Temp_real_Variable_0) == 0x000058, "Member 'WBP_Modern_QuestHistoryPanel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryPanel::Temp_real_Variable_0' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryPanel, Temp_real_Variable_1_0) == 0x000060, "Member 'WBP_Modern_QuestHistoryPanel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryPanel::Temp_real_Variable_1_0' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryPanel, Temp_bool_Variable) == 0x000068, "Member 'WBP_Modern_QuestHistoryPanel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryPanel::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryPanel, K2Node_EnhancedInputActionEvent_ActionValue) == 0x000070, "Member 'WBP_Modern_QuestHistoryPanel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryPanel::K2Node_EnhancedInputActionEvent_ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryPanel, K2Node_EnhancedInputActionEvent_ElapsedTime) == 0x000090, "Member 'WBP_Modern_QuestHistoryPanel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryPanel::K2Node_EnhancedInputActionEvent_ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryPanel, K2Node_EnhancedInputActionEvent_TriggeredTime) == 0x000094, "Member 'WBP_Modern_QuestHistoryPanel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryPanel::K2Node_EnhancedInputActionEvent_TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryPanel, K2Node_EnhancedInputActionEvent_SourceAction) == 0x000098, "Member 'WBP_Modern_QuestHistoryPanel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryPanel::K2Node_EnhancedInputActionEvent_SourceAction' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryPanel, CallFunc_Conv_InputActionValueToBool_ReturnValue_1) == 0x0000A0, "Member 'WBP_Modern_QuestHistoryPanel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryPanel::CallFunc_Conv_InputActionValueToBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryPanel, Temp_object_Variable_1) == 0x0000A8, "Member 'WBP_Modern_QuestHistoryPanel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryPanel::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryPanel, Temp_real_Variable_2) == 0x0000B0, "Member 'WBP_Modern_QuestHistoryPanel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryPanel::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryPanel, Temp_real_Variable_2_0) == 0x0000B8, "Member 'WBP_Modern_QuestHistoryPanel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryPanel::Temp_real_Variable_2_0' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryPanel, Temp_real_Variable_3) == 0x0000C0, "Member 'WBP_Modern_QuestHistoryPanel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryPanel::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryPanel, Temp_bool_Variable_1) == 0x0000C8, "Member 'WBP_Modern_QuestHistoryPanel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryPanel::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryPanel, Temp_real_Variable_3_0) == 0x0000D0, "Member 'WBP_Modern_QuestHistoryPanel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryPanel::Temp_real_Variable_3_0' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryPanel, K2Node_CustomEvent_NewQuestsHistoric) == 0x0000D8, "Member 'WBP_Modern_QuestHistoryPanel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryPanel::K2Node_CustomEvent_NewQuestsHistoric' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryPanel, K2Node_ComponentBoundEvent_Button_2) == 0x0000E8, "Member 'WBP_Modern_QuestHistoryPanel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryPanel::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryPanel, K2Node_ComponentBoundEvent_Button_1) == 0x0000F0, "Member 'WBP_Modern_QuestHistoryPanel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryPanel::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryPanel, K2Node_ComponentBoundEvent_Button) == 0x0000F8, "Member 'WBP_Modern_QuestHistoryPanel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryPanel::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryPanel, K2Node_CustomEvent_Current_Page_Index) == 0x000100, "Member 'WBP_Modern_QuestHistoryPanel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryPanel::K2Node_CustomEvent_Current_Page_Index' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryPanel, K2Node_CreateDelegate_OutputDelegate) == 0x000104, "Member 'WBP_Modern_QuestHistoryPanel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryPanel::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryPanel, CallFunc_ShouldDisplayLastStep_ShouldDisplayLastStep) == 0x000114, "Member 'WBP_Modern_QuestHistoryPanel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryPanel::CallFunc_ShouldDisplayLastStep_ShouldDisplayLastStep' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryPanel, K2Node_MakeStruct_FooterInputActionVisibility) == 0x000118, "Member 'WBP_Modern_QuestHistoryPanel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryPanel::K2Node_MakeStruct_FooterInputActionVisibility' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryPanel, K2Node_CreateDelegate_OutputDelegate_1) == 0x000128, "Member 'WBP_Modern_QuestHistoryPanel_C_ExecuteUbergraph_WBP_Modern_QuestHistoryPanel::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

// Function WBP_Modern_QuestHistoryPanel.WBP_Modern_QuestHistoryPanel_C.InitializeFocus
// 0x0028 (0x0028 - 0x0000)
struct WBP_Modern_QuestHistoryPanel_C_InitializeFocus final
{
public:
	class UVUINavigationGlobalSubsystem*          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetItemAt_ReturnValue;                    // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IVEnhancedInputNavigable> CallFunc_NavigateToWidget_Widget_CastInput;     // 0x0018(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_QuestHistoryPanel_C_InitializeFocus) == 0x000008, "Wrong alignment on WBP_Modern_QuestHistoryPanel_C_InitializeFocus");
static_assert(sizeof(WBP_Modern_QuestHistoryPanel_C_InitializeFocus) == 0x000028, "Wrong size on WBP_Modern_QuestHistoryPanel_C_InitializeFocus");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_InitializeFocus, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000000, "Member 'WBP_Modern_QuestHistoryPanel_C_InitializeFocus::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_InitializeFocus, CallFunc_GetItemAt_ReturnValue) == 0x000008, "Member 'WBP_Modern_QuestHistoryPanel_C_InitializeFocus::CallFunc_GetItemAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_InitializeFocus, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_Modern_QuestHistoryPanel_C_InitializeFocus::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_InitializeFocus, CallFunc_NavigateToWidget_Widget_CastInput) == 0x000018, "Member 'WBP_Modern_QuestHistoryPanel_C_InitializeFocus::CallFunc_NavigateToWidget_Widget_CastInput' has a wrong offset!");

// Function WBP_Modern_QuestHistoryPanel.WBP_Modern_QuestHistoryPanel_C.InpActEvt_IA_UI_Specific_QuestMenu_DetailSpecial_K2Node_EnhancedInputActionEvent_1
// 0x0030 (0x0030 - 0x0000)
struct WBP_Modern_QuestHistoryPanel_C_InpActEvt_IA_UI_Specific_QuestMenu_DetailSpecial_K2Node_EnhancedInputActionEvent_1 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_QuestHistoryPanel_C_InpActEvt_IA_UI_Specific_QuestMenu_DetailSpecial_K2Node_EnhancedInputActionEvent_1) == 0x000008, "Wrong alignment on WBP_Modern_QuestHistoryPanel_C_InpActEvt_IA_UI_Specific_QuestMenu_DetailSpecial_K2Node_EnhancedInputActionEvent_1");
static_assert(sizeof(WBP_Modern_QuestHistoryPanel_C_InpActEvt_IA_UI_Specific_QuestMenu_DetailSpecial_K2Node_EnhancedInputActionEvent_1) == 0x000030, "Wrong size on WBP_Modern_QuestHistoryPanel_C_InpActEvt_IA_UI_Specific_QuestMenu_DetailSpecial_K2Node_EnhancedInputActionEvent_1");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_InpActEvt_IA_UI_Specific_QuestMenu_DetailSpecial_K2Node_EnhancedInputActionEvent_1, ActionValue) == 0x000000, "Member 'WBP_Modern_QuestHistoryPanel_C_InpActEvt_IA_UI_Specific_QuestMenu_DetailSpecial_K2Node_EnhancedInputActionEvent_1::ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_InpActEvt_IA_UI_Specific_QuestMenu_DetailSpecial_K2Node_EnhancedInputActionEvent_1, ElapsedTime) == 0x000020, "Member 'WBP_Modern_QuestHistoryPanel_C_InpActEvt_IA_UI_Specific_QuestMenu_DetailSpecial_K2Node_EnhancedInputActionEvent_1::ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_InpActEvt_IA_UI_Specific_QuestMenu_DetailSpecial_K2Node_EnhancedInputActionEvent_1, TriggeredTime) == 0x000024, "Member 'WBP_Modern_QuestHistoryPanel_C_InpActEvt_IA_UI_Specific_QuestMenu_DetailSpecial_K2Node_EnhancedInputActionEvent_1::TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_InpActEvt_IA_UI_Specific_QuestMenu_DetailSpecial_K2Node_EnhancedInputActionEvent_1, SourceAction) == 0x000028, "Member 'WBP_Modern_QuestHistoryPanel_C_InpActEvt_IA_UI_Specific_QuestMenu_DetailSpecial_K2Node_EnhancedInputActionEvent_1::SourceAction' has a wrong offset!");

// Function WBP_Modern_QuestHistoryPanel.WBP_Modern_QuestHistoryPanel_C.InpActEvt_IA_UI_Specific_QuestMenu_GoToQuestDetailsLastStep_K2Node_EnhancedInputActionEvent_0
// 0x0030 (0x0030 - 0x0000)
struct WBP_Modern_QuestHistoryPanel_C_InpActEvt_IA_UI_Specific_QuestMenu_GoToQuestDetailsLastStep_K2Node_EnhancedInputActionEvent_0 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_QuestHistoryPanel_C_InpActEvt_IA_UI_Specific_QuestMenu_GoToQuestDetailsLastStep_K2Node_EnhancedInputActionEvent_0) == 0x000008, "Wrong alignment on WBP_Modern_QuestHistoryPanel_C_InpActEvt_IA_UI_Specific_QuestMenu_GoToQuestDetailsLastStep_K2Node_EnhancedInputActionEvent_0");
static_assert(sizeof(WBP_Modern_QuestHistoryPanel_C_InpActEvt_IA_UI_Specific_QuestMenu_GoToQuestDetailsLastStep_K2Node_EnhancedInputActionEvent_0) == 0x000030, "Wrong size on WBP_Modern_QuestHistoryPanel_C_InpActEvt_IA_UI_Specific_QuestMenu_GoToQuestDetailsLastStep_K2Node_EnhancedInputActionEvent_0");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_InpActEvt_IA_UI_Specific_QuestMenu_GoToQuestDetailsLastStep_K2Node_EnhancedInputActionEvent_0, ActionValue) == 0x000000, "Member 'WBP_Modern_QuestHistoryPanel_C_InpActEvt_IA_UI_Specific_QuestMenu_GoToQuestDetailsLastStep_K2Node_EnhancedInputActionEvent_0::ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_InpActEvt_IA_UI_Specific_QuestMenu_GoToQuestDetailsLastStep_K2Node_EnhancedInputActionEvent_0, ElapsedTime) == 0x000020, "Member 'WBP_Modern_QuestHistoryPanel_C_InpActEvt_IA_UI_Specific_QuestMenu_GoToQuestDetailsLastStep_K2Node_EnhancedInputActionEvent_0::ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_InpActEvt_IA_UI_Specific_QuestMenu_GoToQuestDetailsLastStep_K2Node_EnhancedInputActionEvent_0, TriggeredTime) == 0x000024, "Member 'WBP_Modern_QuestHistoryPanel_C_InpActEvt_IA_UI_Specific_QuestMenu_GoToQuestDetailsLastStep_K2Node_EnhancedInputActionEvent_0::TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_InpActEvt_IA_UI_Specific_QuestMenu_GoToQuestDetailsLastStep_K2Node_EnhancedInputActionEvent_0, SourceAction) == 0x000028, "Member 'WBP_Modern_QuestHistoryPanel_C_InpActEvt_IA_UI_Specific_QuestMenu_GoToQuestDetailsLastStep_K2Node_EnhancedInputActionEvent_0::SourceAction' has a wrong offset!");

// Function WBP_Modern_QuestHistoryPanel.WBP_Modern_QuestHistoryPanel_C.OnCarouselUpdate
// 0x0004 (0x0004 - 0x0000)
struct WBP_Modern_QuestHistoryPanel_C_OnCarouselUpdate final
{
public:
	int32                                         Current_Page_Index;                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_QuestHistoryPanel_C_OnCarouselUpdate) == 0x000004, "Wrong alignment on WBP_Modern_QuestHistoryPanel_C_OnCarouselUpdate");
static_assert(sizeof(WBP_Modern_QuestHistoryPanel_C_OnCarouselUpdate) == 0x000004, "Wrong size on WBP_Modern_QuestHistoryPanel_C_OnCarouselUpdate");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_OnCarouselUpdate, Current_Page_Index) == 0x000000, "Member 'WBP_Modern_QuestHistoryPanel_C_OnCarouselUpdate::Current_Page_Index' has a wrong offset!");

// Function WBP_Modern_QuestHistoryPanel.WBP_Modern_QuestHistoryPanel_C.OnUpdateQuestHistory
// 0x00D0 (0x00D0 - 0x0000)
struct WBP_Modern_QuestHistoryPanel_C_OnUpdateQuestHistory final
{
public:
	TArray<struct FLegacyMapMenuQuestProperties>  NewQuestsData;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FLegacyMapMenuQuestProperties          Local_NewCurrentQuestData;                         // 0x0010(0x0098)(Edit, BlueprintVisible)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldDisplayLastStep_ShouldDisplayLastStep; // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AB[0x5];                                       // 0x00AB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFooterInputActionVisibility           K2Node_MakeStruct_FooterInputActionVisibility;     // 0x00B0(0x0010)(NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00CE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_QuestHistoryPanel_C_OnUpdateQuestHistory) == 0x000008, "Wrong alignment on WBP_Modern_QuestHistoryPanel_C_OnUpdateQuestHistory");
static_assert(sizeof(WBP_Modern_QuestHistoryPanel_C_OnUpdateQuestHistory) == 0x0000D0, "Wrong size on WBP_Modern_QuestHistoryPanel_C_OnUpdateQuestHistory");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_OnUpdateQuestHistory, NewQuestsData) == 0x000000, "Member 'WBP_Modern_QuestHistoryPanel_C_OnUpdateQuestHistory::NewQuestsData' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_OnUpdateQuestHistory, Local_NewCurrentQuestData) == 0x000010, "Member 'WBP_Modern_QuestHistoryPanel_C_OnUpdateQuestHistory::Local_NewCurrentQuestData' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_OnUpdateQuestHistory, Temp_byte_Variable) == 0x0000A8, "Member 'WBP_Modern_QuestHistoryPanel_C_OnUpdateQuestHistory::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_OnUpdateQuestHistory, Temp_byte_Variable_1) == 0x0000A9, "Member 'WBP_Modern_QuestHistoryPanel_C_OnUpdateQuestHistory::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_OnUpdateQuestHistory, CallFunc_ShouldDisplayLastStep_ShouldDisplayLastStep) == 0x0000AA, "Member 'WBP_Modern_QuestHistoryPanel_C_OnUpdateQuestHistory::CallFunc_ShouldDisplayLastStep_ShouldDisplayLastStep' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_OnUpdateQuestHistory, K2Node_MakeStruct_FooterInputActionVisibility) == 0x0000B0, "Member 'WBP_Modern_QuestHistoryPanel_C_OnUpdateQuestHistory::K2Node_MakeStruct_FooterInputActionVisibility' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_OnUpdateQuestHistory, Temp_bool_Variable) == 0x0000C0, "Member 'WBP_Modern_QuestHistoryPanel_C_OnUpdateQuestHistory::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_OnUpdateQuestHistory, CallFunc_Array_Length_ReturnValue) == 0x0000C4, "Member 'WBP_Modern_QuestHistoryPanel_C_OnUpdateQuestHistory::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_OnUpdateQuestHistory, CallFunc_Array_Length_ReturnValue_1) == 0x0000C8, "Member 'WBP_Modern_QuestHistoryPanel_C_OnUpdateQuestHistory::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_OnUpdateQuestHistory, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000CC, "Member 'WBP_Modern_QuestHistoryPanel_C_OnUpdateQuestHistory::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_OnUpdateQuestHistory, CallFunc_Greater_IntInt_ReturnValue) == 0x0000CD, "Member 'WBP_Modern_QuestHistoryPanel_C_OnUpdateQuestHistory::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_OnUpdateQuestHistory, K2Node_Select_Default) == 0x0000CE, "Member 'WBP_Modern_QuestHistoryPanel_C_OnUpdateQuestHistory::K2Node_Select_Default' has a wrong offset!");

// Function WBP_Modern_QuestHistoryPanel.WBP_Modern_QuestHistoryPanel_C.SetCarouselItems
// 0x0088 (0x0088 - 0x0000)
struct WBP_Modern_QuestHistoryPanel_C_SetCarouselItems final
{
public:
	TArray<struct FLegacyMapMenuQuestProperties>  Items;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UImage*                                 Local_CarouselBuffer;                              // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Modern_QuestHistoryCarouselEntry_C* Local_NewEntry;                                   // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Local_CurrentIndex;                                // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetItemAt_ReturnValue;                    // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVLegacyMapMenuQuestCarouselItem*       CallFunc_CreateQuestCarouselItemRightDecorator_ReturnValue; // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonListView*                        CallFunc_GetListView_ReturnValue;                  // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonListView*                        CallFunc_GetListView_ReturnValue_1;                // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVLegacyMapMenuQuestCarouselItem*       CallFunc_CreateQuestCarouselItemLeftDecorator_ReturnValue; // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonListView*                        CallFunc_GetListView_ReturnValue_2;                // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonListView*                        CallFunc_GetListView_ReturnValue_3;                // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonListView*                        CallFunc_GetListView_ReturnValue_4;                // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVLegacyMapMenuQuestCarouselItem*       CallFunc_CreateQuestCarouselItemFromQuest_ReturnValue; // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_QuestHistoryPanel_C_SetCarouselItems) == 0x000008, "Wrong alignment on WBP_Modern_QuestHistoryPanel_C_SetCarouselItems");
static_assert(sizeof(WBP_Modern_QuestHistoryPanel_C_SetCarouselItems) == 0x000088, "Wrong size on WBP_Modern_QuestHistoryPanel_C_SetCarouselItems");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_SetCarouselItems, Items) == 0x000000, "Member 'WBP_Modern_QuestHistoryPanel_C_SetCarouselItems::Items' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_SetCarouselItems, Local_CarouselBuffer) == 0x000010, "Member 'WBP_Modern_QuestHistoryPanel_C_SetCarouselItems::Local_CarouselBuffer' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_SetCarouselItems, Local_NewEntry) == 0x000018, "Member 'WBP_Modern_QuestHistoryPanel_C_SetCarouselItems::Local_NewEntry' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_SetCarouselItems, Local_CurrentIndex) == 0x000020, "Member 'WBP_Modern_QuestHistoryPanel_C_SetCarouselItems::Local_CurrentIndex' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_SetCarouselItems, Temp_int_Variable) == 0x000024, "Member 'WBP_Modern_QuestHistoryPanel_C_SetCarouselItems::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_SetCarouselItems, CallFunc_GetItemAt_ReturnValue) == 0x000028, "Member 'WBP_Modern_QuestHistoryPanel_C_SetCarouselItems::CallFunc_GetItemAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_SetCarouselItems, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'WBP_Modern_QuestHistoryPanel_C_SetCarouselItems::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_SetCarouselItems, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'WBP_Modern_QuestHistoryPanel_C_SetCarouselItems::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_SetCarouselItems, CallFunc_CreateQuestCarouselItemRightDecorator_ReturnValue) == 0x000038, "Member 'WBP_Modern_QuestHistoryPanel_C_SetCarouselItems::CallFunc_CreateQuestCarouselItemRightDecorator_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_SetCarouselItems, CallFunc_GetListView_ReturnValue) == 0x000040, "Member 'WBP_Modern_QuestHistoryPanel_C_SetCarouselItems::CallFunc_GetListView_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_SetCarouselItems, CallFunc_GetListView_ReturnValue_1) == 0x000048, "Member 'WBP_Modern_QuestHistoryPanel_C_SetCarouselItems::CallFunc_GetListView_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_SetCarouselItems, CallFunc_CreateQuestCarouselItemLeftDecorator_ReturnValue) == 0x000050, "Member 'WBP_Modern_QuestHistoryPanel_C_SetCarouselItems::CallFunc_CreateQuestCarouselItemLeftDecorator_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_SetCarouselItems, CallFunc_GetListView_ReturnValue_2) == 0x000058, "Member 'WBP_Modern_QuestHistoryPanel_C_SetCarouselItems::CallFunc_GetListView_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_SetCarouselItems, CallFunc_GetListView_ReturnValue_3) == 0x000060, "Member 'WBP_Modern_QuestHistoryPanel_C_SetCarouselItems::CallFunc_GetListView_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_SetCarouselItems, CallFunc_GetListView_ReturnValue_4) == 0x000068, "Member 'WBP_Modern_QuestHistoryPanel_C_SetCarouselItems::CallFunc_GetListView_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_SetCarouselItems, CallFunc_Array_Length_ReturnValue) == 0x000070, "Member 'WBP_Modern_QuestHistoryPanel_C_SetCarouselItems::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_SetCarouselItems, CallFunc_CreateQuestCarouselItemFromQuest_ReturnValue) == 0x000078, "Member 'WBP_Modern_QuestHistoryPanel_C_SetCarouselItems::CallFunc_CreateQuestCarouselItemFromQuest_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_SetCarouselItems, CallFunc_Subtract_IntInt_ReturnValue) == 0x000080, "Member 'WBP_Modern_QuestHistoryPanel_C_SetCarouselItems::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_SetCarouselItems, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000084, "Member 'WBP_Modern_QuestHistoryPanel_C_SetCarouselItems::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_Modern_QuestHistoryPanel.WBP_Modern_QuestHistoryPanel_C.ShouldDisplayLastStep
// 0x0048 (0x0048 - 0x0000)
struct WBP_Modern_QuestHistoryPanel_C_ShouldDisplayLastStep final
{
public:
	bool                                          ShouldDisplayLastStep_0;                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonListView*                        CallFunc_GetListView_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonListView*                        CallFunc_GetListView_ReturnValue_1;                // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumItems_ReturnValue;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonListView*                        CallFunc_GetListView_ReturnValue_2;                // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BP_GetSelectedItem_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonListView*                        CallFunc_GetListView_ReturnValue_3;                // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetIndexForItem_ReturnValue;              // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumItems_ReturnValue_1;                // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_QuestHistoryPanel_C_ShouldDisplayLastStep) == 0x000008, "Wrong alignment on WBP_Modern_QuestHistoryPanel_C_ShouldDisplayLastStep");
static_assert(sizeof(WBP_Modern_QuestHistoryPanel_C_ShouldDisplayLastStep) == 0x000048, "Wrong size on WBP_Modern_QuestHistoryPanel_C_ShouldDisplayLastStep");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_ShouldDisplayLastStep, ShouldDisplayLastStep_0) == 0x000000, "Member 'WBP_Modern_QuestHistoryPanel_C_ShouldDisplayLastStep::ShouldDisplayLastStep_0' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_ShouldDisplayLastStep, CallFunc_GetListView_ReturnValue) == 0x000008, "Member 'WBP_Modern_QuestHistoryPanel_C_ShouldDisplayLastStep::CallFunc_GetListView_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_ShouldDisplayLastStep, CallFunc_GetListView_ReturnValue_1) == 0x000010, "Member 'WBP_Modern_QuestHistoryPanel_C_ShouldDisplayLastStep::CallFunc_GetListView_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_ShouldDisplayLastStep, CallFunc_GetNumItems_ReturnValue) == 0x000018, "Member 'WBP_Modern_QuestHistoryPanel_C_ShouldDisplayLastStep::CallFunc_GetNumItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_ShouldDisplayLastStep, CallFunc_Subtract_IntInt_ReturnValue) == 0x00001C, "Member 'WBP_Modern_QuestHistoryPanel_C_ShouldDisplayLastStep::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_ShouldDisplayLastStep, CallFunc_GetListView_ReturnValue_2) == 0x000020, "Member 'WBP_Modern_QuestHistoryPanel_C_ShouldDisplayLastStep::CallFunc_GetListView_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_ShouldDisplayLastStep, CallFunc_BP_GetSelectedItem_ReturnValue) == 0x000028, "Member 'WBP_Modern_QuestHistoryPanel_C_ShouldDisplayLastStep::CallFunc_BP_GetSelectedItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_ShouldDisplayLastStep, CallFunc_GetListView_ReturnValue_3) == 0x000030, "Member 'WBP_Modern_QuestHistoryPanel_C_ShouldDisplayLastStep::CallFunc_GetListView_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_ShouldDisplayLastStep, CallFunc_GetIndexForItem_ReturnValue) == 0x000038, "Member 'WBP_Modern_QuestHistoryPanel_C_ShouldDisplayLastStep::CallFunc_GetIndexForItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_ShouldDisplayLastStep, CallFunc_GetNumItems_ReturnValue_1) == 0x00003C, "Member 'WBP_Modern_QuestHistoryPanel_C_ShouldDisplayLastStep::CallFunc_GetNumItems_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_ShouldDisplayLastStep, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000040, "Member 'WBP_Modern_QuestHistoryPanel_C_ShouldDisplayLastStep::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_ShouldDisplayLastStep, CallFunc_Greater_IntInt_ReturnValue) == 0x000041, "Member 'WBP_Modern_QuestHistoryPanel_C_ShouldDisplayLastStep::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_ShouldDisplayLastStep, CallFunc_BooleanAND_ReturnValue) == 0x000042, "Member 'WBP_Modern_QuestHistoryPanel_C_ShouldDisplayLastStep::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_ShouldDisplayLastStep, CallFunc_BooleanAND_ReturnValue_1) == 0x000043, "Member 'WBP_Modern_QuestHistoryPanel_C_ShouldDisplayLastStep::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function WBP_Modern_QuestHistoryPanel.WBP_Modern_QuestHistoryPanel_C.TriggerDetailSpecialInput
// 0x0003 (0x0003 - 0x0000)
struct WBP_Modern_QuestHistoryPanel_C_TriggerDetailSpecialInput final
{
public:
	bool                                          CallFunc_GetIsFocussed_ReturnValue;                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_QuestHistoryPanel_C_TriggerDetailSpecialInput) == 0x000001, "Wrong alignment on WBP_Modern_QuestHistoryPanel_C_TriggerDetailSpecialInput");
static_assert(sizeof(WBP_Modern_QuestHistoryPanel_C_TriggerDetailSpecialInput) == 0x000003, "Wrong size on WBP_Modern_QuestHistoryPanel_C_TriggerDetailSpecialInput");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_TriggerDetailSpecialInput, CallFunc_GetIsFocussed_ReturnValue) == 0x000000, "Member 'WBP_Modern_QuestHistoryPanel_C_TriggerDetailSpecialInput::CallFunc_GetIsFocussed_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_TriggerDetailSpecialInput, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'WBP_Modern_QuestHistoryPanel_C_TriggerDetailSpecialInput::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_TriggerDetailSpecialInput, CallFunc_BooleanAND_ReturnValue) == 0x000002, "Member 'WBP_Modern_QuestHistoryPanel_C_TriggerDetailSpecialInput::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_Modern_QuestHistoryPanel.WBP_Modern_QuestHistoryPanel_C.Update Carousel
// 0x00E0 (0x00E0 - 0x0000)
struct WBP_Modern_QuestHistoryPanel_C_Update_Carousel final
{
public:
	TArray<struct FLegacyMapMenuQuestProperties>  NewItemsData;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FSlateBrush                            CallFunc_MakeBrushFromTexture_ReturnValue;         // 0x0010(0x00D0)()
};
static_assert(alignof(WBP_Modern_QuestHistoryPanel_C_Update_Carousel) == 0x000010, "Wrong alignment on WBP_Modern_QuestHistoryPanel_C_Update_Carousel");
static_assert(sizeof(WBP_Modern_QuestHistoryPanel_C_Update_Carousel) == 0x0000E0, "Wrong size on WBP_Modern_QuestHistoryPanel_C_Update_Carousel");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_Update_Carousel, NewItemsData) == 0x000000, "Member 'WBP_Modern_QuestHistoryPanel_C_Update_Carousel::NewItemsData' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_Update_Carousel, CallFunc_MakeBrushFromTexture_ReturnValue) == 0x000010, "Member 'WBP_Modern_QuestHistoryPanel_C_Update_Carousel::CallFunc_MakeBrushFromTexture_ReturnValue' has a wrong offset!");

// Function WBP_Modern_QuestHistoryPanel.WBP_Modern_QuestHistoryPanel_C.UpdateButtonSwitcher
// 0x0010 (0x0010 - 0x0000)
struct WBP_Modern_QuestHistoryPanel_C_UpdateButtonSwitcher final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default;                             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_QuestHistoryPanel_C_UpdateButtonSwitcher) == 0x000008, "Wrong alignment on WBP_Modern_QuestHistoryPanel_C_UpdateButtonSwitcher");
static_assert(sizeof(WBP_Modern_QuestHistoryPanel_C_UpdateButtonSwitcher) == 0x000010, "Wrong size on WBP_Modern_QuestHistoryPanel_C_UpdateButtonSwitcher");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_UpdateButtonSwitcher, Temp_bool_Variable) == 0x000000, "Member 'WBP_Modern_QuestHistoryPanel_C_UpdateButtonSwitcher::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestHistoryPanel_C_UpdateButtonSwitcher, K2Node_Select_Default) == 0x000008, "Member 'WBP_Modern_QuestHistoryPanel_C_UpdateButtonSwitcher::K2Node_Select_Default' has a wrong offset!");

// Function WBP_Modern_QuestHistoryPanel.WBP_Modern_QuestHistoryPanel_C.UpdateInputHint
// 0x0058 (0x0058 - 0x0000)
struct WBP_Modern_QuestHistoryPanel_C_UpdateInputHint final
{
public:
	int32                                         CurrentPageIndex;                                  // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonListView*                        CallFunc_GetListView_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonListView*                        CallFunc_GetListView_ReturnValue_1;                // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
