#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_OriginalMenu_InventoryItemDetails

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "Altar_structs.hpp"
#include "Altar_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_OriginalMenu_InventoryItemDetails.WBP_OriginalMenu_InventoryItemDetails_C
// 0x08F8 (0x0DC0 - 0x04C8)
class UWBP_OriginalMenu_InventoryItemDetails_C final : public UVAltarWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVInventoryMenuViewModel*               VInventoryMenuViewModel;                           // 0x04D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UVItemDetailsViewModel*                 VItemDetailsViewModel;                             // 0x04D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UVItemEffectsViewModel*                 VItemEffectsViewModel;                             // 0x04E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       InventoryDetailsFadeInOut;                         // 0x04E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SkillFadeInOut;                                    // 0x04F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SpecificSwitcherFadeInOut;                         // 0x04F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       MainContentFadeInOut;                              // 0x0500(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_ModernPrefab_Button_C*             inv_details_action_button;                         // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               inv_details_action_button_overlay;                 // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           inv_details_canvas;                                // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AltarTextBlock_C*                  inv_details_count;                                 // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               inv_details_item_background;                       // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalMenu_InventoryMainContent_C* inv_details_main_content;                        // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AltarTextBlock_C*                  inv_details_name;                                  // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AltarTextBlock_C*                  inv_details_name_seperator;                        // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalMenu_InventoryItemPreview_C* inv_details_preview;                             // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           inv_details_preview_maincontent_verticalbox;       // 0x0550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModernMenu_StatsPage3_Details_C*   inv_details_skill;                                 // 0x0558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        inv_details_specific_switcher;                     // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         inv_details_subtabs_button_horizontalbox;          // 0x0568(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C* inv_details_subtabs_buttons_tab1;   // 0x0570(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C* inv_details_subtabs_buttons_tab2;   // 0x0578(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalMenu_InventoryItemDetailsSubTabsButton_C* inv_details_subtabs_buttons_tab3;   // 0x0580(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalMenu_InventoryDetails_Tooltip_C* inv_details_tooltip;                         // 0x0588(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMap<EFormID, class FText>                    FormIDToActionButtonText;                          // 0x0590(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<EOriginalInventoryMenuBookType, class FText> BookTypeToActionButtonText;                    // 0x05E0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   ActionTextEquip;                                   // 0x0630(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   ActionTextUnequip;                                 // 0x0648(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   DefaultActionTextHammer;                           // 0x0660(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          Is_Light_Armor;                                    // 0x0678(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOriginalInventoryMenuArmorClothPart          NewArmorPart;                                      // 0x0679(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67A[0x6];                                      // 0x067A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   DefaultArmorLightText;                             // 0x0680(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   DefaultArmorHeavyText;                             // 0x0698(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<EOriginalInventoryMenuArmorClothPart, class FText> DefaultArmorPartText;                    // 0x06B0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<EFormID, class FText>                    FormIDToDefaultDescription;                        // 0x0700(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<EOriginalInventoryMenuArmorClothPart, class FText> DefaultClothPartDescription;             // 0x0750(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<EOriginalInventoryMenuBookType, class FText> DefaultBookTypeDescription;                    // 0x07A0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<EOriginalInventoryMenuPotionType, class FText> DefaultPotionTypeDescription;                // 0x07F0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   DefaultHammerDescription;                          // 0x0840(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMulticastInlineDelegate<void()>              OnActionClicked;                                   // 0x0858(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FText                                   DefaultActionTextWelkynd;                          // 0x0868(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UTESForm*                               CurrentForm;                                       // 0x0880(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class AActor* NewActor)> SendNewItemActor;                         // 0x0888(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FText                                   DefaultWelkyndStoneInfoText;                       // 0x0898(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   DefaultActionTextVarlaStone;                       // 0x08B0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   WeaponDescriptionTextFormat;                       // 0x08C8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<struct FGameplayTag, class FText>        WeaponSizeToTextMap;                               // 0x08E0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<struct FGameplayTag, class FText>        WeaponTypeToTextMap;                               // 0x0930(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<struct FGameplayTag, class FText>        WeaponSkillToTextMap;                              // 0x0980(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         NbSubTabs;                                         // 0x09D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentSubTabIndex;                                // 0x09D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<EFormID, int32>                          FormIDToNumberOfSubTabs;                           // 0x09D8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<EFormID, int32>                          FormIDToSpecificDetailsIndex;                      // 0x0A28(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<EOriginalInventoryMenuBookType, int32>   BookTypeToNumberOfSubTabs;                         // 0x0A78(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   DefaultVarlaStoneInfoText;                         // 0x0AC8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   DefaultSoulgemDescription;                         // 0x0AE0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   SoulgemEmptyDescription;                           // 0x0AF8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   SoulgemEmptyText;                                  // 0x0B10(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   SoulgemFilledText;                                 // 0x0B28(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IsActionDisplayed;                                 // 0x0B40(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDetailsPanelOpen;                                // 0x0B41(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ForceToHideDetails;                                // 0x0B42(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B43[0x5];                                      // 0x0B43(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(bool IsVisible)> DetailsPanelVisibilityChanged;                    // 0x0B48(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          HoveredItemHasEffects;                             // 0x0B58(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B59[0x7];                                      // 0x0B59(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   DefaultUsableStoneDescription;                     // 0x0B60(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IsHoveredItemStack;                                // 0x0B78(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B79[0x7];                                      // 0x0B79(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            LeftBackgroundBrush;                               // 0x0B80(0x00D0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVector2D                              LeftBackgroundPosition;                            // 0x0C50(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            RightBackgroundBrush;                              // 0x0C60(0x00D0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVector2D                              RightBackgroundPosition;                           // 0x0D30(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnSubTabsSwitched;                                 // 0x0D40(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          LastIsDetailsOpen;                                 // 0x0D50(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D51[0x7];                                      // 0x0D51(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOriginalInventoryMenuItemProperties   Item_Hovered;                                      // 0x0D58(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FName                                   PreviewLocationContext;                            // 0x0DA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInContainer;                                     // 0x0DB0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_OriginalMenu_InventoryItemDetails_inv_details_action_button_K2Node_ComponentBoundEvent_11_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_OriginalMenu_InventoryItemDetails_inv_details_actionbutton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_OriginalMenu_InventoryItemDetails_inv_details_subtabs_buttons_tab1_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_OriginalMenu_InventoryItemDetails_inv_details_subtabs_buttons_tab1_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
