#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModernMenu_StatsPage3_Details

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "EnhancedInput_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "CommonInput_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_ModernMenu_StatsPage3_Details.WBP_ModernMenu_StatsPage3_Details_C.DoScroll
// 0x0038 (0x0038 - 0x0000)
struct WBP_ModernMenu_StatsPage3_Details_C_DoScroll final
{
public:
	double                                        ScrollDelta;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScrollOffsetOfEnd_ReturnValue;         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScrollOffset_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_Max_ImplicitCast;                  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScrollOffset_NewScrollOffset_ImplicitCast; // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_StatsPage3_Details_C_DoScroll) == 0x000008, "Wrong alignment on WBP_ModernMenu_StatsPage3_Details_C_DoScroll");
static_assert(sizeof(WBP_ModernMenu_StatsPage3_Details_C_DoScroll) == 0x000038, "Wrong size on WBP_ModernMenu_StatsPage3_Details_C_DoScroll");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_DoScroll, ScrollDelta) == 0x000000, "Member 'WBP_ModernMenu_StatsPage3_Details_C_DoScroll::ScrollDelta' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_DoScroll, CallFunc_GetScrollOffsetOfEnd_ReturnValue) == 0x000008, "Member 'WBP_ModernMenu_StatsPage3_Details_C_DoScroll::CallFunc_GetScrollOffsetOfEnd_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_DoScroll, CallFunc_GetScrollOffset_ReturnValue) == 0x00000C, "Member 'WBP_ModernMenu_StatsPage3_Details_C_DoScroll::CallFunc_GetScrollOffset_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_DoScroll, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000010, "Member 'WBP_ModernMenu_StatsPage3_Details_C_DoScroll::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_DoScroll, CallFunc_FClamp_ReturnValue) == 0x000018, "Member 'WBP_ModernMenu_StatsPage3_Details_C_DoScroll::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_DoScroll, CallFunc_FClamp_Max_ImplicitCast) == 0x000020, "Member 'WBP_ModernMenu_StatsPage3_Details_C_DoScroll::CallFunc_FClamp_Max_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_DoScroll, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000028, "Member 'WBP_ModernMenu_StatsPage3_Details_C_DoScroll::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_DoScroll, CallFunc_SetScrollOffset_NewScrollOffset_ImplicitCast) == 0x000030, "Member 'WBP_ModernMenu_StatsPage3_Details_C_DoScroll::CallFunc_SetScrollOffset_NewScrollOffset_ImplicitCast' has a wrong offset!");

// Function WBP_ModernMenu_StatsPage3_Details.WBP_ModernMenu_StatsPage3_Details_C.ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Details
// 0x00E8 (0x00E8 - 0x0000)
struct WBP_ModernMenu_StatsPage3_Details_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Details final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_2;                              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_3;                              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue;       // 0x0018(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime;       // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime;     // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction;      // 0x0040(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_InputActionValueToAxis2D_ReturnValue; // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable;                              // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_4;                              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_4_0;                            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_5;                              // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable;                              // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_5_0;                            // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate;            // 0x00B0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue; // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              K2Node_CustomEvent_bNewInputType;                  // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              Temp_byte_Variable;                                // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_StatsPage3_Details_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Details) == 0x000008, "Wrong alignment on WBP_ModernMenu_StatsPage3_Details_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Details");
static_assert(sizeof(WBP_ModernMenu_StatsPage3_Details_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Details) == 0x0000E8, "Wrong size on WBP_ModernMenu_StatsPage3_Details_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Details");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Details, EntryPoint) == 0x000000, "Member 'WBP_ModernMenu_StatsPage3_Details_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Details::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Details, Temp_real_Variable) == 0x000004, "Member 'WBP_ModernMenu_StatsPage3_Details_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Details::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Details, Temp_real_Variable_1) == 0x000008, "Member 'WBP_ModernMenu_StatsPage3_Details_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Details::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Details, Temp_real_Variable_2) == 0x00000C, "Member 'WBP_ModernMenu_StatsPage3_Details_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Details::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Details, Temp_real_Variable_3) == 0x000010, "Member 'WBP_ModernMenu_StatsPage3_Details_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Details::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Details, K2Node_EnhancedInputActionEvent_ActionValue) == 0x000018, "Member 'WBP_ModernMenu_StatsPage3_Details_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Details::K2Node_EnhancedInputActionEvent_ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Details, K2Node_EnhancedInputActionEvent_ElapsedTime) == 0x000038, "Member 'WBP_ModernMenu_StatsPage3_Details_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Details::K2Node_EnhancedInputActionEvent_ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Details, K2Node_EnhancedInputActionEvent_TriggeredTime) == 0x00003C, "Member 'WBP_ModernMenu_StatsPage3_Details_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Details::K2Node_EnhancedInputActionEvent_TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Details, K2Node_EnhancedInputActionEvent_SourceAction) == 0x000040, "Member 'WBP_ModernMenu_StatsPage3_Details_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Details::K2Node_EnhancedInputActionEvent_SourceAction' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Details, CallFunc_Conv_InputActionValueToAxis2D_ReturnValue) == 0x000048, "Member 'WBP_ModernMenu_StatsPage3_Details_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Details::CallFunc_Conv_InputActionValueToAxis2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Details, Temp_object_Variable) == 0x000058, "Member 'WBP_ModernMenu_StatsPage3_Details_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Details::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Details, Temp_real_Variable_4) == 0x000060, "Member 'WBP_ModernMenu_StatsPage3_Details_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Details::Temp_real_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Details, Temp_real_Variable_4_0) == 0x000068, "Member 'WBP_ModernMenu_StatsPage3_Details_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Details::Temp_real_Variable_4_0' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Details, Temp_real_Variable_5) == 0x000070, "Member 'WBP_ModernMenu_StatsPage3_Details_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Details::Temp_real_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Details, Temp_struct_Variable) == 0x000078, "Member 'WBP_ModernMenu_StatsPage3_Details_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Details::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Details, Temp_real_Variable_5_0) == 0x000088, "Member 'WBP_ModernMenu_StatsPage3_Details_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Details::Temp_real_Variable_5_0' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Details, CallFunc_BreakVector2D_X) == 0x000090, "Member 'WBP_ModernMenu_StatsPage3_Details_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Details::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Details, CallFunc_BreakVector2D_Y) == 0x000098, "Member 'WBP_ModernMenu_StatsPage3_Details_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Details::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Details, K2Node_Event_IsDesignTime) == 0x0000A0, "Member 'WBP_ModernMenu_StatsPage3_Details_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Details::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Details, CallFunc_GetPlayerController_ReturnValue) == 0x0000A8, "Member 'WBP_ModernMenu_StatsPage3_Details_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Details::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Details, K2Node_CreateDelegate_OutputDelegate) == 0x0000B0, "Member 'WBP_ModernMenu_StatsPage3_Details_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Details::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Details, CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue) == 0x0000C0, "Member 'WBP_ModernMenu_StatsPage3_Details_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Details::CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Details, K2Node_CustomEvent_bNewInputType) == 0x0000C8, "Member 'WBP_ModernMenu_StatsPage3_Details_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Details::K2Node_CustomEvent_bNewInputType' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Details, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0000D0, "Member 'WBP_ModernMenu_StatsPage3_Details_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Details::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Details, CallFunc_GetDynamicMaterial_ReturnValue) == 0x0000D8, "Member 'WBP_ModernMenu_StatsPage3_Details_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Details::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Details, Temp_byte_Variable) == 0x0000E0, "Member 'WBP_ModernMenu_StatsPage3_Details_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Details::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Details, K2Node_Select_Default) == 0x0000E4, "Member 'WBP_ModernMenu_StatsPage3_Details_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Details::K2Node_Select_Default' has a wrong offset!");

// Function WBP_ModernMenu_StatsPage3_Details.WBP_ModernMenu_StatsPage3_Details_C.InitializeWidget
// 0x0015 (0x0015 - 0x0000)
struct WBP_ModernMenu_StatsPage3_Details_C_InitializeWidget final
{
public:
	EConsumeMouseWheel                            Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EConsumeMouseWheel                            Temp_byte_Variable_1;                              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EWidgetClipping                               Temp_byte_Variable_2;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EWidgetClipping                               Temp_byte_Variable_3;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_8;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_9;                              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EConsumeMouseWheel                            K2Node_Select_Default;                             // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EWidgetClipping                               K2Node_Select_Default_1;                           // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_4;                           // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_StatsPage3_Details_C_InitializeWidget) == 0x000001, "Wrong alignment on WBP_ModernMenu_StatsPage3_Details_C_InitializeWidget");
static_assert(sizeof(WBP_ModernMenu_StatsPage3_Details_C_InitializeWidget) == 0x000015, "Wrong size on WBP_ModernMenu_StatsPage3_Details_C_InitializeWidget");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_InitializeWidget, Temp_byte_Variable) == 0x000000, "Member 'WBP_ModernMenu_StatsPage3_Details_C_InitializeWidget::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_InitializeWidget, Temp_byte_Variable_1) == 0x000001, "Member 'WBP_ModernMenu_StatsPage3_Details_C_InitializeWidget::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_InitializeWidget, Temp_bool_Variable) == 0x000002, "Member 'WBP_ModernMenu_StatsPage3_Details_C_InitializeWidget::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_InitializeWidget, Temp_byte_Variable_2) == 0x000003, "Member 'WBP_ModernMenu_StatsPage3_Details_C_InitializeWidget::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_InitializeWidget, Temp_byte_Variable_3) == 0x000004, "Member 'WBP_ModernMenu_StatsPage3_Details_C_InitializeWidget::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_InitializeWidget, Temp_bool_Variable_1) == 0x000005, "Member 'WBP_ModernMenu_StatsPage3_Details_C_InitializeWidget::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_InitializeWidget, Temp_byte_Variable_4) == 0x000006, "Member 'WBP_ModernMenu_StatsPage3_Details_C_InitializeWidget::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_InitializeWidget, Temp_byte_Variable_5) == 0x000007, "Member 'WBP_ModernMenu_StatsPage3_Details_C_InitializeWidget::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_InitializeWidget, Temp_bool_Variable_2) == 0x000008, "Member 'WBP_ModernMenu_StatsPage3_Details_C_InitializeWidget::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_InitializeWidget, Temp_byte_Variable_6) == 0x000009, "Member 'WBP_ModernMenu_StatsPage3_Details_C_InitializeWidget::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_InitializeWidget, Temp_byte_Variable_7) == 0x00000A, "Member 'WBP_ModernMenu_StatsPage3_Details_C_InitializeWidget::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_InitializeWidget, Temp_bool_Variable_3) == 0x00000B, "Member 'WBP_ModernMenu_StatsPage3_Details_C_InitializeWidget::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_InitializeWidget, Temp_byte_Variable_8) == 0x00000C, "Member 'WBP_ModernMenu_StatsPage3_Details_C_InitializeWidget::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_InitializeWidget, Temp_byte_Variable_9) == 0x00000D, "Member 'WBP_ModernMenu_StatsPage3_Details_C_InitializeWidget::Temp_byte_Variable_9' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_InitializeWidget, Temp_bool_Variable_4) == 0x00000E, "Member 'WBP_ModernMenu_StatsPage3_Details_C_InitializeWidget::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_InitializeWidget, K2Node_Select_Default) == 0x00000F, "Member 'WBP_ModernMenu_StatsPage3_Details_C_InitializeWidget::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_InitializeWidget, CallFunc_Not_PreBool_ReturnValue) == 0x000010, "Member 'WBP_ModernMenu_StatsPage3_Details_C_InitializeWidget::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_InitializeWidget, K2Node_Select_Default_1) == 0x000011, "Member 'WBP_ModernMenu_StatsPage3_Details_C_InitializeWidget::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_InitializeWidget, K2Node_Select_Default_2) == 0x000012, "Member 'WBP_ModernMenu_StatsPage3_Details_C_InitializeWidget::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_InitializeWidget, K2Node_Select_Default_3) == 0x000013, "Member 'WBP_ModernMenu_StatsPage3_Details_C_InitializeWidget::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_InitializeWidget, K2Node_Select_Default_4) == 0x000014, "Member 'WBP_ModernMenu_StatsPage3_Details_C_InitializeWidget::K2Node_Select_Default_4' has a wrong offset!");

// Function WBP_ModernMenu_StatsPage3_Details.WBP_ModernMenu_StatsPage3_Details_C.InpActEvt_IA_UI_Specific_QuickKeys_RightStick_K2Node_EnhancedInputActionEvent_0
// 0x0030 (0x0030 - 0x0000)
struct WBP_ModernMenu_StatsPage3_Details_C_InpActEvt_IA_UI_Specific_QuickKeys_RightStick_K2Node_EnhancedInputActionEvent_0 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_StatsPage3_Details_C_InpActEvt_IA_UI_Specific_QuickKeys_RightStick_K2Node_EnhancedInputActionEvent_0) == 0x000008, "Wrong alignment on WBP_ModernMenu_StatsPage3_Details_C_InpActEvt_IA_UI_Specific_QuickKeys_RightStick_K2Node_EnhancedInputActionEvent_0");
static_assert(sizeof(WBP_ModernMenu_StatsPage3_Details_C_InpActEvt_IA_UI_Specific_QuickKeys_RightStick_K2Node_EnhancedInputActionEvent_0) == 0x000030, "Wrong size on WBP_ModernMenu_StatsPage3_Details_C_InpActEvt_IA_UI_Specific_QuickKeys_RightStick_K2Node_EnhancedInputActionEvent_0");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_InpActEvt_IA_UI_Specific_QuickKeys_RightStick_K2Node_EnhancedInputActionEvent_0, ActionValue) == 0x000000, "Member 'WBP_ModernMenu_StatsPage3_Details_C_InpActEvt_IA_UI_Specific_QuickKeys_RightStick_K2Node_EnhancedInputActionEvent_0::ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_InpActEvt_IA_UI_Specific_QuickKeys_RightStick_K2Node_EnhancedInputActionEvent_0, ElapsedTime) == 0x000020, "Member 'WBP_ModernMenu_StatsPage3_Details_C_InpActEvt_IA_UI_Specific_QuickKeys_RightStick_K2Node_EnhancedInputActionEvent_0::ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_InpActEvt_IA_UI_Specific_QuickKeys_RightStick_K2Node_EnhancedInputActionEvent_0, TriggeredTime) == 0x000024, "Member 'WBP_ModernMenu_StatsPage3_Details_C_InpActEvt_IA_UI_Specific_QuickKeys_RightStick_K2Node_EnhancedInputActionEvent_0::TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_InpActEvt_IA_UI_Specific_QuickKeys_RightStick_K2Node_EnhancedInputActionEvent_0, SourceAction) == 0x000028, "Member 'WBP_ModernMenu_StatsPage3_Details_C_InpActEvt_IA_UI_Specific_QuickKeys_RightStick_K2Node_EnhancedInputActionEvent_0::SourceAction' has a wrong offset!");

// Function WBP_ModernMenu_StatsPage3_Details.WBP_ModernMenu_StatsPage3_Details_C.OnInputMethodChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_ModernMenu_StatsPage3_Details_C_OnInputMethodChanged final
{
public:
	ECommonInputType                              bNewInputType;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_StatsPage3_Details_C_OnInputMethodChanged) == 0x000001, "Wrong alignment on WBP_ModernMenu_StatsPage3_Details_C_OnInputMethodChanged");
static_assert(sizeof(WBP_ModernMenu_StatsPage3_Details_C_OnInputMethodChanged) == 0x000001, "Wrong size on WBP_ModernMenu_StatsPage3_Details_C_OnInputMethodChanged");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_OnInputMethodChanged, bNewInputType) == 0x000000, "Member 'WBP_ModernMenu_StatsPage3_Details_C_OnInputMethodChanged::bNewInputType' has a wrong offset!");

// Function WBP_ModernMenu_StatsPage3_Details.WBP_ModernMenu_StatsPage3_Details_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_ModernMenu_StatsPage3_Details_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_StatsPage3_Details_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_ModernMenu_StatsPage3_Details_C_PreConstruct");
static_assert(sizeof(WBP_ModernMenu_StatsPage3_Details_C_PreConstruct) == 0x000001, "Wrong size on WBP_ModernMenu_StatsPage3_Details_C_PreConstruct");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_ModernMenu_StatsPage3_Details_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_ModernMenu_StatsPage3_Details.WBP_ModernMenu_StatsPage3_Details_C.Set Scrollbar Input Hint
// 0x0100 (0x0100 - 0x0000)
struct WBP_ModernMenu_StatsPage3_Details_C_Set_Scrollbar_Input_Hint final
{
public:
	class UVAltarUISubsystem*                     CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_TryGetBrushFromKey_OutBrush;              // 0x0010(0x00D0)()
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               K2Node_DynamicCast_AsTexture;                      // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_StatsPage3_Details_C_Set_Scrollbar_Input_Hint) == 0x000010, "Wrong alignment on WBP_ModernMenu_StatsPage3_Details_C_Set_Scrollbar_Input_Hint");
static_assert(sizeof(WBP_ModernMenu_StatsPage3_Details_C_Set_Scrollbar_Input_Hint) == 0x000100, "Wrong size on WBP_ModernMenu_StatsPage3_Details_C_Set_Scrollbar_Input_Hint");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_Set_Scrollbar_Input_Hint, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000000, "Member 'WBP_ModernMenu_StatsPage3_Details_C_Set_Scrollbar_Input_Hint::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_Set_Scrollbar_Input_Hint, CallFunc_TryGetBrushFromKey_OutBrush) == 0x000010, "Member 'WBP_ModernMenu_StatsPage3_Details_C_Set_Scrollbar_Input_Hint::CallFunc_TryGetBrushFromKey_OutBrush' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_Set_Scrollbar_Input_Hint, CallFunc_GetDynamicMaterial_ReturnValue) == 0x0000E0, "Member 'WBP_ModernMenu_StatsPage3_Details_C_Set_Scrollbar_Input_Hint::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_Set_Scrollbar_Input_Hint, K2Node_DynamicCast_AsTexture) == 0x0000E8, "Member 'WBP_ModernMenu_StatsPage3_Details_C_Set_Scrollbar_Input_Hint::K2Node_DynamicCast_AsTexture' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_Set_Scrollbar_Input_Hint, K2Node_DynamicCast_bSuccess) == 0x0000F0, "Member 'WBP_ModernMenu_StatsPage3_Details_C_Set_Scrollbar_Input_Hint::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_ModernMenu_StatsPage3_Details.WBP_ModernMenu_StatsPage3_Details_C.SetArrowsVisibility
// 0x000A (0x000A - 0x0000)
struct WBP_ModernMenu_StatsPage3_Details_C_SetArrowsVisibility final
{
public:
	bool                                          IsUpArrowVisible;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDownArrowVisible;                                // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_StatsPage3_Details_C_SetArrowsVisibility) == 0x000001, "Wrong alignment on WBP_ModernMenu_StatsPage3_Details_C_SetArrowsVisibility");
static_assert(sizeof(WBP_ModernMenu_StatsPage3_Details_C_SetArrowsVisibility) == 0x00000A, "Wrong size on WBP_ModernMenu_StatsPage3_Details_C_SetArrowsVisibility");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_SetArrowsVisibility, IsUpArrowVisible) == 0x000000, "Member 'WBP_ModernMenu_StatsPage3_Details_C_SetArrowsVisibility::IsUpArrowVisible' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_SetArrowsVisibility, IsDownArrowVisible) == 0x000001, "Member 'WBP_ModernMenu_StatsPage3_Details_C_SetArrowsVisibility::IsDownArrowVisible' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_SetArrowsVisibility, Temp_bool_Variable) == 0x000002, "Member 'WBP_ModernMenu_StatsPage3_Details_C_SetArrowsVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_SetArrowsVisibility, Temp_byte_Variable) == 0x000003, "Member 'WBP_ModernMenu_StatsPage3_Details_C_SetArrowsVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_SetArrowsVisibility, Temp_byte_Variable_1) == 0x000004, "Member 'WBP_ModernMenu_StatsPage3_Details_C_SetArrowsVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_SetArrowsVisibility, Temp_bool_Variable_1) == 0x000005, "Member 'WBP_ModernMenu_StatsPage3_Details_C_SetArrowsVisibility::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_SetArrowsVisibility, Temp_byte_Variable_2) == 0x000006, "Member 'WBP_ModernMenu_StatsPage3_Details_C_SetArrowsVisibility::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_SetArrowsVisibility, Temp_byte_Variable_3) == 0x000007, "Member 'WBP_ModernMenu_StatsPage3_Details_C_SetArrowsVisibility::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_SetArrowsVisibility, K2Node_Select_Default) == 0x000008, "Member 'WBP_ModernMenu_StatsPage3_Details_C_SetArrowsVisibility::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_SetArrowsVisibility, K2Node_Select_Default_1) == 0x000009, "Member 'WBP_ModernMenu_StatsPage3_Details_C_SetArrowsVisibility::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_ModernMenu_StatsPage3_Details.WBP_ModernMenu_StatsPage3_Details_C.SetDescription
// 0x0020 (0x0020 - 0x0000)
struct WBP_ModernMenu_StatsPage3_Details_C_SetDescription final
{
public:
	class FText                                   Description;                                       // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_StatsPage3_Details_C_SetDescription) == 0x000008, "Wrong alignment on WBP_ModernMenu_StatsPage3_Details_C_SetDescription");
static_assert(sizeof(WBP_ModernMenu_StatsPage3_Details_C_SetDescription) == 0x000020, "Wrong size on WBP_ModernMenu_StatsPage3_Details_C_SetDescription");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_SetDescription, Description) == 0x000000, "Member 'WBP_ModernMenu_StatsPage3_Details_C_SetDescription::Description' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_SetDescription, Temp_bool_Variable) == 0x000018, "Member 'WBP_ModernMenu_StatsPage3_Details_C_SetDescription::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_SetDescription, Temp_byte_Variable) == 0x000019, "Member 'WBP_ModernMenu_StatsPage3_Details_C_SetDescription::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_SetDescription, Temp_byte_Variable_1) == 0x00001A, "Member 'WBP_ModernMenu_StatsPage3_Details_C_SetDescription::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_SetDescription, CallFunc_TextIsEmpty_ReturnValue) == 0x00001B, "Member 'WBP_ModernMenu_StatsPage3_Details_C_SetDescription::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_SetDescription, K2Node_Select_Default) == 0x00001C, "Member 'WBP_ModernMenu_StatsPage3_Details_C_SetDescription::K2Node_Select_Default' has a wrong offset!");

// Function WBP_ModernMenu_StatsPage3_Details.WBP_ModernMenu_StatsPage3_Details_C.SetImage
// 0x0100 (0x0100 - 0x0000)
struct WBP_ModernMenu_StatsPage3_Details_C_SetImage final
{
public:
	class UTexture2D*                             Texture;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsTextureValid;                                    // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Blueprint_GetSizeY_ReturnValue;           // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Blueprint_GetSizeX_ReturnValue;           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0xC];                                       // 0x0014(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_MakeBrushFromTexture_ReturnValue;         // 0x0020(0x00D0)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_StatsPage3_Details_C_SetImage) == 0x000010, "Wrong alignment on WBP_ModernMenu_StatsPage3_Details_C_SetImage");
static_assert(sizeof(WBP_ModernMenu_StatsPage3_Details_C_SetImage) == 0x000100, "Wrong size on WBP_ModernMenu_StatsPage3_Details_C_SetImage");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_SetImage, Texture) == 0x000000, "Member 'WBP_ModernMenu_StatsPage3_Details_C_SetImage::Texture' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_SetImage, IsTextureValid) == 0x000008, "Member 'WBP_ModernMenu_StatsPage3_Details_C_SetImage::IsTextureValid' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_SetImage, CallFunc_Blueprint_GetSizeY_ReturnValue) == 0x00000C, "Member 'WBP_ModernMenu_StatsPage3_Details_C_SetImage::CallFunc_Blueprint_GetSizeY_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_SetImage, CallFunc_Blueprint_GetSizeX_ReturnValue) == 0x000010, "Member 'WBP_ModernMenu_StatsPage3_Details_C_SetImage::CallFunc_Blueprint_GetSizeX_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_SetImage, CallFunc_MakeBrushFromTexture_ReturnValue) == 0x000020, "Member 'WBP_ModernMenu_StatsPage3_Details_C_SetImage::CallFunc_MakeBrushFromTexture_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_SetImage, CallFunc_IsValid_ReturnValue) == 0x0000F0, "Member 'WBP_ModernMenu_StatsPage3_Details_C_SetImage::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_ModernMenu_StatsPage3_Details.WBP_ModernMenu_StatsPage3_Details_C.SetModernContent
// 0x00C8 (0x00C8 - 0x0000)
struct WBP_ModernMenu_StatsPage3_Details_C_SetModernContent final
{
public:
	class FText                                   TitleText;                                         // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   LevelText;                                         // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   DescriptionText;                                   // 0x0030(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	double                                        Progression;                                       // 0x0048(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentSkill;                                      // 0x0050(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SkillBase;                                         // 0x0054(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Icon;                                              // 0x0058(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             BigIcon;                                           // 0x0060(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   SkillNameKey;                                      // 0x0068(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   Local_SkillLevelKey;                               // 0x0080(0x0018)(Edit, BlueprintVisible)
	double                                        CallFunc_FMin_ReturnValue;                         // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x00A8(0x0018)()
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_StatsPage3_Details_C_SetModernContent) == 0x000008, "Wrong alignment on WBP_ModernMenu_StatsPage3_Details_C_SetModernContent");
static_assert(sizeof(WBP_ModernMenu_StatsPage3_Details_C_SetModernContent) == 0x0000C8, "Wrong size on WBP_ModernMenu_StatsPage3_Details_C_SetModernContent");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_SetModernContent, TitleText) == 0x000000, "Member 'WBP_ModernMenu_StatsPage3_Details_C_SetModernContent::TitleText' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_SetModernContent, LevelText) == 0x000018, "Member 'WBP_ModernMenu_StatsPage3_Details_C_SetModernContent::LevelText' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_SetModernContent, DescriptionText) == 0x000030, "Member 'WBP_ModernMenu_StatsPage3_Details_C_SetModernContent::DescriptionText' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_SetModernContent, Progression) == 0x000048, "Member 'WBP_ModernMenu_StatsPage3_Details_C_SetModernContent::Progression' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_SetModernContent, CurrentSkill) == 0x000050, "Member 'WBP_ModernMenu_StatsPage3_Details_C_SetModernContent::CurrentSkill' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_SetModernContent, SkillBase) == 0x000054, "Member 'WBP_ModernMenu_StatsPage3_Details_C_SetModernContent::SkillBase' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_SetModernContent, Icon) == 0x000058, "Member 'WBP_ModernMenu_StatsPage3_Details_C_SetModernContent::Icon' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_SetModernContent, BigIcon) == 0x000060, "Member 'WBP_ModernMenu_StatsPage3_Details_C_SetModernContent::BigIcon' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_SetModernContent, SkillNameKey) == 0x000068, "Member 'WBP_ModernMenu_StatsPage3_Details_C_SetModernContent::SkillNameKey' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_SetModernContent, Local_SkillLevelKey) == 0x000080, "Member 'WBP_ModernMenu_StatsPage3_Details_C_SetModernContent::Local_SkillLevelKey' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_SetModernContent, CallFunc_FMin_ReturnValue) == 0x000098, "Member 'WBP_ModernMenu_StatsPage3_Details_C_SetModernContent::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_SetModernContent, CallFunc_GetDynamicMaterial_ReturnValue) == 0x0000A0, "Member 'WBP_ModernMenu_StatsPage3_Details_C_SetModernContent::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_SetModernContent, CallFunc_Conv_IntToText_ReturnValue) == 0x0000A8, "Member 'WBP_ModernMenu_StatsPage3_Details_C_SetModernContent::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_SetModernContent, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000C0, "Member 'WBP_ModernMenu_StatsPage3_Details_C_SetModernContent::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_SetModernContent, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x0000C4, "Member 'WBP_ModernMenu_StatsPage3_Details_C_SetModernContent::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function WBP_ModernMenu_StatsPage3_Details.WBP_ModernMenu_StatsPage3_Details_C.SetSkillModifier
// 0x0020 (0x0020 - 0x0000)
struct WBP_ModernMenu_StatsPage3_Details_C_SetSkillModifier final
{
public:
	int32                                         SkillModifier;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0018)()
};
static_assert(alignof(WBP_ModernMenu_StatsPage3_Details_C_SetSkillModifier) == 0x000008, "Wrong alignment on WBP_ModernMenu_StatsPage3_Details_C_SetSkillModifier");
static_assert(sizeof(WBP_ModernMenu_StatsPage3_Details_C_SetSkillModifier) == 0x000020, "Wrong size on WBP_ModernMenu_StatsPage3_Details_C_SetSkillModifier");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_SetSkillModifier, SkillModifier) == 0x000000, "Member 'WBP_ModernMenu_StatsPage3_Details_C_SetSkillModifier::SkillModifier' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_SetSkillModifier, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000004, "Member 'WBP_ModernMenu_StatsPage3_Details_C_SetSkillModifier::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_SetSkillModifier, CallFunc_Less_IntInt_ReturnValue) == 0x000005, "Member 'WBP_ModernMenu_StatsPage3_Details_C_SetSkillModifier::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_SetSkillModifier, CallFunc_Greater_IntInt_ReturnValue) == 0x000006, "Member 'WBP_ModernMenu_StatsPage3_Details_C_SetSkillModifier::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_Details_C_SetSkillModifier, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'WBP_ModernMenu_StatsPage3_Details_C_SetSkillModifier::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

// Function WBP_ModernMenu_StatsPage3_Details.WBP_ModernMenu_StatsPage3_Details_C.UpdateLevelDescriptionsState
// 0x04F8 (0x04F8 - 0x0000)
struct WBP_ModernMenu_StatsPage3_Details_C_UpdateLevelDescriptionsState final
{
public:
	int32                                         BaseLevel;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   SkillNameKey;                                      // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0020(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0038(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0088(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00D8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x00E8(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0100(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0118(0x0050)(HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0168(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0180(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x01D0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x01E0(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_2;            // 0x01F8(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0210(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x0220(0x0050)(HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_1;          // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_5;            // 0x0278(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x02C8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_3;            // 0x02D8(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x02F0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_6;            // 0x0308(0x0050)(HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_2;          // 0x0358(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_2;          // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
