#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Modern_Settings_HeaderButton

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Modern_Settings_HeaderButton.WBP_Modern_Settings_HeaderButton_C
// 0x0800 (0x0AC0 - 0x02C0)
class UWBP_Modern_Settings_HeaderButton_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button;                                            // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UWBP_Modern_Settings_HeaderButton_C* Button)> OnHeaderButtonPressed; // 0x02D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FButtonStyle                           DefaultTexture;                                    // 0x02E0(0x03F0)(Edit, BlueprintVisible, ExposeOnSpawn)
	struct FButtonStyle                           SelectedTexture;                                   // 0x06D0(0x03F0)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void BndEvt__WBP_Modern_CharacterCreation_HeaderButton_Button_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__WBP_Modern_Settings_HeaderButton_Button_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void ExecuteUbergraph_WBP_Modern_Settings_HeaderButton(int32 EntryPoint);
	void Select();
	void SetIsSelected(bool SelectionState);
	void Unselect();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Modern_Settings_HeaderButton_C">();
	}
	static class UWBP_Modern_Settings_HeaderButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Modern_Settings_HeaderButton_C>();
	}
};
static_assert(alignof(UWBP_Modern_Settings_HeaderButton_C) == 0x000010, "Wrong alignment on UWBP_Modern_Settings_HeaderButton_C");
static_assert(sizeof(UWBP_Modern_Settings_HeaderButton_C) == 0x000AC0, "Wrong size on UWBP_Modern_Settings_HeaderButton_C");
static_assert(offsetof(UWBP_Modern_Settings_HeaderButton_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_Modern_Settings_HeaderButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_HeaderButton_C, Button) == 0x0002C8, "Member 'UWBP_Modern_Settings_HeaderButton_C::Button' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_HeaderButton_C, OnHeaderButtonPressed) == 0x0002D0, "Member 'UWBP_Modern_Settings_HeaderButton_C::OnHeaderButtonPressed' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_HeaderButton_C, DefaultTexture) == 0x0002E0, "Member 'UWBP_Modern_Settings_HeaderButton_C::DefaultTexture' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_HeaderButton_C, SelectedTexture) == 0x0006D0, "Member 'UWBP_Modern_Settings_HeaderButton_C::SelectedTexture' has a wrong offset!");

}

