#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Modern_QuestHistoryCarouselEntry

#include "Basic.hpp"

#include "CommonInput_structs.hpp"
#include "Altar_structs.hpp"
#include "Altar_classes.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Modern_QuestHistoryCarouselEntry.WBP_Modern_QuestHistoryCarouselEntry_C
// 0x01E0 (0x04B0 - 0x02D0)
class UWBP_Modern_QuestHistoryCarouselEntry_C final : public UNavigationListviewEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVFooterViewModel*                      VFooterViewModel;                                  // 0x02D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UOverlay*                               BodyContent;                                       // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AltarTextBlock_C*                  Date;                                              // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               HitBox;                                            // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               LeftDecorator;                                     // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AltarRichTextBlock_C*              QuestDetails;                                      // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNavigationScrollbox*                   QuestDetailsScrollBox;                             // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               RightDecorator;                                    // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               WBP_OriginalImageTile;                             // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_1;                                  // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AltarTextBlock_C*                  Year;                                              // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLegacyMapMenuQuestProperties          Properties;                                        // 0x0330(0x0098)(Edit, BlueprintVisible, ExposeOnSpawn)
	struct FSlateFontInfo                         BaseFont;                                          // 0x03C8(0x0058)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FSlateFontInfo                         BoldFont;                                          // 0x0420(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UVNavigableCarousel*                    ParentCarousel;                                    // 0x0478(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        TextScrollSpeedFactor;                             // 0x0480(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0488(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_48C[0x4];                                      // 0x048C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVLegacyMapMenuQuestCarouselItem*       LocalItemData;                                     // 0x0490(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UListView*                              ParentListView;                                    // 0x0498(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        NotSelectedOpacity;                                // 0x04A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsSelected;                                       // 0x04A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_Modern_QuestHistoryCarouselEntry_HitBox_K2Node_ComponentBoundEvent_1_MouseEventDelegate__DelegateSignature(class UUserWidget* Target, const struct FGeometry& InGeometry, const struct FPointerEvent& InMouseEvent);
	void BP_OnItemSelectionChanged(bool bIsSelected_0);
	void Construct();
	void ExecuteUbergraph_WBP_Modern_QuestHistoryCarouselEntry(int32 EntryPoint);
	void InpActEvt_IA_UI_Specific_QuestMenu_ScrollHistoric_K2Node_EnhancedInputActionEvent_0(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void OnInputMethodChange(ECommonInputType NewInputType);
	void OnListItemObjectSet(class UObject* ListItemObject);
	void PreConstruct(bool IsDesignTime);
	void ScrollBody(double ScrollDelta);
	void ScrollBodyToTop();
	void UpdateBackgroundIndicator(bool NewBackgroundState);
	void UpdateBody();
	void UpdateBoldness(bool NewIsFocus);
	void UpdateDateAndYear();
	void UpdateEntry();

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Modern_QuestHistoryCarouselEntry_C">();
	}
	static class UWBP_Modern_QuestHistoryCarouselEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Modern_QuestHistoryCarouselEntry_C>();
	}
};
static_assert(alignof(UWBP_Modern_QuestHistoryCarouselEntry_C) == 0x000008, "Wrong alignment on UWBP_Modern_QuestHistoryCarouselEntry_C");
static_assert(sizeof(UWBP_Modern_QuestHistoryCarouselEntry_C) == 0x0004B0, "Wrong size on UWBP_Modern_QuestHistoryCarouselEntry_C");
static_assert(offsetof(UWBP_Modern_QuestHistoryCarouselEntry_C, UberGraphFrame) == 0x0002D0, "Member 'UWBP_Modern_QuestHistoryCarouselEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_QuestHistoryCarouselEntry_C, VFooterViewModel) == 0x0002D8, "Member 'UWBP_Modern_QuestHistoryCarouselEntry_C::VFooterViewModel' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_QuestHistoryCarouselEntry_C, BodyContent) == 0x0002E0, "Member 'UWBP_Modern_QuestHistoryCarouselEntry_C::BodyContent' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_QuestHistoryCarouselEntry_C, Date) == 0x0002E8, "Member 'UWBP_Modern_QuestHistoryCarouselEntry_C::Date' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_QuestHistoryCarouselEntry_C, HitBox) == 0x0002F0, "Member 'UWBP_Modern_QuestHistoryCarouselEntry_C::HitBox' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_QuestHistoryCarouselEntry_C, LeftDecorator) == 0x0002F8, "Member 'UWBP_Modern_QuestHistoryCarouselEntry_C::LeftDecorator' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_QuestHistoryCarouselEntry_C, QuestDetails) == 0x000300, "Member 'UWBP_Modern_QuestHistoryCarouselEntry_C::QuestDetails' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_QuestHistoryCarouselEntry_C, QuestDetailsScrollBox) == 0x000308, "Member 'UWBP_Modern_QuestHistoryCarouselEntry_C::QuestDetailsScrollBox' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_QuestHistoryCarouselEntry_C, RightDecorator) == 0x000310, "Member 'UWBP_Modern_QuestHistoryCarouselEntry_C::RightDecorator' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_QuestHistoryCarouselEntry_C, WBP_OriginalImageTile) == 0x000318, "Member 'UWBP_Modern_QuestHistoryCarouselEntry_C::WBP_OriginalImageTile' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_QuestHistoryCarouselEntry_C, WidgetSwitcher_1) == 0x000320, "Member 'UWBP_Modern_QuestHistoryCarouselEntry_C::WidgetSwitcher_1' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_QuestHistoryCarouselEntry_C, Year) == 0x000328, "Member 'UWBP_Modern_QuestHistoryCarouselEntry_C::Year' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_QuestHistoryCarouselEntry_C, Properties) == 0x000330, "Member 'UWBP_Modern_QuestHistoryCarouselEntry_C::Properties' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_QuestHistoryCarouselEntry_C, BaseFont) == 0x0003C8, "Member 'UWBP_Modern_QuestHistoryCarouselEntry_C::BaseFont' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_QuestHistoryCarouselEntry_C, BoldFont) == 0x000420, "Member 'UWBP_Modern_QuestHistoryCarouselEntry_C::BoldFont' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_QuestHistoryCarouselEntry_C, ParentCarousel) == 0x000478, "Member 'UWBP_Modern_QuestHistoryCarouselEntry_C::ParentCarousel' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_QuestHistoryCarouselEntry_C, TextScrollSpeedFactor) == 0x000480, "Member 'UWBP_Modern_QuestHistoryCarouselEntry_C::TextScrollSpeedFactor' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_QuestHistoryCarouselEntry_C, Index_0) == 0x000488, "Member 'UWBP_Modern_QuestHistoryCarouselEntry_C::Index_0' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_QuestHistoryCarouselEntry_C, LocalItemData) == 0x000490, "Member 'UWBP_Modern_QuestHistoryCarouselEntry_C::LocalItemData' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_QuestHistoryCarouselEntry_C, ParentListView) == 0x000498, "Member 'UWBP_Modern_QuestHistoryCarouselEntry_C::ParentListView' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_QuestHistoryCarouselEntry_C, NotSelectedOpacity) == 0x0004A0, "Member 'UWBP_Modern_QuestHistoryCarouselEntry_C::NotSelectedOpacity' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_QuestHistoryCarouselEntry_C, bIsSelected) == 0x0004A8, "Member 'UWBP_Modern_QuestHistoryCarouselEntry_C::bIsSelected' has a wrong offset!");

}

