#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModernHud_InfoIcon

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ModernHud_InfoIcon.WBP_ModernHud_InfoIcon_C
// 0x0058 (0x0340 - 0x02E8)
class UWBP_ModernHud_InfoIcon_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_AltarTextBlock_C*                  hudinfo_text;                                      // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 InfoIcon;                                          // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_Mid;                                        // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Text;                                              // 0x0308(0x0018)(Edit, BlueprintVisible)
	class UMaterialInstance*                      Material;                                          // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            TextColor;                                         // 0x0328(0x0014)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_WBP_ModernHud_InfoIcon(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetTextColour(const struct FLinearColor& Colour);
	void SetValue(const class FText& Value);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ModernHud_InfoIcon_C">();
	}
	static class UWBP_ModernHud_InfoIcon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ModernHud_InfoIcon_C>();
	}
};
static_assert(alignof(UWBP_ModernHud_InfoIcon_C) == 0x000008, "Wrong alignment on UWBP_ModernHud_InfoIcon_C");
static_assert(sizeof(UWBP_ModernHud_InfoIcon_C) == 0x000340, "Wrong size on UWBP_ModernHud_InfoIcon_C");
static_assert(offsetof(UWBP_ModernHud_InfoIcon_C, UberGraphFrame) == 0x0002E8, "Member 'UWBP_ModernHud_InfoIcon_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_InfoIcon_C, hudinfo_text) == 0x0002F0, "Member 'UWBP_ModernHud_InfoIcon_C::hudinfo_text' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_InfoIcon_C, InfoIcon) == 0x0002F8, "Member 'UWBP_ModernHud_InfoIcon_C::InfoIcon' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_InfoIcon_C, Spacer_Mid) == 0x000300, "Member 'UWBP_ModernHud_InfoIcon_C::Spacer_Mid' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_InfoIcon_C, Text) == 0x000308, "Member 'UWBP_ModernHud_InfoIcon_C::Text' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_InfoIcon_C, Material) == 0x000320, "Member 'UWBP_ModernHud_InfoIcon_C::Material' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_InfoIcon_C, TextColor) == 0x000328, "Member 'UWBP_ModernHud_InfoIcon_C::TextColor' has a wrong offset!");

}

