#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModernMenu_StatsPage2_Details

#include "Basic.hpp"

#include "Altar_structs.hpp"
#include "Altar_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ModernMenu_StatsPage2_Details.WBP_ModernMenu_StatsPage2_Details_C
// 0x0070 (0x0538 - 0x04C8)
class UWBP_ModernMenu_StatsPage2_Details_C final : public UVAltarWidget
{
public:
	class UWBP_AltarRichTextBlock_C*              stat_detailsp2_description;                        // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               stat_detailsp2_icon;                               // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AltarTextBlock_C*                  stat_detailsp2_title;                              // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               WBP_OriginalImageTile;                             // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMap<ELegacyStatsMenuPage1Items, struct FSlateBrush> IconMapPage1;                               // 0x04E8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void SetContent(const struct FLegacyStatsMenuPopupContent& Content);
	void SetImage(class UTexture2D* Texture);
	void SetModernContent(const class FText& TitleText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ModernMenu_StatsPage2_Details_C">();
	}
	static class UWBP_ModernMenu_StatsPage2_Details_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ModernMenu_StatsPage2_Details_C>();
	}
};
static_assert(alignof(UWBP_ModernMenu_StatsPage2_Details_C) == 0x000008, "Wrong alignment on UWBP_ModernMenu_StatsPage2_Details_C");
static_assert(sizeof(UWBP_ModernMenu_StatsPage2_Details_C) == 0x000538, "Wrong size on UWBP_ModernMenu_StatsPage2_Details_C");
static_assert(offsetof(UWBP_ModernMenu_StatsPage2_Details_C, stat_detailsp2_description) == 0x0004C8, "Member 'UWBP_ModernMenu_StatsPage2_Details_C::stat_detailsp2_description' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsPage2_Details_C, stat_detailsp2_icon) == 0x0004D0, "Member 'UWBP_ModernMenu_StatsPage2_Details_C::stat_detailsp2_icon' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsPage2_Details_C, stat_detailsp2_title) == 0x0004D8, "Member 'UWBP_ModernMenu_StatsPage2_Details_C::stat_detailsp2_title' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsPage2_Details_C, WBP_OriginalImageTile) == 0x0004E0, "Member 'UWBP_ModernMenu_StatsPage2_Details_C::WBP_OriginalImageTile' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsPage2_Details_C, IconMapPage1) == 0x0004E8, "Member 'UWBP_ModernMenu_StatsPage2_Details_C::IconMapPage1' has a wrong offset!");

}

