#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Altar_structs.hpp"


namespace SDK::Params
{

// Function WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects.WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C.ExecuteUbergraph_WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects
// 0x0018 (0x0018 - 0x0000)
struct WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FModernEffectItemData>          K2Node_CustomEvent_NewItems;                       // 0x0008(0x0010)(ConstParm, ReferenceParm)
};
static_assert(alignof(WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects) == 0x000008, "Wrong alignment on WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects");
static_assert(sizeof(WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects) == 0x000018, "Wrong size on WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects, EntryPoint) == 0x000000, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects, K2Node_CustomEvent_NewItems) == 0x000008, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects::K2Node_CustomEvent_NewItems' has a wrong offset!");

// Function WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects.WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C.HideAllEffects
// 0x0050 (0x0050 - 0x0000)
struct WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_HideAllEffects final
{
public:
	class UWidget*                                Local_CurrentWidget;                               // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ModernMenu_AddedEffects_Small_C*   CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue_1;              // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue_2;              // 0x0037(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_2;          // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_OriginalImageTile_C*               CallFunc_Array_Get_Item_1;                         // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_HideAllEffects) == 0x000008, "Wrong alignment on WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_HideAllEffects");
static_assert(sizeof(WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_HideAllEffects) == 0x000050, "Wrong size on WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_HideAllEffects");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_HideAllEffects, Local_CurrentWidget) == 0x000000, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_HideAllEffects::Local_CurrentWidget' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_HideAllEffects, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_HideAllEffects::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_HideAllEffects, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_HideAllEffects::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_HideAllEffects, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_HideAllEffects::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_HideAllEffects, Temp_int_Array_Index_Variable_1) == 0x000014, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_HideAllEffects::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_HideAllEffects, Temp_int_Loop_Counter_Variable_1) == 0x000018, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_HideAllEffects::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_HideAllEffects, CallFunc_Array_Get_Item) == 0x000020, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_HideAllEffects::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_HideAllEffects, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_HideAllEffects::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_HideAllEffects, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_HideAllEffects::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_HideAllEffects, CallFunc_Add_IntInt_ReturnValue_1) == 0x000030, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_HideAllEffects::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_HideAllEffects, CallFunc_GetVisibility_ReturnValue) == 0x000034, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_HideAllEffects::CallFunc_GetVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_HideAllEffects, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000035, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_HideAllEffects::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_HideAllEffects, CallFunc_GetVisibility_ReturnValue_1) == 0x000036, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_HideAllEffects::CallFunc_GetVisibility_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_HideAllEffects, CallFunc_GetVisibility_ReturnValue_2) == 0x000037, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_HideAllEffects::CallFunc_GetVisibility_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_HideAllEffects, CallFunc_NotEqual_ByteByte_ReturnValue_1) == 0x000038, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_HideAllEffects::CallFunc_NotEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_HideAllEffects, CallFunc_NotEqual_ByteByte_ReturnValue_2) == 0x000039, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_HideAllEffects::CallFunc_NotEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_HideAllEffects, CallFunc_Array_Get_Item_1) == 0x000040, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_HideAllEffects::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_HideAllEffects, CallFunc_Array_Length_ReturnValue_1) == 0x000048, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_HideAllEffects::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_HideAllEffects, CallFunc_Less_IntInt_ReturnValue_1) == 0x00004C, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_HideAllEffects::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects.WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C.MakeEffectsArray
// 0x0010 (0x0010 - 0x0000)
struct WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_MakeEffectsArray final
{
public:
	TArray<class UWBP_ModernMenu_AddedEffects_Small_C*> K2Node_MakeArray_Array;                      // 0x0000(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_MakeEffectsArray) == 0x000008, "Wrong alignment on WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_MakeEffectsArray");
static_assert(sizeof(WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_MakeEffectsArray) == 0x000010, "Wrong size on WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_MakeEffectsArray");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_MakeEffectsArray, K2Node_MakeArray_Array) == 0x000000, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_MakeEffectsArray::K2Node_MakeArray_Array' has a wrong offset!");

// Function WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects.WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C.MakeSeperatorsArray
// 0x0010 (0x0010 - 0x0000)
struct WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_MakeSeperatorsArray final
{
public:
	TArray<class UWBP_OriginalImageTile_C*>       K2Node_MakeArray_Array;                            // 0x0000(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_MakeSeperatorsArray) == 0x000008, "Wrong alignment on WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_MakeSeperatorsArray");
static_assert(sizeof(WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_MakeSeperatorsArray) == 0x000010, "Wrong size on WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_MakeSeperatorsArray");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_MakeSeperatorsArray, K2Node_MakeArray_Array) == 0x000000, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_MakeSeperatorsArray::K2Node_MakeArray_Array' has a wrong offset!");

// Function WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects.WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C.TryToInitLists
// 0x0001 (0x0001 - 0x0000)
struct WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_TryToInitLists final
{
public:
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_TryToInitLists) == 0x000001, "Wrong alignment on WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_TryToInitLists");
static_assert(sizeof(WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_TryToInitLists) == 0x000001, "Wrong size on WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_TryToInitLists");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_TryToInitLists, CallFunc_Not_PreBool_ReturnValue) == 0x000000, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_TryToInitLists::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects.WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C.UpdateEffects
// 0x0120 (0x0120 - 0x0000)
struct WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_UpdateEffects final
{
public:
	TArray<struct FModernEffectItemData>          NewItems;                                          // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         Local_Index;                                       // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ModernMenu_AddedEffects_C*         Local_AddedEffectWidget;                           // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FModernEffectItemData                  Local_EffectItem;                                  // 0x0020(0x0060)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ModernMenu_AddedEffects_Small_C*   CallFunc_Array_Get_Item;                           // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_OriginalImageTile_C*               CallFunc_Array_Get_Item_1;                         // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_ModernMenu_AddedEffects_Small_C*   CallFunc_Array_Get_Item_2;                         // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FModernEffectItemData                  CallFunc_Array_Get_Item_3;                         // 0x00B8(0x0060)()
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_UpdateEffects) == 0x000008, "Wrong alignment on WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_UpdateEffects");
static_assert(sizeof(WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_UpdateEffects) == 0x000120, "Wrong size on WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_UpdateEffects");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_UpdateEffects, NewItems) == 0x000000, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_UpdateEffects::NewItems' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_UpdateEffects, Local_Index) == 0x000010, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_UpdateEffects::Local_Index' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_UpdateEffects, Local_AddedEffectWidget) == 0x000018, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_UpdateEffects::Local_AddedEffectWidget' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_UpdateEffects, Local_EffectItem) == 0x000020, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_UpdateEffects::Local_EffectItem' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_UpdateEffects, Temp_int_Array_Index_Variable) == 0x000080, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_UpdateEffects::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_UpdateEffects, Temp_int_Loop_Counter_Variable) == 0x000084, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_UpdateEffects::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_UpdateEffects, CallFunc_Add_IntInt_ReturnValue) == 0x000088, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_UpdateEffects::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_UpdateEffects, CallFunc_Array_Get_Item) == 0x000090, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_UpdateEffects::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_UpdateEffects, CallFunc_Array_Length_ReturnValue) == 0x000098, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_UpdateEffects::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_UpdateEffects, CallFunc_Less_IntInt_ReturnValue) == 0x00009C, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_UpdateEffects::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_UpdateEffects, CallFunc_Array_Get_Item_1) == 0x0000A0, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_UpdateEffects::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_UpdateEffects, CallFunc_Array_Get_Item_2) == 0x0000A8, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_UpdateEffects::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_UpdateEffects, CallFunc_Array_Length_ReturnValue_1) == 0x0000B0, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_UpdateEffects::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_UpdateEffects, CallFunc_Array_Get_Item_3) == 0x0000B8, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_UpdateEffects::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_UpdateEffects, CallFunc_Array_Length_ReturnValue_2) == 0x000118, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_UpdateEffects::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_UpdateEffects, CallFunc_Less_IntInt_ReturnValue_1) == 0x00011C, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_UpdateEffects::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects.WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C.UpdateListView
// 0x0010 (0x0010 - 0x0000)
struct WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_UpdateListView final
{
public:
	TArray<struct FModernEffectItemData>          NewItems;                                          // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_UpdateListView) == 0x000008, "Wrong alignment on WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_UpdateListView");
static_assert(sizeof(WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_UpdateListView) == 0x000010, "Wrong size on WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_UpdateListView");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_UpdateListView, NewItems) == 0x000000, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C_UpdateListView::NewItems' has a wrong offset!");

}

