#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModernHud_CompassCardinalLine

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ModernHud_CompassCardinalLine.WBP_ModernHud_CompassCardinalLine_C
// 0x0030 (0x0318 - 0x02E8)
class UWBP_ModernHud_CompassCardinalLine_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 CompassPoints;                                     // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CompassPoints1;                                    // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CompassPoints2;                                    // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CompassPoints3;                                    // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAnimatableRetainerBox*                 FaceRetainer;                                      // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_ModernHud_CompassCardinalLine(int32 EntryPoint);
	void OnInitialized();
	void UpdatePosition(double position);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ModernHud_CompassCardinalLine_C">();
	}
	static class UWBP_ModernHud_CompassCardinalLine_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ModernHud_CompassCardinalLine_C>();
	}
};
static_assert(alignof(UWBP_ModernHud_CompassCardinalLine_C) == 0x000008, "Wrong alignment on UWBP_ModernHud_CompassCardinalLine_C");
static_assert(sizeof(UWBP_ModernHud_CompassCardinalLine_C) == 0x000318, "Wrong size on UWBP_ModernHud_CompassCardinalLine_C");
static_assert(offsetof(UWBP_ModernHud_CompassCardinalLine_C, UberGraphFrame) == 0x0002E8, "Member 'UWBP_ModernHud_CompassCardinalLine_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_CompassCardinalLine_C, CompassPoints) == 0x0002F0, "Member 'UWBP_ModernHud_CompassCardinalLine_C::CompassPoints' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_CompassCardinalLine_C, CompassPoints1) == 0x0002F8, "Member 'UWBP_ModernHud_CompassCardinalLine_C::CompassPoints1' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_CompassCardinalLine_C, CompassPoints2) == 0x000300, "Member 'UWBP_ModernHud_CompassCardinalLine_C::CompassPoints2' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_CompassCardinalLine_C, CompassPoints3) == 0x000308, "Member 'UWBP_ModernHud_CompassCardinalLine_C::CompassPoints3' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_CompassCardinalLine_C, FaceRetainer) == 0x000310, "Member 'UWBP_ModernHud_CompassCardinalLine_C::FaceRetainer' has a wrong offset!");

}

