#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModernHud_Subtitle

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ModernHud_Subtitle.WBP_ModernHud_Subtitle_C
// 0x0138 (0x0420 - 0x02E8)
class UWBP_ModernHud_Subtitle_C final : public UCommonUserWidget
{
public:
	class UVHUDSubtitleViewModel*                 VHUDSubtitleViewModel;                             // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hide;                                              // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Show;                                              // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SubtitleFade;                                      // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_AltarTextBlock_C*                  hudsubtitle_text;                                  // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Root;                                              // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint8                                         Pad_318[0x8];                                      // 0x0318(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            NoticeIcon;                                        // 0x0320(0x00D0)(Edit, BlueprintVisible)
	class FText                                   NoticeText;                                        // 0x03F0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVector2D                              DefaultSubtitlePositon;                            // 0x0408(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Fade_Speed;                                        // 0x0418(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LastVisibility;                                    // 0x041C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ShowHide(bool InVisibility);
	void Update_Subtitle_Visibility(bool InVisibility);
	void UpdateSubtitle(const class FText& InText);

	struct FVector2D GetNewSubtitlePosition(double TopOfInfoMenu) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ModernHud_Subtitle_C">();
	}
	static class UWBP_ModernHud_Subtitle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ModernHud_Subtitle_C>();
	}
};
static_assert(alignof(UWBP_ModernHud_Subtitle_C) == 0x000010, "Wrong alignment on UWBP_ModernHud_Subtitle_C");
static_assert(sizeof(UWBP_ModernHud_Subtitle_C) == 0x000420, "Wrong size on UWBP_ModernHud_Subtitle_C");
static_assert(offsetof(UWBP_ModernHud_Subtitle_C, VHUDSubtitleViewModel) == 0x0002E8, "Member 'UWBP_ModernHud_Subtitle_C::VHUDSubtitleViewModel' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_Subtitle_C, Hide) == 0x0002F0, "Member 'UWBP_ModernHud_Subtitle_C::Hide' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_Subtitle_C, Show) == 0x0002F8, "Member 'UWBP_ModernHud_Subtitle_C::Show' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_Subtitle_C, SubtitleFade) == 0x000300, "Member 'UWBP_ModernHud_Subtitle_C::SubtitleFade' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_Subtitle_C, hudsubtitle_text) == 0x000308, "Member 'UWBP_ModernHud_Subtitle_C::hudsubtitle_text' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_Subtitle_C, Root) == 0x000310, "Member 'UWBP_ModernHud_Subtitle_C::Root' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_Subtitle_C, NoticeIcon) == 0x000320, "Member 'UWBP_ModernHud_Subtitle_C::NoticeIcon' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_Subtitle_C, NoticeText) == 0x0003F0, "Member 'UWBP_ModernHud_Subtitle_C::NoticeText' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_Subtitle_C, DefaultSubtitlePositon) == 0x000408, "Member 'UWBP_ModernHud_Subtitle_C::DefaultSubtitlePositon' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_Subtitle_C, Fade_Speed) == 0x000418, "Member 'UWBP_ModernHud_Subtitle_C::Fade_Speed' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_Subtitle_C, LastVisibility) == 0x00041C, "Member 'UWBP_ModernHud_Subtitle_C::LastVisibility' has a wrong offset!");

}

