#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModernPrefab_FocusButton_Header

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_ModernPrefab_FocusButton_Header.WBP_ModernPrefab_FocusButton_Header_C.ExecuteUbergraph_WBP_ModernPrefab_FocusButton_Header
// 0x0008 (0x0008 - 0x0000)
struct WBP_ModernPrefab_FocusButton_Header_C_ExecuteUbergraph_WBP_ModernPrefab_FocusButton_Header final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernPrefab_FocusButton_Header_C_ExecuteUbergraph_WBP_ModernPrefab_FocusButton_Header) == 0x000004, "Wrong alignment on WBP_ModernPrefab_FocusButton_Header_C_ExecuteUbergraph_WBP_ModernPrefab_FocusButton_Header");
static_assert(sizeof(WBP_ModernPrefab_FocusButton_Header_C_ExecuteUbergraph_WBP_ModernPrefab_FocusButton_Header) == 0x000008, "Wrong size on WBP_ModernPrefab_FocusButton_Header_C_ExecuteUbergraph_WBP_ModernPrefab_FocusButton_Header");
static_assert(offsetof(WBP_ModernPrefab_FocusButton_Header_C_ExecuteUbergraph_WBP_ModernPrefab_FocusButton_Header, EntryPoint) == 0x000000, "Member 'WBP_ModernPrefab_FocusButton_Header_C_ExecuteUbergraph_WBP_ModernPrefab_FocusButton_Header::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ModernPrefab_FocusButton_Header_C_ExecuteUbergraph_WBP_ModernPrefab_FocusButton_Header, CallFunc_Not_PreBool_ReturnValue) == 0x000004, "Member 'WBP_ModernPrefab_FocusButton_Header_C_ExecuteUbergraph_WBP_ModernPrefab_FocusButton_Header::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernPrefab_FocusButton_Header_C_ExecuteUbergraph_WBP_ModernPrefab_FocusButton_Header, CallFunc_Not_PreBool_ReturnValue_1) == 0x000005, "Member 'WBP_ModernPrefab_FocusButton_Header_C_ExecuteUbergraph_WBP_ModernPrefab_FocusButton_Header::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernPrefab_FocusButton_Header_C_ExecuteUbergraph_WBP_ModernPrefab_FocusButton_Header, CallFunc_BooleanAND_ReturnValue) == 0x000006, "Member 'WBP_ModernPrefab_FocusButton_Header_C_ExecuteUbergraph_WBP_ModernPrefab_FocusButton_Header::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_ModernPrefab_FocusButton_Header.WBP_ModernPrefab_FocusButton_Header_C.HoverEffect
// 0x0028 (0x0028 - 0x0000)
struct WBP_ModernPrefab_FocusButton_Header_C_HoverEffect final
{
public:
	bool                                          IsHovered_0;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInstant;                                         // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_1;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          K2Node_Select_Default;                             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimation_StartAtTime_ImplicitCast;   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernPrefab_FocusButton_Header_C_HoverEffect) == 0x000008, "Wrong alignment on WBP_ModernPrefab_FocusButton_Header_C_HoverEffect");
static_assert(sizeof(WBP_ModernPrefab_FocusButton_Header_C_HoverEffect) == 0x000028, "Wrong size on WBP_ModernPrefab_FocusButton_Header_C_HoverEffect");
static_assert(offsetof(WBP_ModernPrefab_FocusButton_Header_C_HoverEffect, IsHovered_0) == 0x000000, "Member 'WBP_ModernPrefab_FocusButton_Header_C_HoverEffect::IsHovered_0' has a wrong offset!");
static_assert(offsetof(WBP_ModernPrefab_FocusButton_Header_C_HoverEffect, IsInstant) == 0x000001, "Member 'WBP_ModernPrefab_FocusButton_Header_C_HoverEffect::IsInstant' has a wrong offset!");
static_assert(offsetof(WBP_ModernPrefab_FocusButton_Header_C_HoverEffect, Temp_bool_Variable) == 0x000002, "Member 'WBP_ModernPrefab_FocusButton_Header_C_HoverEffect::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernPrefab_FocusButton_Header_C_HoverEffect, Temp_byte_Variable) == 0x000003, "Member 'WBP_ModernPrefab_FocusButton_Header_C_HoverEffect::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernPrefab_FocusButton_Header_C_HoverEffect, Temp_byte_Variable_1) == 0x000004, "Member 'WBP_ModernPrefab_FocusButton_Header_C_HoverEffect::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernPrefab_FocusButton_Header_C_HoverEffect, CallFunc_SelectFloat_ReturnValue) == 0x000008, "Member 'WBP_ModernPrefab_FocusButton_Header_C_HoverEffect::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernPrefab_FocusButton_Header_C_HoverEffect, K2Node_Select_Default) == 0x000010, "Member 'WBP_ModernPrefab_FocusButton_Header_C_HoverEffect::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_ModernPrefab_FocusButton_Header_C_HoverEffect, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'WBP_ModernPrefab_FocusButton_Header_C_HoverEffect::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernPrefab_FocusButton_Header_C_HoverEffect, CallFunc_PlayAnimation_StartAtTime_ImplicitCast) == 0x000020, "Member 'WBP_ModernPrefab_FocusButton_Header_C_HoverEffect::CallFunc_PlayAnimation_StartAtTime_ImplicitCast' has a wrong offset!");

// Function WBP_ModernPrefab_FocusButton_Header.WBP_ModernPrefab_FocusButton_Header_C.SetButtonActive
// 0x0001 (0x0001 - 0x0000)
struct WBP_ModernPrefab_FocusButton_Header_C_SetButtonActive final
{
public:
	bool                                          NewIsActive;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernPrefab_FocusButton_Header_C_SetButtonActive) == 0x000001, "Wrong alignment on WBP_ModernPrefab_FocusButton_Header_C_SetButtonActive");
static_assert(sizeof(WBP_ModernPrefab_FocusButton_Header_C_SetButtonActive) == 0x000001, "Wrong size on WBP_ModernPrefab_FocusButton_Header_C_SetButtonActive");
static_assert(offsetof(WBP_ModernPrefab_FocusButton_Header_C_SetButtonActive, NewIsActive) == 0x000000, "Member 'WBP_ModernPrefab_FocusButton_Header_C_SetButtonActive::NewIsActive' has a wrong offset!");

// Function WBP_ModernPrefab_FocusButton_Header.WBP_ModernPrefab_FocusButton_Header_C.SetButtonFocus
// 0x0028 (0x0028 - 0x0000)
struct WBP_ModernPrefab_FocusButton_Header_C_SetButtonFocus final
{
public:
	bool                                          NewIsCurrentTab;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInstant;                                         // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_1;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          K2Node_Select_Default;                             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHovered_ReturnValue;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_PlayAnimation_StartAtTime_ImplicitCast;   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernPrefab_FocusButton_Header_C_SetButtonFocus) == 0x000008, "Wrong alignment on WBP_ModernPrefab_FocusButton_Header_C_SetButtonFocus");
static_assert(sizeof(WBP_ModernPrefab_FocusButton_Header_C_SetButtonFocus) == 0x000028, "Wrong size on WBP_ModernPrefab_FocusButton_Header_C_SetButtonFocus");
static_assert(offsetof(WBP_ModernPrefab_FocusButton_Header_C_SetButtonFocus, NewIsCurrentTab) == 0x000000, "Member 'WBP_ModernPrefab_FocusButton_Header_C_SetButtonFocus::NewIsCurrentTab' has a wrong offset!");
static_assert(offsetof(WBP_ModernPrefab_FocusButton_Header_C_SetButtonFocus, IsInstant) == 0x000001, "Member 'WBP_ModernPrefab_FocusButton_Header_C_SetButtonFocus::IsInstant' has a wrong offset!");
static_assert(offsetof(WBP_ModernPrefab_FocusButton_Header_C_SetButtonFocus, Temp_bool_Variable) == 0x000002, "Member 'WBP_ModernPrefab_FocusButton_Header_C_SetButtonFocus::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernPrefab_FocusButton_Header_C_SetButtonFocus, Temp_byte_Variable) == 0x000003, "Member 'WBP_ModernPrefab_FocusButton_Header_C_SetButtonFocus::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernPrefab_FocusButton_Header_C_SetButtonFocus, Temp_byte_Variable_1) == 0x000004, "Member 'WBP_ModernPrefab_FocusButton_Header_C_SetButtonFocus::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernPrefab_FocusButton_Header_C_SetButtonFocus, K2Node_Select_Default) == 0x000005, "Member 'WBP_ModernPrefab_FocusButton_Header_C_SetButtonFocus::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_ModernPrefab_FocusButton_Header_C_SetButtonFocus, CallFunc_SelectFloat_ReturnValue) == 0x000008, "Member 'WBP_ModernPrefab_FocusButton_Header_C_SetButtonFocus::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernPrefab_FocusButton_Header_C_SetButtonFocus, CallFunc_IsHovered_ReturnValue) == 0x000010, "Member 'WBP_ModernPrefab_FocusButton_Header_C_SetButtonFocus::CallFunc_IsHovered_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernPrefab_FocusButton_Header_C_SetButtonFocus, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'WBP_ModernPrefab_FocusButton_Header_C_SetButtonFocus::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernPrefab_FocusButton_Header_C_SetButtonFocus, CallFunc_Not_PreBool_ReturnValue) == 0x000020, "Member 'WBP_ModernPrefab_FocusButton_Header_C_SetButtonFocus::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernPrefab_FocusButton_Header_C_SetButtonFocus, CallFunc_PlayAnimation_StartAtTime_ImplicitCast) == 0x000024, "Member 'WBP_ModernPrefab_FocusButton_Header_C_SetButtonFocus::CallFunc_PlayAnimation_StartAtTime_ImplicitCast' has a wrong offset!");

}

