#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_OriginalMenu_Inventory_FilterIcon

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "CommonInput_structs.hpp"
#include "Altar_structs.hpp"
#include "WBP_ModernPrefab_NavigableButton_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_OriginalMenu_Inventory_FilterIcon.WBP_OriginalMenu_Inventory_FilterIcon_C
// 0x09F0 (0x20B0 - 0x16C0)
class UWBP_OriginalMenu_Inventory_FilterIcon_C final : public UWBP_ModernPrefab_NavigableButton_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_OriginalMenu_Inventory_FilterIcon_C; // 0x16C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UOverlay*                               filterIcon_arrows_overlay;                         // 0x16C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               filterIcon_background;                             // 0x16D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               filterIcon_downArrow;                              // 0x16D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               filterIcon_image;                                  // 0x16E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               filterIcon_upArrow;                                // 0x16E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalMenu_Inventory_Filter_C*   Filter;                                            // 0x16F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonUserWidget*                      ParentWrapper;                                     // 0x16F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FOriginal_InventoryFilterTableRow      DesignData;                                        // 0x1700(0x09A0)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IsFilterActivated;                                 // 0x20A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ActivateFilter();
	void Toggle_Activated_State();
	void HideArrows();
	void SwapArrows();
	void UpdateDesign(bool ActivatedState);
	void SetIsReversed(bool IsReversed);
	void InitializeFilterIcon(class UWBP_OriginalMenu_Inventory_Filter_C* AssociatedFilter, const struct FOriginal_InventoryFilterTableRow& Design);
	void BP_OnClicked();
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_WBP_OriginalMenu_Inventory_FilterIcon(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_OriginalMenu_Inventory_FilterIcon_C">();
	}
	static class UWBP_OriginalMenu_Inventory_FilterIcon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_OriginalMenu_Inventory_FilterIcon_C>();
	}
};
static_assert(alignof(UWBP_OriginalMenu_Inventory_FilterIcon_C) == 0x000010, "Wrong alignment on UWBP_OriginalMenu_Inventory_FilterIcon_C");
static_assert(sizeof(UWBP_OriginalMenu_Inventory_FilterIcon_C) == 0x0020B0, "Wrong size on UWBP_OriginalMenu_Inventory_FilterIcon_C");
static_assert(offsetof(UWBP_OriginalMenu_Inventory_FilterIcon_C, UberGraphFrame_WBP_OriginalMenu_Inventory_FilterIcon_C) == 0x0016C0, "Member 'UWBP_OriginalMenu_Inventory_FilterIcon_C::UberGraphFrame_WBP_OriginalMenu_Inventory_FilterIcon_C' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_Inventory_FilterIcon_C, filterIcon_arrows_overlay) == 0x0016C8, "Member 'UWBP_OriginalMenu_Inventory_FilterIcon_C::filterIcon_arrows_overlay' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_Inventory_FilterIcon_C, filterIcon_background) == 0x0016D0, "Member 'UWBP_OriginalMenu_Inventory_FilterIcon_C::filterIcon_background' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_Inventory_FilterIcon_C, filterIcon_downArrow) == 0x0016D8, "Member 'UWBP_OriginalMenu_Inventory_FilterIcon_C::filterIcon_downArrow' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_Inventory_FilterIcon_C, filterIcon_image) == 0x0016E0, "Member 'UWBP_OriginalMenu_Inventory_FilterIcon_C::filterIcon_image' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_Inventory_FilterIcon_C, filterIcon_upArrow) == 0x0016E8, "Member 'UWBP_OriginalMenu_Inventory_FilterIcon_C::filterIcon_upArrow' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_Inventory_FilterIcon_C, Filter) == 0x0016F0, "Member 'UWBP_OriginalMenu_Inventory_FilterIcon_C::Filter' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_Inventory_FilterIcon_C, ParentWrapper) == 0x0016F8, "Member 'UWBP_OriginalMenu_Inventory_FilterIcon_C::ParentWrapper' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_Inventory_FilterIcon_C, DesignData) == 0x001700, "Member 'UWBP_OriginalMenu_Inventory_FilterIcon_C::DesignData' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_Inventory_FilterIcon_C, IsFilterActivated) == 0x0020A0, "Member 'UWBP_OriginalMenu_Inventory_FilterIcon_C::IsFilterActivated' has a wrong offset!");

}

