#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_OriginalMenu_InventoryDetails_Tooltip

#include "Basic.hpp"

#include "Altar_structs.hpp"
#include "CommonInput_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_OriginalMenu_InventoryDetails_Tooltip.WBP_OriginalMenu_InventoryDetails_Tooltip_C.BndEvt__WBP_OriginalMenu_InventoryDetails_Tooltip_inv_details_tooltip_enchantment_effects_K2Node_ComponentBoundEvent_1_OnEffectsUpdated__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_OriginalMenu_InventoryDetails_Tooltip_C_BndEvt__WBP_OriginalMenu_InventoryDetails_Tooltip_inv_details_tooltip_enchantment_effects_K2Node_ComponentBoundEvent_1_OnEffectsUpdated__DelegateSignature final
{
public:
	int32                                         EffectsNb;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OriginalMenu_InventoryDetails_Tooltip_C_BndEvt__WBP_OriginalMenu_InventoryDetails_Tooltip_inv_details_tooltip_enchantment_effects_K2Node_ComponentBoundEvent_1_OnEffectsUpdated__DelegateSignature) == 0x000004, "Wrong alignment on WBP_OriginalMenu_InventoryDetails_Tooltip_C_BndEvt__WBP_OriginalMenu_InventoryDetails_Tooltip_inv_details_tooltip_enchantment_effects_K2Node_ComponentBoundEvent_1_OnEffectsUpdated__DelegateSignature");
static_assert(sizeof(WBP_OriginalMenu_InventoryDetails_Tooltip_C_BndEvt__WBP_OriginalMenu_InventoryDetails_Tooltip_inv_details_tooltip_enchantment_effects_K2Node_ComponentBoundEvent_1_OnEffectsUpdated__DelegateSignature) == 0x000004, "Wrong size on WBP_OriginalMenu_InventoryDetails_Tooltip_C_BndEvt__WBP_OriginalMenu_InventoryDetails_Tooltip_inv_details_tooltip_enchantment_effects_K2Node_ComponentBoundEvent_1_OnEffectsUpdated__DelegateSignature");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_C_BndEvt__WBP_OriginalMenu_InventoryDetails_Tooltip_inv_details_tooltip_enchantment_effects_K2Node_ComponentBoundEvent_1_OnEffectsUpdated__DelegateSignature, EffectsNb) == 0x000000, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_C_BndEvt__WBP_OriginalMenu_InventoryDetails_Tooltip_inv_details_tooltip_enchantment_effects_K2Node_ComponentBoundEvent_1_OnEffectsUpdated__DelegateSignature::EffectsNb' has a wrong offset!");

// Function WBP_OriginalMenu_InventoryDetails_Tooltip.WBP_OriginalMenu_InventoryDetails_Tooltip_C.BndEvt__WBP_OriginalMenu_InventoryDetails_Tooltip_inv_details_tooltip_ingredient_effects_K2Node_ComponentBoundEvent_0_OnEffectsUpdated__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_OriginalMenu_InventoryDetails_Tooltip_C_BndEvt__WBP_OriginalMenu_InventoryDetails_Tooltip_inv_details_tooltip_ingredient_effects_K2Node_ComponentBoundEvent_0_OnEffectsUpdated__DelegateSignature final
{
public:
	int32                                         EffectsNb;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OriginalMenu_InventoryDetails_Tooltip_C_BndEvt__WBP_OriginalMenu_InventoryDetails_Tooltip_inv_details_tooltip_ingredient_effects_K2Node_ComponentBoundEvent_0_OnEffectsUpdated__DelegateSignature) == 0x000004, "Wrong alignment on WBP_OriginalMenu_InventoryDetails_Tooltip_C_BndEvt__WBP_OriginalMenu_InventoryDetails_Tooltip_inv_details_tooltip_ingredient_effects_K2Node_ComponentBoundEvent_0_OnEffectsUpdated__DelegateSignature");
static_assert(sizeof(WBP_OriginalMenu_InventoryDetails_Tooltip_C_BndEvt__WBP_OriginalMenu_InventoryDetails_Tooltip_inv_details_tooltip_ingredient_effects_K2Node_ComponentBoundEvent_0_OnEffectsUpdated__DelegateSignature) == 0x000004, "Wrong size on WBP_OriginalMenu_InventoryDetails_Tooltip_C_BndEvt__WBP_OriginalMenu_InventoryDetails_Tooltip_inv_details_tooltip_ingredient_effects_K2Node_ComponentBoundEvent_0_OnEffectsUpdated__DelegateSignature");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_C_BndEvt__WBP_OriginalMenu_InventoryDetails_Tooltip_inv_details_tooltip_ingredient_effects_K2Node_ComponentBoundEvent_0_OnEffectsUpdated__DelegateSignature, EffectsNb) == 0x000000, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_C_BndEvt__WBP_OriginalMenu_InventoryDetails_Tooltip_inv_details_tooltip_ingredient_effects_K2Node_ComponentBoundEvent_0_OnEffectsUpdated__DelegateSignature::EffectsNb' has a wrong offset!");

// Function WBP_OriginalMenu_InventoryDetails_Tooltip.WBP_OriginalMenu_InventoryDetails_Tooltip_C.ExecuteUbergraph_WBP_OriginalMenu_InventoryDetails_Tooltip
// 0x0048 (0x0048 - 0x0000)
struct WBP_OriginalMenu_InventoryDetails_Tooltip_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryDetails_Tooltip final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_EffectsNb_1;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_EffectsNb;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTESForm*                               K2Node_CustomEvent_ItemForm;                       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EFormID                                       CallFunc_GetFormType_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue; // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsHovered;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OriginalMenu_InventoryDetails_Tooltip_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryDetails_Tooltip) == 0x000008, "Wrong alignment on WBP_OriginalMenu_InventoryDetails_Tooltip_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryDetails_Tooltip");
static_assert(sizeof(WBP_OriginalMenu_InventoryDetails_Tooltip_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryDetails_Tooltip) == 0x000048, "Wrong size on WBP_OriginalMenu_InventoryDetails_Tooltip_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryDetails_Tooltip");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryDetails_Tooltip, EntryPoint) == 0x000000, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryDetails_Tooltip::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryDetails_Tooltip, Temp_byte_Variable) == 0x000004, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryDetails_Tooltip::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryDetails_Tooltip, Temp_byte_Variable_1) == 0x000005, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryDetails_Tooltip::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryDetails_Tooltip, K2Node_ComponentBoundEvent_EffectsNb_1) == 0x000008, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryDetails_Tooltip::K2Node_ComponentBoundEvent_EffectsNb_1' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryDetails_Tooltip, K2Node_ComponentBoundEvent_EffectsNb) == 0x00000C, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryDetails_Tooltip::K2Node_ComponentBoundEvent_EffectsNb' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryDetails_Tooltip, K2Node_CustomEvent_ItemForm) == 0x000010, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryDetails_Tooltip::K2Node_CustomEvent_ItemForm' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryDetails_Tooltip, CallFunc_GetFormType_ReturnValue) == 0x000018, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryDetails_Tooltip::CallFunc_GetFormType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryDetails_Tooltip, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryDetails_Tooltip::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryDetails_Tooltip, Temp_bool_Variable) == 0x00001A, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryDetails_Tooltip::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryDetails_Tooltip, CallFunc_GetPlayerController_ReturnValue) == 0x000020, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryDetails_Tooltip::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryDetails_Tooltip, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryDetails_Tooltip::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryDetails_Tooltip, CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue) == 0x000038, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryDetails_Tooltip::CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryDetails_Tooltip, K2Node_CustomEvent_IsHovered) == 0x000040, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryDetails_Tooltip::K2Node_CustomEvent_IsHovered' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryDetails_Tooltip, CallFunc_BooleanAND_ReturnValue) == 0x000041, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryDetails_Tooltip::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryDetails_Tooltip, K2Node_Select_Default) == 0x000042, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryDetails_Tooltip::K2Node_Select_Default' has a wrong offset!");

// Function WBP_OriginalMenu_InventoryDetails_Tooltip.WBP_OriginalMenu_InventoryDetails_Tooltip_C.OnInputMethodChanged
// 0x0008 (0x0008 - 0x0000)
struct WBP_OriginalMenu_InventoryDetails_Tooltip_C_OnInputMethodChanged final
{
public:
	ECommonInputType                              bNewInputType;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OriginalMenu_InventoryDetails_Tooltip_C_OnInputMethodChanged) == 0x000001, "Wrong alignment on WBP_OriginalMenu_InventoryDetails_Tooltip_C_OnInputMethodChanged");
static_assert(sizeof(WBP_OriginalMenu_InventoryDetails_Tooltip_C_OnInputMethodChanged) == 0x000008, "Wrong size on WBP_OriginalMenu_InventoryDetails_Tooltip_C_OnInputMethodChanged");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_C_OnInputMethodChanged, bNewInputType) == 0x000000, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_C_OnInputMethodChanged::bNewInputType' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_C_OnInputMethodChanged, Temp_byte_Variable) == 0x000001, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_C_OnInputMethodChanged::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_C_OnInputMethodChanged, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000002, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_C_OnInputMethodChanged::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_C_OnInputMethodChanged, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_C_OnInputMethodChanged::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_C_OnInputMethodChanged, Temp_bool_Variable) == 0x000004, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_C_OnInputMethodChanged::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_C_OnInputMethodChanged, CallFunc_BooleanAND_ReturnValue) == 0x000005, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_C_OnInputMethodChanged::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_C_OnInputMethodChanged, CallFunc_Not_PreBool_ReturnValue) == 0x000006, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_C_OnInputMethodChanged::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_C_OnInputMethodChanged, K2Node_Select_Default) == 0x000007, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_C_OnInputMethodChanged::K2Node_Select_Default' has a wrong offset!");

// Function WBP_OriginalMenu_InventoryDetails_Tooltip.WBP_OriginalMenu_InventoryDetails_Tooltip_C.OnMouseHoverListViewChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_OriginalMenu_InventoryDetails_Tooltip_C_OnMouseHoverListViewChanged final
{
public:
	bool                                          IsHovered_0;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OriginalMenu_InventoryDetails_Tooltip_C_OnMouseHoverListViewChanged) == 0x000001, "Wrong alignment on WBP_OriginalMenu_InventoryDetails_Tooltip_C_OnMouseHoverListViewChanged");
static_assert(sizeof(WBP_OriginalMenu_InventoryDetails_Tooltip_C_OnMouseHoverListViewChanged) == 0x000001, "Wrong size on WBP_OriginalMenu_InventoryDetails_Tooltip_C_OnMouseHoverListViewChanged");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_C_OnMouseHoverListViewChanged, IsHovered_0) == 0x000000, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_C_OnMouseHoverListViewChanged::IsHovered_0' has a wrong offset!");

// Function WBP_OriginalMenu_InventoryDetails_Tooltip.WBP_OriginalMenu_InventoryDetails_Tooltip_C.UpdateHoveredItem
// 0x0008 (0x0008 - 0x0000)
struct WBP_OriginalMenu_InventoryDetails_Tooltip_C_UpdateHoveredItem final
{
public:
	class UTESForm*                               ItemForm;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OriginalMenu_InventoryDetails_Tooltip_C_UpdateHoveredItem) == 0x000008, "Wrong alignment on WBP_OriginalMenu_InventoryDetails_Tooltip_C_UpdateHoveredItem");
static_assert(sizeof(WBP_OriginalMenu_InventoryDetails_Tooltip_C_UpdateHoveredItem) == 0x000008, "Wrong size on WBP_OriginalMenu_InventoryDetails_Tooltip_C_UpdateHoveredItem");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_C_UpdateHoveredItem, ItemForm) == 0x000000, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_C_UpdateHoveredItem::ItemForm' has a wrong offset!");

// Function WBP_OriginalMenu_InventoryDetails_Tooltip.WBP_OriginalMenu_InventoryDetails_Tooltip_C.UpdateLayout
// 0x0018 (0x0018 - 0x0000)
struct WBP_OriginalMenu_InventoryDetails_Tooltip_C_UpdateLayout final
{
public:
	EFormID                                       FormType;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_5;        // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_6;        // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_4;                  // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OriginalMenu_InventoryDetails_Tooltip_C_UpdateLayout) == 0x000001, "Wrong alignment on WBP_OriginalMenu_InventoryDetails_Tooltip_C_UpdateLayout");
static_assert(sizeof(WBP_OriginalMenu_InventoryDetails_Tooltip_C_UpdateLayout) == 0x000018, "Wrong size on WBP_OriginalMenu_InventoryDetails_Tooltip_C_UpdateLayout");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_C_UpdateLayout, FormType) == 0x000000, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_C_UpdateLayout::FormType' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_C_UpdateLayout, Temp_byte_Variable) == 0x000001, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_C_UpdateLayout::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_C_UpdateLayout, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_C_UpdateLayout::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_C_UpdateLayout, Temp_bool_Variable) == 0x000003, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_C_UpdateLayout::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_C_UpdateLayout, CallFunc_Greater_IntInt_ReturnValue) == 0x000004, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_C_UpdateLayout::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_C_UpdateLayout, CallFunc_BooleanAND_ReturnValue) == 0x000005, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_C_UpdateLayout::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_C_UpdateLayout, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000006, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_C_UpdateLayout::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_C_UpdateLayout, K2Node_Select_Default) == 0x000007, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_C_UpdateLayout::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_C_UpdateLayout, Temp_byte_Variable_2) == 0x000008, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_C_UpdateLayout::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_C_UpdateLayout, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000009, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_C_UpdateLayout::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_C_UpdateLayout, Temp_byte_Variable_3) == 0x00000A, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_C_UpdateLayout::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_C_UpdateLayout, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00000B, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_C_UpdateLayout::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_C_UpdateLayout, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x00000C, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_C_UpdateLayout::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_C_UpdateLayout, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x00000D, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_C_UpdateLayout::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_C_UpdateLayout, CallFunc_BooleanOR_ReturnValue) == 0x00000E, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_C_UpdateLayout::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_C_UpdateLayout, Temp_bool_Variable_1) == 0x00000F, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_C_UpdateLayout::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_C_UpdateLayout, CallFunc_EqualEqual_ByteByte_ReturnValue_4) == 0x000010, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_C_UpdateLayout::CallFunc_EqualEqual_ByteByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_C_UpdateLayout, K2Node_Select_Default_1) == 0x000011, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_C_UpdateLayout::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_C_UpdateLayout, CallFunc_BooleanOR_ReturnValue_1) == 0x000012, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_C_UpdateLayout::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_C_UpdateLayout, CallFunc_EqualEqual_ByteByte_ReturnValue_5) == 0x000013, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_C_UpdateLayout::CallFunc_EqualEqual_ByteByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_C_UpdateLayout, CallFunc_EqualEqual_ByteByte_ReturnValue_6) == 0x000014, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_C_UpdateLayout::CallFunc_EqualEqual_ByteByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_C_UpdateLayout, CallFunc_BooleanOR_ReturnValue_2) == 0x000015, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_C_UpdateLayout::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_C_UpdateLayout, CallFunc_BooleanOR_ReturnValue_3) == 0x000016, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_C_UpdateLayout::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_C_UpdateLayout, CallFunc_BooleanOR_ReturnValue_4) == 0x000017, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_C_UpdateLayout::CallFunc_BooleanOR_ReturnValue_4' has a wrong offset!");

// Function WBP_OriginalMenu_InventoryDetails_Tooltip.WBP_OriginalMenu_InventoryDetails_Tooltip_C.UpdateSpecificLayout
// 0x0018 (0x0018 - 0x0000)
struct WBP_OriginalMenu_InventoryDetails_Tooltip_C_UpdateSpecificLayout final
{
public:
	class UCommonUserWidget*                      ToolTipWidget_0;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         EffectsNb;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OriginalMenu_InventoryDetails_Tooltip_C_UpdateSpecificLayout) == 0x000008, "Wrong alignment on WBP_OriginalMenu_InventoryDetails_Tooltip_C_UpdateSpecificLayout");
static_assert(sizeof(WBP_OriginalMenu_InventoryDetails_Tooltip_C_UpdateSpecificLayout) == 0x000018, "Wrong size on WBP_OriginalMenu_InventoryDetails_Tooltip_C_UpdateSpecificLayout");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_C_UpdateSpecificLayout, ToolTipWidget_0) == 0x000000, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_C_UpdateSpecificLayout::ToolTipWidget_0' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_C_UpdateSpecificLayout, EffectsNb) == 0x000008, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_C_UpdateSpecificLayout::EffectsNb' has a wrong offset!");
