#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Modern_Settings_SaveLoadPopup

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "Altar_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Modern_Settings_SaveLoadPopup.WBP_Modern_Settings_SaveLoadPopup_C
// 0x0058 (0x0520 - 0x04C8)
class UWBP_Modern_Settings_SaveLoadPopup_C final : public UVAltarWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       PopupFadeInOut;                                    // 0x04D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_AltarRichTextBlock_C*              message_text;                                      // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModernPrefab_Button_C*             saveload_confirm_no_button;                        // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModernPrefab_Button_C*             saveload_confirm_yes_button;                       // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(int32 ButtonIndex)> OnButtonClicked;                               // 0x04F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         ModIndex;                                          // 0x0500(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_504[0x4];                                      // 0x0504(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   PopupText;                                         // 0x0508(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void BndEvt__WBP_Modern_Settings_SaveLoadPopup_saveload_confirm_no_button_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_Modern_Settings_SaveLoadPopup_saveload_confirm_yes_button_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BP_OnActivated();
	bool BP_OnHandleBackAction();
	void BP_OnTirggeringActionCommited();
	void Construct();
	void ExecuteUbergraph_WBP_Modern_Settings_SaveLoadPopup(int32 EntryPoint);
	void MenuFadeInOut(bool InIsVisible, double* AnimationTime);
	void Set_Popup_Text(const class FText& NewPopupText);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Modern_Settings_SaveLoadPopup_C">();
	}
	static class UWBP_Modern_Settings_SaveLoadPopup_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Modern_Settings_SaveLoadPopup_C>();
	}
};
static_assert(alignof(UWBP_Modern_Settings_SaveLoadPopup_C) == 0x000008, "Wrong alignment on UWBP_Modern_Settings_SaveLoadPopup_C");
static_assert(sizeof(UWBP_Modern_Settings_SaveLoadPopup_C) == 0x000520, "Wrong size on UWBP_Modern_Settings_SaveLoadPopup_C");
static_assert(offsetof(UWBP_Modern_Settings_SaveLoadPopup_C, UberGraphFrame) == 0x0004C8, "Member 'UWBP_Modern_Settings_SaveLoadPopup_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_SaveLoadPopup_C, PopupFadeInOut) == 0x0004D0, "Member 'UWBP_Modern_Settings_SaveLoadPopup_C::PopupFadeInOut' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_SaveLoadPopup_C, message_text) == 0x0004D8, "Member 'UWBP_Modern_Settings_SaveLoadPopup_C::message_text' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_SaveLoadPopup_C, saveload_confirm_no_button) == 0x0004E0, "Member 'UWBP_Modern_Settings_SaveLoadPopup_C::saveload_confirm_no_button' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_SaveLoadPopup_C, saveload_confirm_yes_button) == 0x0004E8, "Member 'UWBP_Modern_Settings_SaveLoadPopup_C::saveload_confirm_yes_button' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_SaveLoadPopup_C, OnButtonClicked) == 0x0004F0, "Member 'UWBP_Modern_Settings_SaveLoadPopup_C::OnButtonClicked' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_SaveLoadPopup_C, ModIndex) == 0x000500, "Member 'UWBP_Modern_Settings_SaveLoadPopup_C::ModIndex' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_SaveLoadPopup_C, PopupText) == 0x000508, "Member 'UWBP_Modern_Settings_SaveLoadPopup_C::PopupText' has a wrong offset!");

}

