#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModernPrefab_Button

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "WBP_ModernPrefab_NavigableButton_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ModernPrefab_Button.WBP_ModernPrefab_Button_C
// 0x00F0 (0x17B0 - 0x16C0)
class UWBP_ModernPrefab_Button_C final : public UWBP_ModernPrefab_NavigableButton_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_ModernPrefab_Button_C;          // 0x16C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           button_background_panel;                           // 0x16C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         button_long_off;                                   // 0x16D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         button_long_on;                                    // 0x16D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModernPrefab_ControllerInputHint_C* ControllerInput;                                  // 0x16E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               State_Default_Left_FIll;                           // 0x16E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               State_Default_Left_LineBottom;                     // 0x16F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               State_Default_Left_LineTop;                        // 0x16F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               State_Default_Middle_FIll;                         // 0x1700(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               State_Default_Middle_LineBottom;                   // 0x1708(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               State_Default_Middle_LineTop;                      // 0x1710(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               State_Default_Right_FIll;                          // 0x1718(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               State_Default_Right_LineBottom;                    // 0x1720(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               State_Default_Right_LineTop;                       // 0x1728(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               State_Hover_Left_Arrow;                            // 0x1730(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               State_Hover_Left_Fill;                             // 0x1738(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               State_Hover_Left_LineBottom;                       // 0x1740(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               State_Hover_Left_LineTop;                          // 0x1748(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               State_Hover_Middle_FIll;                           // 0x1750(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               State_Hover_Middle_LineBottom;                     // 0x1758(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               State_Hover_Middle_LineTop;                        // 0x1760(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               State_Hover_Right_Arrow;                           // 0x1768(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               State_Hover_Right_Fill;                            // 0x1770(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               State_Hover_Right_LineBottom;                      // 0x1778(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               State_Hover_Right_LineTop;                         // 0x1780(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AltarTextBlock_C*                  Text;                                              // 0x1788(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           FontColor;                                         // 0x1790(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DisplayKeyboardInput;                              // 0x17A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17A1[0x7];                                     // 0x17A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           HintKeyInputAction;                                // 0x17A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnHovered();
	void ExecuteUbergraph_WBP_ModernPrefab_Button(int32 EntryPoint);
	void OnInitButtonWidgets();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ModernPrefab_Button_C">();
	}
	static class UWBP_ModernPrefab_Button_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ModernPrefab_Button_C>();
	}
};
static_assert(alignof(UWBP_ModernPrefab_Button_C) == 0x000010, "Wrong alignment on UWBP_ModernPrefab_Button_C");
static_assert(sizeof(UWBP_ModernPrefab_Button_C) == 0x0017B0, "Wrong size on UWBP_ModernPrefab_Button_C");
static_assert(offsetof(UWBP_ModernPrefab_Button_C, UberGraphFrame_WBP_ModernPrefab_Button_C) == 0x0016C0, "Member 'UWBP_ModernPrefab_Button_C::UberGraphFrame_WBP_ModernPrefab_Button_C' has a wrong offset!");
static_assert(offsetof(UWBP_ModernPrefab_Button_C, button_background_panel) == 0x0016C8, "Member 'UWBP_ModernPrefab_Button_C::button_background_panel' has a wrong offset!");
static_assert(offsetof(UWBP_ModernPrefab_Button_C, button_long_off) == 0x0016D0, "Member 'UWBP_ModernPrefab_Button_C::button_long_off' has a wrong offset!");
static_assert(offsetof(UWBP_ModernPrefab_Button_C, button_long_on) == 0x0016D8, "Member 'UWBP_ModernPrefab_Button_C::button_long_on' has a wrong offset!");
static_assert(offsetof(UWBP_ModernPrefab_Button_C, ControllerInput) == 0x0016E0, "Member 'UWBP_ModernPrefab_Button_C::ControllerInput' has a wrong offset!");
static_assert(offsetof(UWBP_ModernPrefab_Button_C, State_Default_Left_FIll) == 0x0016E8, "Member 'UWBP_ModernPrefab_Button_C::State_Default_Left_FIll' has a wrong offset!");
static_assert(offsetof(UWBP_ModernPrefab_Button_C, State_Default_Left_LineBottom) == 0x0016F0, "Member 'UWBP_ModernPrefab_Button_C::State_Default_Left_LineBottom' has a wrong offset!");
static_assert(offsetof(UWBP_ModernPrefab_Button_C, State_Default_Left_LineTop) == 0x0016F8, "Member 'UWBP_ModernPrefab_Button_C::State_Default_Left_LineTop' has a wrong offset!");
static_assert(offsetof(UWBP_ModernPrefab_Button_C, State_Default_Middle_FIll) == 0x001700, "Member 'UWBP_ModernPrefab_Button_C::State_Default_Middle_FIll' has a wrong offset!");
static_assert(offsetof(UWBP_ModernPrefab_Button_C, State_Default_Middle_LineBottom) == 0x001708, "Member 'UWBP_ModernPrefab_Button_C::State_Default_Middle_LineBottom' has a wrong offset!");
static_assert(offsetof(UWBP_ModernPrefab_Button_C, State_Default_Middle_LineTop) == 0x001710, "Member 'UWBP_ModernPrefab_Button_C::State_Default_Middle_LineTop' has a wrong offset!");
static_assert(offsetof(UWBP_ModernPrefab_Button_C, State_Default_Right_FIll) == 0x001718, "Member 'UWBP_ModernPrefab_Button_C::State_Default_Right_FIll' has a wrong offset!");
static_assert(offsetof(UWBP_ModernPrefab_Button_C, State_Default_Right_LineBottom) == 0x001720, "Member 'UWBP_ModernPrefab_Button_C::State_Default_Right_LineBottom' has a wrong offset!");
static_assert(offsetof(UWBP_ModernPrefab_Button_C, State_Default_Right_LineTop) == 0x001728, "Member 'UWBP_ModernPrefab_Button_C::State_Default_Right_LineTop' has a wrong offset!");
static_assert(offsetof(UWBP_ModernPrefab_Button_C, State_Hover_Left_Arrow) == 0x001730, "Member 'UWBP_ModernPrefab_Button_C::State_Hover_Left_Arrow' has a wrong offset!");
static_assert(offsetof(UWBP_ModernPrefab_Button_C, State_Hover_Left_Fill) == 0x001738, "Member 'UWBP_ModernPrefab_Button_C::State_Hover_Left_Fill' has a wrong offset!");
static_assert(offsetof(UWBP_ModernPrefab_Button_C, State_Hover_Left_LineBottom) == 0x001740, "Member 'UWBP_ModernPrefab_Button_C::State_Hover_Left_LineBottom' has a wrong offset!");
static_assert(offsetof(UWBP_ModernPrefab_Button_C, State_Hover_Left_LineTop) == 0x001748, "Member 'UWBP_ModernPrefab_Button_C::State_Hover_Left_LineTop' has a wrong offset!");
static_assert(offsetof(UWBP_ModernPrefab_Button_C, State_Hover_Middle_FIll) == 0x001750, "Member 'UWBP_ModernPrefab_Button_C::State_Hover_Middle_FIll' has a wrong offset!");
static_assert(offsetof(UWBP_ModernPrefab_Button_C, State_Hover_Middle_LineBottom) == 0x001758, "Member 'UWBP_ModernPrefab_Button_C::State_Hover_Middle_LineBottom' has a wrong offset!");
static_assert(offsetof(UWBP_ModernPrefab_Button_C, State_Hover_Middle_LineTop) == 0x001760, "Member 'UWBP_ModernPrefab_Button_C::State_Hover_Middle_LineTop' has a wrong offset!");
static_assert(offsetof(UWBP_ModernPrefab_Button_C, State_Hover_Right_Arrow) == 0x001768, "Member 'UWBP_ModernPrefab_Button_C::State_Hover_Right_Arrow' has a wrong offset!");
static_assert(offsetof(UWBP_ModernPrefab_Button_C, State_Hover_Right_Fill) == 0x001770, "Member 'UWBP_ModernPrefab_Button_C::State_Hover_Right_Fill' has a wrong offset!");
static_assert(offsetof(UWBP_ModernPrefab_Button_C, State_Hover_Right_LineBottom) == 0x001778, "Member 'UWBP_ModernPrefab_Button_C::State_Hover_Right_LineBottom' has a wrong offset!");
static_assert(offsetof(UWBP_ModernPrefab_Button_C, State_Hover_Right_LineTop) == 0x001780, "Member 'UWBP_ModernPrefab_Button_C::State_Hover_Right_LineTop' has a wrong offset!");
static_assert(offsetof(UWBP_ModernPrefab_Button_C, Text) == 0x001788, "Member 'UWBP_ModernPrefab_Button_C::Text' has a wrong offset!");
static_assert(offsetof(UWBP_ModernPrefab_Button_C, FontColor) == 0x001790, "Member 'UWBP_ModernPrefab_Button_C::FontColor' has a wrong offset!");
static_assert(offsetof(UWBP_ModernPrefab_Button_C, DisplayKeyboardInput) == 0x0017A0, "Member 'UWBP_ModernPrefab_Button_C::DisplayKeyboardInput' has a wrong offset!");
static_assert(offsetof(UWBP_ModernPrefab_Button_C, HintKeyInputAction) == 0x0017A8, "Member 'UWBP_ModernPrefab_Button_C::HintKeyInputAction' has a wrong offset!");

}

