#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Modern_Menu_Player_Header

#include "Basic.hpp"

#include "Altar_structs.hpp"
#include "Altar_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Modern_Menu_Player_Header.WBP_Modern_Menu_Player_Header_C
// 0x0070 (0x0538 - 0x04C8)
class UWBP_Modern_Menu_Player_Header_C final : public UVAltarWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_ModernPrefab_FocusButton_Header_C* character_tab;                                     // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModernPrefab_FocusButton_Header_C* codex_tab;                                         // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox;                                     // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModernPrefab_FocusButton_Header_C* inventory_tab;                                     // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModernPrefab_FocusButton_Header_C* magic_tab;                                         // 0x04F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModernPrefab_FocusButton_Header_C* map_tab;                                           // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModernPrefab_FocusButton_Header_C* quest_tab;                                         // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModernPrefab_FocusButton_Header_C* system_tab;                                        // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(ELegacyPlayerMenuPage NewPage)> OnTabClick;                        // 0x0510(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	ELegacyPlayerMenuPage                         CurrentPage;                                       // 0x0520(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_521[0x7];                                      // 0x0521(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ModernPrefab_FocusButton_Header_C* CurrentTabButton;                                  // 0x0528(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          IsHeaderEnable;                                    // 0x0530(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Binding();
	void BndEvt__WBP_Modern_Menu_Player_Header_character_tab_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_Modern_Menu_Player_Header_codex_tab_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_Modern_Menu_Player_Header_inventory_tab_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_Modern_Menu_Player_Header_magic_tab_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_Modern_Menu_Player_Header_map_tab_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_Modern_Menu_Player_Header_quest_tab_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_Modern_Menu_Player_Header_system_tab_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void Construct();
	void Destruct();
	void DisableInteractionOnListenningForRebind(class UVNavigableInputKeySelector* Target, bool NewState);
	void ExecuteUbergraph_WBP_Modern_Menu_Player_Header(int32 EntryPoint);
	void Reset();
	void SelectPage(ELegacyPlayerMenuPage NewPage);
	void SetHeaderState(bool IsEnable);
	void Unbinding();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Modern_Menu_Player_Header_C">();
	}
	static class UWBP_Modern_Menu_Player_Header_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Modern_Menu_Player_Header_C>();
	}
};
static_assert(alignof(UWBP_Modern_Menu_Player_Header_C) == 0x000008, "Wrong alignment on UWBP_Modern_Menu_Player_Header_C");
static_assert(sizeof(UWBP_Modern_Menu_Player_Header_C) == 0x000538, "Wrong size on UWBP_Modern_Menu_Player_Header_C");
static_assert(offsetof(UWBP_Modern_Menu_Player_Header_C, UberGraphFrame) == 0x0004C8, "Member 'UWBP_Modern_Menu_Player_Header_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Menu_Player_Header_C, character_tab) == 0x0004D0, "Member 'UWBP_Modern_Menu_Player_Header_C::character_tab' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Menu_Player_Header_C, codex_tab) == 0x0004D8, "Member 'UWBP_Modern_Menu_Player_Header_C::codex_tab' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Menu_Player_Header_C, HorizontalBox) == 0x0004E0, "Member 'UWBP_Modern_Menu_Player_Header_C::HorizontalBox' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Menu_Player_Header_C, inventory_tab) == 0x0004E8, "Member 'UWBP_Modern_Menu_Player_Header_C::inventory_tab' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Menu_Player_Header_C, magic_tab) == 0x0004F0, "Member 'UWBP_Modern_Menu_Player_Header_C::magic_tab' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Menu_Player_Header_C, map_tab) == 0x0004F8, "Member 'UWBP_Modern_Menu_Player_Header_C::map_tab' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Menu_Player_Header_C, quest_tab) == 0x000500, "Member 'UWBP_Modern_Menu_Player_Header_C::quest_tab' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Menu_Player_Header_C, system_tab) == 0x000508, "Member 'UWBP_Modern_Menu_Player_Header_C::system_tab' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Menu_Player_Header_C, OnTabClick) == 0x000510, "Member 'UWBP_Modern_Menu_Player_Header_C::OnTabClick' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Menu_Player_Header_C, CurrentPage) == 0x000520, "Member 'UWBP_Modern_Menu_Player_Header_C::CurrentPage' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Menu_Player_Header_C, CurrentTabButton) == 0x000528, "Member 'UWBP_Modern_Menu_Player_Header_C::CurrentTabButton' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Menu_Player_Header_C, IsHeaderEnable) == 0x000530, "Member 'UWBP_Modern_Menu_Player_Header_C::IsHeaderEnable' has a wrong offset!");

}

