#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Modern_SettingsMenu_TimedRevertPopup

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "Altar_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Modern_SettingsMenu_TimedRevertPopup.WBP_Modern_SettingsMenu_TimedRevertPopup_C
// 0x00B8 (0x0580 - 0x04C8)
class UWBP_Modern_SettingsMenu_TimedRevertPopup_C final : public UVAltarWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       PopupFadeInOut;                                    // 0x04D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_ModernPrefab_Button_C*             Button_0;                                          // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModernPrefab_Button_C*             Button_1;                                          // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AltarTextBlock_C*                  message_text;                                      // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AltarTextBlock_C*                  TimerText;                                         // 0x04F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AltarTextBlock_C*                  TitleText;                                         // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(int32 ButtonIndex)> OnPopupQuit;                                   // 0x0500(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FText                                   Title;                                             // 0x0510(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FText                                   Message;                                           // 0x0528(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FText                                   Button1Text;                                       // 0x0540(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FText                                   Button2Text;                                       // 0x0558(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	int32                                         Timer;                                             // 0x0570(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_574[0x4];                                      // 0x0574(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Countdown;                                         // 0x0578(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void PreConstruct(bool IsDesignTime);
	void MenuFadeInOut(bool InIsVisible, double* AnimationTime);
	void ManageCountDown(double DeltaTime);
	void InitPopup(const class FText& NewTitle, const class FText& NewMessage, const class FText& NewButton1Text, const class FText& NewButton2Text, int32 NewTimer);
	void ExecuteUbergraph_WBP_Modern_SettingsMenu_TimedRevertPopup(int32 EntryPoint);
	void Construct();
	void BP_OnTirggeringActionCommited();
	bool BP_OnHandleBackAction();
	void BP_OnActivated();
	void BndEvt__WBP_Modern_SettingsMenu_ValidationPopup_Button_2_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_Modern_SettingsMenu_ValidationPopup_Button_1_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Modern_SettingsMenu_TimedRevertPopup_C">();
	}
	static class UWBP_Modern_SettingsMenu_TimedRevertPopup_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Modern_SettingsMenu_TimedRevertPopup_C>();
	}
};
static_assert(alignof(UWBP_Modern_SettingsMenu_TimedRevertPopup_C) == 0x000008, "Wrong alignment on UWBP_Modern_SettingsMenu_TimedRevertPopup_C");
static_assert(sizeof(UWBP_Modern_SettingsMenu_TimedRevertPopup_C) == 0x000580, "Wrong size on UWBP_Modern_SettingsMenu_TimedRevertPopup_C");
static_assert(offsetof(UWBP_Modern_SettingsMenu_TimedRevertPopup_C, UberGraphFrame) == 0x0004C8, "Member 'UWBP_Modern_SettingsMenu_TimedRevertPopup_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_SettingsMenu_TimedRevertPopup_C, PopupFadeInOut) == 0x0004D0, "Member 'UWBP_Modern_SettingsMenu_TimedRevertPopup_C::PopupFadeInOut' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_SettingsMenu_TimedRevertPopup_C, Button_0) == 0x0004D8, "Member 'UWBP_Modern_SettingsMenu_TimedRevertPopup_C::Button_0' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_SettingsMenu_TimedRevertPopup_C, Button_1) == 0x0004E0, "Member 'UWBP_Modern_SettingsMenu_TimedRevertPopup_C::Button_1' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_SettingsMenu_TimedRevertPopup_C, message_text) == 0x0004E8, "Member 'UWBP_Modern_SettingsMenu_TimedRevertPopup_C::message_text' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_SettingsMenu_TimedRevertPopup_C, TimerText) == 0x0004F0, "Member 'UWBP_Modern_SettingsMenu_TimedRevertPopup_C::TimerText' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_SettingsMenu_TimedRevertPopup_C, TitleText) == 0x0004F8, "Member 'UWBP_Modern_SettingsMenu_TimedRevertPopup_C::TitleText' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_SettingsMenu_TimedRevertPopup_C, OnPopupQuit) == 0x000500, "Member 'UWBP_Modern_SettingsMenu_TimedRevertPopup_C::OnPopupQuit' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_SettingsMenu_TimedRevertPopup_C, Title) == 0x000510, "Member 'UWBP_Modern_SettingsMenu_TimedRevertPopup_C::Title' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_SettingsMenu_TimedRevertPopup_C, Message) == 0x000528, "Member 'UWBP_Modern_SettingsMenu_TimedRevertPopup_C::Message' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_SettingsMenu_TimedRevertPopup_C, Button1Text) == 0x000540, "Member 'UWBP_Modern_SettingsMenu_TimedRevertPopup_C::Button1Text' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_SettingsMenu_TimedRevertPopup_C, Button2Text) == 0x000558, "Member 'UWBP_Modern_SettingsMenu_TimedRevertPopup_C::Button2Text' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_SettingsMenu_TimedRevertPopup_C, Timer) == 0x000570, "Member 'UWBP_Modern_SettingsMenu_TimedRevertPopup_C::Timer' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_SettingsMenu_TimedRevertPopup_C, Countdown) == 0x000578, "Member 'UWBP_Modern_SettingsMenu_TimedRevertPopup_C::Countdown' has a wrong offset!");

}

