#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Modern_Settings_ComboBox

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Altar_classes.hpp"
#include "VCommonUIEnhancedInputNavigation_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Modern_Settings_ComboBox.WBP_Modern_Settings_ComboBox_C
// 0x0068 (0x0530 - 0x04C8)
class UWBP_Modern_Settings_ComboBox_C final : public UVAltarWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                ComboBoxButton;                                    // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               DropdownArrow;                                     // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Modern_Settings_ComboBox_ListView_C* ListView;                                        // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AltarTextBlock_C*                  SelectionLabel;                                    // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(int32 Index, class FText Value)> OnSelectionChanged;               // 0x04F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         CurrentIndex;                                      // 0x0500(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_504[0x4];                                      // 0x0504(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           Options;                                           // 0x0508(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IsOpen;                                            // 0x0518(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_519[0x7];                                      // 0x0519(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(bool IsOpen)>   OnStateChanged;                                    // 0x0520(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void AddOption(const class FText& NewOption);
	void BndEvt__WBP_Modern_Settings_ComboBox_ComboBoxButton_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_Modern_Settings_ComboBox_ListView_K2Node_ComponentBoundEvent_0_OnItemClicked__DelegateSignature(class UObject* SelectedItem);
	void ClearOption();
	void ClearSelection();
	void Close();
	void DelayedOpenFocus();
	void ExecuteUbergraph_WBP_Modern_Settings_ComboBox(int32 EntryPoint);
	void GetListRef(class UWBP_Modern_Settings_ComboBox_ListView_C** ListView_0);
	void GetOptionIndex(const class FText& Option, int32* Index_0);
	void OnFocus();
	void OnSettingsFocus();
	void OnSettingsUnfocus();
	void Open();
	void RegenerateEntry();
	void SetSelectedIndex(int32 SelectedIndex);

	class UWidget* BP_GetDesiredFocusTarget() const;
	void GetIsOpen(bool* IsOpen_0) const;
	TScriptInterface<class IVEnhancedInputNavigable> GetNavigationWidgetForAction(EVNavigationDirection Action) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Modern_Settings_ComboBox_C">();
	}
	static class UWBP_Modern_Settings_ComboBox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Modern_Settings_ComboBox_C>();
	}
};
static_assert(alignof(UWBP_Modern_Settings_ComboBox_C) == 0x000008, "Wrong alignment on UWBP_Modern_Settings_ComboBox_C");
static_assert(sizeof(UWBP_Modern_Settings_ComboBox_C) == 0x000530, "Wrong size on UWBP_Modern_Settings_ComboBox_C");
static_assert(offsetof(UWBP_Modern_Settings_ComboBox_C, UberGraphFrame) == 0x0004C8, "Member 'UWBP_Modern_Settings_ComboBox_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_ComboBox_C, ComboBoxButton) == 0x0004D0, "Member 'UWBP_Modern_Settings_ComboBox_C::ComboBoxButton' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_ComboBox_C, DropdownArrow) == 0x0004D8, "Member 'UWBP_Modern_Settings_ComboBox_C::DropdownArrow' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_ComboBox_C, ListView) == 0x0004E0, "Member 'UWBP_Modern_Settings_ComboBox_C::ListView' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_ComboBox_C, SelectionLabel) == 0x0004E8, "Member 'UWBP_Modern_Settings_ComboBox_C::SelectionLabel' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_ComboBox_C, OnSelectionChanged) == 0x0004F0, "Member 'UWBP_Modern_Settings_ComboBox_C::OnSelectionChanged' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_ComboBox_C, CurrentIndex) == 0x000500, "Member 'UWBP_Modern_Settings_ComboBox_C::CurrentIndex' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_ComboBox_C, Options) == 0x000508, "Member 'UWBP_Modern_Settings_ComboBox_C::Options' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_ComboBox_C, IsOpen) == 0x000518, "Member 'UWBP_Modern_Settings_ComboBox_C::IsOpen' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_ComboBox_C, OnStateChanged) == 0x000520, "Member 'UWBP_Modern_Settings_ComboBox_C::OnStateChanged' has a wrong offset!");

}

