#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Modern_Settings_Step

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Modern_Settings_Step.WBP_Modern_Settings_Step_C
// 0x0018 (0x02D8 - 0x02C0)
class UWBP_Modern_Settings_Step_C final : public UUserWidget
{
public:
	class UWBP_OriginalImageTile_C*               SelectedBackground;                                // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               UnselectedBackground;                              // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         StepIndex;                                         // 0x02D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          State;                                             // 0x02D4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetSelectionState(bool NewState);
	void OnUnfocus();
	void OnFocus();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Modern_Settings_Step_C">();
	}
	static class UWBP_Modern_Settings_Step_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Modern_Settings_Step_C>();
	}
};
static_assert(alignof(UWBP_Modern_Settings_Step_C) == 0x000008, "Wrong alignment on UWBP_Modern_Settings_Step_C");
static_assert(sizeof(UWBP_Modern_Settings_Step_C) == 0x0002D8, "Wrong size on UWBP_Modern_Settings_Step_C");
static_assert(offsetof(UWBP_Modern_Settings_Step_C, SelectedBackground) == 0x0002C0, "Member 'UWBP_Modern_Settings_Step_C::SelectedBackground' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_Step_C, UnselectedBackground) == 0x0002C8, "Member 'UWBP_Modern_Settings_Step_C::UnselectedBackground' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_Step_C, StepIndex) == 0x0002D0, "Member 'UWBP_Modern_Settings_Step_C::StepIndex' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_Step_C, State) == 0x0002D4, "Member 'UWBP_Modern_Settings_Step_C::State' has a wrong offset!");

}

