#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_OriginalMenu_InventoryEntry_ValueWithLine

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_OriginalMenu_InventoryEntry_ValueWithLine.WBP_OriginalMenu_InventoryEntry_ValueWithLine_C.ExecuteUbergraph_WBP_OriginalMenu_InventoryEntry_ValueWithLine
// 0x000C (0x000C - 0x0000)
struct WBP_OriginalMenu_InventoryEntry_ValueWithLine_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryEntry_ValueWithLine final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OriginalMenu_InventoryEntry_ValueWithLine_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryEntry_ValueWithLine) == 0x000004, "Wrong alignment on WBP_OriginalMenu_InventoryEntry_ValueWithLine_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryEntry_ValueWithLine");
static_assert(sizeof(WBP_OriginalMenu_InventoryEntry_ValueWithLine_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryEntry_ValueWithLine) == 0x00000C, "Wrong size on WBP_OriginalMenu_InventoryEntry_ValueWithLine_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryEntry_ValueWithLine");
static_assert(offsetof(WBP_OriginalMenu_InventoryEntry_ValueWithLine_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryEntry_ValueWithLine, EntryPoint) == 0x000000, "Member 'WBP_OriginalMenu_InventoryEntry_ValueWithLine_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryEntry_ValueWithLine::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryEntry_ValueWithLine_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryEntry_ValueWithLine, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_OriginalMenu_InventoryEntry_ValueWithLine_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryEntry_ValueWithLine::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryEntry_ValueWithLine_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryEntry_ValueWithLine, CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast) == 0x000008, "Member 'WBP_OriginalMenu_InventoryEntry_ValueWithLine_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryEntry_ValueWithLine::CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast' has a wrong offset!");

// Function WBP_OriginalMenu_InventoryEntry_ValueWithLine.WBP_OriginalMenu_InventoryEntry_ValueWithLine_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_OriginalMenu_InventoryEntry_ValueWithLine_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OriginalMenu_InventoryEntry_ValueWithLine_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_OriginalMenu_InventoryEntry_ValueWithLine_C_PreConstruct");
static_assert(sizeof(WBP_OriginalMenu_InventoryEntry_ValueWithLine_C_PreConstruct) == 0x000001, "Wrong size on WBP_OriginalMenu_InventoryEntry_ValueWithLine_C_PreConstruct");
static_assert(offsetof(WBP_OriginalMenu_InventoryEntry_ValueWithLine_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_OriginalMenu_InventoryEntry_ValueWithLine_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_OriginalMenu_InventoryEntry_ValueWithLine.WBP_OriginalMenu_InventoryEntry_ValueWithLine_C.SetTextValue
// 0x0018 (0x0018 - 0x0000)
struct WBP_OriginalMenu_InventoryEntry_ValueWithLine_C_SetTextValue final
{
public:
	class FText                                   NewText;                                           // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_OriginalMenu_InventoryEntry_ValueWithLine_C_SetTextValue) == 0x000008, "Wrong alignment on WBP_OriginalMenu_InventoryEntry_ValueWithLine_C_SetTextValue");
static_assert(sizeof(WBP_OriginalMenu_InventoryEntry_ValueWithLine_C_SetTextValue) == 0x000018, "Wrong size on WBP_OriginalMenu_InventoryEntry_ValueWithLine_C_SetTextValue");
static_assert(offsetof(WBP_OriginalMenu_InventoryEntry_ValueWithLine_C_SetTextValue, NewText) == 0x000000, "Member 'WBP_OriginalMenu_InventoryEntry_ValueWithLine_C_SetTextValue::NewText' has a wrong offset!");

// Function WBP_OriginalMenu_InventoryEntry_ValueWithLine.WBP_OriginalMenu_InventoryEntry_ValueWithLine_C.UpdateSpacerVisibility
// 0x0004 (0x0004 - 0x0000)
struct WBP_OriginalMenu_InventoryEntry_ValueWithLine_C_UpdateSpacerVisibility final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OriginalMenu_InventoryEntry_ValueWithLine_C_UpdateSpacerVisibility) == 0x000001, "Wrong alignment on WBP_OriginalMenu_InventoryEntry_ValueWithLine_C_UpdateSpacerVisibility");
static_assert(sizeof(WBP_OriginalMenu_InventoryEntry_ValueWithLine_C_UpdateSpacerVisibility) == 0x000004, "Wrong size on WBP_OriginalMenu_InventoryEntry_ValueWithLine_C_UpdateSpacerVisibility");
static_assert(offsetof(WBP_OriginalMenu_InventoryEntry_ValueWithLine_C_UpdateSpacerVisibility, Temp_bool_Variable) == 0x000000, "Member 'WBP_OriginalMenu_InventoryEntry_ValueWithLine_C_UpdateSpacerVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryEntry_ValueWithLine_C_UpdateSpacerVisibility, Temp_byte_Variable) == 0x000001, "Member 'WBP_OriginalMenu_InventoryEntry_ValueWithLine_C_UpdateSpacerVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryEntry_ValueWithLine_C_UpdateSpacerVisibility, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_OriginalMenu_InventoryEntry_ValueWithLine_C_UpdateSpacerVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryEntry_ValueWithLine_C_UpdateSpacerVisibility, K2Node_Select_Default) == 0x000003, "Member 'WBP_OriginalMenu_InventoryEntry_ValueWithLine_C_UpdateSpacerVisibility::K2Node_Select_Default' has a wrong offset!");

}

