#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModernMenu_Help

#include "Basic.hpp"

#include "CommonInput_structs.hpp"
#include "Altar_structs.hpp"
#include "EnhancedInput_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_ModernMenu_Help.WBP_ModernMenu_Help_C.BndEvt__WBP_ModernMenu_Help_ListView_K2Node_ComponentBoundEvent_0_OnItemClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ModernMenu_Help_C_BndEvt__WBP_ModernMenu_Help_ListView_K2Node_ComponentBoundEvent_0_OnItemClicked__DelegateSignature final
{
public:
	class UObject*                                SelectedItem;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_Help_C_BndEvt__WBP_ModernMenu_Help_ListView_K2Node_ComponentBoundEvent_0_OnItemClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ModernMenu_Help_C_BndEvt__WBP_ModernMenu_Help_ListView_K2Node_ComponentBoundEvent_0_OnItemClicked__DelegateSignature");
static_assert(sizeof(WBP_ModernMenu_Help_C_BndEvt__WBP_ModernMenu_Help_ListView_K2Node_ComponentBoundEvent_0_OnItemClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_ModernMenu_Help_C_BndEvt__WBP_ModernMenu_Help_ListView_K2Node_ComponentBoundEvent_0_OnItemClicked__DelegateSignature");
static_assert(offsetof(WBP_ModernMenu_Help_C_BndEvt__WBP_ModernMenu_Help_ListView_K2Node_ComponentBoundEvent_0_OnItemClicked__DelegateSignature, SelectedItem) == 0x000000, "Member 'WBP_ModernMenu_Help_C_BndEvt__WBP_ModernMenu_Help_ListView_K2Node_ComponentBoundEvent_0_OnItemClicked__DelegateSignature::SelectedItem' has a wrong offset!");

// Function WBP_ModernMenu_Help.WBP_ModernMenu_Help_C.BndEvt__WBP_ModernMenu_Help_ListView_K2Node_ComponentBoundEvent_1_OnItemSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ModernMenu_Help_C_BndEvt__WBP_ModernMenu_Help_ListView_K2Node_ComponentBoundEvent_1_OnItemSelected__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_Help_C_BndEvt__WBP_ModernMenu_Help_ListView_K2Node_ComponentBoundEvent_1_OnItemSelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ModernMenu_Help_C_BndEvt__WBP_ModernMenu_Help_ListView_K2Node_ComponentBoundEvent_1_OnItemSelected__DelegateSignature");
static_assert(sizeof(WBP_ModernMenu_Help_C_BndEvt__WBP_ModernMenu_Help_ListView_K2Node_ComponentBoundEvent_1_OnItemSelected__DelegateSignature) == 0x000008, "Wrong size on WBP_ModernMenu_Help_C_BndEvt__WBP_ModernMenu_Help_ListView_K2Node_ComponentBoundEvent_1_OnItemSelected__DelegateSignature");
static_assert(offsetof(WBP_ModernMenu_Help_C_BndEvt__WBP_ModernMenu_Help_ListView_K2Node_ComponentBoundEvent_1_OnItemSelected__DelegateSignature, Item) == 0x000000, "Member 'WBP_ModernMenu_Help_C_BndEvt__WBP_ModernMenu_Help_ListView_K2Node_ComponentBoundEvent_1_OnItemSelected__DelegateSignature::Item' has a wrong offset!");

// Function WBP_ModernMenu_Help.WBP_ModernMenu_Help_C.BndEvt__WBP_ModernMenu_Help_NextButton_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ModernMenu_Help_C_BndEvt__WBP_ModernMenu_Help_NextButton_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_Help_C_BndEvt__WBP_ModernMenu_Help_NextButton_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ModernMenu_Help_C_BndEvt__WBP_ModernMenu_Help_NextButton_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_ModernMenu_Help_C_BndEvt__WBP_ModernMenu_Help_NextButton_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_ModernMenu_Help_C_BndEvt__WBP_ModernMenu_Help_NextButton_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_ModernMenu_Help_C_BndEvt__WBP_ModernMenu_Help_NextButton_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_ModernMenu_Help_C_BndEvt__WBP_ModernMenu_Help_NextButton_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_ModernMenu_Help.WBP_ModernMenu_Help_C.BndEvt__WBP_ModernMenu_Help_PreviousButton_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ModernMenu_Help_C_BndEvt__WBP_ModernMenu_Help_PreviousButton_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_Help_C_BndEvt__WBP_ModernMenu_Help_PreviousButton_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ModernMenu_Help_C_BndEvt__WBP_ModernMenu_Help_PreviousButton_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_ModernMenu_Help_C_BndEvt__WBP_ModernMenu_Help_PreviousButton_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_ModernMenu_Help_C_BndEvt__WBP_ModernMenu_Help_PreviousButton_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_ModernMenu_Help_C_BndEvt__WBP_ModernMenu_Help_PreviousButton_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_ModernMenu_Help_C_BndEvt__WBP_ModernMenu_Help_PreviousButton_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_ModernMenu_Help.WBP_ModernMenu_Help_C.BndEvt__WBP_ModernMenu_Help_ReadMoreButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ModernMenu_Help_C_BndEvt__WBP_ModernMenu_Help_ReadMoreButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_Help_C_BndEvt__WBP_ModernMenu_Help_ReadMoreButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ModernMenu_Help_C_BndEvt__WBP_ModernMenu_Help_ReadMoreButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_ModernMenu_Help_C_BndEvt__WBP_ModernMenu_Help_ReadMoreButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_ModernMenu_Help_C_BndEvt__WBP_ModernMenu_Help_ReadMoreButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_ModernMenu_Help_C_BndEvt__WBP_ModernMenu_Help_ReadMoreButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_ModernMenu_Help_C_BndEvt__WBP_ModernMenu_Help_ReadMoreButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_ModernMenu_Help.WBP_ModernMenu_Help_C.CanDoOneMoreStep
// 0x0048 (0x0048 - 0x0000)
struct WBP_ModernMenu_Help_C_CanDoOneMoreStep final
{
public:
	bool                                          Forward;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCurrentElementIndex_ReturnValue;       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonListView*                        CallFunc_GetListView_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumItems_ReturnValue;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetItemAt_ReturnValue;                    // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHelpMenuListEntryData*                 K2Node_DynamicCast_AsHelp_Menu_List_Entry_Data;    // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCurrentElementIndex_ReturnValue_1;     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsCategory_ReturnValue;                // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E[0x2];                                       // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCurrentElementIndex_ReturnValue_2;     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0047(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_Help_C_CanDoOneMoreStep) == 0x000008, "Wrong alignment on WBP_ModernMenu_Help_C_CanDoOneMoreStep");
static_assert(sizeof(WBP_ModernMenu_Help_C_CanDoOneMoreStep) == 0x000048, "Wrong size on WBP_ModernMenu_Help_C_CanDoOneMoreStep");
static_assert(offsetof(WBP_ModernMenu_Help_C_CanDoOneMoreStep, Forward) == 0x000000, "Member 'WBP_ModernMenu_Help_C_CanDoOneMoreStep::Forward' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Help_C_CanDoOneMoreStep, ReturnValue) == 0x000001, "Member 'WBP_ModernMenu_Help_C_CanDoOneMoreStep::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Help_C_CanDoOneMoreStep, CallFunc_GetCurrentElementIndex_ReturnValue) == 0x000004, "Member 'WBP_ModernMenu_Help_C_CanDoOneMoreStep::CallFunc_GetCurrentElementIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Help_C_CanDoOneMoreStep, CallFunc_GetListView_ReturnValue) == 0x000008, "Member 'WBP_ModernMenu_Help_C_CanDoOneMoreStep::CallFunc_GetListView_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Help_C_CanDoOneMoreStep, CallFunc_Subtract_IntInt_ReturnValue) == 0x000010, "Member 'WBP_ModernMenu_Help_C_CanDoOneMoreStep::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Help_C_CanDoOneMoreStep, CallFunc_GetNumItems_ReturnValue) == 0x000014, "Member 'WBP_ModernMenu_Help_C_CanDoOneMoreStep::CallFunc_GetNumItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Help_C_CanDoOneMoreStep, CallFunc_Max_ReturnValue) == 0x000018, "Member 'WBP_ModernMenu_Help_C_CanDoOneMoreStep::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Help_C_CanDoOneMoreStep, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x00001C, "Member 'WBP_ModernMenu_Help_C_CanDoOneMoreStep::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Help_C_CanDoOneMoreStep, CallFunc_GetItemAt_ReturnValue) == 0x000020, "Member 'WBP_ModernMenu_Help_C_CanDoOneMoreStep::CallFunc_GetItemAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Help_C_CanDoOneMoreStep, K2Node_DynamicCast_AsHelp_Menu_List_Entry_Data) == 0x000028, "Member 'WBP_ModernMenu_Help_C_CanDoOneMoreStep::K2Node_DynamicCast_AsHelp_Menu_List_Entry_Data' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Help_C_CanDoOneMoreStep, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'WBP_ModernMenu_Help_C_CanDoOneMoreStep::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Help_C_CanDoOneMoreStep, CallFunc_GetCurrentElementIndex_ReturnValue_1) == 0x000034, "Member 'WBP_ModernMenu_Help_C_CanDoOneMoreStep::CallFunc_GetCurrentElementIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Help_C_CanDoOneMoreStep, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'WBP_ModernMenu_Help_C_CanDoOneMoreStep::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Help_C_CanDoOneMoreStep, CallFunc_GetIsCategory_ReturnValue) == 0x000039, "Member 'WBP_ModernMenu_Help_C_CanDoOneMoreStep::CallFunc_GetIsCategory_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Help_C_CanDoOneMoreStep, CallFunc_BooleanAND_ReturnValue) == 0x00003A, "Member 'WBP_ModernMenu_Help_C_CanDoOneMoreStep::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Help_C_CanDoOneMoreStep, CallFunc_Not_PreBool_ReturnValue) == 0x00003B, "Member 'WBP_ModernMenu_Help_C_CanDoOneMoreStep::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Help_C_CanDoOneMoreStep, CallFunc_Not_PreBool_ReturnValue_1) == 0x00003C, "Member 'WBP_ModernMenu_Help_C_CanDoOneMoreStep::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Help_C_CanDoOneMoreStep, CallFunc_BooleanAND_ReturnValue_1) == 0x00003D, "Member 'WBP_ModernMenu_Help_C_CanDoOneMoreStep::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Help_C_CanDoOneMoreStep, CallFunc_GetCurrentElementIndex_ReturnValue_2) == 0x000040, "Member 'WBP_ModernMenu_Help_C_CanDoOneMoreStep::CallFunc_GetCurrentElementIndex_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Help_C_CanDoOneMoreStep, CallFunc_Greater_IntInt_ReturnValue) == 0x000044, "Member 'WBP_ModernMenu_Help_C_CanDoOneMoreStep::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Help_C_CanDoOneMoreStep, CallFunc_BooleanOR_ReturnValue) == 0x000045, "Member 'WBP_ModernMenu_Help_C_CanDoOneMoreStep::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Help_C_CanDoOneMoreStep, CallFunc_BooleanAND_ReturnValue_2) == 0x000046, "Member 'WBP_ModernMenu_Help_C_CanDoOneMoreStep::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Help_C_CanDoOneMoreStep, CallFunc_BooleanOR_ReturnValue_1) == 0x000047, "Member 'WBP_ModernMenu_Help_C_CanDoOneMoreStep::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");

// Function WBP_ModernMenu_Help.WBP_ModernMenu_Help_C.DoScroll
// 0x0050 (0x0050 - 0x0000)
struct WBP_ModernMenu_Help_C_DoScroll final
{
public:
	double                                        ScrollDeltaRaw;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVModernScrollBox*                      ScrollBoxTarget;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        LocalScrollDelta;                                  // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScrollOffsetOfEnd_ReturnValue;         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScrollOffset_ReturnValue;              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_Max_ImplicitCast;                  // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScrollOffset_NewScrollOffset_ImplicitCast; // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_Help_C_DoScroll) == 0x000008, "Wrong alignment on WBP_ModernMenu_Help_C_DoScroll");
static_assert(sizeof(WBP_ModernMenu_Help_C_DoScroll) == 0x000050, "Wrong size on WBP_ModernMenu_Help_C_DoScroll");
static_assert(offsetof(WBP_ModernMenu_Help_C_DoScroll, ScrollDeltaRaw) == 0x000000, "Member 'WBP_ModernMenu_Help_C_DoScroll::ScrollDeltaRaw' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Help_C_DoScroll, ScrollBoxTarget) == 0x000008, "Member 'WBP_ModernMenu_Help_C_DoScroll::ScrollBoxTarget' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Help_C_DoScroll, LocalScrollDelta) == 0x000010, "Member 'WBP_ModernMenu_Help_C_DoScroll::LocalScrollDelta' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Help_C_DoScroll, CallFunc_GetScrollOffsetOfEnd_ReturnValue) == 0x000018, "Member 'WBP_ModernMenu_Help_C_DoScroll::CallFunc_GetScrollOffsetOfEnd_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Help_C_DoScroll, CallFunc_GetScrollOffset_ReturnValue) == 0x00001C, "Member 'WBP_ModernMenu_Help_C_DoScroll::CallFunc_GetScrollOffset_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Help_C_DoScroll, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000020, "Member 'WBP_ModernMenu_Help_C_DoScroll::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Help_C_DoScroll, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000028, "Member 'WBP_ModernMenu_Help_C_DoScroll::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Help_C_DoScroll, CallFunc_FClamp_ReturnValue) == 0x000030, "Member 'WBP_ModernMenu_Help_C_DoScroll::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Help_C_DoScroll, CallFunc_FClamp_Max_ImplicitCast) == 0x000038, "Member 'WBP_ModernMenu_Help_C_DoScroll::CallFunc_FClamp_Max_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Help_C_DoScroll, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000040, "Member 'WBP_ModernMenu_Help_C_DoScroll::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Help_C_DoScroll, CallFunc_SetScrollOffset_NewScrollOffset_ImplicitCast) == 0x000048, "Member 'WBP_ModernMenu_Help_C_DoScroll::CallFunc_SetScrollOffset_NewScrollOffset_ImplicitCast' has a wrong offset!");

// Function WBP_ModernMenu_Help.WBP_ModernMenu_Help_C.ExecuteUbergraph_WBP_ModernMenu_Help
// 0x0600 (0x0600 - 0x0000)
struct WBP_ModernMenu_Help_C_ExecuteUbergraph_WBP_ModernMenu_Help final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_4;     // 0x0008(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_4;     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_4;   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_4;    // 0x0030(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable;                                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue;  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAltarUISubsystem*                     CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_1;     // 0x0050(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_1;     // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_1;   // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_1;    // 0x0078(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            CallFunc_TryGetBrushFromKey_OutBrush;              // 0x0080(0x00D0)()
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_1; // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           Temp_object_Variable;                              // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               K2Node_DynamicCast_AsTexture;                      // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_1;                              // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2;                              // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1_0;                            // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2_0;                            // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue;       // 0x0198(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime;       // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime;     // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction;      // 0x01C0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_2; // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           Temp_object_Variable_1;                            // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3;                              // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3_0;                            // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_4;                              // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_4_0;                            // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVAltarUISubsystem*                     CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVUINavigationGlobalSubsystem*          CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            CallFunc_TryGetBrushFromKey_OutBrush_1;            // 0x0210(0x00D0)()
	class UVUINavigationGlobalSubsystem*          CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x02E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVUINavigationGlobalSubsystem*          CallFunc_GetGameInstanceSubsystem_ReturnValue_4;   // 0x02E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               K2Node_DynamicCast_AsTexture_1;                    // 0x02F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F9[0x7];                                      // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVUINavigationGlobalSubsystem*          CallFunc_GetGameInstanceSubsystem_ReturnValue_5;   // 0x0300(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVUINavigationGlobalSubsystem*          CallFunc_GetGameInstanceSubsystem_ReturnValue_6;   // 0x0308(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVUINavigationGlobalSubsystem*          CallFunc_GetGameInstanceSubsystem_ReturnValue_7;   // 0x0310(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVUINavigationGlobalSubsystem*          CallFunc_GetGameInstanceSubsystem_ReturnValue_8;   // 0x0318(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVUINavigationGlobalSubsystem*          CallFunc_GetGameInstanceSubsystem_ReturnValue_9;   // 0x0320(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVUINavigationGlobalSubsystem*          CallFunc_GetGameInstanceSubsystem_ReturnValue_10;  // 0x0328(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0334(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33C[0x4];                                      // 0x033C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_5;                              // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UHelpMenuListEntryData*>         K2Node_Event_InListData;                           // 0x0348(0x0010)(ConstParm, ReferenceParm)
	class UHelpMenuListEntryData*                 CallFunc_Array_Get_Item;                           // 0x0358(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_364[0x4];                                      // 0x0364(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_ComponentBoundEvent_SelectedItem;           // 0x0368(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_371[0x7];                                      // 0x0371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHelpMenuListEntryData*                 K2Node_DynamicCast_AsHelp_Menu_List_Entry_Data;    // 0x0378(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_381[0x7];                                      // 0x0381(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_ComponentBoundEvent_Item;                   // 0x0388(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_2;               // 0x0390(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHelpMenuListEntryData*                 K2Node_DynamicCast_AsHelp_Menu_List_Entry_Data_1;  // 0x0398(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A1[0x7];                                      // 0x03A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHelpMenuListEntryData*                 K2Node_Event_Entry;                                // 0x03A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             CallFunc_GetTutorialData_ReturnValue;              // 0x03B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetViewMode_ReturnValue;                  // 0x03B8(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x03BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NavigateEntryFromMoreDetailsPanel_DidOneStep; // 0x03BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NavigateEntryFromMoreDetailsPanel_DidOneStep_1; // 0x03BE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NavigateEntryFromMoreDetailsPanel_DidOneStep_2; // 0x03BF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NavigateEntryFromMoreDetailsPanel_DidOneStep_3; // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C1[0x3];                                      // 0x03C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetViewMode_ReturnValue_1;                // 0x03C4(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess_1;                 // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C9[0x7];                                      // 0x03C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_6;                              // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x03D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate;            // 0x03E0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue; // 0x03F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsVisible;                           // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bFromLeft;                            // 0x03F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInstant;                             // 0x03FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FB[0x5];                                      // 0x03FB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0400(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0408(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0410(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NavigateEntryFromMoreDetailsPanel_DidOneStep_4; // 0x0418(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_419[0x3];                                      // 0x0419(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetViewMode_ReturnValue_2;                // 0x041C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess_2;                 // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_421[0x7];                                      // 0x0421(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           Temp_object_Variable_2;                            // 0x0428(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0430(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             CallFunc_GetTutorialData_ReturnValue_1;            // 0x0438(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_2;     // 0x0440(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_2;     // 0x0460(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_2;   // 0x0464(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_2;    // 0x0468(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0470(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_471[0x7];                                      // 0x0471(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_6_0;                            // 0x0478(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_5_0;                            // 0x0480(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_InputActionValueToAxis1D_ReturnValue; // 0x0488(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_7;                              // 0x0490(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_8;                              // 0x0498(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonListView*                        CallFunc_GetListView_ReturnValue;                  // 0x04A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable_3;                            // 0x04A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetIndexForItem_ReturnValue;              // 0x04B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B4[0x4];                                      // 0x04B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_3;     // 0x04B8(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_3;     // 0x04D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_3;   // 0x04DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_3;    // 0x04E0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_8_0;                            // 0x04E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_7_0;                            // 0x04F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_3; // 0x04F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F9[0x7];                                      // 0x04F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IVEnhancedInputNavigable> CallFunc_IsWidgetInTopMostFocusedStack_Widget_CastInput; // 0x0500(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsWidgetInTopMostFocusedStack_ReturnValue; // 0x0510(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_511[0x7];                                      // 0x0511(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IVEnhancedInputNavigable> CallFunc_IsWidgetInTopMostFocusedStack_Widget_CastInput_1; // 0x0518(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsWidgetInTopMostFocusedStack_ReturnValue_1; // 0x0528(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_529[0x7];                                      // 0x0529(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IVEnhancedInputNavigable> CallFunc_IsWidgetInTopMostFocusedStack_Widget_CastInput_2; // 0x0530(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsWidgetInTopMostFocusedStack_ReturnValue_2; // 0x0540(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_541[0x7];                                      // 0x0541(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IVEnhancedInputNavigable> CallFunc_IsWidgetInTopMostFocusedStack_Widget_CastInput_3; // 0x0548(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsWidgetInTopMostFocusedStack_ReturnValue_3; // 0x0558(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_559[0x7];                                      // 0x0559(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IVEnhancedInputNavigable> CallFunc_IsWidgetInTopMostFocusedStack_Widget_CastInput_4; // 0x0560(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsWidgetInTopMostFocusedStack_ReturnValue_4; // 0x0570(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_571[0x7];                                      // 0x0571(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IVEnhancedInputNavigable> CallFunc_IsWidgetInTopMostFocusedStack_Widget_CastInput_5; // 0x0578(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsWidgetInTopMostFocusedStack_ReturnValue_5; // 0x0588(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0589(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58A[0x6];                                      // 0x058A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_9;                              // 0x0590(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IVEnhancedInputNavigable> CallFunc_IsWidgetInTopMostFocusedStack_Widget_CastInput_6; // 0x0598(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsWidgetInTopMostFocusedStack_ReturnValue_6; // 0x05A8(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A9[0x7];                                      // 0x05A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_9_0;                            // 0x05B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_10;                             // 0x05B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IVEnhancedInputNavigable> CallFunc_IsWidgetInTopMostFocusedStack_Widget_CastInput_7; // 0x05C0(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsWidgetInTopMostFocusedStack_ReturnValue_7; // 0x05D0(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D1[0x7];                                      // 0x05D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_10_0;                           // 0x05D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable_4;                            // 0x05E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IVEnhancedInputNavigable> CallFunc_IsWidgetInTopMostFocusedStack_Widget_CastInput_8; // 0x05E8(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsWidgetInTopMostFocusedStack_ReturnValue_8; // 0x05F8(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_Help_C_ExecuteUbergraph_WBP_ModernMenu_Help) == 0x000010, "Wrong alignment on WBP_ModernMenu_Help_C_ExecuteUbergraph_WBP_ModernMenu_Help");
static_assert(sizeof(WBP_ModernMenu_Help_C_ExecuteUbergraph_WBP_ModernMenu_Help) == 0x000600, "Wrong size on WBP_ModernMenu_Help_C_ExecuteUbergraph_WBP_ModernMenu_Help");
static_assert(offsetof(WBP_ModernMenu_Help_C_ExecuteUbergraph_WBP_ModernMenu_Help, EntryPoint) == 0x000000, "Member 'WBP_ModernMenu_Help_C_ExecuteUbergraph_WBP_ModernMenu_Help::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Help_C_ExecuteUbergraph_WBP_ModernMenu_Help, K2Node_EnhancedInputActionEvent_ActionValue_4) == 0x000008, "Member 'WBP_ModernMenu_Help_C_ExecuteUbergraph_WBP_ModernMenu_Help::K2Node_EnhancedInputActionEvent_ActionValue_4' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Help_C_ExecuteUbergraph_WBP_ModernMenu_Help, K2Node_EnhancedInputActionEvent_ElapsedTime_4) == 0x000028, "Member 'WBP_ModernMenu_Help_C_ExecuteUbergraph_WBP_ModernMenu_Help::K2Node_EnhancedInputActionEvent_ElapsedTime_4' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Help_C_ExecuteUbergraph_WBP_ModernMenu_Help, K2Node_EnhancedInputActionEvent_TriggeredTime_4) == 0x00002C, "Member 'WBP_ModernMenu_Help_C_ExecuteUbergraph_WBP_ModernMenu_Help::K2Node_EnhancedInputActionEvent_TriggeredTime_4' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Help_C_ExecuteUbergraph_WBP_ModernMenu_Help, K2Node_EnhancedInputActionEvent_SourceAction_4) == 0x000030, "Member 'WBP_ModernMenu_Help_C_ExecuteUbergraph_WBP_ModernMenu_Help::K2Node_EnhancedInputActionEvent_SourceAction_4' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Help_C_ExecuteUbergraph_WBP_ModernMenu_Help, Temp_real_Variable) == 0x000038, "Member 'WBP_ModernMenu_Help_C_ExecuteUbergraph_WBP_ModernMenu_Help::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Help_C_ExecuteUbergraph_WBP_ModernMenu_Help, CallFunc_Conv_InputActionValueToBool_ReturnValue) == 0x000040, "Member 'WBP_ModernMenu_Help_C_ExecuteUbergraph_WBP_ModernMenu_Help::CallFunc_Conv_InputActionValueToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Help_C_ExecuteUbergraph_WBP_ModernMenu_Help, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000048, "Member 'WBP_ModernMenu_Help_C_ExecuteUbergraph_WBP_ModernMenu_Help::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Help_C_ExecuteUbergraph_WBP_ModernMenu_Help, K2Node_EnhancedInputActionEvent_ActionValue_1) == 0x000050, "Member 'WBP_ModernMenu_Help_C_ExecuteUbergraph_WBP_ModernMenu_Help::K2Node_EnhancedInputActionEvent_ActionValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Help_C_ExecuteUbergraph_WBP_ModernMenu_Help, K2Node_EnhancedInputActionEvent_ElapsedTime_1) == 0x000070, "Member 'WBP_ModernMenu_Help_C_ExecuteUbergraph_WBP_ModernMenu_Help::K2Node_EnhancedInputActionEvent_ElapsedTime_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Help_C_ExecuteUbergraph_WBP_ModernMenu_Help, K2Node_EnhancedInputActionEvent_TriggeredTime_1) == 0x000074, "Member 'WBP_ModernMenu_Help_C_ExecuteUbergraph_WBP_ModernMenu_Help::K2Node_EnhancedInputActionEvent_TriggeredTime_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Help_C_ExecuteUbergraph_WBP_ModernMenu_Help, K2Node_EnhancedInputActionEvent_SourceAction_1) == 0x000078, "Member 'WBP_ModernMenu_Help_C_ExecuteUbergraph_WBP_ModernMenu_Help::K2Node_EnhancedInputActionEvent_SourceAction_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Help_C_ExecuteUbergraph_WBP_ModernMenu_Help, CallFunc_TryGetBrushFromKey_OutBrush) == 0x000080, "Member 'WBP_ModernMenu_Help_C_ExecuteUbergraph_WBP_ModernMenu_Help::CallFunc_TryGetBrushFromKey_OutBrush' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Help_C_ExecuteUbergraph_WBP_ModernMenu_Help, CallFunc_Conv_InputActionValueToBool_ReturnValue_1) == 0x000150, "Member 'WBP_ModernMenu_Help_C_ExecuteUbergraph_WBP_ModernMenu_Help::CallFunc_Conv_InputActionValueToBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Help_C_ExecuteUbergraph_WBP_ModernMenu_Help, Temp_object_Variable) == 0x000158, "Member 'WBP_ModernMenu_Help_C_ExecuteUbergraph_WBP_ModernMenu_Help::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Help_C_ExecuteUbergraph_WBP_ModernMenu_Help, K2Node_DynamicCast_AsTexture) == 0x000160, "Member 'WBP_ModernMenu_Help_C_ExecuteUbergraph_WBP_ModernMenu_Help::K2Node_DynamicCast_AsTexture' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Help_C_ExecuteUbergraph_WBP_ModernMenu_Help, K2Node_DynamicCast_bSuccess) == 0x000168, "Member 'WBP_ModernMenu_Help_C_ExecuteUbergraph_WBP_ModernMenu_Help::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Help_C_ExecuteUbergraph_WBP_ModernMenu_Help, Temp_real_Variable_1) == 0x000170, "Member 'WBP_ModernMenu_Help_C_ExecuteUbergraph_WBP_ModernMenu_Help::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Help_C_ExecuteUbergraph_WBP_ModernMenu_Help, Temp_real_Variable_2) == 0x000178, "Member 'WBP_ModernMenu_Help_C_ExecuteUbergraph_WBP_ModernMenu_Help::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Help_C_ExecuteUbergraph_WBP_ModernMenu_Help, Temp_real_Variable_1_0) == 0x000180, "Member 'WBP_ModernMenu_Help_C_ExecuteUbergraph_WBP_ModernMenu_Help::Temp_real_Variable_1_0' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Help_C_ExecuteUbergraph_WBP_ModernMenu_Help, Temp_real_Variable_2_0) == 0x000188, "Member 'WBP_ModernMenu_Help_C_ExecuteUbergraph_WBP_ModernMenu_Help::Temp_real_Variable_2_0' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Help_C_ExecuteUbergraph_WBP_ModernMenu_Help, Temp_bool_Variable) == 0x000190, "Member 'WBP_ModernMenu_Help_C_ExecuteUbergraph_WBP_ModernMenu_Help::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Help_C_ExecuteUbergraph_WBP_ModernMenu_Help, K2Node_EnhancedInputActionEvent_ActionValue) == 0x000198, "Member 'WBP_ModernMenu_Help_C_ExecuteUbergraph_WBP_ModernMenu_Help::K2Node_EnhancedInputActionEvent_ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Help_C_ExecuteUbergraph_WBP_ModernMenu_Help, K2Node_EnhancedInputActionEvent_ElapsedTime) == 0x0001B8, "Member 'WBP_ModernMenu_Help_C_ExecuteUbergraph_WBP_ModernMenu_Help::K2Node_EnhancedInputActionEvent_ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Help_C_ExecuteUbergraph_WBP_ModernMenu_Help, K2Node_EnhancedInputActionEvent_TriggeredTime) == 0x0001BC, "Member 'WBP_ModernMenu_Help_C_ExecuteUbergraph_WBP_ModernMenu_Help::K2Node_EnhancedInputActionEvent_TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Help_C_ExecuteUbergraph_WBP_ModernMenu_Help, K2Node_EnhancedInputActionEvent_SourceAction) == 0x0001C0, "Member 'WBP_ModernMenu_Help_C_ExecuteUbergraph_WBP_ModernMenu_Help::K2Node_EnhancedInputActionEvent_SourceAction' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Help_C_ExecuteUbergraph_WBP_ModernMenu_Help, CallFunc_Conv_InputActionValueToBool_ReturnValue_2) == 0x0001C8, "Member 'WBP_ModernMenu_Help_C_ExecuteUbergraph_WBP_ModernMenu_Help::CallFunc_Conv_InputActionValueToBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Help_C_ExecuteUbergraph_WBP_ModernMenu_Help, Temp_object_Variable_1) == 0x0001D0, "Member 'WBP_ModernMenu_Help_C_ExecuteUbergraph_WBP_ModernMenu_Help::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Help_C_ExecuteUbergraph_WBP_ModernMenu_Help, Temp_real_Variable_3) == 0x0001D8, "Member 'WBP_ModernMenu_Help_C_ExecuteUbergraph_WBP_ModernMenu_Help::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Help_C_ExecuteUbergraph_WBP_ModernMenu_Help, Temp_real_Variable_3_0) == 0x0001E0, "Member 'WBP_ModernMenu_Help_C_ExecuteUbergraph_WBP_ModernMenu_Help::Temp_real_Variable_3_0' has a wrong offset!");
