#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Modern_Settings_RebindPanel_ScrollBox

#include "Basic.hpp"

#include "CommonInput_structs.hpp"
#include "Altar_structs.hpp"
#include "Altar_classes.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Modern_Settings_RebindPanel_ScrollBox.WBP_Modern_Settings_RebindPanel_ScrollBox_C
// 0x0040 (0x0548 - 0x0508)
class UWBP_Modern_Settings_RebindPanel_ScrollBox_C final : public UVAltarNavigableScrollBox
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0508(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FMargin                                ItemsPadding;                                      // 0x0510(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UVModernSettingRebindData*              RebindDataTable;                                   // 0x0520(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          ListenState;                                       // 0x0528(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_529[0x7];                                      // 0x0529(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UVAltarWidget*>                  WidgetArray;                                       // 0x0530(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	EVModernRebindType                            CurrentType;                                       // 0x0540(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPopulated;                                       // 0x0541(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Binding();
	void BP_OnActivated();
	void BP_Update_Lock_State(bool NewLockState);
	void BroadcastNavigationIndexChanged(int32 NewNavigationIndex);
	void Clear();
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WBP_Modern_Settings_RebindPanel_ScrollBox(int32 EntryPoint);
	void IsKeyboard(bool* Keyboard);
	void OnInputMethodChanged(ECommonInputType bNewInputType);
	void OnWidgetListenStateChanged(class UVNavigableInputKeySelector* Target, bool NewListenState);
	void Populate(class UVModernSettingRebindData* NewDataTable);
	void PreConstruct(bool IsDesignTime);
	void ResetBindingsToDefault();
	void SetScrollbarInputHint();
	void Unbinding();

	bool DoesAllowNavigation() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Modern_Settings_RebindPanel_ScrollBox_C">();
	}
	static class UWBP_Modern_Settings_RebindPanel_ScrollBox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Modern_Settings_RebindPanel_ScrollBox_C>();
	}
};
static_assert(alignof(UWBP_Modern_Settings_RebindPanel_ScrollBox_C) == 0x000008, "Wrong alignment on UWBP_Modern_Settings_RebindPanel_ScrollBox_C");
static_assert(sizeof(UWBP_Modern_Settings_RebindPanel_ScrollBox_C) == 0x000548, "Wrong size on UWBP_Modern_Settings_RebindPanel_ScrollBox_C");
static_assert(offsetof(UWBP_Modern_Settings_RebindPanel_ScrollBox_C, UberGraphFrame) == 0x000508, "Member 'UWBP_Modern_Settings_RebindPanel_ScrollBox_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_RebindPanel_ScrollBox_C, ItemsPadding) == 0x000510, "Member 'UWBP_Modern_Settings_RebindPanel_ScrollBox_C::ItemsPadding' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_RebindPanel_ScrollBox_C, RebindDataTable) == 0x000520, "Member 'UWBP_Modern_Settings_RebindPanel_ScrollBox_C::RebindDataTable' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_RebindPanel_ScrollBox_C, ListenState) == 0x000528, "Member 'UWBP_Modern_Settings_RebindPanel_ScrollBox_C::ListenState' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_RebindPanel_ScrollBox_C, WidgetArray) == 0x000530, "Member 'UWBP_Modern_Settings_RebindPanel_ScrollBox_C::WidgetArray' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_RebindPanel_ScrollBox_C, CurrentType) == 0x000540, "Member 'UWBP_Modern_Settings_RebindPanel_ScrollBox_C::CurrentType' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_RebindPanel_ScrollBox_C, IsPopulated) == 0x000541, "Member 'UWBP_Modern_Settings_RebindPanel_ScrollBox_C::IsPopulated' has a wrong offset!");

}

