#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Modern_HorizontalSlider

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Altar_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Modern_HorizontalSlider.WBP_Modern_HorizontalSlider_C
// 0x0020 (0x05A8 - 0x0588)
class UWBP_Modern_HorizontalSlider_C final : public UVAltarNavigableSlider
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0588(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HandleHoverScale;                                  // 0x0590(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Focus;                                             // 0x0598(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxSliderSpace;                                    // 0x05A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Mouse_Capture_End;                                 // 0x05A4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_Modern_HorizontalSlider_Slider_K2Node_ComponentBoundEvent_0_OnMouseCaptureBeginEvent__DelegateSignature();
	void BndEvt__WBP_Modern_HorizontalSlider_Slider_K2Node_ComponentBoundEvent_1_OnMouseCaptureEndEvent__DelegateSignature();
	void BP_OnActivated();
	void BP_OnDeactivated();
	void ExecuteUbergraph_WBP_Modern_HorizontalSlider(int32 EntryPoint);
	void OnFocus();
	void OnUnfocus();

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Modern_HorizontalSlider_C">();
	}
	static class UWBP_Modern_HorizontalSlider_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Modern_HorizontalSlider_C>();
	}
};
static_assert(alignof(UWBP_Modern_HorizontalSlider_C) == 0x000008, "Wrong alignment on UWBP_Modern_HorizontalSlider_C");
static_assert(sizeof(UWBP_Modern_HorizontalSlider_C) == 0x0005A8, "Wrong size on UWBP_Modern_HorizontalSlider_C");
static_assert(offsetof(UWBP_Modern_HorizontalSlider_C, UberGraphFrame) == 0x000588, "Member 'UWBP_Modern_HorizontalSlider_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_HorizontalSlider_C, HandleHoverScale) == 0x000590, "Member 'UWBP_Modern_HorizontalSlider_C::HandleHoverScale' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_HorizontalSlider_C, Focus) == 0x000598, "Member 'UWBP_Modern_HorizontalSlider_C::Focus' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_HorizontalSlider_C, MaxSliderSpace) == 0x0005A0, "Member 'UWBP_Modern_HorizontalSlider_C::MaxSliderSpace' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_HorizontalSlider_C, Mouse_Capture_End) == 0x0005A4, "Member 'UWBP_Modern_HorizontalSlider_C::Mouse_Capture_End' has a wrong offset!");

}

