#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModernPrefab_NavigableButton

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "InputCore_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "Altar_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ModernPrefab_NavigableButton.WBP_ModernPrefab_NavigableButton_C
// 0x0060 (0x16C0 - 0x1660)
class UWBP_ModernPrefab_NavigableButton_C : public UVAltarNavigableButton
{
public:
	uint8                                         Pad_1658[0x8];                                     // 0x1658(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1660(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             ButtonTextWidget;                                  // 0x1668(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                ButtonBackgroundPanelWidget;                       // 0x1670(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                ButtonFocusPanelWidget;                            // 0x1678(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                ButtonUnfocusPanelWidget;                          // 0x1680(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_ModernPrefab_ControllerInputHint_C* ButtonControllerIconWidget;                       // 0x1688(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   ControllerKey;                                     // 0x1690(0x0018)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UWBP_ModernPrefab_NavigableButton_C* Button)> OnControllerFocusLost; // 0x16A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FColor                                 CustomButtonColor;                                 // 0x16B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShowBackgroundOnGamepad;                          // 0x16BC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ApplyCustomButtonColor();
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_WBP_ModernPrefab_NavigableButton(int32 EntryPoint);
	void InitButtonAttributes(class UTextBlock* TextWidget, class UWidget* BackgroundPanelWidget, class UWidget* FocusPanelWidget, class UWidget* UnfocusPanelWidget, class UWBP_ModernPrefab_ControllerInputHint_C* ControllerIconWidget);
	void OnButtonTextUpdated(const class FText& Value);
	void OnControllerActiveUpdated(const bool Value);
	void OnControllerActiveUpdatedEffect();
	void OnFocus();
	void OnFocusEffect();
	void OnInitButtonWidgets();
	void OnSynchronizeProperties();
	void OnUnfocus();
	void OnUnfocusEffect();
	void ResetButtonColor();
	void UpdateControllerSpecificFocus();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ModernPrefab_NavigableButton_C">();
	}
	static class UWBP_ModernPrefab_NavigableButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ModernPrefab_NavigableButton_C>();
	}
};
static_assert(alignof(UWBP_ModernPrefab_NavigableButton_C) == 0x000010, "Wrong alignment on UWBP_ModernPrefab_NavigableButton_C");
static_assert(sizeof(UWBP_ModernPrefab_NavigableButton_C) == 0x0016C0, "Wrong size on UWBP_ModernPrefab_NavigableButton_C");
static_assert(offsetof(UWBP_ModernPrefab_NavigableButton_C, UberGraphFrame) == 0x001660, "Member 'UWBP_ModernPrefab_NavigableButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ModernPrefab_NavigableButton_C, ButtonTextWidget) == 0x001668, "Member 'UWBP_ModernPrefab_NavigableButton_C::ButtonTextWidget' has a wrong offset!");
static_assert(offsetof(UWBP_ModernPrefab_NavigableButton_C, ButtonBackgroundPanelWidget) == 0x001670, "Member 'UWBP_ModernPrefab_NavigableButton_C::ButtonBackgroundPanelWidget' has a wrong offset!");
static_assert(offsetof(UWBP_ModernPrefab_NavigableButton_C, ButtonFocusPanelWidget) == 0x001678, "Member 'UWBP_ModernPrefab_NavigableButton_C::ButtonFocusPanelWidget' has a wrong offset!");
static_assert(offsetof(UWBP_ModernPrefab_NavigableButton_C, ButtonUnfocusPanelWidget) == 0x001680, "Member 'UWBP_ModernPrefab_NavigableButton_C::ButtonUnfocusPanelWidget' has a wrong offset!");
static_assert(offsetof(UWBP_ModernPrefab_NavigableButton_C, ButtonControllerIconWidget) == 0x001688, "Member 'UWBP_ModernPrefab_NavigableButton_C::ButtonControllerIconWidget' has a wrong offset!");
static_assert(offsetof(UWBP_ModernPrefab_NavigableButton_C, ControllerKey) == 0x001690, "Member 'UWBP_ModernPrefab_NavigableButton_C::ControllerKey' has a wrong offset!");
static_assert(offsetof(UWBP_ModernPrefab_NavigableButton_C, OnControllerFocusLost) == 0x0016A8, "Member 'UWBP_ModernPrefab_NavigableButton_C::OnControllerFocusLost' has a wrong offset!");
static_assert(offsetof(UWBP_ModernPrefab_NavigableButton_C, CustomButtonColor) == 0x0016B8, "Member 'UWBP_ModernPrefab_NavigableButton_C::CustomButtonColor' has a wrong offset!");
static_assert(offsetof(UWBP_ModernPrefab_NavigableButton_C, bShowBackgroundOnGamepad) == 0x0016BC, "Member 'UWBP_ModernPrefab_NavigableButton_C::bShowBackgroundOnGamepad' has a wrong offset!");

}

