#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModernMenu_StatsPage1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Altar_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ModernMenu_StatsPage1.WBP_ModernMenu_StatsPage1_C
// 0x00A0 (0x0588 - 0x04E8)
class UWBP_ModernMenu_StatsPage1_C final : public UVLegacyStatsMenuPage1
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVHUDMainViewModel*                     VHUDMainViewModel;                                 // 0x04F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UVStatsMenuViewModel*                   VStatsMenuViewModel;                               // 0x04F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       StatsPage1FadeInOut;                               // 0x0500(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_ModernMenu_StatsPlayerInfo_C*      stat_p1_birthsign;                                 // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModernMenu_StatsPlayerInfo_C*      stat_p1_class;                                     // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModernMenu_StatsPage1_Details_C*   stat_p1_details;                                   // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModernMenu_StatsPrimaryAttribute_C* stat_p1_fatigue;                                  // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModernMenu_StatsPrimaryAttribute_C* stat_p1_health;                                   // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModernMenu_StatsPlayerInfo_C*      stat_p1_level;                                     // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModernMenu_StatsPrimaryAttribute_C* stat_p1_magicka;                                  // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AltarTextBlock_C*                  stat_p1_name;                                      // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModernMenu_StatsPlayerInfo_C*      stat_p1_race;                                      // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           UnmodifiedColour;                                  // 0x0550(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           NegativelyModifiedColour;                          // 0x0560(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           PositivelyModifiedColour;                          // 0x0570(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanLevelUp;                                        // 0x0580(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DoPlayAnimation;                                   // 0x0581(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_LegacyMenu_StatsPage1_stat_p1_fatigue_K2Node_ComponentBoundEvent_11_FocusDispatcher__DelegateSignature();
	void BndEvt__WBP_LegacyMenu_StatsPage1_stat_p1_health_K2Node_ComponentBoundEvent_13_FocusDispatcher__DelegateSignature();
	void BndEvt__WBP_LegacyMenu_StatsPage1_stat_p1_magicka_K2Node_ComponentBoundEvent_31_FocusDispatcher__DelegateSignature();
	void BndEvt__WBP_ModernMenu_StatsPage1_stat_p1_birthsign_K2Node_ComponentBoundEvent_1_FocusDispatcher__DelegateSignature();
	void BndEvt__WBP_ModernMenu_StatsPage1_stat_p1_class_K2Node_ComponentBoundEvent_2_FocusDispatcher__DelegateSignature();
	void BndEvt__WBP_ModernMenu_StatsPage1_stat_p1_level_K2Node_ComponentBoundEvent_3_FocusDispatcher__DelegateSignature();
	void BndEvt__WBP_ModernMenu_StatsPage1_stat_p1_race_K2Node_ComponentBoundEvent_0_FocusDispatcher__DelegateSignature();
	void BP_OnActivated();
	void BP_OnDeactivated();
	void ExecuteUbergraph_WBP_ModernMenu_StatsPage1(int32 EntryPoint);
	void OnFocus();
	void Set_Details_State(bool InIsDisplayed);
	void SetPrimaryAttribute(class UTextBlock* Value, class UWBP_LegacyPrefab_FillBar_C* fillbar, const struct FLegacyStatsMenuPrimaryAttributeValues& Attribute);
	void update_magicka(const struct FLegacyStatsMenuPrimaryAttributeValues& Value);
	void UpdateActiveEffectsIcon(const TArray<class UTexture2D*>& EffectsIcon);
	void UpdateActiveEffectsTimeLeft(const TArray<double>& EffectsTimeLeft);
	void UpdateCanLevelUp(bool Value);
	void UpdateDetailsContent(const struct FLegacyStatsMenuPopupContent& Content);
	void UpdateFatigue(const struct FLegacyStatsMenuPrimaryAttributeValues& Value);
	void UpdateHealth(const struct FLegacyStatsMenuPrimaryAttributeValues& Value);
	void UpdatePlayerInfo(const struct FLegacyStatsMenuPlayerInfo& NewParam);
	void UpdatePlayerInfos(const struct FLegacyStatsMenuPlayerInfo& LegacyStatsMenuPlayerInfo);

	class UWidget* BP_GetDesiredFocusTarget() const;
	void GetColourFromModifier(double Modifier, struct FLinearColor* Return) const;
	void PrimaryAttributeToText(const struct FLegacyStatsMenuPrimaryAttributeValues& Attribute, class FText* Return_Value) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ModernMenu_StatsPage1_C">();
	}
	static class UWBP_ModernMenu_StatsPage1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ModernMenu_StatsPage1_C>();
	}
};
static_assert(alignof(UWBP_ModernMenu_StatsPage1_C) == 0x000008, "Wrong alignment on UWBP_ModernMenu_StatsPage1_C");
static_assert(sizeof(UWBP_ModernMenu_StatsPage1_C) == 0x000588, "Wrong size on UWBP_ModernMenu_StatsPage1_C");
static_assert(offsetof(UWBP_ModernMenu_StatsPage1_C, UberGraphFrame) == 0x0004E8, "Member 'UWBP_ModernMenu_StatsPage1_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsPage1_C, VHUDMainViewModel) == 0x0004F0, "Member 'UWBP_ModernMenu_StatsPage1_C::VHUDMainViewModel' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsPage1_C, VStatsMenuViewModel) == 0x0004F8, "Member 'UWBP_ModernMenu_StatsPage1_C::VStatsMenuViewModel' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsPage1_C, StatsPage1FadeInOut) == 0x000500, "Member 'UWBP_ModernMenu_StatsPage1_C::StatsPage1FadeInOut' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsPage1_C, stat_p1_birthsign) == 0x000508, "Member 'UWBP_ModernMenu_StatsPage1_C::stat_p1_birthsign' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsPage1_C, stat_p1_class) == 0x000510, "Member 'UWBP_ModernMenu_StatsPage1_C::stat_p1_class' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsPage1_C, stat_p1_details) == 0x000518, "Member 'UWBP_ModernMenu_StatsPage1_C::stat_p1_details' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsPage1_C, stat_p1_fatigue) == 0x000520, "Member 'UWBP_ModernMenu_StatsPage1_C::stat_p1_fatigue' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsPage1_C, stat_p1_health) == 0x000528, "Member 'UWBP_ModernMenu_StatsPage1_C::stat_p1_health' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsPage1_C, stat_p1_level) == 0x000530, "Member 'UWBP_ModernMenu_StatsPage1_C::stat_p1_level' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsPage1_C, stat_p1_magicka) == 0x000538, "Member 'UWBP_ModernMenu_StatsPage1_C::stat_p1_magicka' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsPage1_C, stat_p1_name) == 0x000540, "Member 'UWBP_ModernMenu_StatsPage1_C::stat_p1_name' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsPage1_C, stat_p1_race) == 0x000548, "Member 'UWBP_ModernMenu_StatsPage1_C::stat_p1_race' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsPage1_C, UnmodifiedColour) == 0x000550, "Member 'UWBP_ModernMenu_StatsPage1_C::UnmodifiedColour' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsPage1_C, NegativelyModifiedColour) == 0x000560, "Member 'UWBP_ModernMenu_StatsPage1_C::NegativelyModifiedColour' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsPage1_C, PositivelyModifiedColour) == 0x000570, "Member 'UWBP_ModernMenu_StatsPage1_C::PositivelyModifiedColour' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsPage1_C, CanLevelUp) == 0x000580, "Member 'UWBP_ModernMenu_StatsPage1_C::CanLevelUp' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsPage1_C, DoPlayAnimation) == 0x000581, "Member 'UWBP_ModernMenu_StatsPage1_C::DoPlayAnimation' has a wrong offset!");

}

