#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Modern_Settings_ComboBox

#include "Basic.hpp"

#include "VCommonUIEnhancedInputNavigation_structs.hpp"


namespace SDK::Params
{

// Function WBP_Modern_Settings_ComboBox.WBP_Modern_Settings_ComboBox_C.AddOption
// 0x0030 (0x0030 - 0x0000)
struct WBP_Modern_Settings_ComboBox_C_AddOption final
{
public:
	class FText                                   NewOption;                                         // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UVModernSettingComboBoxItem*            Local_CurrentComboBoxItem;                         // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVModernSettingComboBoxItem*            CallFunc_SpawnObject_ReturnValue;                  // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Settings_ComboBox_C_AddOption) == 0x000008, "Wrong alignment on WBP_Modern_Settings_ComboBox_C_AddOption");
static_assert(sizeof(WBP_Modern_Settings_ComboBox_C_AddOption) == 0x000030, "Wrong size on WBP_Modern_Settings_ComboBox_C_AddOption");
static_assert(offsetof(WBP_Modern_Settings_ComboBox_C_AddOption, NewOption) == 0x000000, "Member 'WBP_Modern_Settings_ComboBox_C_AddOption::NewOption' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBox_C_AddOption, Local_CurrentComboBoxItem) == 0x000018, "Member 'WBP_Modern_Settings_ComboBox_C_AddOption::Local_CurrentComboBoxItem' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBox_C_AddOption, CallFunc_Array_Add_ReturnValue) == 0x000020, "Member 'WBP_Modern_Settings_ComboBox_C_AddOption::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBox_C_AddOption, CallFunc_SpawnObject_ReturnValue) == 0x000028, "Member 'WBP_Modern_Settings_ComboBox_C_AddOption::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");

// Function WBP_Modern_Settings_ComboBox.WBP_Modern_Settings_ComboBox_C.BndEvt__WBP_Modern_Settings_ComboBox_ListView_K2Node_ComponentBoundEvent_0_OnItemClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Modern_Settings_ComboBox_C_BndEvt__WBP_Modern_Settings_ComboBox_ListView_K2Node_ComponentBoundEvent_0_OnItemClicked__DelegateSignature final
{
public:
	class UObject*                                SelectedItem;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Settings_ComboBox_C_BndEvt__WBP_Modern_Settings_ComboBox_ListView_K2Node_ComponentBoundEvent_0_OnItemClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Modern_Settings_ComboBox_C_BndEvt__WBP_Modern_Settings_ComboBox_ListView_K2Node_ComponentBoundEvent_0_OnItemClicked__DelegateSignature");
static_assert(sizeof(WBP_Modern_Settings_ComboBox_C_BndEvt__WBP_Modern_Settings_ComboBox_ListView_K2Node_ComponentBoundEvent_0_OnItemClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Modern_Settings_ComboBox_C_BndEvt__WBP_Modern_Settings_ComboBox_ListView_K2Node_ComponentBoundEvent_0_OnItemClicked__DelegateSignature");
static_assert(offsetof(WBP_Modern_Settings_ComboBox_C_BndEvt__WBP_Modern_Settings_ComboBox_ListView_K2Node_ComponentBoundEvent_0_OnItemClicked__DelegateSignature, SelectedItem) == 0x000000, "Member 'WBP_Modern_Settings_ComboBox_C_BndEvt__WBP_Modern_Settings_ComboBox_ListView_K2Node_ComponentBoundEvent_0_OnItemClicked__DelegateSignature::SelectedItem' has a wrong offset!");

// Function WBP_Modern_Settings_ComboBox.WBP_Modern_Settings_ComboBox_C.ClearOption
// 0x0008 (0x0008 - 0x0000)
struct WBP_Modern_Settings_ComboBox_C_ClearOption final
{
public:
	class UCommonListView*                        CallFunc_GetListView_ReturnValue;                  // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Settings_ComboBox_C_ClearOption) == 0x000008, "Wrong alignment on WBP_Modern_Settings_ComboBox_C_ClearOption");
static_assert(sizeof(WBP_Modern_Settings_ComboBox_C_ClearOption) == 0x000008, "Wrong size on WBP_Modern_Settings_ComboBox_C_ClearOption");
static_assert(offsetof(WBP_Modern_Settings_ComboBox_C_ClearOption, CallFunc_GetListView_ReturnValue) == 0x000000, "Member 'WBP_Modern_Settings_ComboBox_C_ClearOption::CallFunc_GetListView_ReturnValue' has a wrong offset!");

// Function WBP_Modern_Settings_ComboBox.WBP_Modern_Settings_ComboBox_C.ExecuteUbergraph_WBP_Modern_Settings_ComboBox
// 0x0078 (0x0078 - 0x0000)
struct WBP_Modern_Settings_ComboBox_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBox final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVUINavigationGlobalSubsystem*          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsOpen_IsOpen;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_ComponentBoundEvent_SelectedItem;           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVModernSettingComboBoxItem*            K2Node_DynamicCast_AsVModern_Setting_Combo_Box_Item; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IVEnhancedInputNavigable> CallFunc_NavigateToWidget_Widget_CastInput;     // 0x0030(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FText                                   CallFunc_GetOption_ReturnValue;                    // 0x0040(0x0018)(ConstParm)
	int32                                         CallFunc_GetOptionIndex_Index;                     // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsOpen_IsOpen_1;                       // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UVUINavigationGlobalSubsystem*          CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IVEnhancedInputNavigable> CallFunc_NavigateToWidget_Widget_CastInput_1;   // 0x0068(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Settings_ComboBox_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBox) == 0x000008, "Wrong alignment on WBP_Modern_Settings_ComboBox_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBox");
static_assert(sizeof(WBP_Modern_Settings_ComboBox_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBox) == 0x000078, "Wrong size on WBP_Modern_Settings_ComboBox_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBox");
static_assert(offsetof(WBP_Modern_Settings_ComboBox_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBox, EntryPoint) == 0x000000, "Member 'WBP_Modern_Settings_ComboBox_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBox::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBox_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBox, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'WBP_Modern_Settings_ComboBox_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBox::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBox_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBox, CallFunc_GetIsOpen_IsOpen) == 0x000010, "Member 'WBP_Modern_Settings_ComboBox_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBox::CallFunc_GetIsOpen_IsOpen' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBox_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBox, K2Node_ComponentBoundEvent_SelectedItem) == 0x000018, "Member 'WBP_Modern_Settings_ComboBox_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBox::K2Node_ComponentBoundEvent_SelectedItem' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBox_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBox, K2Node_DynamicCast_AsVModern_Setting_Combo_Box_Item) == 0x000020, "Member 'WBP_Modern_Settings_ComboBox_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBox::K2Node_DynamicCast_AsVModern_Setting_Combo_Box_Item' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBox_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBox, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WBP_Modern_Settings_ComboBox_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBox::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBox_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBox, CallFunc_NavigateToWidget_Widget_CastInput) == 0x000030, "Member 'WBP_Modern_Settings_ComboBox_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBox::CallFunc_NavigateToWidget_Widget_CastInput' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBox_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBox, CallFunc_GetOption_ReturnValue) == 0x000040, "Member 'WBP_Modern_Settings_ComboBox_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBox::CallFunc_GetOption_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBox_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBox, CallFunc_GetOptionIndex_Index) == 0x000058, "Member 'WBP_Modern_Settings_ComboBox_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBox::CallFunc_GetOptionIndex_Index' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBox_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBox, CallFunc_GetIsOpen_IsOpen_1) == 0x00005C, "Member 'WBP_Modern_Settings_ComboBox_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBox::CallFunc_GetIsOpen_IsOpen_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBox_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBox, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000060, "Member 'WBP_Modern_Settings_ComboBox_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBox::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBox_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBox, CallFunc_NavigateToWidget_Widget_CastInput_1) == 0x000068, "Member 'WBP_Modern_Settings_ComboBox_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBox::CallFunc_NavigateToWidget_Widget_CastInput_1' has a wrong offset!");

// Function WBP_Modern_Settings_ComboBox.WBP_Modern_Settings_ComboBox_C.GetListRef
// 0x0008 (0x0008 - 0x0000)
struct WBP_Modern_Settings_ComboBox_C_GetListRef final
{
public:
	class UWBP_Modern_Settings_ComboBox_ListView_C* ListView_0;                                      // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Settings_ComboBox_C_GetListRef) == 0x000008, "Wrong alignment on WBP_Modern_Settings_ComboBox_C_GetListRef");
static_assert(sizeof(WBP_Modern_Settings_ComboBox_C_GetListRef) == 0x000008, "Wrong size on WBP_Modern_Settings_ComboBox_C_GetListRef");
static_assert(offsetof(WBP_Modern_Settings_ComboBox_C_GetListRef, ListView_0) == 0x000000, "Member 'WBP_Modern_Settings_ComboBox_C_GetListRef::ListView_0' has a wrong offset!");

// Function WBP_Modern_Settings_ComboBox.WBP_Modern_Settings_ComboBox_C.GetOptionIndex
// 0x0020 (0x0020 - 0x0000)
struct WBP_Modern_Settings_ComboBox_C_GetOptionIndex final
{
public:
	class FText                                   Option;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         Index_0;                                           // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Settings_ComboBox_C_GetOptionIndex) == 0x000008, "Wrong alignment on WBP_Modern_Settings_ComboBox_C_GetOptionIndex");
static_assert(sizeof(WBP_Modern_Settings_ComboBox_C_GetOptionIndex) == 0x000020, "Wrong size on WBP_Modern_Settings_ComboBox_C_GetOptionIndex");
static_assert(offsetof(WBP_Modern_Settings_ComboBox_C_GetOptionIndex, Option) == 0x000000, "Member 'WBP_Modern_Settings_ComboBox_C_GetOptionIndex::Option' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBox_C_GetOptionIndex, Index_0) == 0x000018, "Member 'WBP_Modern_Settings_ComboBox_C_GetOptionIndex::Index_0' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBox_C_GetOptionIndex, CallFunc_Array_Find_ReturnValue) == 0x00001C, "Member 'WBP_Modern_Settings_ComboBox_C_GetOptionIndex::CallFunc_Array_Find_ReturnValue' has a wrong offset!");

// Function WBP_Modern_Settings_ComboBox.WBP_Modern_Settings_ComboBox_C.RegenerateEntry
// 0x0008 (0x0008 - 0x0000)
struct WBP_Modern_Settings_ComboBox_C_RegenerateEntry final
{
public:
	class UCommonListView*                        CallFunc_GetListView_ReturnValue;                  // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Settings_ComboBox_C_RegenerateEntry) == 0x000008, "Wrong alignment on WBP_Modern_Settings_ComboBox_C_RegenerateEntry");
static_assert(sizeof(WBP_Modern_Settings_ComboBox_C_RegenerateEntry) == 0x000008, "Wrong size on WBP_Modern_Settings_ComboBox_C_RegenerateEntry");
static_assert(offsetof(WBP_Modern_Settings_ComboBox_C_RegenerateEntry, CallFunc_GetListView_ReturnValue) == 0x000000, "Member 'WBP_Modern_Settings_ComboBox_C_RegenerateEntry::CallFunc_GetListView_ReturnValue' has a wrong offset!");

// Function WBP_Modern_Settings_ComboBox.WBP_Modern_Settings_ComboBox_C.SetSelectedIndex
// 0x0060 (0x0060 - 0x0000)
struct WBP_Modern_Settings_ComboBox_C_SetSelectedIndex final
{
public:
	int32                                         SelectedIndex;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetItemAt_ReturnValue;                    // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVModernSettingComboBoxItem*            K2Node_DynamicCast_AsVModern_Setting_Combo_Box_Item; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetOption_ReturnValue;                    // 0x0020(0x0018)(ConstParm)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0048(0x0018)()
};
static_assert(alignof(WBP_Modern_Settings_ComboBox_C_SetSelectedIndex) == 0x000008, "Wrong alignment on WBP_Modern_Settings_ComboBox_C_SetSelectedIndex");
static_assert(sizeof(WBP_Modern_Settings_ComboBox_C_SetSelectedIndex) == 0x000060, "Wrong size on WBP_Modern_Settings_ComboBox_C_SetSelectedIndex");
static_assert(offsetof(WBP_Modern_Settings_ComboBox_C_SetSelectedIndex, SelectedIndex) == 0x000000, "Member 'WBP_Modern_Settings_ComboBox_C_SetSelectedIndex::SelectedIndex' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBox_C_SetSelectedIndex, CallFunc_GetItemAt_ReturnValue) == 0x000008, "Member 'WBP_Modern_Settings_ComboBox_C_SetSelectedIndex::CallFunc_GetItemAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBox_C_SetSelectedIndex, K2Node_DynamicCast_AsVModern_Setting_Combo_Box_Item) == 0x000010, "Member 'WBP_Modern_Settings_ComboBox_C_SetSelectedIndex::K2Node_DynamicCast_AsVModern_Setting_Combo_Box_Item' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBox_C_SetSelectedIndex, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_Modern_Settings_ComboBox_C_SetSelectedIndex::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBox_C_SetSelectedIndex, CallFunc_GetOption_ReturnValue) == 0x000020, "Member 'WBP_Modern_Settings_ComboBox_C_SetSelectedIndex::CallFunc_GetOption_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBox_C_SetSelectedIndex, CallFunc_Conv_TextToString_ReturnValue) == 0x000038, "Member 'WBP_Modern_Settings_ComboBox_C_SetSelectedIndex::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBox_C_SetSelectedIndex, CallFunc_Conv_StringToText_ReturnValue) == 0x000048, "Member 'WBP_Modern_Settings_ComboBox_C_SetSelectedIndex::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function WBP_Modern_Settings_ComboBox.WBP_Modern_Settings_ComboBox_C.BP_GetDesiredFocusTarget
// 0x0010 (0x0010 - 0x0000)
struct WBP_Modern_Settings_ComboBox_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsOpen_IsOpen;                         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Settings_ComboBox_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_Modern_Settings_ComboBox_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_Modern_Settings_ComboBox_C_BP_GetDesiredFocusTarget) == 0x000010, "Wrong size on WBP_Modern_Settings_ComboBox_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_Modern_Settings_ComboBox_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_Modern_Settings_ComboBox_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBox_C_BP_GetDesiredFocusTarget, CallFunc_GetIsOpen_IsOpen) == 0x000008, "Member 'WBP_Modern_Settings_ComboBox_C_BP_GetDesiredFocusTarget::CallFunc_GetIsOpen_IsOpen' has a wrong offset!");

// Function WBP_Modern_Settings_ComboBox.WBP_Modern_Settings_ComboBox_C.GetIsOpen
// 0x0001 (0x0001 - 0x0000)
struct WBP_Modern_Settings_ComboBox_C_GetIsOpen final
{
public:
	bool                                          IsOpen_0;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Settings_ComboBox_C_GetIsOpen) == 0x000001, "Wrong alignment on WBP_Modern_Settings_ComboBox_C_GetIsOpen");
static_assert(sizeof(WBP_Modern_Settings_ComboBox_C_GetIsOpen) == 0x000001, "Wrong size on WBP_Modern_Settings_ComboBox_C_GetIsOpen");
static_assert(offsetof(WBP_Modern_Settings_ComboBox_C_GetIsOpen, IsOpen_0) == 0x000000, "Member 'WBP_Modern_Settings_ComboBox_C_GetIsOpen::IsOpen_0' has a wrong offset!");

// Function WBP_Modern_Settings_ComboBox.WBP_Modern_Settings_ComboBox_C.GetNavigationWidgetForAction
// 0x0028 (0x0028 - 0x0000)
struct WBP_Modern_Settings_ComboBox_C_GetNavigationWidgetForAction final
{
public:
	EVNavigationDirection                         Action;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IVEnhancedInputNavigable> ReturnValue;                                    // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TScriptInterface<class IVEnhancedInputNavigable> CallFunc_GetNavigationWidgetForAction_ReturnValue; // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Settings_ComboBox_C_GetNavigationWidgetForAction) == 0x000008, "Wrong alignment on WBP_Modern_Settings_ComboBox_C_GetNavigationWidgetForAction");
static_assert(sizeof(WBP_Modern_Settings_ComboBox_C_GetNavigationWidgetForAction) == 0x000028, "Wrong size on WBP_Modern_Settings_ComboBox_C_GetNavigationWidgetForAction");
static_assert(offsetof(WBP_Modern_Settings_ComboBox_C_GetNavigationWidgetForAction, Action) == 0x000000, "Member 'WBP_Modern_Settings_ComboBox_C_GetNavigationWidgetForAction::Action' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBox_C_GetNavigationWidgetForAction, ReturnValue) == 0x000008, "Member 'WBP_Modern_Settings_ComboBox_C_GetNavigationWidgetForAction::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBox_C_GetNavigationWidgetForAction, CallFunc_GetNavigationWidgetForAction_ReturnValue) == 0x000018, "Member 'WBP_Modern_Settings_ComboBox_C_GetNavigationWidgetForAction::CallFunc_GetNavigationWidgetForAction_ReturnValue' has a wrong offset!");

}

