#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_OriginalMenu_InventoryMainPart

#include "Basic.hpp"

#include "Altar_structs.hpp"
#include "Altar_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_OriginalMenu_InventoryMainPart.WBP_OriginalMenu_InventoryMainPart_C
// 0x00D8 (0x05A0 - 0x04C8)
class UWBP_OriginalMenu_InventoryMainPart_C final : public UVAltarWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVInventoryMenuViewModel*               VInventoryMenuViewModel;                           // 0x04D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UVHUDMainViewModel*                     VHUDMainViewModel;                                 // 0x04D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_Original_ImageAndText_C*           inv_armor;                                         // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModernMenu_ContainerInventory_MainContent_C* inv_mainContent;                         // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Original_ImageAndText_C*           inv_money;                                         // 0x04F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModernHud_Fatigue_C*               inv_statusbar_fatigue;                             // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModernHud_Health_C*                inv_statusbar_health;                              // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModernHud_Magicka_C*               inv_statusbar_magicka;                             // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalMenu_InventoryTabs_C*      inv_tabs;                                          // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Original_ImageAndText_C*           inv_weight;                                        // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMap<ELegacyInventoryMenuPage, class FText>   PageTitle;                                         // 0x0520(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMulticastInlineDelegate<void(class UVOriginalInventoryMenuItem* NewItem)> OnItemHovered;        // 0x0570(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UVOriginalInventoryMenuItem*            CurrentClickedItem;                                // 0x0580(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	EOriginalInventoryMenuSortType                DefaultSortType;                                   // 0x0588(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_589[0x7];                                      // 0x0589(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        FilterColumnSize;                                  // 0x0590(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPlayerMenuClosing;                               // 0x0598(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_OriginalMenu_InventoryMainPart_inv_mainContent_K2Node_ComponentBoundEvent_10_OnListViewUpdated__DelegateSignature();
	void BndEvt__WBP_OriginalMenu_InventoryMainPart_inv_mainContent_K2Node_ComponentBoundEvent_11_OnListViewItemHovered__DelegateSignature(class UObject* Item);
	void BndEvt__WBP_OriginalMenu_InventoryMainPart_inv_mainContent_K2Node_ComponentBoundEvent_12_OnSortTypeUpdated__DelegateSignature(EOriginalInventoryMenuSortType SortType);
	void BndEvt__WBP_OriginalMenu_InventoryMainPart_inv_mainContent_K2Node_ComponentBoundEvent_13_OnSortIsReversedUpdated__DelegateSignature(bool IsReversed);
	void BndEvt__WBP_OriginalMenu_InventoryMainPart_inv_mainContent_K2Node_ComponentBoundEvent_6_OnMouseHoverListViewChanged__DelegateSignature(bool IsHovered_0);
	void BndEvt__WBP_OriginalMenu_InventoryMainPart_WBP_ModernMenu_ContainerInventory_MainContent_K2Node_ComponentBoundEvent_9_OnListViewItemClicked__DelegateSignature(class UObject* Item);
	void BndEvt__WBP_OriginalMenu_InventoryMainPart_WBP_Original_Tabs_K2Node_ComponentBoundEvent_0_OnTab1Clicked__DelegateSignature();
	void BndEvt__WBP_OriginalMenu_InventoryMainPart_WBP_Original_Tabs_K2Node_ComponentBoundEvent_1_OnTab2Clicked__DelegateSignature();
	void BndEvt__WBP_OriginalMenu_InventoryMainPart_WBP_Original_Tabs_K2Node_ComponentBoundEvent_2_OnTab3Clicked__DelegateSignature();
	void BndEvt__WBP_OriginalMenu_InventoryMainPart_WBP_Original_Tabs_K2Node_ComponentBoundEvent_3_OnTab4Clicked__DelegateSignature();
	void BndEvt__WBP_OriginalMenu_InventoryMainPart_WBP_Original_Tabs_K2Node_ComponentBoundEvent_4_OnTab5Clicked__DelegateSignature();
	void ChangePage(ELegacyInventoryMenuPage NewPage);
	void Construct();
	void DropAllItem();
	void DropItem();
	void ExecuteUbergraph_WBP_OriginalMenu_InventoryMainPart(int32 EntryPoint);
	void FocusListFirstItem();
	void Get_Item_List_View(class UWBP_OriginalMenu_InventoryListView_C** NewParam);
	void GetDisabledFilterEnumsForGivenPage(ELegacyInventoryMenuPage Page, TArray<EOriginalInventoryMenuSortType>* DisabledFilterEnums);
	void GetFilter(class UWBP_OriginalMenu_Inventory_Filter_C** Filter);
	void GetIsFilterFocused(bool* IsFilterFocused);
	void OnFocus();
	void OnInteractWithItem();
	void OnItemClicked(class UObject* Object);
	void OnSortIsReversedUpdated(bool IsReversed);
	void OnSortTypeUpdated(EOriginalInventoryMenuSortType SortType);
	void SetPageTitle(ELegacyInventoryMenuPage Page);
	void SetSelectedTab(ELegacyInventoryMenuPage Page);
	void ToggleSorting();
	void Update_Fatigue_Bar_Value(double NewParam);
	void Update_Health_Bar_Value(double NewParam);
	void Update_Magicka_Bar_Value(double NewParam);
	void UpdateCurrentPage(ELegacyInventoryMenuPage Page);
	void UpdateListViewItems(const TArray<struct FOriginalInventoryMenuItemProperties>& Items);
	void UpdatePlayerInfo(const struct FLegacyInventoryMenuExtraData& NewInfo);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_OriginalMenu_InventoryMainPart_C">();
	}
	static class UWBP_OriginalMenu_InventoryMainPart_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_OriginalMenu_InventoryMainPart_C>();
	}
};
static_assert(alignof(UWBP_OriginalMenu_InventoryMainPart_C) == 0x000008, "Wrong alignment on UWBP_OriginalMenu_InventoryMainPart_C");
static_assert(sizeof(UWBP_OriginalMenu_InventoryMainPart_C) == 0x0005A0, "Wrong size on UWBP_OriginalMenu_InventoryMainPart_C");
static_assert(offsetof(UWBP_OriginalMenu_InventoryMainPart_C, UberGraphFrame) == 0x0004C8, "Member 'UWBP_OriginalMenu_InventoryMainPart_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryMainPart_C, VInventoryMenuViewModel) == 0x0004D0, "Member 'UWBP_OriginalMenu_InventoryMainPart_C::VInventoryMenuViewModel' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryMainPart_C, VHUDMainViewModel) == 0x0004D8, "Member 'UWBP_OriginalMenu_InventoryMainPart_C::VHUDMainViewModel' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryMainPart_C, inv_armor) == 0x0004E0, "Member 'UWBP_OriginalMenu_InventoryMainPart_C::inv_armor' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryMainPart_C, inv_mainContent) == 0x0004E8, "Member 'UWBP_OriginalMenu_InventoryMainPart_C::inv_mainContent' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryMainPart_C, inv_money) == 0x0004F0, "Member 'UWBP_OriginalMenu_InventoryMainPart_C::inv_money' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryMainPart_C, inv_statusbar_fatigue) == 0x0004F8, "Member 'UWBP_OriginalMenu_InventoryMainPart_C::inv_statusbar_fatigue' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryMainPart_C, inv_statusbar_health) == 0x000500, "Member 'UWBP_OriginalMenu_InventoryMainPart_C::inv_statusbar_health' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryMainPart_C, inv_statusbar_magicka) == 0x000508, "Member 'UWBP_OriginalMenu_InventoryMainPart_C::inv_statusbar_magicka' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryMainPart_C, inv_tabs) == 0x000510, "Member 'UWBP_OriginalMenu_InventoryMainPart_C::inv_tabs' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryMainPart_C, inv_weight) == 0x000518, "Member 'UWBP_OriginalMenu_InventoryMainPart_C::inv_weight' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryMainPart_C, PageTitle) == 0x000520, "Member 'UWBP_OriginalMenu_InventoryMainPart_C::PageTitle' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryMainPart_C, OnItemHovered) == 0x000570, "Member 'UWBP_OriginalMenu_InventoryMainPart_C::OnItemHovered' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryMainPart_C, CurrentClickedItem) == 0x000580, "Member 'UWBP_OriginalMenu_InventoryMainPart_C::CurrentClickedItem' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryMainPart_C, DefaultSortType) == 0x000588, "Member 'UWBP_OriginalMenu_InventoryMainPart_C::DefaultSortType' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryMainPart_C, FilterColumnSize) == 0x000590, "Member 'UWBP_OriginalMenu_InventoryMainPart_C::FilterColumnSize' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryMainPart_C, IsPlayerMenuClosing) == 0x000598, "Member 'UWBP_OriginalMenu_InventoryMainPart_C::IsPlayerMenuClosing' has a wrong offset!");

}

