#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Modern_Settings_ComboBox_ListView

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CommonInput_structs.hpp"


namespace SDK::Params
{

// Function WBP_Modern_Settings_ComboBox_ListView.WBP_Modern_Settings_ComboBox_ListView_C.ExecuteUbergraph_WBP_Modern_Settings_ComboBox_ListView
// 0x0098 (0x0098 - 0x0000)
struct WBP_Modern_Settings_ComboBox_ListView_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBox_ListView final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonListView*                        CallFunc_GetListView_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate;            // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              K2Node_CustomEvent_bNewInputType;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonListView*                        CallFunc_GetListView_ReturnValue_1;                // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate_1;          // 0x0068(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue_1; // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable_2;                              // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_3;                              // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              Temp_byte_Variable;                                // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Settings_ComboBox_ListView_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBox_ListView) == 0x000008, "Wrong alignment on WBP_Modern_Settings_ComboBox_ListView_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBox_ListView");
static_assert(sizeof(WBP_Modern_Settings_ComboBox_ListView_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBox_ListView) == 0x000098, "Wrong size on WBP_Modern_Settings_ComboBox_ListView_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBox_ListView");
static_assert(offsetof(WBP_Modern_Settings_ComboBox_ListView_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBox_ListView, EntryPoint) == 0x000000, "Member 'WBP_Modern_Settings_ComboBox_ListView_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBox_ListView::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBox_ListView_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBox_ListView, Temp_real_Variable) == 0x000004, "Member 'WBP_Modern_Settings_ComboBox_ListView_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBox_ListView::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBox_ListView_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBox_ListView, K2Node_Event_IsDesignTime) == 0x000008, "Member 'WBP_Modern_Settings_ComboBox_ListView_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBox_ListView::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBox_ListView_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBox_ListView, CallFunc_GetListView_ReturnValue) == 0x000010, "Member 'WBP_Modern_Settings_ComboBox_ListView_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBox_ListView::CallFunc_GetListView_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBox_ListView_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBox_ListView, Temp_real_Variable_1) == 0x000018, "Member 'WBP_Modern_Settings_ComboBox_ListView_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBox_ListView::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBox_ListView_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBox_ListView, CallFunc_GetPlayerController_ReturnValue) == 0x000020, "Member 'WBP_Modern_Settings_ComboBox_ListView_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBox_ListView::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBox_ListView_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBox_ListView, CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue) == 0x000028, "Member 'WBP_Modern_Settings_ComboBox_ListView_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBox_ListView::CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBox_ListView_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBox_ListView, K2Node_CreateDelegate_OutputDelegate) == 0x000030, "Member 'WBP_Modern_Settings_ComboBox_ListView_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBox_ListView::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBox_ListView_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBox_ListView, K2Node_CustomEvent_bNewInputType) == 0x000040, "Member 'WBP_Modern_Settings_ComboBox_ListView_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBox_ListView::K2Node_CustomEvent_bNewInputType' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBox_ListView_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBox_ListView, CallFunc_GetListView_ReturnValue_1) == 0x000048, "Member 'WBP_Modern_Settings_ComboBox_ListView_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBox_ListView::CallFunc_GetListView_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBox_ListView_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBox_ListView, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000050, "Member 'WBP_Modern_Settings_ComboBox_ListView_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBox_ListView::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBox_ListView_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBox_ListView, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000058, "Member 'WBP_Modern_Settings_ComboBox_ListView_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBox_ListView::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBox_ListView_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBox_ListView, CallFunc_GetPlayerController_ReturnValue_1) == 0x000060, "Member 'WBP_Modern_Settings_ComboBox_ListView_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBox_ListView::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBox_ListView_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBox_ListView, K2Node_CreateDelegate_OutputDelegate_1) == 0x000068, "Member 'WBP_Modern_Settings_ComboBox_ListView_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBox_ListView::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBox_ListView_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBox_ListView, CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue_1) == 0x000078, "Member 'WBP_Modern_Settings_ComboBox_ListView_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBox_ListView::CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBox_ListView_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBox_ListView, CallFunc_IsValid_ReturnValue) == 0x000080, "Member 'WBP_Modern_Settings_ComboBox_ListView_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBox_ListView::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBox_ListView_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBox_ListView, Temp_real_Variable_2) == 0x000084, "Member 'WBP_Modern_Settings_ComboBox_ListView_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBox_ListView::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBox_ListView_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBox_ListView, Temp_real_Variable_3) == 0x000088, "Member 'WBP_Modern_Settings_ComboBox_ListView_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBox_ListView::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBox_ListView_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBox_ListView, Temp_byte_Variable) == 0x00008C, "Member 'WBP_Modern_Settings_ComboBox_ListView_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBox_ListView::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBox_ListView_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBox_ListView, K2Node_Select_Default) == 0x000090, "Member 'WBP_Modern_Settings_ComboBox_ListView_C_ExecuteUbergraph_WBP_Modern_Settings_ComboBox_ListView::K2Node_Select_Default' has a wrong offset!");

// Function WBP_Modern_Settings_ComboBox_ListView.WBP_Modern_Settings_ComboBox_ListView_C.OnInputMethodChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_Modern_Settings_ComboBox_ListView_C_OnInputMethodChanged final
{
public:
	ECommonInputType                              bNewInputType;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Settings_ComboBox_ListView_C_OnInputMethodChanged) == 0x000001, "Wrong alignment on WBP_Modern_Settings_ComboBox_ListView_C_OnInputMethodChanged");
static_assert(sizeof(WBP_Modern_Settings_ComboBox_ListView_C_OnInputMethodChanged) == 0x000001, "Wrong size on WBP_Modern_Settings_ComboBox_ListView_C_OnInputMethodChanged");
static_assert(offsetof(WBP_Modern_Settings_ComboBox_ListView_C_OnInputMethodChanged, bNewInputType) == 0x000000, "Member 'WBP_Modern_Settings_ComboBox_ListView_C_OnInputMethodChanged::bNewInputType' has a wrong offset!");

// Function WBP_Modern_Settings_ComboBox_ListView.WBP_Modern_Settings_ComboBox_ListView_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Modern_Settings_ComboBox_ListView_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Settings_ComboBox_ListView_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_Modern_Settings_ComboBox_ListView_C_PreConstruct");
static_assert(sizeof(WBP_Modern_Settings_ComboBox_ListView_C_PreConstruct) == 0x000001, "Wrong size on WBP_Modern_Settings_ComboBox_ListView_C_PreConstruct");
static_assert(offsetof(WBP_Modern_Settings_ComboBox_ListView_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_Modern_Settings_ComboBox_ListView_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_Modern_Settings_ComboBox_ListView.WBP_Modern_Settings_ComboBox_ListView_C.SetScrollbarInputHint
// 0x0100 (0x0100 - 0x0000)
struct WBP_Modern_Settings_ComboBox_ListView_C_SetScrollbarInputHint final
{
public:
	class UVAltarUISubsystem*                     CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonListView*                        CallFunc_GetListView_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            CallFunc_TryGetBrushFromKey_OutBrush;              // 0x0010(0x00D0)()
	class UTexture*                               K2Node_DynamicCast_AsTexture;                      // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Settings_ComboBox_ListView_C_SetScrollbarInputHint) == 0x000010, "Wrong alignment on WBP_Modern_Settings_ComboBox_ListView_C_SetScrollbarInputHint");
static_assert(sizeof(WBP_Modern_Settings_ComboBox_ListView_C_SetScrollbarInputHint) == 0x000100, "Wrong size on WBP_Modern_Settings_ComboBox_ListView_C_SetScrollbarInputHint");
static_assert(offsetof(WBP_Modern_Settings_ComboBox_ListView_C_SetScrollbarInputHint, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000000, "Member 'WBP_Modern_Settings_ComboBox_ListView_C_SetScrollbarInputHint::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBox_ListView_C_SetScrollbarInputHint, CallFunc_GetListView_ReturnValue) == 0x000008, "Member 'WBP_Modern_Settings_ComboBox_ListView_C_SetScrollbarInputHint::CallFunc_GetListView_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBox_ListView_C_SetScrollbarInputHint, CallFunc_TryGetBrushFromKey_OutBrush) == 0x000010, "Member 'WBP_Modern_Settings_ComboBox_ListView_C_SetScrollbarInputHint::CallFunc_TryGetBrushFromKey_OutBrush' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBox_ListView_C_SetScrollbarInputHint, K2Node_DynamicCast_AsTexture) == 0x0000E0, "Member 'WBP_Modern_Settings_ComboBox_ListView_C_SetScrollbarInputHint::K2Node_DynamicCast_AsTexture' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBox_ListView_C_SetScrollbarInputHint, K2Node_DynamicCast_bSuccess) == 0x0000E8, "Member 'WBP_Modern_Settings_ComboBox_ListView_C_SetScrollbarInputHint::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBox_ListView_C_SetScrollbarInputHint, CallFunc_GetDynamicMaterial_ReturnValue) == 0x0000F0, "Member 'WBP_Modern_Settings_ComboBox_ListView_C_SetScrollbarInputHint::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function WBP_Modern_Settings_ComboBox_ListView.WBP_Modern_Settings_ComboBox_ListView_C.UpdateVisibility
// 0x0010 (0x0010 - 0x0000)
struct WBP_Modern_Settings_ComboBox_ListView_C_UpdateVisibility final
{
public:
	ESlateVisibility                              NewVisibility;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonListView*                        CallFunc_GetListView_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Settings_ComboBox_ListView_C_UpdateVisibility) == 0x000008, "Wrong alignment on WBP_Modern_Settings_ComboBox_ListView_C_UpdateVisibility");
static_assert(sizeof(WBP_Modern_Settings_ComboBox_ListView_C_UpdateVisibility) == 0x000010, "Wrong size on WBP_Modern_Settings_ComboBox_ListView_C_UpdateVisibility");
static_assert(offsetof(WBP_Modern_Settings_ComboBox_ListView_C_UpdateVisibility, NewVisibility) == 0x000000, "Member 'WBP_Modern_Settings_ComboBox_ListView_C_UpdateVisibility::NewVisibility' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ComboBox_ListView_C_UpdateVisibility, CallFunc_GetListView_ReturnValue) == 0x000008, "Member 'WBP_Modern_Settings_ComboBox_ListView_C_UpdateVisibility::CallFunc_GetListView_ReturnValue' has a wrong offset!");

}

