#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Graphics_TogglerButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Altar_structs.hpp"
#include "Altar_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Graphics_TogglerButton.WBP_Graphics_TogglerButton_C
// 0x0020 (0x0520 - 0x0500)
class UWBP_Graphics_TogglerButton_C final : public UVDebugGraphicsSettingWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0500(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             ButtonLabel_Text;                                  // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             RowLabel_Text;                                     // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                TogglerButton;                                     // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__WBP_Graphics_TogglerButton_TogglerButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void ExecuteUbergraph_WBP_Graphics_TogglerButton(int32 EntryPoint);
	void OnRefresh();
	void Refresh();
	void SetUpscalingOptions();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Graphics_TogglerButton_C">();
	}
	static class UWBP_Graphics_TogglerButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Graphics_TogglerButton_C>();
	}
};
static_assert(alignof(UWBP_Graphics_TogglerButton_C) == 0x000008, "Wrong alignment on UWBP_Graphics_TogglerButton_C");
static_assert(sizeof(UWBP_Graphics_TogglerButton_C) == 0x000520, "Wrong size on UWBP_Graphics_TogglerButton_C");
static_assert(offsetof(UWBP_Graphics_TogglerButton_C, UberGraphFrame) == 0x000500, "Member 'UWBP_Graphics_TogglerButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Graphics_TogglerButton_C, ButtonLabel_Text) == 0x000508, "Member 'UWBP_Graphics_TogglerButton_C::ButtonLabel_Text' has a wrong offset!");
static_assert(offsetof(UWBP_Graphics_TogglerButton_C, RowLabel_Text) == 0x000510, "Member 'UWBP_Graphics_TogglerButton_C::RowLabel_Text' has a wrong offset!");
static_assert(offsetof(UWBP_Graphics_TogglerButton_C, TogglerButton) == 0x000518, "Member 'UWBP_Graphics_TogglerButton_C::TogglerButton' has a wrong offset!");

}

