#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModernTopStats

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "Altar_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ModernTopStats.WBP_ModernTopStats_C
// 0x0088 (0x0370 - 0x02E8)
class UWBP_ModernTopStats_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVHUDReticleViewModel*                  VHUDReticleViewModel;                              // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeIn;                                            // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeOut;                                           // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UAnimatableRetainerBox*                 AnimRetainerBox;                                   // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModernHud_StatusBarEnemy_C*        NPC_Health;                                        // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           NPC_Name;                                          // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           NPC_Overlay;                                       // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               NPC_Wrapper;                                       // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModernBossBackground_C*            NPCNameBossFrame;                                  // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               NPCNameFrame;                                      // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AltarTextBlock_C*                  NPCNameText;                                       // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModernHud_Area_C*                  WBP_ModernHud_Area;                                // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModernHud_Breath_C*                WBP_ModernHud_Breath;                              // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModernHud_SneakEye_C*              WBP_ModernHud_SneakEye;                            // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         FadeOutDelay;                                      // 0x0360(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FadeOutSpeed;                                      // 0x0364(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsNPCWaitingForFade;                              // 0x0368(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_ModernTopStats(int32 EntryPoint);
	void FadeNPCOut();
	void HandleNPCVisibility(bool InNewVisibility);
	void SetBossVisual(bool bIsBoss);
	void SetBreathVisibility(ESlateVisibility InVisibility);
	void SetEnemyOverlayVisibility(bool& InVisibility);
	void ToggleMenuMode(bool bIsMenuMode);
	void UpdateBossVisual();
	void UpdateEnemyHealth(struct FLegacyReticleEnemyHealthProperties& InProperties);
	void UpdateNPCName(const class FText& InText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ModernTopStats_C">();
	}
	static class UWBP_ModernTopStats_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ModernTopStats_C>();
	}
};
static_assert(alignof(UWBP_ModernTopStats_C) == 0x000008, "Wrong alignment on UWBP_ModernTopStats_C");
static_assert(sizeof(UWBP_ModernTopStats_C) == 0x000370, "Wrong size on UWBP_ModernTopStats_C");
static_assert(offsetof(UWBP_ModernTopStats_C, UberGraphFrame) == 0x0002E8, "Member 'UWBP_ModernTopStats_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ModernTopStats_C, VHUDReticleViewModel) == 0x0002F0, "Member 'UWBP_ModernTopStats_C::VHUDReticleViewModel' has a wrong offset!");
static_assert(offsetof(UWBP_ModernTopStats_C, FadeIn) == 0x0002F8, "Member 'UWBP_ModernTopStats_C::FadeIn' has a wrong offset!");
static_assert(offsetof(UWBP_ModernTopStats_C, FadeOut) == 0x000300, "Member 'UWBP_ModernTopStats_C::FadeOut' has a wrong offset!");
static_assert(offsetof(UWBP_ModernTopStats_C, AnimRetainerBox) == 0x000308, "Member 'UWBP_ModernTopStats_C::AnimRetainerBox' has a wrong offset!");
static_assert(offsetof(UWBP_ModernTopStats_C, NPC_Health) == 0x000310, "Member 'UWBP_ModernTopStats_C::NPC_Health' has a wrong offset!");
static_assert(offsetof(UWBP_ModernTopStats_C, NPC_Name) == 0x000318, "Member 'UWBP_ModernTopStats_C::NPC_Name' has a wrong offset!");
static_assert(offsetof(UWBP_ModernTopStats_C, NPC_Overlay) == 0x000320, "Member 'UWBP_ModernTopStats_C::NPC_Overlay' has a wrong offset!");
static_assert(offsetof(UWBP_ModernTopStats_C, NPC_Wrapper) == 0x000328, "Member 'UWBP_ModernTopStats_C::NPC_Wrapper' has a wrong offset!");
static_assert(offsetof(UWBP_ModernTopStats_C, NPCNameBossFrame) == 0x000330, "Member 'UWBP_ModernTopStats_C::NPCNameBossFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ModernTopStats_C, NPCNameFrame) == 0x000338, "Member 'UWBP_ModernTopStats_C::NPCNameFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ModernTopStats_C, NPCNameText) == 0x000340, "Member 'UWBP_ModernTopStats_C::NPCNameText' has a wrong offset!");
static_assert(offsetof(UWBP_ModernTopStats_C, WBP_ModernHud_Area) == 0x000348, "Member 'UWBP_ModernTopStats_C::WBP_ModernHud_Area' has a wrong offset!");
static_assert(offsetof(UWBP_ModernTopStats_C, WBP_ModernHud_Breath) == 0x000350, "Member 'UWBP_ModernTopStats_C::WBP_ModernHud_Breath' has a wrong offset!");
static_assert(offsetof(UWBP_ModernTopStats_C, WBP_ModernHud_SneakEye) == 0x000358, "Member 'UWBP_ModernTopStats_C::WBP_ModernHud_SneakEye' has a wrong offset!");
static_assert(offsetof(UWBP_ModernTopStats_C, FadeOutDelay) == 0x000360, "Member 'UWBP_ModernTopStats_C::FadeOutDelay' has a wrong offset!");
static_assert(offsetof(UWBP_ModernTopStats_C, FadeOutSpeed) == 0x000364, "Member 'UWBP_ModernTopStats_C::FadeOutSpeed' has a wrong offset!");
static_assert(offsetof(UWBP_ModernTopStats_C, bIsNPCWaitingForFade) == 0x000368, "Member 'UWBP_ModernTopStats_C::bIsNPCWaitingForFade' has a wrong offset!");

}

