#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PrimaryGameLayout

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Altar_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PrimaryGameLayout.WBP_PrimaryGameLayout_C
// 0x0068 (0x03D8 - 0x0370)
class UWBP_PrimaryGameLayout_C final : public UVPrimaryGameLayout
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       BlurFadeInOut;                                     // 0x0378(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UVActivatableWidgetStack*               FadeWidgetStack;                                   // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVActivatableWidgetStack*               GameMenuRepairStack;                               // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVActivatableWidgetStack*               GameMenuSkillStack;                                // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVActivatableWidgetStack*               GameMenuStack;                                     // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVActivatableWidgetStack*               GameMenuUntintedStack;                             // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVActivatableWidgetStack*               GameOptionMenuUntintedStack;                       // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVActivatableWidgetStack*               GameStack;                                         // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVActivatableWidgetStack*               LoadingScreenStack;                                // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVActivatableWidgetStack*               MenuStack;                                         // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVActivatableWidgetStack*               ModalStack;                                        // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_BackgroundWidget_C*                WBP_BackgroundWidget;                              // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_PrimaryGameLayout(int32 EntryPoint);
	void OnInitialized();

	class UVBackgroundWidgetBase* GetBackgroundWidget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PrimaryGameLayout_C">();
	}
	static class UWBP_PrimaryGameLayout_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PrimaryGameLayout_C>();
	}
};
static_assert(alignof(UWBP_PrimaryGameLayout_C) == 0x000008, "Wrong alignment on UWBP_PrimaryGameLayout_C");
static_assert(sizeof(UWBP_PrimaryGameLayout_C) == 0x0003D8, "Wrong size on UWBP_PrimaryGameLayout_C");
static_assert(offsetof(UWBP_PrimaryGameLayout_C, UberGraphFrame) == 0x000370, "Member 'UWBP_PrimaryGameLayout_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PrimaryGameLayout_C, BlurFadeInOut) == 0x000378, "Member 'UWBP_PrimaryGameLayout_C::BlurFadeInOut' has a wrong offset!");
static_assert(offsetof(UWBP_PrimaryGameLayout_C, FadeWidgetStack) == 0x000380, "Member 'UWBP_PrimaryGameLayout_C::FadeWidgetStack' has a wrong offset!");
static_assert(offsetof(UWBP_PrimaryGameLayout_C, GameMenuRepairStack) == 0x000388, "Member 'UWBP_PrimaryGameLayout_C::GameMenuRepairStack' has a wrong offset!");
static_assert(offsetof(UWBP_PrimaryGameLayout_C, GameMenuSkillStack) == 0x000390, "Member 'UWBP_PrimaryGameLayout_C::GameMenuSkillStack' has a wrong offset!");
static_assert(offsetof(UWBP_PrimaryGameLayout_C, GameMenuStack) == 0x000398, "Member 'UWBP_PrimaryGameLayout_C::GameMenuStack' has a wrong offset!");
static_assert(offsetof(UWBP_PrimaryGameLayout_C, GameMenuUntintedStack) == 0x0003A0, "Member 'UWBP_PrimaryGameLayout_C::GameMenuUntintedStack' has a wrong offset!");
static_assert(offsetof(UWBP_PrimaryGameLayout_C, GameOptionMenuUntintedStack) == 0x0003A8, "Member 'UWBP_PrimaryGameLayout_C::GameOptionMenuUntintedStack' has a wrong offset!");
static_assert(offsetof(UWBP_PrimaryGameLayout_C, GameStack) == 0x0003B0, "Member 'UWBP_PrimaryGameLayout_C::GameStack' has a wrong offset!");
static_assert(offsetof(UWBP_PrimaryGameLayout_C, LoadingScreenStack) == 0x0003B8, "Member 'UWBP_PrimaryGameLayout_C::LoadingScreenStack' has a wrong offset!");
static_assert(offsetof(UWBP_PrimaryGameLayout_C, MenuStack) == 0x0003C0, "Member 'UWBP_PrimaryGameLayout_C::MenuStack' has a wrong offset!");
static_assert(offsetof(UWBP_PrimaryGameLayout_C, ModalStack) == 0x0003C8, "Member 'UWBP_PrimaryGameLayout_C::ModalStack' has a wrong offset!");
static_assert(offsetof(UWBP_PrimaryGameLayout_C, WBP_BackgroundWidget) == 0x0003D0, "Member 'UWBP_PrimaryGameLayout_C::WBP_BackgroundWidget' has a wrong offset!");

}

