#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModernMenu_AddedEffects

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "Altar_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_ModernMenu_AddedEffects.WBP_ModernMenu_AddedEffects_C.ExecuteUbergraph_WBP_ModernMenu_AddedEffects
// 0x0080 (0x0080 - 0x0000)
struct WBP_ModernMenu_AddedEffects_C_ExecuteUbergraph_WBP_ModernMenu_AddedEffects final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVModernEffectItem*                     K2Node_DynamicCast_AsVModern_Effect_Item;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FModernEffectItemData                  CallFunc_GetProperties_ReturnValue;                // 0x0020(0x0060)(ConstParm)
};
static_assert(alignof(WBP_ModernMenu_AddedEffects_C_ExecuteUbergraph_WBP_ModernMenu_AddedEffects) == 0x000008, "Wrong alignment on WBP_ModernMenu_AddedEffects_C_ExecuteUbergraph_WBP_ModernMenu_AddedEffects");
static_assert(sizeof(WBP_ModernMenu_AddedEffects_C_ExecuteUbergraph_WBP_ModernMenu_AddedEffects) == 0x000080, "Wrong size on WBP_ModernMenu_AddedEffects_C_ExecuteUbergraph_WBP_ModernMenu_AddedEffects");
static_assert(offsetof(WBP_ModernMenu_AddedEffects_C_ExecuteUbergraph_WBP_ModernMenu_AddedEffects, EntryPoint) == 0x000000, "Member 'WBP_ModernMenu_AddedEffects_C_ExecuteUbergraph_WBP_ModernMenu_AddedEffects::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_AddedEffects_C_ExecuteUbergraph_WBP_ModernMenu_AddedEffects, K2Node_Event_ListItemObject) == 0x000008, "Member 'WBP_ModernMenu_AddedEffects_C_ExecuteUbergraph_WBP_ModernMenu_AddedEffects::K2Node_Event_ListItemObject' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_AddedEffects_C_ExecuteUbergraph_WBP_ModernMenu_AddedEffects, K2Node_DynamicCast_AsVModern_Effect_Item) == 0x000010, "Member 'WBP_ModernMenu_AddedEffects_C_ExecuteUbergraph_WBP_ModernMenu_AddedEffects::K2Node_DynamicCast_AsVModern_Effect_Item' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_AddedEffects_C_ExecuteUbergraph_WBP_ModernMenu_AddedEffects, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_ModernMenu_AddedEffects_C_ExecuteUbergraph_WBP_ModernMenu_AddedEffects::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_AddedEffects_C_ExecuteUbergraph_WBP_ModernMenu_AddedEffects, CallFunc_GetProperties_ReturnValue) == 0x000020, "Member 'WBP_ModernMenu_AddedEffects_C_ExecuteUbergraph_WBP_ModernMenu_AddedEffects::CallFunc_GetProperties_ReturnValue' has a wrong offset!");

// Function WBP_ModernMenu_AddedEffects.WBP_ModernMenu_AddedEffects_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct WBP_ModernMenu_AddedEffects_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_AddedEffects_C_OnListItemObjectSet) == 0x000008, "Wrong alignment on WBP_ModernMenu_AddedEffects_C_OnListItemObjectSet");
static_assert(sizeof(WBP_ModernMenu_AddedEffects_C_OnListItemObjectSet) == 0x000008, "Wrong size on WBP_ModernMenu_AddedEffects_C_OnListItemObjectSet");
static_assert(offsetof(WBP_ModernMenu_AddedEffects_C_OnListItemObjectSet, ListItemObject) == 0x000000, "Member 'WBP_ModernMenu_AddedEffects_C_OnListItemObjectSet::ListItemObject' has a wrong offset!");

// Function WBP_ModernMenu_AddedEffects.WBP_ModernMenu_AddedEffects_C.SetProperties
// 0x0160 (0x0160 - 0x0000)
struct WBP_ModernMenu_AddedEffects_C_SetProperties final
{
public:
	struct FModernEffectItemData                  NewProperties;                                     // 0x0000(0x0060)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UTexture2D*                             IconTexture;                                       // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_MakeBrushFromTexture_ReturnValue;         // 0x0070(0x00D0)()
	class UTexture2D*                             CallFunc_Map_Find_Value;                           // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_Map_Find_Value_1;                         // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x015A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_AddedEffects_C_SetProperties) == 0x000010, "Wrong alignment on WBP_ModernMenu_AddedEffects_C_SetProperties");
static_assert(sizeof(WBP_ModernMenu_AddedEffects_C_SetProperties) == 0x000160, "Wrong size on WBP_ModernMenu_AddedEffects_C_SetProperties");
static_assert(offsetof(WBP_ModernMenu_AddedEffects_C_SetProperties, NewProperties) == 0x000000, "Member 'WBP_ModernMenu_AddedEffects_C_SetProperties::NewProperties' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_AddedEffects_C_SetProperties, IconTexture) == 0x000060, "Member 'WBP_ModernMenu_AddedEffects_C_SetProperties::IconTexture' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_AddedEffects_C_SetProperties, CallFunc_MakeBrushFromTexture_ReturnValue) == 0x000070, "Member 'WBP_ModernMenu_AddedEffects_C_SetProperties::CallFunc_MakeBrushFromTexture_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_AddedEffects_C_SetProperties, CallFunc_Map_Find_Value) == 0x000140, "Member 'WBP_ModernMenu_AddedEffects_C_SetProperties::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_AddedEffects_C_SetProperties, CallFunc_Map_Find_ReturnValue) == 0x000148, "Member 'WBP_ModernMenu_AddedEffects_C_SetProperties::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_AddedEffects_C_SetProperties, CallFunc_Map_Find_Value_1) == 0x000150, "Member 'WBP_ModernMenu_AddedEffects_C_SetProperties::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_AddedEffects_C_SetProperties, CallFunc_Map_Find_ReturnValue_1) == 0x000158, "Member 'WBP_ModernMenu_AddedEffects_C_SetProperties::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_AddedEffects_C_SetProperties, CallFunc_IsValid_ReturnValue) == 0x000159, "Member 'WBP_ModernMenu_AddedEffects_C_SetProperties::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_AddedEffects_C_SetProperties, CallFunc_IsValid_ReturnValue_1) == 0x00015A, "Member 'WBP_ModernMenu_AddedEffects_C_SetProperties::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function WBP_ModernMenu_AddedEffects.WBP_ModernMenu_AddedEffects_C.SetPropertiesText
// 0x03E8 (0x03E8 - 0x0000)
struct WBP_ModernMenu_AddedEffects_C_SetPropertiesText final
{
public:
	class FText                                   ShortEffectName;                                   // 0x0000(0x0018)(Edit, BlueprintVisible)
	EModernMagnitudeType                          Temp_byte_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0020(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0070(0x0010)(ReferenceParm)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0090(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x00E0(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0130(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0140(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0150(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0168(0x0018)()
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_2;            // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_3;            // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0190(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x01E0(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_3;                          // 0x0230(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_4;                          // 0x0240(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x0250(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_3;                     // 0x0268(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x0280(0x0018)()
	class FText                                   CallFunc_Map_Find_Value;                           // 0x0298(0x0018)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue_4;                     // 0x02B8(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_5;            // 0x02D0(0x0050)(HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_5;                          // 0x0328(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_5;                     // 0x0338(0x0018)()
	class FText                                   K2Node_Select_Default_1;                           // 0x0350(0x0018)()
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_4;            // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_6;            // 0x0370(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_6;                          // 0x03C0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_6;                     // 0x03D0(0x0018)()
};
static_assert(alignof(WBP_ModernMenu_AddedEffects_C_SetPropertiesText) == 0x000008, "Wrong alignment on WBP_ModernMenu_AddedEffects_C_SetPropertiesText");
static_assert(sizeof(WBP_ModernMenu_AddedEffects_C_SetPropertiesText) == 0x0003E8, "Wrong size on WBP_ModernMenu_AddedEffects_C_SetPropertiesText");
static_assert(offsetof(WBP_ModernMenu_AddedEffects_C_SetPropertiesText, ShortEffectName) == 0x000000, "Member 'WBP_ModernMenu_AddedEffects_C_SetPropertiesText::ShortEffectName' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_AddedEffects_C_SetPropertiesText, Temp_byte_Variable) == 0x000018, "Member 'WBP_ModernMenu_AddedEffects_C_SetPropertiesText::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_AddedEffects_C_SetPropertiesText, K2Node_MakeStruct_FormatArgumentData) == 0x000020, "Member 'WBP_ModernMenu_AddedEffects_C_SetPropertiesText::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_AddedEffects_C_SetPropertiesText, K2Node_MakeArray_Array) == 0x000070, "Member 'WBP_ModernMenu_AddedEffects_C_SetPropertiesText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_AddedEffects_C_SetPropertiesText, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000080, "Member 'WBP_ModernMenu_AddedEffects_C_SetPropertiesText::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_AddedEffects_C_SetPropertiesText, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x000088, "Member 'WBP_ModernMenu_AddedEffects_C_SetPropertiesText::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_AddedEffects_C_SetPropertiesText, K2Node_MakeStruct_FormatArgumentData_1) == 0x000090, "Member 'WBP_ModernMenu_AddedEffects_C_SetPropertiesText::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_AddedEffects_C_SetPropertiesText, K2Node_MakeStruct_FormatArgumentData_2) == 0x0000E0, "Member 'WBP_ModernMenu_AddedEffects_C_SetPropertiesText::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_AddedEffects_C_SetPropertiesText, K2Node_MakeArray_Array_1) == 0x000130, "Member 'WBP_ModernMenu_AddedEffects_C_SetPropertiesText::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_AddedEffects_C_SetPropertiesText, K2Node_MakeArray_Array_2) == 0x000140, "Member 'WBP_ModernMenu_AddedEffects_C_SetPropertiesText::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_AddedEffects_C_SetPropertiesText, CallFunc_Format_ReturnValue) == 0x000150, "Member 'WBP_ModernMenu_AddedEffects_C_SetPropertiesText::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_AddedEffects_C_SetPropertiesText, CallFunc_Format_ReturnValue_1) == 0x000168, "Member 'WBP_ModernMenu_AddedEffects_C_SetPropertiesText::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_AddedEffects_C_SetPropertiesText, CallFunc_Conv_IntToInt64_ReturnValue_2) == 0x000180, "Member 'WBP_ModernMenu_AddedEffects_C_SetPropertiesText::CallFunc_Conv_IntToInt64_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_AddedEffects_C_SetPropertiesText, CallFunc_Conv_IntToInt64_ReturnValue_3) == 0x000188, "Member 'WBP_ModernMenu_AddedEffects_C_SetPropertiesText::CallFunc_Conv_IntToInt64_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_AddedEffects_C_SetPropertiesText, K2Node_MakeStruct_FormatArgumentData_3) == 0x000190, "Member 'WBP_ModernMenu_AddedEffects_C_SetPropertiesText::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_AddedEffects_C_SetPropertiesText, K2Node_MakeStruct_FormatArgumentData_4) == 0x0001E0, "Member 'WBP_ModernMenu_AddedEffects_C_SetPropertiesText::K2Node_MakeStruct_FormatArgumentData_4' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_AddedEffects_C_SetPropertiesText, K2Node_MakeArray_Array_3) == 0x000230, "Member 'WBP_ModernMenu_AddedEffects_C_SetPropertiesText::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_AddedEffects_C_SetPropertiesText, K2Node_MakeArray_Array_4) == 0x000240, "Member 'WBP_ModernMenu_AddedEffects_C_SetPropertiesText::K2Node_MakeArray_Array_4' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_AddedEffects_C_SetPropertiesText, CallFunc_Format_ReturnValue_2) == 0x000250, "Member 'WBP_ModernMenu_AddedEffects_C_SetPropertiesText::CallFunc_Format_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_AddedEffects_C_SetPropertiesText, CallFunc_Format_ReturnValue_3) == 0x000268, "Member 'WBP_ModernMenu_AddedEffects_C_SetPropertiesText::CallFunc_Format_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_AddedEffects_C_SetPropertiesText, K2Node_Select_Default) == 0x000280, "Member 'WBP_ModernMenu_AddedEffects_C_SetPropertiesText::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_AddedEffects_C_SetPropertiesText, CallFunc_Map_Find_Value) == 0x000298, "Member 'WBP_ModernMenu_AddedEffects_C_SetPropertiesText::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_AddedEffects_C_SetPropertiesText, CallFunc_Map_Find_ReturnValue) == 0x0002B0, "Member 'WBP_ModernMenu_AddedEffects_C_SetPropertiesText::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_AddedEffects_C_SetPropertiesText, CallFunc_Format_ReturnValue_4) == 0x0002B8, "Member 'WBP_ModernMenu_AddedEffects_C_SetPropertiesText::CallFunc_Format_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_AddedEffects_C_SetPropertiesText, K2Node_MakeStruct_FormatArgumentData_5) == 0x0002D0, "Member 'WBP_ModernMenu_AddedEffects_C_SetPropertiesText::K2Node_MakeStruct_FormatArgumentData_5' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_AddedEffects_C_SetPropertiesText, Temp_bool_Variable) == 0x000320, "Member 'WBP_ModernMenu_AddedEffects_C_SetPropertiesText::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_AddedEffects_C_SetPropertiesText, K2Node_MakeArray_Array_5) == 0x000328, "Member 'WBP_ModernMenu_AddedEffects_C_SetPropertiesText::K2Node_MakeArray_Array_5' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_AddedEffects_C_SetPropertiesText, CallFunc_Format_ReturnValue_5) == 0x000338, "Member 'WBP_ModernMenu_AddedEffects_C_SetPropertiesText::CallFunc_Format_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_AddedEffects_C_SetPropertiesText, K2Node_Select_Default_1) == 0x000350, "Member 'WBP_ModernMenu_AddedEffects_C_SetPropertiesText::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_AddedEffects_C_SetPropertiesText, CallFunc_Conv_IntToInt64_ReturnValue_4) == 0x000368, "Member 'WBP_ModernMenu_AddedEffects_C_SetPropertiesText::CallFunc_Conv_IntToInt64_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_AddedEffects_C_SetPropertiesText, K2Node_MakeStruct_FormatArgumentData_6) == 0x000370, "Member 'WBP_ModernMenu_AddedEffects_C_SetPropertiesText::K2Node_MakeStruct_FormatArgumentData_6' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_AddedEffects_C_SetPropertiesText, K2Node_MakeArray_Array_6) == 0x0003C0, "Member 'WBP_ModernMenu_AddedEffects_C_SetPropertiesText::K2Node_MakeArray_Array_6' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_AddedEffects_C_SetPropertiesText, CallFunc_Format_ReturnValue_6) == 0x0003D0, "Member 'WBP_ModernMenu_AddedEffects_C_SetPropertiesText::CallFunc_Format_ReturnValue_6' has a wrong offset!");

// Function WBP_ModernMenu_AddedEffects.WBP_ModernMenu_AddedEffects_C.SetPropertiesVisibility
// 0x000E (0x000E - 0x0000)
struct WBP_ModernMenu_AddedEffects_C_SetPropertiesVisibility final
{
public:
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_AddedEffects_C_SetPropertiesVisibility) == 0x000001, "Wrong alignment on WBP_ModernMenu_AddedEffects_C_SetPropertiesVisibility");
static_assert(sizeof(WBP_ModernMenu_AddedEffects_C_SetPropertiesVisibility) == 0x00000E, "Wrong size on WBP_ModernMenu_AddedEffects_C_SetPropertiesVisibility");
static_assert(offsetof(WBP_ModernMenu_AddedEffects_C_SetPropertiesVisibility, Temp_byte_Variable) == 0x000000, "Member 'WBP_ModernMenu_AddedEffects_C_SetPropertiesVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_AddedEffects_C_SetPropertiesVisibility, Temp_byte_Variable_1) == 0x000001, "Member 'WBP_ModernMenu_AddedEffects_C_SetPropertiesVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_AddedEffects_C_SetPropertiesVisibility, Temp_bool_Variable) == 0x000002, "Member 'WBP_ModernMenu_AddedEffects_C_SetPropertiesVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_AddedEffects_C_SetPropertiesVisibility, Temp_byte_Variable_2) == 0x000003, "Member 'WBP_ModernMenu_AddedEffects_C_SetPropertiesVisibility::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_AddedEffects_C_SetPropertiesVisibility, Temp_byte_Variable_3) == 0x000004, "Member 'WBP_ModernMenu_AddedEffects_C_SetPropertiesVisibility::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_AddedEffects_C_SetPropertiesVisibility, Temp_bool_Variable_1) == 0x000005, "Member 'WBP_ModernMenu_AddedEffects_C_SetPropertiesVisibility::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_AddedEffects_C_SetPropertiesVisibility, Temp_byte_Variable_4) == 0x000006, "Member 'WBP_ModernMenu_AddedEffects_C_SetPropertiesVisibility::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_AddedEffects_C_SetPropertiesVisibility, Temp_byte_Variable_5) == 0x000007, "Member 'WBP_ModernMenu_AddedEffects_C_SetPropertiesVisibility::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_AddedEffects_C_SetPropertiesVisibility, Temp_bool_Variable_2) == 0x000008, "Member 'WBP_ModernMenu_AddedEffects_C_SetPropertiesVisibility::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_AddedEffects_C_SetPropertiesVisibility, K2Node_Select_Default) == 0x000009, "Member 'WBP_ModernMenu_AddedEffects_C_SetPropertiesVisibility::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_AddedEffects_C_SetPropertiesVisibility, CallFunc_Greater_IntInt_ReturnValue) == 0x00000A, "Member 'WBP_ModernMenu_AddedEffects_C_SetPropertiesVisibility::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_AddedEffects_C_SetPropertiesVisibility, K2Node_Select_Default_1) == 0x00000B, "Member 'WBP_ModernMenu_AddedEffects_C_SetPropertiesVisibility::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_AddedEffects_C_SetPropertiesVisibility, CallFunc_Greater_IntInt_ReturnValue_1) == 0x00000C, "Member 'WBP_ModernMenu_AddedEffects_C_SetPropertiesVisibility::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_AddedEffects_C_SetPropertiesVisibility, K2Node_Select_Default_2) == 0x00000D, "Member 'WBP_ModernMenu_AddedEffects_C_SetPropertiesVisibility::K2Node_Select_Default_2' has a wrong offset!");

}

