#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Modern_QuestEntry

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Altar_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Modern_QuestEntry.WBP_Modern_QuestEntry_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_Modern_QuestEntry_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_QuestEntry_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong alignment on WBP_Modern_QuestEntry_C_BP_OnItemSelectionChanged");
static_assert(sizeof(WBP_Modern_QuestEntry_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong size on WBP_Modern_QuestEntry_C_BP_OnItemSelectionChanged");
static_assert(offsetof(WBP_Modern_QuestEntry_C_BP_OnItemSelectionChanged, bIsSelected) == 0x000000, "Member 'WBP_Modern_QuestEntry_C_BP_OnItemSelectionChanged::bIsSelected' has a wrong offset!");

// Function WBP_Modern_QuestEntry.WBP_Modern_QuestEntry_C.ExecuteUbergraph_WBP_Modern_QuestEntry
// 0x00E0 (0x00E0 - 0x0000)
struct WBP_Modern_QuestEntry_C_ExecuteUbergraph_WBP_Modern_QuestEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVLegacyMapMenuQuestItem*               K2Node_DynamicCast_AsVLegacy_Map_Menu_Quest_Item;  // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLegacyMapMenuQuestProperties          CallFunc_GetProperties_ReturnValue;                // 0x0020(0x0098)(ConstParm)
	bool                                          K2Node_Event_bIsSelected;                          // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x00C0(0x0018)()
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue;          // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x00DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00DE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_QuestEntry_C_ExecuteUbergraph_WBP_Modern_QuestEntry) == 0x000008, "Wrong alignment on WBP_Modern_QuestEntry_C_ExecuteUbergraph_WBP_Modern_QuestEntry");
static_assert(sizeof(WBP_Modern_QuestEntry_C_ExecuteUbergraph_WBP_Modern_QuestEntry) == 0x0000E0, "Wrong size on WBP_Modern_QuestEntry_C_ExecuteUbergraph_WBP_Modern_QuestEntry");
static_assert(offsetof(WBP_Modern_QuestEntry_C_ExecuteUbergraph_WBP_Modern_QuestEntry, EntryPoint) == 0x000000, "Member 'WBP_Modern_QuestEntry_C_ExecuteUbergraph_WBP_Modern_QuestEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestEntry_C_ExecuteUbergraph_WBP_Modern_QuestEntry, Temp_bool_Variable) == 0x000004, "Member 'WBP_Modern_QuestEntry_C_ExecuteUbergraph_WBP_Modern_QuestEntry::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestEntry_C_ExecuteUbergraph_WBP_Modern_QuestEntry, Temp_byte_Variable) == 0x000005, "Member 'WBP_Modern_QuestEntry_C_ExecuteUbergraph_WBP_Modern_QuestEntry::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestEntry_C_ExecuteUbergraph_WBP_Modern_QuestEntry, Temp_byte_Variable_1) == 0x000006, "Member 'WBP_Modern_QuestEntry_C_ExecuteUbergraph_WBP_Modern_QuestEntry::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestEntry_C_ExecuteUbergraph_WBP_Modern_QuestEntry, K2Node_Event_ListItemObject) == 0x000008, "Member 'WBP_Modern_QuestEntry_C_ExecuteUbergraph_WBP_Modern_QuestEntry::K2Node_Event_ListItemObject' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestEntry_C_ExecuteUbergraph_WBP_Modern_QuestEntry, K2Node_DynamicCast_AsVLegacy_Map_Menu_Quest_Item) == 0x000010, "Member 'WBP_Modern_QuestEntry_C_ExecuteUbergraph_WBP_Modern_QuestEntry::K2Node_DynamicCast_AsVLegacy_Map_Menu_Quest_Item' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestEntry_C_ExecuteUbergraph_WBP_Modern_QuestEntry, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_Modern_QuestEntry_C_ExecuteUbergraph_WBP_Modern_QuestEntry::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestEntry_C_ExecuteUbergraph_WBP_Modern_QuestEntry, CallFunc_GetProperties_ReturnValue) == 0x000020, "Member 'WBP_Modern_QuestEntry_C_ExecuteUbergraph_WBP_Modern_QuestEntry::CallFunc_GetProperties_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestEntry_C_ExecuteUbergraph_WBP_Modern_QuestEntry, K2Node_Event_bIsSelected) == 0x0000B8, "Member 'WBP_Modern_QuestEntry_C_ExecuteUbergraph_WBP_Modern_QuestEntry::K2Node_Event_bIsSelected' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestEntry_C_ExecuteUbergraph_WBP_Modern_QuestEntry, CallFunc_MakeLiteralText_ReturnValue) == 0x0000C0, "Member 'WBP_Modern_QuestEntry_C_ExecuteUbergraph_WBP_Modern_QuestEntry::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestEntry_C_ExecuteUbergraph_WBP_Modern_QuestEntry, CallFunc_EqualEqual_TextText_ReturnValue) == 0x0000D8, "Member 'WBP_Modern_QuestEntry_C_ExecuteUbergraph_WBP_Modern_QuestEntry::CallFunc_EqualEqual_TextText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestEntry_C_ExecuteUbergraph_WBP_Modern_QuestEntry, CallFunc_Not_PreBool_ReturnValue) == 0x0000D9, "Member 'WBP_Modern_QuestEntry_C_ExecuteUbergraph_WBP_Modern_QuestEntry::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestEntry_C_ExecuteUbergraph_WBP_Modern_QuestEntry, CallFunc_Not_PreBool_ReturnValue_1) == 0x0000DA, "Member 'WBP_Modern_QuestEntry_C_ExecuteUbergraph_WBP_Modern_QuestEntry::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestEntry_C_ExecuteUbergraph_WBP_Modern_QuestEntry, CallFunc_Not_PreBool_ReturnValue_2) == 0x0000DB, "Member 'WBP_Modern_QuestEntry_C_ExecuteUbergraph_WBP_Modern_QuestEntry::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestEntry_C_ExecuteUbergraph_WBP_Modern_QuestEntry, CallFunc_Not_PreBool_ReturnValue_3) == 0x0000DC, "Member 'WBP_Modern_QuestEntry_C_ExecuteUbergraph_WBP_Modern_QuestEntry::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestEntry_C_ExecuteUbergraph_WBP_Modern_QuestEntry, CallFunc_BooleanAND_ReturnValue) == 0x0000DD, "Member 'WBP_Modern_QuestEntry_C_ExecuteUbergraph_WBP_Modern_QuestEntry::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestEntry_C_ExecuteUbergraph_WBP_Modern_QuestEntry, K2Node_Select_Default) == 0x0000DE, "Member 'WBP_Modern_QuestEntry_C_ExecuteUbergraph_WBP_Modern_QuestEntry::K2Node_Select_Default' has a wrong offset!");

// Function WBP_Modern_QuestEntry.WBP_Modern_QuestEntry_C.IsMainQuest
// 0x0050 (0x0050 - 0x0000)
struct WBP_Modern_QuestEntry_C_IsMainQuest final
{
public:
	class FText                                   NewName;                                           // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          IsMainQuest_0;                                     // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Array_Get_Item;                           // 0x0030(0x0018)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue;          // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_QuestEntry_C_IsMainQuest) == 0x000008, "Wrong alignment on WBP_Modern_QuestEntry_C_IsMainQuest");
static_assert(sizeof(WBP_Modern_QuestEntry_C_IsMainQuest) == 0x000050, "Wrong size on WBP_Modern_QuestEntry_C_IsMainQuest");
static_assert(offsetof(WBP_Modern_QuestEntry_C_IsMainQuest, NewName) == 0x000000, "Member 'WBP_Modern_QuestEntry_C_IsMainQuest::NewName' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestEntry_C_IsMainQuest, IsMainQuest_0) == 0x000018, "Member 'WBP_Modern_QuestEntry_C_IsMainQuest::IsMainQuest_0' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestEntry_C_IsMainQuest, Temp_bool_True_if_break_was_hit_Variable) == 0x000019, "Member 'WBP_Modern_QuestEntry_C_IsMainQuest::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestEntry_C_IsMainQuest, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'WBP_Modern_QuestEntry_C_IsMainQuest::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestEntry_C_IsMainQuest, CallFunc_Not_PreBool_ReturnValue) == 0x000020, "Member 'WBP_Modern_QuestEntry_C_IsMainQuest::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestEntry_C_IsMainQuest, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'WBP_Modern_QuestEntry_C_IsMainQuest::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestEntry_C_IsMainQuest, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'WBP_Modern_QuestEntry_C_IsMainQuest::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestEntry_C_IsMainQuest, CallFunc_Array_Length_ReturnValue) == 0x00002C, "Member 'WBP_Modern_QuestEntry_C_IsMainQuest::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestEntry_C_IsMainQuest, CallFunc_Array_Get_Item) == 0x000030, "Member 'WBP_Modern_QuestEntry_C_IsMainQuest::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestEntry_C_IsMainQuest, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'WBP_Modern_QuestEntry_C_IsMainQuest::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestEntry_C_IsMainQuest, CallFunc_EqualEqual_TextText_ReturnValue) == 0x000049, "Member 'WBP_Modern_QuestEntry_C_IsMainQuest::CallFunc_EqualEqual_TextText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestEntry_C_IsMainQuest, CallFunc_BooleanAND_ReturnValue) == 0x00004A, "Member 'WBP_Modern_QuestEntry_C_IsMainQuest::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_Modern_QuestEntry.WBP_Modern_QuestEntry_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct WBP_Modern_QuestEntry_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_QuestEntry_C_OnListItemObjectSet) == 0x000008, "Wrong alignment on WBP_Modern_QuestEntry_C_OnListItemObjectSet");
static_assert(sizeof(WBP_Modern_QuestEntry_C_OnListItemObjectSet) == 0x000008, "Wrong size on WBP_Modern_QuestEntry_C_OnListItemObjectSet");
static_assert(offsetof(WBP_Modern_QuestEntry_C_OnListItemObjectSet, ListItemObject) == 0x000000, "Member 'WBP_Modern_QuestEntry_C_OnListItemObjectSet::ListItemObject' has a wrong offset!");

// Function WBP_Modern_QuestEntry.WBP_Modern_QuestEntry_C.SelectStateIcon
// 0x0009 (0x0009 - 0x0000)
struct WBP_Modern_QuestEntry_C_SelectStateIcon final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMainQuest_IsMainQuest;                  // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_QuestEntry_C_SelectStateIcon) == 0x000001, "Wrong alignment on WBP_Modern_QuestEntry_C_SelectStateIcon");
static_assert(sizeof(WBP_Modern_QuestEntry_C_SelectStateIcon) == 0x000009, "Wrong size on WBP_Modern_QuestEntry_C_SelectStateIcon");
static_assert(offsetof(WBP_Modern_QuestEntry_C_SelectStateIcon, Temp_bool_Variable) == 0x000000, "Member 'WBP_Modern_QuestEntry_C_SelectStateIcon::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestEntry_C_SelectStateIcon, Temp_byte_Variable) == 0x000001, "Member 'WBP_Modern_QuestEntry_C_SelectStateIcon::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestEntry_C_SelectStateIcon, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_Modern_QuestEntry_C_SelectStateIcon::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestEntry_C_SelectStateIcon, Temp_bool_Variable_1) == 0x000003, "Member 'WBP_Modern_QuestEntry_C_SelectStateIcon::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestEntry_C_SelectStateIcon, Temp_byte_Variable_2) == 0x000004, "Member 'WBP_Modern_QuestEntry_C_SelectStateIcon::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestEntry_C_SelectStateIcon, Temp_byte_Variable_3) == 0x000005, "Member 'WBP_Modern_QuestEntry_C_SelectStateIcon::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestEntry_C_SelectStateIcon, CallFunc_IsMainQuest_IsMainQuest) == 0x000006, "Member 'WBP_Modern_QuestEntry_C_SelectStateIcon::CallFunc_IsMainQuest_IsMainQuest' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestEntry_C_SelectStateIcon, K2Node_Select_Default) == 0x000007, "Member 'WBP_Modern_QuestEntry_C_SelectStateIcon::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestEntry_C_SelectStateIcon, K2Node_Select_Default_1) == 0x000008, "Member 'WBP_Modern_QuestEntry_C_SelectStateIcon::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_Modern_QuestEntry.WBP_Modern_QuestEntry_C.SetIcon
// 0x00F0 (0x00F0 - 0x0000)
struct WBP_Modern_QuestEntry_C_SetIcon final
{
public:
	class UTexture2D*                             Texture;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_MakeBrushFromTexture_ReturnValue;         // 0x0010(0x00D0)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_QuestEntry_C_SetIcon) == 0x000010, "Wrong alignment on WBP_Modern_QuestEntry_C_SetIcon");
static_assert(sizeof(WBP_Modern_QuestEntry_C_SetIcon) == 0x0000F0, "Wrong size on WBP_Modern_QuestEntry_C_SetIcon");
static_assert(offsetof(WBP_Modern_QuestEntry_C_SetIcon, Texture) == 0x000000, "Member 'WBP_Modern_QuestEntry_C_SetIcon::Texture' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestEntry_C_SetIcon, CallFunc_MakeBrushFromTexture_ReturnValue) == 0x000010, "Member 'WBP_Modern_QuestEntry_C_SetIcon::CallFunc_MakeBrushFromTexture_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestEntry_C_SetIcon, CallFunc_IsValid_ReturnValue) == 0x0000E0, "Member 'WBP_Modern_QuestEntry_C_SetIcon::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_Modern_QuestEntry.WBP_Modern_QuestEntry_C.SetProperties
// 0x0098 (0x0098 - 0x0000)
struct WBP_Modern_QuestEntry_C_SetProperties final
{
public:
	struct FLegacyMapMenuQuestProperties          NewProperties;                                     // 0x0000(0x0098)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Modern_QuestEntry_C_SetProperties) == 0x000008, "Wrong alignment on WBP_Modern_QuestEntry_C_SetProperties");
static_assert(sizeof(WBP_Modern_QuestEntry_C_SetProperties) == 0x000098, "Wrong size on WBP_Modern_QuestEntry_C_SetProperties");
static_assert(offsetof(WBP_Modern_QuestEntry_C_SetProperties, NewProperties) == 0x000000, "Member 'WBP_Modern_QuestEntry_C_SetProperties::NewProperties' has a wrong offset!");

}

