#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_OriginalMenu_InventoryEntry_ValueWithLine

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_OriginalMenu_InventoryEntry_ValueWithLine.WBP_OriginalMenu_InventoryEntry_ValueWithLine_C
// 0x0030 (0x02F0 - 0x02C0)
class UWBP_OriginalMenu_InventoryEntry_ValueWithLine_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_OriginalImageTile_C*               inv_entry_line;                                    // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               inv_entry_sizebox;                                 // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AltarTextBlock_C*                  inv_entry_value;                                   // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        WidgetWidth;                                       // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSpacerDisplayed;                                 // 0x02E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_OriginalMenu_InventoryEntry_ValueWithLine(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetTextValue(const class FText& NewText);
	void UpdateSpacerVisibility();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_OriginalMenu_InventoryEntry_ValueWithLine_C">();
	}
	static class UWBP_OriginalMenu_InventoryEntry_ValueWithLine_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_OriginalMenu_InventoryEntry_ValueWithLine_C>();
	}
};
static_assert(alignof(UWBP_OriginalMenu_InventoryEntry_ValueWithLine_C) == 0x000008, "Wrong alignment on UWBP_OriginalMenu_InventoryEntry_ValueWithLine_C");
static_assert(sizeof(UWBP_OriginalMenu_InventoryEntry_ValueWithLine_C) == 0x0002F0, "Wrong size on UWBP_OriginalMenu_InventoryEntry_ValueWithLine_C");
static_assert(offsetof(UWBP_OriginalMenu_InventoryEntry_ValueWithLine_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_OriginalMenu_InventoryEntry_ValueWithLine_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryEntry_ValueWithLine_C, inv_entry_line) == 0x0002C8, "Member 'UWBP_OriginalMenu_InventoryEntry_ValueWithLine_C::inv_entry_line' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryEntry_ValueWithLine_C, inv_entry_sizebox) == 0x0002D0, "Member 'UWBP_OriginalMenu_InventoryEntry_ValueWithLine_C::inv_entry_sizebox' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryEntry_ValueWithLine_C, inv_entry_value) == 0x0002D8, "Member 'UWBP_OriginalMenu_InventoryEntry_ValueWithLine_C::inv_entry_value' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryEntry_ValueWithLine_C, WidgetWidth) == 0x0002E0, "Member 'UWBP_OriginalMenu_InventoryEntry_ValueWithLine_C::WidgetWidth' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryEntry_ValueWithLine_C, IsSpacerDisplayed) == 0x0002E8, "Member 'UWBP_OriginalMenu_InventoryEntry_ValueWithLine_C::IsSpacerDisplayed' has a wrong offset!");

}

