#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModernMenu_StatsPage4

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Altar_structs.hpp"
#include "Altar_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ModernMenu_StatsPage4.WBP_ModernMenu_StatsPage4_C
// 0x0040 (0x0508 - 0x04C8)
class UWBP_ModernMenu_StatsPage4_C final : public UVLegacyStatsMenuPage4
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVStatsMenuViewModel*                   VStatsMenuViewModel;                               // 0x04D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       StatsPage4FadeInOut;                               // 0x04D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_ModernMenu_StatsPage4_ListView_C*  stat_p4_factions_listview;                         // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        ScrollByNavigationInput;                           // 0x04E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FLegacyStatsMenuFactionProperties> Factions;                                       // 0x04F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          DoPlayAnimation;                                   // 0x0500(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_ModernMenu_StatsPage4_stat_p4_factions_listview_K2Node_ComponentBoundEvent_0_OnItemHovered__DelegateSignature(class UObject* HoveredItem);
	void BP_OnActivated();
	void BP_OnDeactivated();
	void ExecuteUbergraph_WBP_ModernMenu_StatsPage4(int32 EntryPoint);
	void OnFocus();
	void UpdateFactions(const TArray<struct FLegacyStatsMenuFactionProperties>& NewFactions);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ModernMenu_StatsPage4_C">();
	}
	static class UWBP_ModernMenu_StatsPage4_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ModernMenu_StatsPage4_C>();
	}
};
static_assert(alignof(UWBP_ModernMenu_StatsPage4_C) == 0x000008, "Wrong alignment on UWBP_ModernMenu_StatsPage4_C");
static_assert(sizeof(UWBP_ModernMenu_StatsPage4_C) == 0x000508, "Wrong size on UWBP_ModernMenu_StatsPage4_C");
static_assert(offsetof(UWBP_ModernMenu_StatsPage4_C, UberGraphFrame) == 0x0004C8, "Member 'UWBP_ModernMenu_StatsPage4_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsPage4_C, VStatsMenuViewModel) == 0x0004D0, "Member 'UWBP_ModernMenu_StatsPage4_C::VStatsMenuViewModel' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsPage4_C, StatsPage4FadeInOut) == 0x0004D8, "Member 'UWBP_ModernMenu_StatsPage4_C::StatsPage4FadeInOut' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsPage4_C, stat_p4_factions_listview) == 0x0004E0, "Member 'UWBP_ModernMenu_StatsPage4_C::stat_p4_factions_listview' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsPage4_C, ScrollByNavigationInput) == 0x0004E8, "Member 'UWBP_ModernMenu_StatsPage4_C::ScrollByNavigationInput' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsPage4_C, Factions) == 0x0004F0, "Member 'UWBP_ModernMenu_StatsPage4_C::Factions' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsPage4_C, DoPlayAnimation) == 0x000500, "Member 'UWBP_ModernMenu_StatsPage4_C::DoPlayAnimation' has a wrong offset!");

}

