#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModernMenu_MagicMenu

#include "Basic.hpp"

#include "Altar_structs.hpp"
#include "EnhancedInput_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_ModernMenu_MagicMenu.WBP_ModernMenu_MagicMenu_C.BndEvt__WBP_ModernMenu_MagicMenu_Filters_K2Node_ComponentBoundEvent_0_OnSortTypeUpdated__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_ModernMenu_MagicMenu_C_BndEvt__WBP_ModernMenu_MagicMenu_Filters_K2Node_ComponentBoundEvent_0_OnSortTypeUpdated__DelegateSignature final
{
public:
	ELegacyMagicMenuSortType                      SortType;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_MagicMenu_C_BndEvt__WBP_ModernMenu_MagicMenu_Filters_K2Node_ComponentBoundEvent_0_OnSortTypeUpdated__DelegateSignature) == 0x000001, "Wrong alignment on WBP_ModernMenu_MagicMenu_C_BndEvt__WBP_ModernMenu_MagicMenu_Filters_K2Node_ComponentBoundEvent_0_OnSortTypeUpdated__DelegateSignature");
static_assert(sizeof(WBP_ModernMenu_MagicMenu_C_BndEvt__WBP_ModernMenu_MagicMenu_Filters_K2Node_ComponentBoundEvent_0_OnSortTypeUpdated__DelegateSignature) == 0x000001, "Wrong size on WBP_ModernMenu_MagicMenu_C_BndEvt__WBP_ModernMenu_MagicMenu_Filters_K2Node_ComponentBoundEvent_0_OnSortTypeUpdated__DelegateSignature");
static_assert(offsetof(WBP_ModernMenu_MagicMenu_C_BndEvt__WBP_ModernMenu_MagicMenu_Filters_K2Node_ComponentBoundEvent_0_OnSortTypeUpdated__DelegateSignature, SortType) == 0x000000, "Member 'WBP_ModernMenu_MagicMenu_C_BndEvt__WBP_ModernMenu_MagicMenu_Filters_K2Node_ComponentBoundEvent_0_OnSortTypeUpdated__DelegateSignature::SortType' has a wrong offset!");

// Function WBP_ModernMenu_MagicMenu.WBP_ModernMenu_MagicMenu_C.BndEvt__WBP_ModernMenu_MagicMenu_Filters_K2Node_ComponentBoundEvent_1_OnIsReversedUpdated__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_ModernMenu_MagicMenu_C_BndEvt__WBP_ModernMenu_MagicMenu_Filters_K2Node_ComponentBoundEvent_1_OnIsReversedUpdated__DelegateSignature final
{
public:
	bool                                          bIsReversed;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_MagicMenu_C_BndEvt__WBP_ModernMenu_MagicMenu_Filters_K2Node_ComponentBoundEvent_1_OnIsReversedUpdated__DelegateSignature) == 0x000001, "Wrong alignment on WBP_ModernMenu_MagicMenu_C_BndEvt__WBP_ModernMenu_MagicMenu_Filters_K2Node_ComponentBoundEvent_1_OnIsReversedUpdated__DelegateSignature");
static_assert(sizeof(WBP_ModernMenu_MagicMenu_C_BndEvt__WBP_ModernMenu_MagicMenu_Filters_K2Node_ComponentBoundEvent_1_OnIsReversedUpdated__DelegateSignature) == 0x000001, "Wrong size on WBP_ModernMenu_MagicMenu_C_BndEvt__WBP_ModernMenu_MagicMenu_Filters_K2Node_ComponentBoundEvent_1_OnIsReversedUpdated__DelegateSignature");
static_assert(offsetof(WBP_ModernMenu_MagicMenu_C_BndEvt__WBP_ModernMenu_MagicMenu_Filters_K2Node_ComponentBoundEvent_1_OnIsReversedUpdated__DelegateSignature, bIsReversed) == 0x000000, "Member 'WBP_ModernMenu_MagicMenu_C_BndEvt__WBP_ModernMenu_MagicMenu_Filters_K2Node_ComponentBoundEvent_1_OnIsReversedUpdated__DelegateSignature::bIsReversed' has a wrong offset!");

// Function WBP_ModernMenu_MagicMenu.WBP_ModernMenu_MagicMenu_C.BndEvt__WBP_ModernMenu_MagicMenu_Magic_Spell_List_K2Node_ComponentBoundEvent_7_OnItemHovered__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ModernMenu_MagicMenu_C_BndEvt__WBP_ModernMenu_MagicMenu_Magic_Spell_List_K2Node_ComponentBoundEvent_7_OnItemHovered__DelegateSignature final
{
public:
	class UObject*                                HoveredItem;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_MagicMenu_C_BndEvt__WBP_ModernMenu_MagicMenu_Magic_Spell_List_K2Node_ComponentBoundEvent_7_OnItemHovered__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ModernMenu_MagicMenu_C_BndEvt__WBP_ModernMenu_MagicMenu_Magic_Spell_List_K2Node_ComponentBoundEvent_7_OnItemHovered__DelegateSignature");
static_assert(sizeof(WBP_ModernMenu_MagicMenu_C_BndEvt__WBP_ModernMenu_MagicMenu_Magic_Spell_List_K2Node_ComponentBoundEvent_7_OnItemHovered__DelegateSignature) == 0x000008, "Wrong size on WBP_ModernMenu_MagicMenu_C_BndEvt__WBP_ModernMenu_MagicMenu_Magic_Spell_List_K2Node_ComponentBoundEvent_7_OnItemHovered__DelegateSignature");
static_assert(offsetof(WBP_ModernMenu_MagicMenu_C_BndEvt__WBP_ModernMenu_MagicMenu_Magic_Spell_List_K2Node_ComponentBoundEvent_7_OnItemHovered__DelegateSignature, HoveredItem) == 0x000000, "Member 'WBP_ModernMenu_MagicMenu_C_BndEvt__WBP_ModernMenu_MagicMenu_Magic_Spell_List_K2Node_ComponentBoundEvent_7_OnItemHovered__DelegateSignature::HoveredItem' has a wrong offset!");

// Function WBP_ModernMenu_MagicMenu.WBP_ModernMenu_MagicMenu_C.BndEvt__WBP_ModernMenu_MagicMenu_Magic_Spell_List_K2Node_ComponentBoundEvent_8_OnItemClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ModernMenu_MagicMenu_C_BndEvt__WBP_ModernMenu_MagicMenu_Magic_Spell_List_K2Node_ComponentBoundEvent_8_OnItemClicked__DelegateSignature final
{
public:
	class UObject*                                SelectedItem;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_MagicMenu_C_BndEvt__WBP_ModernMenu_MagicMenu_Magic_Spell_List_K2Node_ComponentBoundEvent_8_OnItemClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ModernMenu_MagicMenu_C_BndEvt__WBP_ModernMenu_MagicMenu_Magic_Spell_List_K2Node_ComponentBoundEvent_8_OnItemClicked__DelegateSignature");
static_assert(sizeof(WBP_ModernMenu_MagicMenu_C_BndEvt__WBP_ModernMenu_MagicMenu_Magic_Spell_List_K2Node_ComponentBoundEvent_8_OnItemClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_ModernMenu_MagicMenu_C_BndEvt__WBP_ModernMenu_MagicMenu_Magic_Spell_List_K2Node_ComponentBoundEvent_8_OnItemClicked__DelegateSignature");
static_assert(offsetof(WBP_ModernMenu_MagicMenu_C_BndEvt__WBP_ModernMenu_MagicMenu_Magic_Spell_List_K2Node_ComponentBoundEvent_8_OnItemClicked__DelegateSignature, SelectedItem) == 0x000000, "Member 'WBP_ModernMenu_MagicMenu_C_BndEvt__WBP_ModernMenu_MagicMenu_Magic_Spell_List_K2Node_ComponentBoundEvent_8_OnItemClicked__DelegateSignature::SelectedItem' has a wrong offset!");

// Function WBP_ModernMenu_MagicMenu.WBP_ModernMenu_MagicMenu_C.ExecuteUbergraph_WBP_ModernMenu_MagicMenu
// 0x06B8 (0x06B8 - 0x0000)
struct WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVUINavigationGlobalSubsystem*          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_10;    // 0x0010(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_10;    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_10;  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_10;   // 0x0038(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable;                              // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_InputActionValueToAxis1D_ReturnValue; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable;                                // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_0;                              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1_0;                            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2;                              // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_9;     // 0x0078(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_9;     // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_9;   // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_9;    // 0x00A0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue;  // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           Temp_object_Variable_1;                            // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3;                              // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3_0;                            // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_4;                              // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_4_0;                            // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_8;     // 0x00E0(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_8;     // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_8;   // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_8;    // 0x0108(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable_2;                            // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_1; // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_5;                              // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_6;                              // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_5_0;                            // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_6_0;                            // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_7;     // 0x0148(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_7;     // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_7;   // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_7;    // 0x0170(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_2; // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           Temp_object_Variable_3;                            // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_7;                              // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_7_0;                            // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_8;                              // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_8_0;                            // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_6;     // 0x01B0(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_6;     // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_6;   // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_6;    // 0x01D8(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable_4;                            // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_3; // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_9;                              // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_10;                             // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_9_0;                            // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_10_0;                           // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_5;     // 0x0218(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_5;     // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_5;   // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_5;    // 0x0240(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_4; // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           Temp_object_Variable_5;                            // 0x0250(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_11;                             // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_11_0;                           // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_12;                             // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_12_0;                           // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_4;     // 0x0280(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_4;     // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_4;   // 0x02A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_4;    // 0x02A8(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable_6;                            // 0x02B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_5; // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_13;                             // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_14;                             // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_13_0;                           // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_14_0;                           // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E1[0x7];                                      // 0x02E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_3;     // 0x02E8(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_3;     // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_3;   // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_3;    // 0x0310(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_6; // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_319[0x7];                                      // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           Temp_object_Variable_7;                            // 0x0320(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_15;                             // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_15_0;                           // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_16;                             // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_6;                              // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_341[0x7];                                      // 0x0341(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_16_0;                           // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_2;     // 0x0350(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_2;     // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_2;   // 0x0374(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_2;    // 0x0378(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable_8;                            // 0x0380(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_7; // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_389[0x7];                                      // 0x0389(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_17;                             // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_18;                             // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_17_0;                           // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_18_0;                           // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_7;                              // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B1[0x7];                                      // 0x03B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_1;     // 0x03B8(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_1;     // 0x03D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_1;   // 0x03DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_1;    // 0x03E0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable_9;                            // 0x03E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_8; // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F1[0x7];                                      // 0x03F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_19;                             // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_20;                             // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_19_0;                           // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_20_0;                           // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_8;                              // 0x0418(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_419[0x7];                                      // 0x0419(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue;       // 0x0420(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime;       // 0x0440(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime;     // 0x0444(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction;      // 0x0448(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_9; // 0x0450(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_451[0x7];                                      // 0x0451(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           Temp_object_Variable_10;                           // 0x0458(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_21;                             // 0x0460(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_21_0;                           // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_22;                             // 0x0470(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_9;                              // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_479[0x7];                                      // 0x0479(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_22_0;                           // 0x0480(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVUINavigationGlobalSubsystem*          CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0488(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVUINavigationGlobalSubsystem*          CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0490(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FLegacyMagicMenuItemProperties> K2Node_CustomEvent_NewList;                        // 0x0498(0x0010)(ConstParm, ReferenceParm)
	double                                        K2Node_CustomEvent_New_Effectiveness;              // 0x04A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_ComponentBoundEvent_HoveredItem;            // 0x04B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVLegacyMagicMenuItem*                  K2Node_DynamicCast_AsVLegacy_Magic_Menu_Item;      // 0x04B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x04C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C1[0x7];                                      // 0x04C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_ComponentBoundEvent_SelectedItem;           // 0x04C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVLegacyMagicMenuItem*                  K2Node_DynamicCast_AsVLegacy_Magic_Menu_Item_1;    // 0x04D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x04D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D9[0x3];                                      // 0x04D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetInventoryIndex_ReturnValue;            // 0x04DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsReversed;            // 0x04E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELegacyMagicMenuSortType                      K2Node_ComponentBoundEvent_SortType;               // 0x04E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E2[0x6];                                      // 0x04E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_NewParam_2;                     // 0x04E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_NewParam_1;                     // 0x04F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_NewParam;                       // 0x04F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_New_Value_1;                    // 0x0500(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_New_Value;                      // 0x0508(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELegacyMagicMenuPage                          CallFunc_GetNextPageEnum_New_Page;                 // 0x0510(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELegacyMagicMenuPage                          CallFunc_GetNextPageEnum_New_Page_1;               // 0x0511(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_512[0x6];                                      // 0x0512(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IVEnhancedInputNavigable> CallFunc_NavigateToWidget_Widget_CastInput;     // 0x0518(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0528(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELegacyMagicMenuPage                          K2Node_CustomEvent_New_Page;                       // 0x0529(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELegacyMagicMenuPage                          CallFunc_GetCurrentPage_ReturnValue;               // 0x052A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x052B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52C[0x4];                                      // 0x052C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0530(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_10;                             // 0x0538(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_539[0x7];                                      // 0x0539(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_23;                             // 0x0540(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_24;                             // 0x0548(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable_11;                           // 0x0550(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_11;    // 0x0558(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_11;    // 0x0578(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_11;  // 0x057C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_11;   // 0x0580(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsVisible;                           // 0x0588(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bFromLeft;                            // 0x0589(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInstant;                             // 0x058A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58B[0x5];                                      // 0x058B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_24_0;                           // 0x0590(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_23_0;                           // 0x0598(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_10; // 0x05A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_11;                             // 0x05A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A2[0x6];                                      // 0x05A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_25;                             // 0x05A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_26;                             // 0x05B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable_12;                           // 0x05B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_13;    // 0x05C0(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_13;    // 0x05E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_13;  // 0x05E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_13;   // 0x05E8(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetInventoryIndex_ReturnValue_1;          // 0x05F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F4[0x4];                                      // 0x05F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_26_0;                           // 0x05F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_25_0;                           // 0x0600(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_11; // 0x0608(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0609(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x060A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60B[0x5];                                      // 0x060B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FLegacyMagicMenuItemProperties> K2Node_CustomEvent_Items;                          // 0x0610(0x0010)(ConstParm, ReferenceParm)
	ELegacyMagicMenuPage                          CallFunc_GetCurrentPage_ReturnValue_1;             // 0x0620(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_12;                             // 0x0621(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_622[0x6];                                      // 0x0622(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_27;                             // 0x0628(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_28;                             // 0x0630(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable_13;                           // 0x0638(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_12;    // 0x0640(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_12;    // 0x0660(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_12;  // 0x0664(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_12;   // 0x0668(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IVEnhancedInputNavigable> CallFunc_IsWidgetInTopMostFocusedStack_Widget_CastInput; // 0x0670(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsWidgetInTopMostFocusedStack_ReturnValue; // 0x0680(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_681[0x7];                                      // 0x0681(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_28_0;                           // 0x0688(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_27_0;                           // 0x0690(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_12; // 0x0698(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_699[0x7];                                      // 0x0699(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IVEnhancedInputNavigable> CallFunc_IsWidgetInTopMostFocusedStack_Widget_CastInput_1; // 0x06A0(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsWidgetInTopMostFocusedStack_ReturnValue_1; // 0x06B0(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELegacyMagicMenuPage                          CallFunc_GetCurrentPage_ReturnValue_2;             // 0x06B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x06B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x06B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu) == 0x000008, "Wrong alignment on WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu");
static_assert(sizeof(WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu) == 0x0006B8, "Wrong size on WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu");
static_assert(offsetof(WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu, EntryPoint) == 0x000000, "Member 'WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu, K2Node_EnhancedInputActionEvent_ActionValue_10) == 0x000010, "Member 'WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu::K2Node_EnhancedInputActionEvent_ActionValue_10' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu, K2Node_EnhancedInputActionEvent_ElapsedTime_10) == 0x000030, "Member 'WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu::K2Node_EnhancedInputActionEvent_ElapsedTime_10' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu, K2Node_EnhancedInputActionEvent_TriggeredTime_10) == 0x000034, "Member 'WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu::K2Node_EnhancedInputActionEvent_TriggeredTime_10' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu, K2Node_EnhancedInputActionEvent_SourceAction_10) == 0x000038, "Member 'WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu::K2Node_EnhancedInputActionEvent_SourceAction_10' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu, Temp_object_Variable) == 0x000040, "Member 'WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu, CallFunc_Conv_InputActionValueToAxis1D_ReturnValue) == 0x000048, "Member 'WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu::CallFunc_Conv_InputActionValueToAxis1D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu, Temp_real_Variable) == 0x000050, "Member 'WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu, Temp_real_Variable_1) == 0x000058, "Member 'WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu, Temp_real_Variable_0) == 0x000060, "Member 'WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu::Temp_real_Variable_0' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu, Temp_real_Variable_1_0) == 0x000068, "Member 'WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu::Temp_real_Variable_1_0' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu, Temp_real_Variable_2) == 0x000070, "Member 'WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu, K2Node_EnhancedInputActionEvent_ActionValue_9) == 0x000078, "Member 'WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu::K2Node_EnhancedInputActionEvent_ActionValue_9' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu, K2Node_EnhancedInputActionEvent_ElapsedTime_9) == 0x000098, "Member 'WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu::K2Node_EnhancedInputActionEvent_ElapsedTime_9' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu, K2Node_EnhancedInputActionEvent_TriggeredTime_9) == 0x00009C, "Member 'WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu::K2Node_EnhancedInputActionEvent_TriggeredTime_9' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu, K2Node_EnhancedInputActionEvent_SourceAction_9) == 0x0000A0, "Member 'WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu::K2Node_EnhancedInputActionEvent_SourceAction_9' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu, CallFunc_Conv_InputActionValueToBool_ReturnValue) == 0x0000A8, "Member 'WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu::CallFunc_Conv_InputActionValueToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu, Temp_object_Variable_1) == 0x0000B0, "Member 'WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu, Temp_real_Variable_3) == 0x0000B8, "Member 'WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu, Temp_real_Variable_3_0) == 0x0000C0, "Member 'WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu::Temp_real_Variable_3_0' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu, Temp_real_Variable_4) == 0x0000C8, "Member 'WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu::Temp_real_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu, Temp_bool_Variable) == 0x0000D0, "Member 'WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu, Temp_real_Variable_4_0) == 0x0000D8, "Member 'WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu::Temp_real_Variable_4_0' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu, K2Node_EnhancedInputActionEvent_ActionValue_8) == 0x0000E0, "Member 'WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu::K2Node_EnhancedInputActionEvent_ActionValue_8' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu, K2Node_EnhancedInputActionEvent_ElapsedTime_8) == 0x000100, "Member 'WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu::K2Node_EnhancedInputActionEvent_ElapsedTime_8' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu, K2Node_EnhancedInputActionEvent_TriggeredTime_8) == 0x000104, "Member 'WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu::K2Node_EnhancedInputActionEvent_TriggeredTime_8' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu, K2Node_EnhancedInputActionEvent_SourceAction_8) == 0x000108, "Member 'WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu::K2Node_EnhancedInputActionEvent_SourceAction_8' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu, Temp_object_Variable_2) == 0x000110, "Member 'WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu, CallFunc_Conv_InputActionValueToBool_ReturnValue_1) == 0x000118, "Member 'WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu::CallFunc_Conv_InputActionValueToBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu, Temp_real_Variable_5) == 0x000120, "Member 'WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu::Temp_real_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu, Temp_real_Variable_6) == 0x000128, "Member 'WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu::Temp_real_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu, Temp_real_Variable_5_0) == 0x000130, "Member 'WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu::Temp_real_Variable_5_0' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu, Temp_real_Variable_6_0) == 0x000138, "Member 'WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu::Temp_real_Variable_6_0' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu, Temp_bool_Variable_1) == 0x000140, "Member 'WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu, K2Node_EnhancedInputActionEvent_ActionValue_7) == 0x000148, "Member 'WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu::K2Node_EnhancedInputActionEvent_ActionValue_7' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu, K2Node_EnhancedInputActionEvent_ElapsedTime_7) == 0x000168, "Member 'WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu::K2Node_EnhancedInputActionEvent_ElapsedTime_7' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu, K2Node_EnhancedInputActionEvent_TriggeredTime_7) == 0x00016C, "Member 'WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu::K2Node_EnhancedInputActionEvent_TriggeredTime_7' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu, K2Node_EnhancedInputActionEvent_SourceAction_7) == 0x000170, "Member 'WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu::K2Node_EnhancedInputActionEvent_SourceAction_7' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu, CallFunc_Conv_InputActionValueToBool_ReturnValue_2) == 0x000178, "Member 'WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu::CallFunc_Conv_InputActionValueToBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu, Temp_object_Variable_3) == 0x000180, "Member 'WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu, Temp_real_Variable_7) == 0x000188, "Member 'WBP_ModernMenu_MagicMenu_C_ExecuteUbergraph_WBP_ModernMenu_MagicMenu::Temp_real_Variable_7' has a wrong offset!");
