#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModernPrefab_ButtonWrapper

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Altar_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ModernPrefab_ButtonWrapper.WBP_ModernPrefab_ButtonWrapper_C
// 0x0050 (0x0518 - 0x04C8)
class UWBP_ModernPrefab_ButtonWrapper_C final : public UVAltarWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_ModernPrefab_Button_C*             modern_prefab_button;                              // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           FontColor;                                         // 0x04D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(int32 ButtonIndex)> OnClick;                                       // 0x04E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         ButtonIndex;                                       // 0x04F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4FC[0x4];                                      // 0x04FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Text;                                              // 0x0500(0x0018)(Edit, BlueprintVisible)

public:
	void PreConstruct(bool IsDesignTime);
	void OnFocus();
	void ExecuteUbergraph_WBP_ModernPrefab_ButtonWrapper(int32 EntryPoint);
	void BndEvt__WBP_ModernPrefab_ButtonWrapper_modern_prefab_button_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ModernPrefab_ButtonWrapper_C">();
	}
	static class UWBP_ModernPrefab_ButtonWrapper_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ModernPrefab_ButtonWrapper_C>();
	}
};
static_assert(alignof(UWBP_ModernPrefab_ButtonWrapper_C) == 0x000008, "Wrong alignment on UWBP_ModernPrefab_ButtonWrapper_C");
static_assert(sizeof(UWBP_ModernPrefab_ButtonWrapper_C) == 0x000518, "Wrong size on UWBP_ModernPrefab_ButtonWrapper_C");
static_assert(offsetof(UWBP_ModernPrefab_ButtonWrapper_C, UberGraphFrame) == 0x0004C8, "Member 'UWBP_ModernPrefab_ButtonWrapper_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ModernPrefab_ButtonWrapper_C, modern_prefab_button) == 0x0004D0, "Member 'UWBP_ModernPrefab_ButtonWrapper_C::modern_prefab_button' has a wrong offset!");
static_assert(offsetof(UWBP_ModernPrefab_ButtonWrapper_C, FontColor) == 0x0004D8, "Member 'UWBP_ModernPrefab_ButtonWrapper_C::FontColor' has a wrong offset!");
static_assert(offsetof(UWBP_ModernPrefab_ButtonWrapper_C, OnClick) == 0x0004E8, "Member 'UWBP_ModernPrefab_ButtonWrapper_C::OnClick' has a wrong offset!");
static_assert(offsetof(UWBP_ModernPrefab_ButtonWrapper_C, ButtonIndex) == 0x0004F8, "Member 'UWBP_ModernPrefab_ButtonWrapper_C::ButtonIndex' has a wrong offset!");
static_assert(offsetof(UWBP_ModernPrefab_ButtonWrapper_C, Text) == 0x000500, "Member 'UWBP_ModernPrefab_ButtonWrapper_C::Text' has a wrong offset!");

}

