#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_OriginalMenu_InventoryMainPart

#include "Basic.hpp"

#include "Altar_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_OriginalMenu_InventoryMainPart.WBP_OriginalMenu_InventoryMainPart_C.BndEvt__WBP_OriginalMenu_InventoryMainPart_inv_mainContent_K2Node_ComponentBoundEvent_11_OnListViewItemHovered__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_OriginalMenu_InventoryMainPart_C_BndEvt__WBP_OriginalMenu_InventoryMainPart_inv_mainContent_K2Node_ComponentBoundEvent_11_OnListViewItemHovered__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OriginalMenu_InventoryMainPart_C_BndEvt__WBP_OriginalMenu_InventoryMainPart_inv_mainContent_K2Node_ComponentBoundEvent_11_OnListViewItemHovered__DelegateSignature) == 0x000008, "Wrong alignment on WBP_OriginalMenu_InventoryMainPart_C_BndEvt__WBP_OriginalMenu_InventoryMainPart_inv_mainContent_K2Node_ComponentBoundEvent_11_OnListViewItemHovered__DelegateSignature");
static_assert(sizeof(WBP_OriginalMenu_InventoryMainPart_C_BndEvt__WBP_OriginalMenu_InventoryMainPart_inv_mainContent_K2Node_ComponentBoundEvent_11_OnListViewItemHovered__DelegateSignature) == 0x000008, "Wrong size on WBP_OriginalMenu_InventoryMainPart_C_BndEvt__WBP_OriginalMenu_InventoryMainPart_inv_mainContent_K2Node_ComponentBoundEvent_11_OnListViewItemHovered__DelegateSignature");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_BndEvt__WBP_OriginalMenu_InventoryMainPart_inv_mainContent_K2Node_ComponentBoundEvent_11_OnListViewItemHovered__DelegateSignature, Item) == 0x000000, "Member 'WBP_OriginalMenu_InventoryMainPart_C_BndEvt__WBP_OriginalMenu_InventoryMainPart_inv_mainContent_K2Node_ComponentBoundEvent_11_OnListViewItemHovered__DelegateSignature::Item' has a wrong offset!");

// Function WBP_OriginalMenu_InventoryMainPart.WBP_OriginalMenu_InventoryMainPart_C.BndEvt__WBP_OriginalMenu_InventoryMainPart_inv_mainContent_K2Node_ComponentBoundEvent_12_OnSortTypeUpdated__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_OriginalMenu_InventoryMainPart_C_BndEvt__WBP_OriginalMenu_InventoryMainPart_inv_mainContent_K2Node_ComponentBoundEvent_12_OnSortTypeUpdated__DelegateSignature final
{
public:
	EOriginalInventoryMenuSortType                SortType;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OriginalMenu_InventoryMainPart_C_BndEvt__WBP_OriginalMenu_InventoryMainPart_inv_mainContent_K2Node_ComponentBoundEvent_12_OnSortTypeUpdated__DelegateSignature) == 0x000001, "Wrong alignment on WBP_OriginalMenu_InventoryMainPart_C_BndEvt__WBP_OriginalMenu_InventoryMainPart_inv_mainContent_K2Node_ComponentBoundEvent_12_OnSortTypeUpdated__DelegateSignature");
static_assert(sizeof(WBP_OriginalMenu_InventoryMainPart_C_BndEvt__WBP_OriginalMenu_InventoryMainPart_inv_mainContent_K2Node_ComponentBoundEvent_12_OnSortTypeUpdated__DelegateSignature) == 0x000001, "Wrong size on WBP_OriginalMenu_InventoryMainPart_C_BndEvt__WBP_OriginalMenu_InventoryMainPart_inv_mainContent_K2Node_ComponentBoundEvent_12_OnSortTypeUpdated__DelegateSignature");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_BndEvt__WBP_OriginalMenu_InventoryMainPart_inv_mainContent_K2Node_ComponentBoundEvent_12_OnSortTypeUpdated__DelegateSignature, SortType) == 0x000000, "Member 'WBP_OriginalMenu_InventoryMainPart_C_BndEvt__WBP_OriginalMenu_InventoryMainPart_inv_mainContent_K2Node_ComponentBoundEvent_12_OnSortTypeUpdated__DelegateSignature::SortType' has a wrong offset!");

// Function WBP_OriginalMenu_InventoryMainPart.WBP_OriginalMenu_InventoryMainPart_C.BndEvt__WBP_OriginalMenu_InventoryMainPart_inv_mainContent_K2Node_ComponentBoundEvent_13_OnSortIsReversedUpdated__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_OriginalMenu_InventoryMainPart_C_BndEvt__WBP_OriginalMenu_InventoryMainPart_inv_mainContent_K2Node_ComponentBoundEvent_13_OnSortIsReversedUpdated__DelegateSignature final
{
public:
	bool                                          IsReversed;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OriginalMenu_InventoryMainPart_C_BndEvt__WBP_OriginalMenu_InventoryMainPart_inv_mainContent_K2Node_ComponentBoundEvent_13_OnSortIsReversedUpdated__DelegateSignature) == 0x000001, "Wrong alignment on WBP_OriginalMenu_InventoryMainPart_C_BndEvt__WBP_OriginalMenu_InventoryMainPart_inv_mainContent_K2Node_ComponentBoundEvent_13_OnSortIsReversedUpdated__DelegateSignature");
static_assert(sizeof(WBP_OriginalMenu_InventoryMainPart_C_BndEvt__WBP_OriginalMenu_InventoryMainPart_inv_mainContent_K2Node_ComponentBoundEvent_13_OnSortIsReversedUpdated__DelegateSignature) == 0x000001, "Wrong size on WBP_OriginalMenu_InventoryMainPart_C_BndEvt__WBP_OriginalMenu_InventoryMainPart_inv_mainContent_K2Node_ComponentBoundEvent_13_OnSortIsReversedUpdated__DelegateSignature");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_BndEvt__WBP_OriginalMenu_InventoryMainPart_inv_mainContent_K2Node_ComponentBoundEvent_13_OnSortIsReversedUpdated__DelegateSignature, IsReversed) == 0x000000, "Member 'WBP_OriginalMenu_InventoryMainPart_C_BndEvt__WBP_OriginalMenu_InventoryMainPart_inv_mainContent_K2Node_ComponentBoundEvent_13_OnSortIsReversedUpdated__DelegateSignature::IsReversed' has a wrong offset!");

// Function WBP_OriginalMenu_InventoryMainPart.WBP_OriginalMenu_InventoryMainPart_C.BndEvt__WBP_OriginalMenu_InventoryMainPart_inv_mainContent_K2Node_ComponentBoundEvent_6_OnMouseHoverListViewChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_OriginalMenu_InventoryMainPart_C_BndEvt__WBP_OriginalMenu_InventoryMainPart_inv_mainContent_K2Node_ComponentBoundEvent_6_OnMouseHoverListViewChanged__DelegateSignature final
{
public:
	bool                                          IsHovered_0;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OriginalMenu_InventoryMainPart_C_BndEvt__WBP_OriginalMenu_InventoryMainPart_inv_mainContent_K2Node_ComponentBoundEvent_6_OnMouseHoverListViewChanged__DelegateSignature) == 0x000001, "Wrong alignment on WBP_OriginalMenu_InventoryMainPart_C_BndEvt__WBP_OriginalMenu_InventoryMainPart_inv_mainContent_K2Node_ComponentBoundEvent_6_OnMouseHoverListViewChanged__DelegateSignature");
static_assert(sizeof(WBP_OriginalMenu_InventoryMainPart_C_BndEvt__WBP_OriginalMenu_InventoryMainPart_inv_mainContent_K2Node_ComponentBoundEvent_6_OnMouseHoverListViewChanged__DelegateSignature) == 0x000001, "Wrong size on WBP_OriginalMenu_InventoryMainPart_C_BndEvt__WBP_OriginalMenu_InventoryMainPart_inv_mainContent_K2Node_ComponentBoundEvent_6_OnMouseHoverListViewChanged__DelegateSignature");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_BndEvt__WBP_OriginalMenu_InventoryMainPart_inv_mainContent_K2Node_ComponentBoundEvent_6_OnMouseHoverListViewChanged__DelegateSignature, IsHovered_0) == 0x000000, "Member 'WBP_OriginalMenu_InventoryMainPart_C_BndEvt__WBP_OriginalMenu_InventoryMainPart_inv_mainContent_K2Node_ComponentBoundEvent_6_OnMouseHoverListViewChanged__DelegateSignature::IsHovered_0' has a wrong offset!");

// Function WBP_OriginalMenu_InventoryMainPart.WBP_OriginalMenu_InventoryMainPart_C.BndEvt__WBP_OriginalMenu_InventoryMainPart_WBP_ModernMenu_ContainerInventory_MainContent_K2Node_ComponentBoundEvent_9_OnListViewItemClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_OriginalMenu_InventoryMainPart_C_BndEvt__WBP_OriginalMenu_InventoryMainPart_WBP_ModernMenu_ContainerInventory_MainContent_K2Node_ComponentBoundEvent_9_OnListViewItemClicked__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OriginalMenu_InventoryMainPart_C_BndEvt__WBP_OriginalMenu_InventoryMainPart_WBP_ModernMenu_ContainerInventory_MainContent_K2Node_ComponentBoundEvent_9_OnListViewItemClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_OriginalMenu_InventoryMainPart_C_BndEvt__WBP_OriginalMenu_InventoryMainPart_WBP_ModernMenu_ContainerInventory_MainContent_K2Node_ComponentBoundEvent_9_OnListViewItemClicked__DelegateSignature");
static_assert(sizeof(WBP_OriginalMenu_InventoryMainPart_C_BndEvt__WBP_OriginalMenu_InventoryMainPart_WBP_ModernMenu_ContainerInventory_MainContent_K2Node_ComponentBoundEvent_9_OnListViewItemClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_OriginalMenu_InventoryMainPart_C_BndEvt__WBP_OriginalMenu_InventoryMainPart_WBP_ModernMenu_ContainerInventory_MainContent_K2Node_ComponentBoundEvent_9_OnListViewItemClicked__DelegateSignature");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_BndEvt__WBP_OriginalMenu_InventoryMainPart_WBP_ModernMenu_ContainerInventory_MainContent_K2Node_ComponentBoundEvent_9_OnListViewItemClicked__DelegateSignature, Item) == 0x000000, "Member 'WBP_OriginalMenu_InventoryMainPart_C_BndEvt__WBP_OriginalMenu_InventoryMainPart_WBP_ModernMenu_ContainerInventory_MainContent_K2Node_ComponentBoundEvent_9_OnListViewItemClicked__DelegateSignature::Item' has a wrong offset!");

// Function WBP_OriginalMenu_InventoryMainPart.WBP_OriginalMenu_InventoryMainPart_C.ChangePage
// 0x0004 (0x0004 - 0x0000)
struct WBP_OriginalMenu_InventoryMainPart_C_ChangePage final
{
public:
	ELegacyInventoryMenuPage                      NewPage;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELegacyInventoryMenuPage                      CallFunc_GetCurrentPageInventory_ReturnValue;      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELegacyInventoryMenuPage                      CallFunc_GetCurrentPageInventory_ReturnValue_1;    // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OriginalMenu_InventoryMainPart_C_ChangePage) == 0x000001, "Wrong alignment on WBP_OriginalMenu_InventoryMainPart_C_ChangePage");
static_assert(sizeof(WBP_OriginalMenu_InventoryMainPart_C_ChangePage) == 0x000004, "Wrong size on WBP_OriginalMenu_InventoryMainPart_C_ChangePage");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_ChangePage, NewPage) == 0x000000, "Member 'WBP_OriginalMenu_InventoryMainPart_C_ChangePage::NewPage' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_ChangePage, CallFunc_GetCurrentPageInventory_ReturnValue) == 0x000001, "Member 'WBP_OriginalMenu_InventoryMainPart_C_ChangePage::CallFunc_GetCurrentPageInventory_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_ChangePage, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000002, "Member 'WBP_OriginalMenu_InventoryMainPart_C_ChangePage::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_ChangePage, CallFunc_GetCurrentPageInventory_ReturnValue_1) == 0x000003, "Member 'WBP_OriginalMenu_InventoryMainPart_C_ChangePage::CallFunc_GetCurrentPageInventory_ReturnValue_1' has a wrong offset!");

// Function WBP_OriginalMenu_InventoryMainPart.WBP_OriginalMenu_InventoryMainPart_C.DropAllItem
// 0x0070 (0x0070 - 0x0000)
struct WBP_OriginalMenu_InventoryMainPart_C_DropAllItem final
{
public:
	class UObject*                                CallFunc_GetCurrentItem_CurrentItem;               // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVOriginalInventoryMenuItem*            K2Node_DynamicCast_AsVOriginal_Inventory_Menu_Item; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOriginalInventoryMenuItemProperties   CallFunc_GetProperties_ReturnValue;                // 0x0020(0x0050)(ConstParm)
};
static_assert(alignof(WBP_OriginalMenu_InventoryMainPart_C_DropAllItem) == 0x000008, "Wrong alignment on WBP_OriginalMenu_InventoryMainPart_C_DropAllItem");
static_assert(sizeof(WBP_OriginalMenu_InventoryMainPart_C_DropAllItem) == 0x000070, "Wrong size on WBP_OriginalMenu_InventoryMainPart_C_DropAllItem");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_DropAllItem, CallFunc_GetCurrentItem_CurrentItem) == 0x000000, "Member 'WBP_OriginalMenu_InventoryMainPart_C_DropAllItem::CallFunc_GetCurrentItem_CurrentItem' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_DropAllItem, CallFunc_Not_PreBool_ReturnValue) == 0x000008, "Member 'WBP_OriginalMenu_InventoryMainPart_C_DropAllItem::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_DropAllItem, K2Node_DynamicCast_AsVOriginal_Inventory_Menu_Item) == 0x000010, "Member 'WBP_OriginalMenu_InventoryMainPart_C_DropAllItem::K2Node_DynamicCast_AsVOriginal_Inventory_Menu_Item' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_DropAllItem, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_OriginalMenu_InventoryMainPart_C_DropAllItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_DropAllItem, CallFunc_GetProperties_ReturnValue) == 0x000020, "Member 'WBP_OriginalMenu_InventoryMainPart_C_DropAllItem::CallFunc_GetProperties_ReturnValue' has a wrong offset!");

// Function WBP_OriginalMenu_InventoryMainPart.WBP_OriginalMenu_InventoryMainPart_C.DropItem
// 0x0020 (0x0020 - 0x0000)
struct WBP_OriginalMenu_InventoryMainPart_C_DropItem final
{
public:
	class UObject*                                CallFunc_GetCurrentItem_CurrentItem;               // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVOriginalInventoryMenuItem*            K2Node_DynamicCast_AsVOriginal_Inventory_Menu_Item; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetInventoryIndex_ReturnValue;            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OriginalMenu_InventoryMainPart_C_DropItem) == 0x000008, "Wrong alignment on WBP_OriginalMenu_InventoryMainPart_C_DropItem");
static_assert(sizeof(WBP_OriginalMenu_InventoryMainPart_C_DropItem) == 0x000020, "Wrong size on WBP_OriginalMenu_InventoryMainPart_C_DropItem");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_DropItem, CallFunc_GetCurrentItem_CurrentItem) == 0x000000, "Member 'WBP_OriginalMenu_InventoryMainPart_C_DropItem::CallFunc_GetCurrentItem_CurrentItem' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_DropItem, CallFunc_Not_PreBool_ReturnValue) == 0x000008, "Member 'WBP_OriginalMenu_InventoryMainPart_C_DropItem::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_DropItem, K2Node_DynamicCast_AsVOriginal_Inventory_Menu_Item) == 0x000010, "Member 'WBP_OriginalMenu_InventoryMainPart_C_DropItem::K2Node_DynamicCast_AsVOriginal_Inventory_Menu_Item' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_DropItem, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_OriginalMenu_InventoryMainPart_C_DropItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_DropItem, CallFunc_GetInventoryIndex_ReturnValue) == 0x00001C, "Member 'WBP_OriginalMenu_InventoryMainPart_C_DropItem::CallFunc_GetInventoryIndex_ReturnValue' has a wrong offset!");

// Function WBP_OriginalMenu_InventoryMainPart.WBP_OriginalMenu_InventoryMainPart_C.ExecuteUbergraph_WBP_OriginalMenu_InventoryMainPart
// 0x00D8 (0x00D8 - 0x0000)
struct WBP_OriginalMenu_InventoryMainPart_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryMainPart final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_NewParam;                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_NewParam_1;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ELegacyInventoryMenuPage                      K2Node_CustomEvent_Page;                           // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELegacyInventoryMenuPage                      CallFunc_GetCurrentPageInventory_ReturnValue;      // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0037(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_ComponentBoundEvent_Item_1;                 // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetCurrentItem_CurrentItem;               // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVOriginalInventoryMenuItem*            K2Node_DynamicCast_AsVOriginal_Inventory_Menu_Item; // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetCurrentItem_CurrentItem_1;             // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetInventoryIndex_ReturnValue;            // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVOriginalInventoryMenuItem*            K2Node_DynamicCast_AsVOriginal_Inventory_Menu_Item_1; // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetInventoryIndex_ReturnValue_1;          // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_ComponentBoundEvent_Item;                   // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVOriginalInventoryMenuItem*            K2Node_DynamicCast_AsVOriginal_Inventory_Menu_Item_2; // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOriginalInventoryMenuSortType                K2Node_ComponentBoundEvent_SortType;               // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x2];                                       // 0x008A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetInventoryIndex_ReturnValue_2;          // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_IsReversed;             // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FOriginalInventoryMenuItemProperties> K2Node_CustomEvent_Items;                    // 0x0098(0x0010)(ConstParm, ReferenceParm)
	double                                        K2Node_CustomEvent_NewParam_2;                     // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVUINavigationGlobalSubsystem*          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IVEnhancedInputNavigable> CallFunc_NavigateToWidget_Widget_CastInput;     // 0x00C0(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_IsHovered;              // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OriginalMenu_InventoryMainPart_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryMainPart) == 0x000008, "Wrong alignment on WBP_OriginalMenu_InventoryMainPart_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryMainPart");
static_assert(sizeof(WBP_OriginalMenu_InventoryMainPart_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryMainPart) == 0x0000D8, "Wrong size on WBP_OriginalMenu_InventoryMainPart_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryMainPart");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryMainPart, EntryPoint) == 0x000000, "Member 'WBP_OriginalMenu_InventoryMainPart_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryMainPart::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryMainPart, K2Node_CustomEvent_NewParam) == 0x000008, "Member 'WBP_OriginalMenu_InventoryMainPart_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryMainPart::K2Node_CustomEvent_NewParam' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryMainPart, CallFunc_Not_PreBool_ReturnValue) == 0x000010, "Member 'WBP_OriginalMenu_InventoryMainPart_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryMainPart::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryMainPart, K2Node_CustomEvent_NewParam_1) == 0x000018, "Member 'WBP_OriginalMenu_InventoryMainPart_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryMainPart::K2Node_CustomEvent_NewParam_1' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryMainPart, CallFunc_MakeLiteralByte_ReturnValue) == 0x000020, "Member 'WBP_OriginalMenu_InventoryMainPart_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryMainPart::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryMainPart, K2Node_CreateDelegate_OutputDelegate) == 0x000024, "Member 'WBP_OriginalMenu_InventoryMainPart_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryMainPart::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryMainPart, K2Node_CustomEvent_Page) == 0x000034, "Member 'WBP_OriginalMenu_InventoryMainPart_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryMainPart::K2Node_CustomEvent_Page' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryMainPart, CallFunc_GetCurrentPageInventory_ReturnValue) == 0x000035, "Member 'WBP_OriginalMenu_InventoryMainPart_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryMainPart::CallFunc_GetCurrentPageInventory_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryMainPart, CallFunc_IsValid_ReturnValue) == 0x000036, "Member 'WBP_OriginalMenu_InventoryMainPart_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryMainPart::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryMainPart, CallFunc_IsValid_ReturnValue_1) == 0x000037, "Member 'WBP_OriginalMenu_InventoryMainPart_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryMainPart::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryMainPart, K2Node_ComponentBoundEvent_Item_1) == 0x000038, "Member 'WBP_OriginalMenu_InventoryMainPart_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryMainPart::K2Node_ComponentBoundEvent_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryMainPart, CallFunc_GetCurrentItem_CurrentItem) == 0x000040, "Member 'WBP_OriginalMenu_InventoryMainPart_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryMainPart::CallFunc_GetCurrentItem_CurrentItem' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryMainPart, K2Node_DynamicCast_AsVOriginal_Inventory_Menu_Item) == 0x000048, "Member 'WBP_OriginalMenu_InventoryMainPart_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryMainPart::K2Node_DynamicCast_AsVOriginal_Inventory_Menu_Item' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryMainPart, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'WBP_OriginalMenu_InventoryMainPart_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryMainPart::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryMainPart, CallFunc_GetCurrentItem_CurrentItem_1) == 0x000058, "Member 'WBP_OriginalMenu_InventoryMainPart_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryMainPart::CallFunc_GetCurrentItem_CurrentItem_1' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryMainPart, CallFunc_GetInventoryIndex_ReturnValue) == 0x000060, "Member 'WBP_OriginalMenu_InventoryMainPart_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryMainPart::CallFunc_GetInventoryIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryMainPart, K2Node_DynamicCast_AsVOriginal_Inventory_Menu_Item_1) == 0x000068, "Member 'WBP_OriginalMenu_InventoryMainPart_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryMainPart::K2Node_DynamicCast_AsVOriginal_Inventory_Menu_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryMainPart, K2Node_DynamicCast_bSuccess_1) == 0x000070, "Member 'WBP_OriginalMenu_InventoryMainPart_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryMainPart::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryMainPart, CallFunc_GetInventoryIndex_ReturnValue_1) == 0x000074, "Member 'WBP_OriginalMenu_InventoryMainPart_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryMainPart::CallFunc_GetInventoryIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryMainPart, K2Node_ComponentBoundEvent_Item) == 0x000078, "Member 'WBP_OriginalMenu_InventoryMainPart_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryMainPart::K2Node_ComponentBoundEvent_Item' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryMainPart, K2Node_DynamicCast_AsVOriginal_Inventory_Menu_Item_2) == 0x000080, "Member 'WBP_OriginalMenu_InventoryMainPart_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryMainPart::K2Node_DynamicCast_AsVOriginal_Inventory_Menu_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryMainPart, K2Node_DynamicCast_bSuccess_2) == 0x000088, "Member 'WBP_OriginalMenu_InventoryMainPart_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryMainPart::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryMainPart, K2Node_ComponentBoundEvent_SortType) == 0x000089, "Member 'WBP_OriginalMenu_InventoryMainPart_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryMainPart::K2Node_ComponentBoundEvent_SortType' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryMainPart, CallFunc_GetInventoryIndex_ReturnValue_2) == 0x00008C, "Member 'WBP_OriginalMenu_InventoryMainPart_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryMainPart::CallFunc_GetInventoryIndex_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryMainPart, K2Node_ComponentBoundEvent_IsReversed) == 0x000090, "Member 'WBP_OriginalMenu_InventoryMainPart_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryMainPart::K2Node_ComponentBoundEvent_IsReversed' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryMainPart, K2Node_CustomEvent_Items) == 0x000098, "Member 'WBP_OriginalMenu_InventoryMainPart_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryMainPart::K2Node_CustomEvent_Items' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryMainPart, K2Node_CustomEvent_NewParam_2) == 0x0000A8, "Member 'WBP_OriginalMenu_InventoryMainPart_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryMainPart::K2Node_CustomEvent_NewParam_2' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryMainPart, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x0000B0, "Member 'WBP_OriginalMenu_InventoryMainPart_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryMainPart::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryMainPart, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x0000B8, "Member 'WBP_OriginalMenu_InventoryMainPart_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryMainPart::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryMainPart, CallFunc_NavigateToWidget_Widget_CastInput) == 0x0000C0, "Member 'WBP_OriginalMenu_InventoryMainPart_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryMainPart::CallFunc_NavigateToWidget_Widget_CastInput' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryMainPart, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x0000D0, "Member 'WBP_OriginalMenu_InventoryMainPart_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryMainPart::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryMainPart, K2Node_ComponentBoundEvent_IsHovered) == 0x0000D1, "Member 'WBP_OriginalMenu_InventoryMainPart_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryMainPart::K2Node_ComponentBoundEvent_IsHovered' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryMainPart, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x0000D2, "Member 'WBP_OriginalMenu_InventoryMainPart_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryMainPart::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryMainPart, CallFunc_IsValid_ReturnValue_2) == 0x0000D3, "Member 'WBP_OriginalMenu_InventoryMainPart_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryMainPart::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryMainPart, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x0000D4, "Member 'WBP_OriginalMenu_InventoryMainPart_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryMainPart::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");

// Function WBP_OriginalMenu_InventoryMainPart.WBP_OriginalMenu_InventoryMainPart_C.Get Item List View
// 0x0008 (0x0008 - 0x0000)
struct WBP_OriginalMenu_InventoryMainPart_C_Get_Item_List_View final
{
public:
	class UWBP_OriginalMenu_InventoryListView_C*  NewParam;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OriginalMenu_InventoryMainPart_C_Get_Item_List_View) == 0x000008, "Wrong alignment on WBP_OriginalMenu_InventoryMainPart_C_Get_Item_List_View");
static_assert(sizeof(WBP_OriginalMenu_InventoryMainPart_C_Get_Item_List_View) == 0x000008, "Wrong size on WBP_OriginalMenu_InventoryMainPart_C_Get_Item_List_View");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_Get_Item_List_View, NewParam) == 0x000000, "Member 'WBP_OriginalMenu_InventoryMainPart_C_Get_Item_List_View::NewParam' has a wrong offset!");

// Function WBP_OriginalMenu_InventoryMainPart.WBP_OriginalMenu_InventoryMainPart_C.GetDisabledFilterEnumsForGivenPage
// 0x0070 (0x0070 - 0x0000)
struct WBP_OriginalMenu_InventoryMainPart_C_GetDisabledFilterEnumsForGivenPage final
{
public:
	ELegacyInventoryMenuPage                      Page;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EOriginalInventoryMenuSortType>        DisabledFilterEnums;                               // 0x0008(0x0010)(Parm, OutParm)
	TArray<EOriginalInventoryMenuSortType>        K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ReferenceParm)
	TArray<EOriginalInventoryMenuSortType>        K2Node_MakeArray_Array_1;                          // 0x0028(0x0010)(ReferenceParm)
	TArray<EOriginalInventoryMenuSortType>        K2Node_MakeArray_Array_2;                          // 0x0038(0x0010)(ReferenceParm)
	TArray<EOriginalInventoryMenuSortType>        K2Node_MakeArray_Array_3;                          // 0x0048(0x0010)(ReferenceParm)
	TArray<EOriginalInventoryMenuSortType>        K2Node_MakeArray_Array_4;                          // 0x0058(0x0010)(ReferenceParm)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OriginalMenu_InventoryMainPart_C_GetDisabledFilterEnumsForGivenPage) == 0x000008, "Wrong alignment on WBP_OriginalMenu_InventoryMainPart_C_GetDisabledFilterEnumsForGivenPage");
static_assert(sizeof(WBP_OriginalMenu_InventoryMainPart_C_GetDisabledFilterEnumsForGivenPage) == 0x000070, "Wrong size on WBP_OriginalMenu_InventoryMainPart_C_GetDisabledFilterEnumsForGivenPage");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_GetDisabledFilterEnumsForGivenPage, Page) == 0x000000, "Member 'WBP_OriginalMenu_InventoryMainPart_C_GetDisabledFilterEnumsForGivenPage::Page' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_GetDisabledFilterEnumsForGivenPage, DisabledFilterEnums) == 0x000008, "Member 'WBP_OriginalMenu_InventoryMainPart_C_GetDisabledFilterEnumsForGivenPage::DisabledFilterEnums' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_GetDisabledFilterEnumsForGivenPage, K2Node_MakeArray_Array) == 0x000018, "Member 'WBP_OriginalMenu_InventoryMainPart_C_GetDisabledFilterEnumsForGivenPage::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_GetDisabledFilterEnumsForGivenPage, K2Node_MakeArray_Array_1) == 0x000028, "Member 'WBP_OriginalMenu_InventoryMainPart_C_GetDisabledFilterEnumsForGivenPage::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_GetDisabledFilterEnumsForGivenPage, K2Node_MakeArray_Array_2) == 0x000038, "Member 'WBP_OriginalMenu_InventoryMainPart_C_GetDisabledFilterEnumsForGivenPage::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_GetDisabledFilterEnumsForGivenPage, K2Node_MakeArray_Array_3) == 0x000048, "Member 'WBP_OriginalMenu_InventoryMainPart_C_GetDisabledFilterEnumsForGivenPage::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_GetDisabledFilterEnumsForGivenPage, K2Node_MakeArray_Array_4) == 0x000058, "Member 'WBP_OriginalMenu_InventoryMainPart_C_GetDisabledFilterEnumsForGivenPage::K2Node_MakeArray_Array_4' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_GetDisabledFilterEnumsForGivenPage, K2Node_SwitchEnum_CmpSuccess) == 0x000068, "Member 'WBP_OriginalMenu_InventoryMainPart_C_GetDisabledFilterEnumsForGivenPage::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_OriginalMenu_InventoryMainPart.WBP_OriginalMenu_InventoryMainPart_C.GetFilter
// 0x0008 (0x0008 - 0x0000)
struct WBP_OriginalMenu_InventoryMainPart_C_GetFilter final
{
public:
	class UWBP_OriginalMenu_Inventory_Filter_C*   Filter;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OriginalMenu_InventoryMainPart_C_GetFilter) == 0x000008, "Wrong alignment on WBP_OriginalMenu_InventoryMainPart_C_GetFilter");
static_assert(sizeof(WBP_OriginalMenu_InventoryMainPart_C_GetFilter) == 0x000008, "Wrong size on WBP_OriginalMenu_InventoryMainPart_C_GetFilter");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_GetFilter, Filter) == 0x000000, "Member 'WBP_OriginalMenu_InventoryMainPart_C_GetFilter::Filter' has a wrong offset!");

// Function WBP_OriginalMenu_InventoryMainPart.WBP_OriginalMenu_InventoryMainPart_C.GetIsFilterFocused
// 0x0001 (0x0001 - 0x0000)
struct WBP_OriginalMenu_InventoryMainPart_C_GetIsFilterFocused final
{
public:
	bool                                          IsFilterFocused;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OriginalMenu_InventoryMainPart_C_GetIsFilterFocused) == 0x000001, "Wrong alignment on WBP_OriginalMenu_InventoryMainPart_C_GetIsFilterFocused");
static_assert(sizeof(WBP_OriginalMenu_InventoryMainPart_C_GetIsFilterFocused) == 0x000001, "Wrong size on WBP_OriginalMenu_InventoryMainPart_C_GetIsFilterFocused");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_GetIsFilterFocused, IsFilterFocused) == 0x000000, "Member 'WBP_OriginalMenu_InventoryMainPart_C_GetIsFilterFocused::IsFilterFocused' has a wrong offset!");

// Function WBP_OriginalMenu_InventoryMainPart.WBP_OriginalMenu_InventoryMainPart_C.OnItemClicked
// 0x00A0 (0x00A0 - 0x0000)
struct WBP_OriginalMenu_InventoryMainPart_C_OnItemClicked final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVOriginalInventoryMenuItem*            Local_Item;                                        // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetInventoryIndex_ReturnValue;            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FOriginalInventoryMenuItemProperties   CallFunc_GetProperties_ReturnValue;                // 0x0018(0x0050)(ConstParm)
	int32                                         CallFunc_GetInventoryIndex_ReturnValue_1;          // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVOriginalInventoryMenuItem*            K2Node_DynamicCast_AsVOriginal_Inventory_Menu_Item; // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVUINavigationPlayerSubsystem*          CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsShiftKeyDown_ReturnValue;               // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVUINavigationPlayerSubsystem*          CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCtrlKeyDown_ReturnValue;                // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OriginalMenu_InventoryMainPart_C_OnItemClicked) == 0x000008, "Wrong alignment on WBP_OriginalMenu_InventoryMainPart_C_OnItemClicked");
static_assert(sizeof(WBP_OriginalMenu_InventoryMainPart_C_OnItemClicked) == 0x0000A0, "Wrong size on WBP_OriginalMenu_InventoryMainPart_C_OnItemClicked");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_OnItemClicked, Object) == 0x000000, "Member 'WBP_OriginalMenu_InventoryMainPart_C_OnItemClicked::Object' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_OnItemClicked, Local_Item) == 0x000008, "Member 'WBP_OriginalMenu_InventoryMainPart_C_OnItemClicked::Local_Item' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_OnItemClicked, CallFunc_Not_PreBool_ReturnValue) == 0x000010, "Member 'WBP_OriginalMenu_InventoryMainPart_C_OnItemClicked::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_OnItemClicked, CallFunc_GetInventoryIndex_ReturnValue) == 0x000014, "Member 'WBP_OriginalMenu_InventoryMainPart_C_OnItemClicked::CallFunc_GetInventoryIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_OnItemClicked, CallFunc_GetProperties_ReturnValue) == 0x000018, "Member 'WBP_OriginalMenu_InventoryMainPart_C_OnItemClicked::CallFunc_GetProperties_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_OnItemClicked, CallFunc_GetInventoryIndex_ReturnValue_1) == 0x000068, "Member 'WBP_OriginalMenu_InventoryMainPart_C_OnItemClicked::CallFunc_GetInventoryIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_OnItemClicked, K2Node_DynamicCast_AsVOriginal_Inventory_Menu_Item) == 0x000070, "Member 'WBP_OriginalMenu_InventoryMainPart_C_OnItemClicked::K2Node_DynamicCast_AsVOriginal_Inventory_Menu_Item' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_OnItemClicked, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'WBP_OriginalMenu_InventoryMainPart_C_OnItemClicked::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_OnItemClicked, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000080, "Member 'WBP_OriginalMenu_InventoryMainPart_C_OnItemClicked::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_OnItemClicked, CallFunc_IsShiftKeyDown_ReturnValue) == 0x000088, "Member 'WBP_OriginalMenu_InventoryMainPart_C_OnItemClicked::CallFunc_IsShiftKeyDown_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_OnItemClicked, CallFunc_GetLocalPlayerSubsystem_ReturnValue_1) == 0x000090, "Member 'WBP_OriginalMenu_InventoryMainPart_C_OnItemClicked::CallFunc_GetLocalPlayerSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_OnItemClicked, CallFunc_IsCtrlKeyDown_ReturnValue) == 0x000098, "Member 'WBP_OriginalMenu_InventoryMainPart_C_OnItemClicked::CallFunc_IsCtrlKeyDown_ReturnValue' has a wrong offset!");

// Function WBP_OriginalMenu_InventoryMainPart.WBP_OriginalMenu_InventoryMainPart_C.OnSortIsReversedUpdated
// 0x0003 (0x0003 - 0x0000)
struct WBP_OriginalMenu_InventoryMainPart_C_OnSortIsReversedUpdated final
{
public:
	bool                                          IsReversed;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsSortReversedInventory_ReturnValue;   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OriginalMenu_InventoryMainPart_C_OnSortIsReversedUpdated) == 0x000001, "Wrong alignment on WBP_OriginalMenu_InventoryMainPart_C_OnSortIsReversedUpdated");
static_assert(sizeof(WBP_OriginalMenu_InventoryMainPart_C_OnSortIsReversedUpdated) == 0x000003, "Wrong size on WBP_OriginalMenu_InventoryMainPart_C_OnSortIsReversedUpdated");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_OnSortIsReversedUpdated, IsReversed) == 0x000000, "Member 'WBP_OriginalMenu_InventoryMainPart_C_OnSortIsReversedUpdated::IsReversed' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_OnSortIsReversedUpdated, CallFunc_GetIsSortReversedInventory_ReturnValue) == 0x000001, "Member 'WBP_OriginalMenu_InventoryMainPart_C_OnSortIsReversedUpdated::CallFunc_GetIsSortReversedInventory_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_OnSortIsReversedUpdated, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000002, "Member 'WBP_OriginalMenu_InventoryMainPart_C_OnSortIsReversedUpdated::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function WBP_OriginalMenu_InventoryMainPart.WBP_OriginalMenu_InventoryMainPart_C.OnSortTypeUpdated
// 0x0001 (0x0001 - 0x0000)
struct WBP_OriginalMenu_InventoryMainPart_C_OnSortTypeUpdated final
{
public:
	EOriginalInventoryMenuSortType                SortType;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OriginalMenu_InventoryMainPart_C_OnSortTypeUpdated) == 0x000001, "Wrong alignment on WBP_OriginalMenu_InventoryMainPart_C_OnSortTypeUpdated");
static_assert(sizeof(WBP_OriginalMenu_InventoryMainPart_C_OnSortTypeUpdated) == 0x000001, "Wrong size on WBP_OriginalMenu_InventoryMainPart_C_OnSortTypeUpdated");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_OnSortTypeUpdated, SortType) == 0x000000, "Member 'WBP_OriginalMenu_InventoryMainPart_C_OnSortTypeUpdated::SortType' has a wrong offset!");

// Function WBP_OriginalMenu_InventoryMainPart.WBP_OriginalMenu_InventoryMainPart_C.SetPageTitle
// 0x0028 (0x0028 - 0x0000)
struct WBP_OriginalMenu_InventoryMainPart_C_SetPageTitle final
{
public:
	ELegacyInventoryMenuPage                      Page;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Map_Find_Value;                           // 0x0008(0x0018)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OriginalMenu_InventoryMainPart_C_SetPageTitle) == 0x000008, "Wrong alignment on WBP_OriginalMenu_InventoryMainPart_C_SetPageTitle");
static_assert(sizeof(WBP_OriginalMenu_InventoryMainPart_C_SetPageTitle) == 0x000028, "Wrong size on WBP_OriginalMenu_InventoryMainPart_C_SetPageTitle");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_SetPageTitle, Page) == 0x000000, "Member 'WBP_OriginalMenu_InventoryMainPart_C_SetPageTitle::Page' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_SetPageTitle, CallFunc_Map_Find_Value) == 0x000008, "Member 'WBP_OriginalMenu_InventoryMainPart_C_SetPageTitle::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_SetPageTitle, CallFunc_Map_Find_ReturnValue) == 0x000020, "Member 'WBP_OriginalMenu_InventoryMainPart_C_SetPageTitle::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function WBP_OriginalMenu_InventoryMainPart.WBP_OriginalMenu_InventoryMainPart_C.SetSelectedTab
// 0x0020 (0x0020 - 0x0000)
struct WBP_OriginalMenu_InventoryMainPart_C_SetSelectedTab final
{
public:
	ELegacyInventoryMenuPage                      Page;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EOriginalInventoryMenuSortType>        Local_DisabledFilterEnums;                         // 0x0008(0x0010)(Edit, BlueprintVisible)
	EOriginalInventoryMenuSortType                CallFunc_GetSortTypeInventory_ReturnValue;         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOriginalInventoryMenuSortType                CallFunc_UpdateFiltersToDisplay_NewSortType;       // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OriginalMenu_InventoryMainPart_C_SetSelectedTab) == 0x000008, "Wrong alignment on WBP_OriginalMenu_InventoryMainPart_C_SetSelectedTab");
static_assert(sizeof(WBP_OriginalMenu_InventoryMainPart_C_SetSelectedTab) == 0x000020, "Wrong size on WBP_OriginalMenu_InventoryMainPart_C_SetSelectedTab");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_SetSelectedTab, Page) == 0x000000, "Member 'WBP_OriginalMenu_InventoryMainPart_C_SetSelectedTab::Page' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_SetSelectedTab, Local_DisabledFilterEnums) == 0x000008, "Member 'WBP_OriginalMenu_InventoryMainPart_C_SetSelectedTab::Local_DisabledFilterEnums' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_SetSelectedTab, CallFunc_GetSortTypeInventory_ReturnValue) == 0x000018, "Member 'WBP_OriginalMenu_InventoryMainPart_C_SetSelectedTab::CallFunc_GetSortTypeInventory_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_SetSelectedTab, CallFunc_UpdateFiltersToDisplay_NewSortType) == 0x000019, "Member 'WBP_OriginalMenu_InventoryMainPart_C_SetSelectedTab::CallFunc_UpdateFiltersToDisplay_NewSortType' has a wrong offset!");

// Function WBP_OriginalMenu_InventoryMainPart.WBP_OriginalMenu_InventoryMainPart_C.ToggleSorting
// 0x0001 (0x0001 - 0x0000)
struct WBP_OriginalMenu_InventoryMainPart_C_ToggleSorting final
{
public:
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OriginalMenu_InventoryMainPart_C_ToggleSorting) == 0x000001, "Wrong alignment on WBP_OriginalMenu_InventoryMainPart_C_ToggleSorting");
static_assert(sizeof(WBP_OriginalMenu_InventoryMainPart_C_ToggleSorting) == 0x000001, "Wrong size on WBP_OriginalMenu_InventoryMainPart_C_ToggleSorting");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_ToggleSorting, CallFunc_Not_PreBool_ReturnValue) == 0x000000, "Member 'WBP_OriginalMenu_InventoryMainPart_C_ToggleSorting::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function WBP_OriginalMenu_InventoryMainPart.WBP_OriginalMenu_InventoryMainPart_C.Update Fatigue Bar Value
// 0x0008 (0x0008 - 0x0000)
struct WBP_OriginalMenu_InventoryMainPart_C_Update_Fatigue_Bar_Value final
{
public:
	double                                        NewParam;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OriginalMenu_InventoryMainPart_C_Update_Fatigue_Bar_Value) == 0x000008, "Wrong alignment on WBP_OriginalMenu_InventoryMainPart_C_Update_Fatigue_Bar_Value");
static_assert(sizeof(WBP_OriginalMenu_InventoryMainPart_C_Update_Fatigue_Bar_Value) == 0x000008, "Wrong size on WBP_OriginalMenu_InventoryMainPart_C_Update_Fatigue_Bar_Value");
static_assert(offsetof(WBP_OriginalMenu_InventoryMainPart_C_Update_Fatigue_Bar_Value, NewParam) == 0x000000, "Member 'WBP_OriginalMenu_InventoryMainPart_C_Update_Fatigue_Bar_Value::NewParam' has a wrong offset!");

// Function WBP_OriginalMenu_InventoryMainPart.WBP_OriginalMenu_InventoryMainPart_C.Update Health Bar Value
// 0x0008 (0x0008 - 0x0000)
