#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModernMenu_StatsFactionEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Altar_structs.hpp"
#include "Altar_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ModernMenu_StatsFactionEntry.WBP_ModernMenu_StatsFactionEntry_C
// 0x0080 (0x0350 - 0x02D0)
class UWBP_ModernMenu_StatsFactionEntry_C final : public UNavigationListviewEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_ModernPrefab_Focusbox_C*           stat_faction_focusBox;                             // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               stat_faction_icon;                                 // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AltarTextBlock_C*                  stat_faction_item_name;                            // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AltarTextBlock_C*                  stat_faction_item_rank;                            // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLegacyStatsMenuFactionProperties      Faction;                                           // 0x02F8(0x0058)(Edit, BlueprintVisible)

public:
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void ExecuteUbergraph_WBP_ModernMenu_StatsFactionEntry(int32 EntryPoint);
	void OnListItemObjectSet(class UObject* ListItemObject);
	void OnSynchronizeProperties();
	void SetIcon(class UTexture2D* Texture);
	void UpdateData(const struct FLegacyStatsMenuFactionProperties& Data);
	void UpdateEntry();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ModernMenu_StatsFactionEntry_C">();
	}
	static class UWBP_ModernMenu_StatsFactionEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ModernMenu_StatsFactionEntry_C>();
	}
};
static_assert(alignof(UWBP_ModernMenu_StatsFactionEntry_C) == 0x000008, "Wrong alignment on UWBP_ModernMenu_StatsFactionEntry_C");
static_assert(sizeof(UWBP_ModernMenu_StatsFactionEntry_C) == 0x000350, "Wrong size on UWBP_ModernMenu_StatsFactionEntry_C");
static_assert(offsetof(UWBP_ModernMenu_StatsFactionEntry_C, UberGraphFrame) == 0x0002D0, "Member 'UWBP_ModernMenu_StatsFactionEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsFactionEntry_C, stat_faction_focusBox) == 0x0002D8, "Member 'UWBP_ModernMenu_StatsFactionEntry_C::stat_faction_focusBox' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsFactionEntry_C, stat_faction_icon) == 0x0002E0, "Member 'UWBP_ModernMenu_StatsFactionEntry_C::stat_faction_icon' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsFactionEntry_C, stat_faction_item_name) == 0x0002E8, "Member 'UWBP_ModernMenu_StatsFactionEntry_C::stat_faction_item_name' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsFactionEntry_C, stat_faction_item_rank) == 0x0002F0, "Member 'UWBP_ModernMenu_StatsFactionEntry_C::stat_faction_item_rank' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsFactionEntry_C, Faction) == 0x0002F8, "Member 'UWBP_ModernMenu_StatsFactionEntry_C::Faction' has a wrong offset!");

}

