#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Graphic_Resolutions

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Altar_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Graphic_Resolutions.WBP_Graphic_Resolutions_C.ExecuteUbergraph_WBP_Graphic_Resolutions
// 0x0130 (0x0130 - 0x0000)
struct WBP_Graphic_Resolutions_C_ExecuteUbergraph_WBP_Graphic_Resolutions final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& SelectedItem, ESelectInfo SelectionType)> K2Node_CreateDelegate_OutputDelegate; // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FOriginalVideoOption>           CallFunc_Prepare_Supported_Resolution_Options_ResolutionOptions; // 0x0040(0x0010)(ReferenceParm)
	class FString                                 K2Node_CustomEvent_SelectedItem;                   // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   K2Node_CustomEvent_SelectionType;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOriginalVideoOption                   CallFunc_Array_Get_Item;                           // 0x0070(0x0028)()
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item_1;                         // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CA[0x2];                                       // 0x00CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item_2;                         // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOriginalVideoOption                   CallFunc_Array_Get_Item_3;                         // 0x00E8(0x0028)()
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Graphic_Resolutions_C_ExecuteUbergraph_WBP_Graphic_Resolutions) == 0x000008, "Wrong alignment on WBP_Graphic_Resolutions_C_ExecuteUbergraph_WBP_Graphic_Resolutions");
static_assert(sizeof(WBP_Graphic_Resolutions_C_ExecuteUbergraph_WBP_Graphic_Resolutions) == 0x000130, "Wrong size on WBP_Graphic_Resolutions_C_ExecuteUbergraph_WBP_Graphic_Resolutions");
static_assert(offsetof(WBP_Graphic_Resolutions_C_ExecuteUbergraph_WBP_Graphic_Resolutions, EntryPoint) == 0x000000, "Member 'WBP_Graphic_Resolutions_C_ExecuteUbergraph_WBP_Graphic_Resolutions::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Graphic_Resolutions_C_ExecuteUbergraph_WBP_Graphic_Resolutions, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_Graphic_Resolutions_C_ExecuteUbergraph_WBP_Graphic_Resolutions::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Graphic_Resolutions_C_ExecuteUbergraph_WBP_Graphic_Resolutions, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_Graphic_Resolutions_C_ExecuteUbergraph_WBP_Graphic_Resolutions::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Graphic_Resolutions_C_ExecuteUbergraph_WBP_Graphic_Resolutions, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WBP_Graphic_Resolutions_C_ExecuteUbergraph_WBP_Graphic_Resolutions::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphic_Resolutions_C_ExecuteUbergraph_WBP_Graphic_Resolutions, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'WBP_Graphic_Resolutions_C_ExecuteUbergraph_WBP_Graphic_Resolutions::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Graphic_Resolutions_C_ExecuteUbergraph_WBP_Graphic_Resolutions, Temp_int_Loop_Counter_Variable_1) == 0x000020, "Member 'WBP_Graphic_Resolutions_C_ExecuteUbergraph_WBP_Graphic_Resolutions::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Graphic_Resolutions_C_ExecuteUbergraph_WBP_Graphic_Resolutions, CallFunc_Add_IntInt_ReturnValue_1) == 0x000024, "Member 'WBP_Graphic_Resolutions_C_ExecuteUbergraph_WBP_Graphic_Resolutions::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Graphic_Resolutions_C_ExecuteUbergraph_WBP_Graphic_Resolutions, Temp_int_Array_Index_Variable_1) == 0x000028, "Member 'WBP_Graphic_Resolutions_C_ExecuteUbergraph_WBP_Graphic_Resolutions::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Graphic_Resolutions_C_ExecuteUbergraph_WBP_Graphic_Resolutions, Temp_int_Loop_Counter_Variable_2) == 0x00002C, "Member 'WBP_Graphic_Resolutions_C_ExecuteUbergraph_WBP_Graphic_Resolutions::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Graphic_Resolutions_C_ExecuteUbergraph_WBP_Graphic_Resolutions, CallFunc_Add_IntInt_ReturnValue_2) == 0x000030, "Member 'WBP_Graphic_Resolutions_C_ExecuteUbergraph_WBP_Graphic_Resolutions::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Graphic_Resolutions_C_ExecuteUbergraph_WBP_Graphic_Resolutions, Temp_int_Array_Index_Variable_2) == 0x000034, "Member 'WBP_Graphic_Resolutions_C_ExecuteUbergraph_WBP_Graphic_Resolutions::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Graphic_Resolutions_C_ExecuteUbergraph_WBP_Graphic_Resolutions, Temp_int_Loop_Counter_Variable_3) == 0x000038, "Member 'WBP_Graphic_Resolutions_C_ExecuteUbergraph_WBP_Graphic_Resolutions::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Graphic_Resolutions_C_ExecuteUbergraph_WBP_Graphic_Resolutions, CallFunc_Add_IntInt_ReturnValue_3) == 0x00003C, "Member 'WBP_Graphic_Resolutions_C_ExecuteUbergraph_WBP_Graphic_Resolutions::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Graphic_Resolutions_C_ExecuteUbergraph_WBP_Graphic_Resolutions, CallFunc_Prepare_Supported_Resolution_Options_ResolutionOptions) == 0x000040, "Member 'WBP_Graphic_Resolutions_C_ExecuteUbergraph_WBP_Graphic_Resolutions::CallFunc_Prepare_Supported_Resolution_Options_ResolutionOptions' has a wrong offset!");
static_assert(offsetof(WBP_Graphic_Resolutions_C_ExecuteUbergraph_WBP_Graphic_Resolutions, K2Node_CustomEvent_SelectedItem) == 0x000050, "Member 'WBP_Graphic_Resolutions_C_ExecuteUbergraph_WBP_Graphic_Resolutions::K2Node_CustomEvent_SelectedItem' has a wrong offset!");
static_assert(offsetof(WBP_Graphic_Resolutions_C_ExecuteUbergraph_WBP_Graphic_Resolutions, K2Node_CustomEvent_SelectionType) == 0x000060, "Member 'WBP_Graphic_Resolutions_C_ExecuteUbergraph_WBP_Graphic_Resolutions::K2Node_CustomEvent_SelectionType' has a wrong offset!");
static_assert(offsetof(WBP_Graphic_Resolutions_C_ExecuteUbergraph_WBP_Graphic_Resolutions, CallFunc_Array_Length_ReturnValue) == 0x000064, "Member 'WBP_Graphic_Resolutions_C_ExecuteUbergraph_WBP_Graphic_Resolutions::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphic_Resolutions_C_ExecuteUbergraph_WBP_Graphic_Resolutions, CallFunc_Less_IntInt_ReturnValue) == 0x000068, "Member 'WBP_Graphic_Resolutions_C_ExecuteUbergraph_WBP_Graphic_Resolutions::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphic_Resolutions_C_ExecuteUbergraph_WBP_Graphic_Resolutions, CallFunc_Array_Get_Item) == 0x000070, "Member 'WBP_Graphic_Resolutions_C_ExecuteUbergraph_WBP_Graphic_Resolutions::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Graphic_Resolutions_C_ExecuteUbergraph_WBP_Graphic_Resolutions, CallFunc_Array_Length_ReturnValue_1) == 0x000098, "Member 'WBP_Graphic_Resolutions_C_ExecuteUbergraph_WBP_Graphic_Resolutions::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Graphic_Resolutions_C_ExecuteUbergraph_WBP_Graphic_Resolutions, CallFunc_Array_Get_Item_1) == 0x0000A0, "Member 'WBP_Graphic_Resolutions_C_ExecuteUbergraph_WBP_Graphic_Resolutions::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_Graphic_Resolutions_C_ExecuteUbergraph_WBP_Graphic_Resolutions, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000B0, "Member 'WBP_Graphic_Resolutions_C_ExecuteUbergraph_WBP_Graphic_Resolutions::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Graphic_Resolutions_C_ExecuteUbergraph_WBP_Graphic_Resolutions, CallFunc_Array_Length_ReturnValue_2) == 0x0000B4, "Member 'WBP_Graphic_Resolutions_C_ExecuteUbergraph_WBP_Graphic_Resolutions::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Graphic_Resolutions_C_ExecuteUbergraph_WBP_Graphic_Resolutions, CallFunc_Conv_TextToString_ReturnValue) == 0x0000B8, "Member 'WBP_Graphic_Resolutions_C_ExecuteUbergraph_WBP_Graphic_Resolutions::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphic_Resolutions_C_ExecuteUbergraph_WBP_Graphic_Resolutions, CallFunc_Less_IntInt_ReturnValue_2) == 0x0000C8, "Member 'WBP_Graphic_Resolutions_C_ExecuteUbergraph_WBP_Graphic_Resolutions::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Graphic_Resolutions_C_ExecuteUbergraph_WBP_Graphic_Resolutions, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x0000C9, "Member 'WBP_Graphic_Resolutions_C_ExecuteUbergraph_WBP_Graphic_Resolutions::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphic_Resolutions_C_ExecuteUbergraph_WBP_Graphic_Resolutions, Temp_int_Array_Index_Variable_3) == 0x0000CC, "Member 'WBP_Graphic_Resolutions_C_ExecuteUbergraph_WBP_Graphic_Resolutions::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Graphic_Resolutions_C_ExecuteUbergraph_WBP_Graphic_Resolutions, CallFunc_Array_Get_Item_2) == 0x0000D0, "Member 'WBP_Graphic_Resolutions_C_ExecuteUbergraph_WBP_Graphic_Resolutions::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_Graphic_Resolutions_C_ExecuteUbergraph_WBP_Graphic_Resolutions, CallFunc_Array_Length_ReturnValue_3) == 0x0000E0, "Member 'WBP_Graphic_Resolutions_C_ExecuteUbergraph_WBP_Graphic_Resolutions::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Graphic_Resolutions_C_ExecuteUbergraph_WBP_Graphic_Resolutions, CallFunc_Array_Get_Item_3) == 0x0000E8, "Member 'WBP_Graphic_Resolutions_C_ExecuteUbergraph_WBP_Graphic_Resolutions::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(WBP_Graphic_Resolutions_C_ExecuteUbergraph_WBP_Graphic_Resolutions, CallFunc_Less_IntInt_ReturnValue_3) == 0x000110, "Member 'WBP_Graphic_Resolutions_C_ExecuteUbergraph_WBP_Graphic_Resolutions::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Graphic_Resolutions_C_ExecuteUbergraph_WBP_Graphic_Resolutions, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000118, "Member 'WBP_Graphic_Resolutions_C_ExecuteUbergraph_WBP_Graphic_Resolutions::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Graphic_Resolutions_C_ExecuteUbergraph_WBP_Graphic_Resolutions, CallFunc_EqualEqual_StrStr_ReturnValue_1) == 0x000128, "Member 'WBP_Graphic_Resolutions_C_ExecuteUbergraph_WBP_Graphic_Resolutions::CallFunc_EqualEqual_StrStr_ReturnValue_1' has a wrong offset!");

// Function WBP_Graphic_Resolutions.WBP_Graphic_Resolutions_C.OnResolutionChange
// 0x0018 (0x0018 - 0x0000)
struct WBP_Graphic_Resolutions_C_OnResolutionChange final
{
public:
	class FString                                 SelectedItem;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectionType;                                     // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Graphic_Resolutions_C_OnResolutionChange) == 0x000008, "Wrong alignment on WBP_Graphic_Resolutions_C_OnResolutionChange");
static_assert(sizeof(WBP_Graphic_Resolutions_C_OnResolutionChange) == 0x000018, "Wrong size on WBP_Graphic_Resolutions_C_OnResolutionChange");
static_assert(offsetof(WBP_Graphic_Resolutions_C_OnResolutionChange, SelectedItem) == 0x000000, "Member 'WBP_Graphic_Resolutions_C_OnResolutionChange::SelectedItem' has a wrong offset!");
static_assert(offsetof(WBP_Graphic_Resolutions_C_OnResolutionChange, SelectionType) == 0x000010, "Member 'WBP_Graphic_Resolutions_C_OnResolutionChange::SelectionType' has a wrong offset!");

// Function WBP_Graphic_Resolutions.WBP_Graphic_Resolutions_C.Prepare Supported Resolution Options
// 0x0110 (0x0110 - 0x0000)
struct WBP_Graphic_Resolutions_C_Prepare_Supported_Resolution_Options final
{
public:
	TArray<struct FOriginalVideoOption>           ResolutionOptions_0;                               // 0x0000(0x0010)(Parm, OutParm)
	TArray<struct FOriginalVideoOption>           Local_OriginalResolutionOptions;                   // 0x0010(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FIntPoint>                      CallFunc_GetSupportedFullscreenResolutions_Resolutions; // 0x0030(0x0010)(ReferenceParm)
	bool                                          CallFunc_GetSupportedFullscreenResolutions_ReturnValue; // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0098(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         K2Node_MakeArray_Array;                            // 0x00D0(0x0010)(ReferenceParm)
	struct FOriginalVideoOption                   K2Node_MakeStruct_OriginalVideoOption;             // 0x00E0(0x0028)()
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Graphic_Resolutions_C_Prepare_Supported_Resolution_Options) == 0x000008, "Wrong alignment on WBP_Graphic_Resolutions_C_Prepare_Supported_Resolution_Options");
static_assert(sizeof(WBP_Graphic_Resolutions_C_Prepare_Supported_Resolution_Options) == 0x000110, "Wrong size on WBP_Graphic_Resolutions_C_Prepare_Supported_Resolution_Options");
static_assert(offsetof(WBP_Graphic_Resolutions_C_Prepare_Supported_Resolution_Options, ResolutionOptions_0) == 0x000000, "Member 'WBP_Graphic_Resolutions_C_Prepare_Supported_Resolution_Options::ResolutionOptions_0' has a wrong offset!");
static_assert(offsetof(WBP_Graphic_Resolutions_C_Prepare_Supported_Resolution_Options, Local_OriginalResolutionOptions) == 0x000010, "Member 'WBP_Graphic_Resolutions_C_Prepare_Supported_Resolution_Options::Local_OriginalResolutionOptions' has a wrong offset!");
static_assert(offsetof(WBP_Graphic_Resolutions_C_Prepare_Supported_Resolution_Options, Temp_int_Array_Index_Variable) == 0x000020, "Member 'WBP_Graphic_Resolutions_C_Prepare_Supported_Resolution_Options::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Graphic_Resolutions_C_Prepare_Supported_Resolution_Options, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'WBP_Graphic_Resolutions_C_Prepare_Supported_Resolution_Options::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Graphic_Resolutions_C_Prepare_Supported_Resolution_Options, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'WBP_Graphic_Resolutions_C_Prepare_Supported_Resolution_Options::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphic_Resolutions_C_Prepare_Supported_Resolution_Options, CallFunc_GetSupportedFullscreenResolutions_Resolutions) == 0x000030, "Member 'WBP_Graphic_Resolutions_C_Prepare_Supported_Resolution_Options::CallFunc_GetSupportedFullscreenResolutions_Resolutions' has a wrong offset!");
static_assert(offsetof(WBP_Graphic_Resolutions_C_Prepare_Supported_Resolution_Options, CallFunc_GetSupportedFullscreenResolutions_ReturnValue) == 0x000040, "Member 'WBP_Graphic_Resolutions_C_Prepare_Supported_Resolution_Options::CallFunc_GetSupportedFullscreenResolutions_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphic_Resolutions_C_Prepare_Supported_Resolution_Options, CallFunc_Array_Length_ReturnValue) == 0x000044, "Member 'WBP_Graphic_Resolutions_C_Prepare_Supported_Resolution_Options::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphic_Resolutions_C_Prepare_Supported_Resolution_Options, CallFunc_Array_Get_Item) == 0x000048, "Member 'WBP_Graphic_Resolutions_C_Prepare_Supported_Resolution_Options::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Graphic_Resolutions_C_Prepare_Supported_Resolution_Options, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'WBP_Graphic_Resolutions_C_Prepare_Supported_Resolution_Options::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphic_Resolutions_C_Prepare_Supported_Resolution_Options, CallFunc_Conv_IntToString_ReturnValue) == 0x000058, "Member 'WBP_Graphic_Resolutions_C_Prepare_Supported_Resolution_Options::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphic_Resolutions_C_Prepare_Supported_Resolution_Options, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000068, "Member 'WBP_Graphic_Resolutions_C_Prepare_Supported_Resolution_Options::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Graphic_Resolutions_C_Prepare_Supported_Resolution_Options, CallFunc_Concat_StrStr_ReturnValue) == 0x000078, "Member 'WBP_Graphic_Resolutions_C_Prepare_Supported_Resolution_Options::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphic_Resolutions_C_Prepare_Supported_Resolution_Options, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000088, "Member 'WBP_Graphic_Resolutions_C_Prepare_Supported_Resolution_Options::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Graphic_Resolutions_C_Prepare_Supported_Resolution_Options, CallFunc_Conv_StringToText_ReturnValue) == 0x000098, "Member 'WBP_Graphic_Resolutions_C_Prepare_Supported_Resolution_Options::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphic_Resolutions_C_Prepare_Supported_Resolution_Options, CallFunc_Conv_TextToString_ReturnValue) == 0x0000B0, "Member 'WBP_Graphic_Resolutions_C_Prepare_Supported_Resolution_Options::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphic_Resolutions_C_Prepare_Supported_Resolution_Options, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0000C0, "Member 'WBP_Graphic_Resolutions_C_Prepare_Supported_Resolution_Options::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Graphic_Resolutions_C_Prepare_Supported_Resolution_Options, K2Node_MakeArray_Array) == 0x0000D0, "Member 'WBP_Graphic_Resolutions_C_Prepare_Supported_Resolution_Options::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Graphic_Resolutions_C_Prepare_Supported_Resolution_Options, K2Node_MakeStruct_OriginalVideoOption) == 0x0000E0, "Member 'WBP_Graphic_Resolutions_C_Prepare_Supported_Resolution_Options::K2Node_MakeStruct_OriginalVideoOption' has a wrong offset!");
static_assert(offsetof(WBP_Graphic_Resolutions_C_Prepare_Supported_Resolution_Options, CallFunc_Array_Add_ReturnValue) == 0x000108, "Member 'WBP_Graphic_Resolutions_C_Prepare_Supported_Resolution_Options::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function WBP_Graphic_Resolutions.WBP_Graphic_Resolutions_C.Refresh
// 0x0018 (0x0018 - 0x0000)
struct WBP_Graphic_Resolutions_C_Refresh final
{
public:
	class FText                                   CallFunc_GetLabel_ReturnValue;                     // 0x0000(0x0018)(ConstParm)
};
static_assert(alignof(WBP_Graphic_Resolutions_C_Refresh) == 0x000008, "Wrong alignment on WBP_Graphic_Resolutions_C_Refresh");
static_assert(sizeof(WBP_Graphic_Resolutions_C_Refresh) == 0x000018, "Wrong size on WBP_Graphic_Resolutions_C_Refresh");
static_assert(offsetof(WBP_Graphic_Resolutions_C_Refresh, CallFunc_GetLabel_ReturnValue) == 0x000000, "Member 'WBP_Graphic_Resolutions_C_Refresh::CallFunc_GetLabel_ReturnValue' has a wrong offset!");

// Function WBP_Graphic_Resolutions.WBP_Graphic_Resolutions_C.Update Resolution in Game User Settings
// 0x0050 (0x0050 - 0x0000)
struct WBP_Graphic_Resolutions_C_Update_Resolution_in_Game_User_Settings final
{
public:
	class FString                                 Option_Label;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_LeftS;                              // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_RightS;                             // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Split_ReturnValue;                        // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_StringToInt_ReturnValue;             // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_StringToInt_ReturnValue_1;           // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              K2Node_MakeStruct_IntPoint;                        // 0x0044(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Graphic_Resolutions_C_Update_Resolution_in_Game_User_Settings) == 0x000008, "Wrong alignment on WBP_Graphic_Resolutions_C_Update_Resolution_in_Game_User_Settings");
static_assert(sizeof(WBP_Graphic_Resolutions_C_Update_Resolution_in_Game_User_Settings) == 0x000050, "Wrong size on WBP_Graphic_Resolutions_C_Update_Resolution_in_Game_User_Settings");
static_assert(offsetof(WBP_Graphic_Resolutions_C_Update_Resolution_in_Game_User_Settings, Option_Label) == 0x000000, "Member 'WBP_Graphic_Resolutions_C_Update_Resolution_in_Game_User_Settings::Option_Label' has a wrong offset!");
static_assert(offsetof(WBP_Graphic_Resolutions_C_Update_Resolution_in_Game_User_Settings, CallFunc_GetGameUserSettings_ReturnValue) == 0x000010, "Member 'WBP_Graphic_Resolutions_C_Update_Resolution_in_Game_User_Settings::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
