#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Modern_Settings_StepsWidget

#include "Basic.hpp"

#include "Altar_structs.hpp"


namespace SDK::Params
{

// Function WBP_Modern_Settings_StepsWidget.WBP_Modern_Settings_StepsWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Modern_Settings_StepsWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Settings_StepsWidget_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_Modern_Settings_StepsWidget_C_PreConstruct");
static_assert(sizeof(WBP_Modern_Settings_StepsWidget_C_PreConstruct) == 0x000001, "Wrong size on WBP_Modern_Settings_StepsWidget_C_PreConstruct");
static_assert(offsetof(WBP_Modern_Settings_StepsWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_Modern_Settings_StepsWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_Modern_Settings_StepsWidget.WBP_Modern_Settings_StepsWidget_C.OnStepChanged
// 0x0018 (0x0018 - 0x0000)
struct WBP_Modern_Settings_StepsWidget_C_OnStepChanged final
{
public:
	int32                                         StepIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Value;                                             // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Settings_StepsWidget_C_OnStepChanged) == 0x000008, "Wrong alignment on WBP_Modern_Settings_StepsWidget_C_OnStepChanged");
static_assert(sizeof(WBP_Modern_Settings_StepsWidget_C_OnStepChanged) == 0x000018, "Wrong size on WBP_Modern_Settings_StepsWidget_C_OnStepChanged");
static_assert(offsetof(WBP_Modern_Settings_StepsWidget_C_OnStepChanged, StepIndex) == 0x000000, "Member 'WBP_Modern_Settings_StepsWidget_C_OnStepChanged::StepIndex' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_StepsWidget_C_OnStepChanged, Value) == 0x000008, "Member 'WBP_Modern_Settings_StepsWidget_C_OnStepChanged::Value' has a wrong offset!");

// Function WBP_Modern_Settings_StepsWidget.WBP_Modern_Settings_StepsWidget_C.OnSettingChanged
// 0x0138 (0x0138 - 0x0000)
struct WBP_Modern_Settings_StepsWidget_C_OnSettingChanged final
{
public:
	struct FModernSettingTableRow                 NewSettingRow;                                     // 0x0000(0x0138)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_Modern_Settings_StepsWidget_C_OnSettingChanged) == 0x000008, "Wrong alignment on WBP_Modern_Settings_StepsWidget_C_OnSettingChanged");
static_assert(sizeof(WBP_Modern_Settings_StepsWidget_C_OnSettingChanged) == 0x000138, "Wrong size on WBP_Modern_Settings_StepsWidget_C_OnSettingChanged");
static_assert(offsetof(WBP_Modern_Settings_StepsWidget_C_OnSettingChanged, NewSettingRow) == 0x000000, "Member 'WBP_Modern_Settings_StepsWidget_C_OnSettingChanged::NewSettingRow' has a wrong offset!");

// Function WBP_Modern_Settings_StepsWidget.WBP_Modern_Settings_StepsWidget_C.OnRefreshWidgetRequested
// 0x0004 (0x0004 - 0x0000)
struct WBP_Modern_Settings_StepsWidget_C_OnRefreshWidgetRequested final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Settings_StepsWidget_C_OnRefreshWidgetRequested) == 0x000004, "Wrong alignment on WBP_Modern_Settings_StepsWidget_C_OnRefreshWidgetRequested");
static_assert(sizeof(WBP_Modern_Settings_StepsWidget_C_OnRefreshWidgetRequested) == 0x000004, "Wrong size on WBP_Modern_Settings_StepsWidget_C_OnRefreshWidgetRequested");
static_assert(offsetof(WBP_Modern_Settings_StepsWidget_C_OnRefreshWidgetRequested, Value) == 0x000000, "Member 'WBP_Modern_Settings_StepsWidget_C_OnRefreshWidgetRequested::Value' has a wrong offset!");

// Function WBP_Modern_Settings_StepsWidget.WBP_Modern_Settings_StepsWidget_C.InitializeWidget
// 0x0160 (0x0160 - 0x0000)
struct WBP_Modern_Settings_StepsWidget_C_InitializeWidget final
{
public:
	struct FModernSettingTableRow                 CallFunc_GetSettingRow_ReturnValue;                // 0x0000(0x0138)(ConstParm)
	float                                         CallFunc_GetCurrentWidgetValue_ReturnValue;        // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_145[0x3];                                      // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 StepIndex, const class FString& Value)> K2Node_CreateDelegate_OutputDelegate; // 0x0148(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FTrunc_A_ImplicitCast;                    // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Settings_StepsWidget_C_InitializeWidget) == 0x000008, "Wrong alignment on WBP_Modern_Settings_StepsWidget_C_InitializeWidget");
static_assert(sizeof(WBP_Modern_Settings_StepsWidget_C_InitializeWidget) == 0x000160, "Wrong size on WBP_Modern_Settings_StepsWidget_C_InitializeWidget");
static_assert(offsetof(WBP_Modern_Settings_StepsWidget_C_InitializeWidget, CallFunc_GetSettingRow_ReturnValue) == 0x000000, "Member 'WBP_Modern_Settings_StepsWidget_C_InitializeWidget::CallFunc_GetSettingRow_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_StepsWidget_C_InitializeWidget, CallFunc_GetCurrentWidgetValue_ReturnValue) == 0x000138, "Member 'WBP_Modern_Settings_StepsWidget_C_InitializeWidget::CallFunc_GetCurrentWidgetValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_StepsWidget_C_InitializeWidget, CallFunc_FTrunc_ReturnValue) == 0x00013C, "Member 'WBP_Modern_Settings_StepsWidget_C_InitializeWidget::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_StepsWidget_C_InitializeWidget, CallFunc_Array_Length_ReturnValue) == 0x000140, "Member 'WBP_Modern_Settings_StepsWidget_C_InitializeWidget::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_StepsWidget_C_InitializeWidget, CallFunc_Greater_IntInt_ReturnValue) == 0x000144, "Member 'WBP_Modern_Settings_StepsWidget_C_InitializeWidget::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_StepsWidget_C_InitializeWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000148, "Member 'WBP_Modern_Settings_StepsWidget_C_InitializeWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_StepsWidget_C_InitializeWidget, CallFunc_FTrunc_A_ImplicitCast) == 0x000158, "Member 'WBP_Modern_Settings_StepsWidget_C_InitializeWidget::CallFunc_FTrunc_A_ImplicitCast' has a wrong offset!");

// Function WBP_Modern_Settings_StepsWidget.WBP_Modern_Settings_StepsWidget_C.ExecuteUbergraph_WBP_Modern_Settings_StepsWidget
// 0x0690 (0x0690 - 0x0000)
struct WBP_Modern_Settings_StepsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_StepsWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FModernSettingTableRow                 CallFunc_GetSettingRow_ReturnValue;                // 0x0008(0x0138)(ConstParm)
	struct FModernSettingTableRow                 CallFunc_GetSettingRow_ReturnValue_1;              // 0x0140(0x0138)(ConstParm)
	struct FModernSettingTableRow                 K2Node_Event_NewSettingRow;                        // 0x0278(0x0138)(ConstParm)
	int32                                         K2Node_ComponentBoundEvent_StepIndex;              // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B4[0x4];                                      // 0x03B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_ComponentBoundEvent_Value;                  // 0x03B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FModernSettingTableRow                 CallFunc_GetSettingRow_ReturnValue_2;              // 0x03D0(0x0138)(ConstParm)
	struct FModernSettingTableRow                 CallFunc_GetSettingRow_ReturnValue_3;              // 0x0508(0x0138)(ConstParm)
	float                                         K2Node_Event_Value;                                // 0x0640(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0644(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCurrentIndex_Value;                    // 0x0648(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x064C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCurrentIndex_Value_1;                  // 0x0650(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0654(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCurrentIndex_Value_2;                  // 0x0658(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x065C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCurrentIndex_Value_3;                  // 0x0660(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0664(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0668(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocked_ReturnValue;                     // 0x0669(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocked_ReturnValue_1;                   // 0x066A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x066B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x066C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocked_ReturnValue_2;                   // 0x066D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_66E[0x2];                                      // 0x066E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCurrentIndex_Value_4;                  // 0x0670(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0674(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_675[0x3];                                      // 0x0675(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0678(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocked_ReturnValue_3;                   // 0x067C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocked_ReturnValue_4;                   // 0x067D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x067E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x067F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocked_ReturnValue_5;                   // 0x0680(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_681[0x3];                                      // 0x0681(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_ApplyNewValue_WidgetValue_ImplicitCast;   // 0x0684(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FTrunc_A_ImplicitCast;                    // 0x0688(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Settings_StepsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_StepsWidget) == 0x000008, "Wrong alignment on WBP_Modern_Settings_StepsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_StepsWidget");
static_assert(sizeof(WBP_Modern_Settings_StepsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_StepsWidget) == 0x000690, "Wrong size on WBP_Modern_Settings_StepsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_StepsWidget");
static_assert(offsetof(WBP_Modern_Settings_StepsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_StepsWidget, EntryPoint) == 0x000000, "Member 'WBP_Modern_Settings_StepsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_StepsWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_StepsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_StepsWidget, CallFunc_GetSettingRow_ReturnValue) == 0x000008, "Member 'WBP_Modern_Settings_StepsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_StepsWidget::CallFunc_GetSettingRow_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_StepsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_StepsWidget, CallFunc_GetSettingRow_ReturnValue_1) == 0x000140, "Member 'WBP_Modern_Settings_StepsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_StepsWidget::CallFunc_GetSettingRow_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_StepsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_StepsWidget, K2Node_Event_NewSettingRow) == 0x000278, "Member 'WBP_Modern_Settings_StepsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_StepsWidget::K2Node_Event_NewSettingRow' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_StepsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_StepsWidget, K2Node_ComponentBoundEvent_StepIndex) == 0x0003B0, "Member 'WBP_Modern_Settings_StepsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_StepsWidget::K2Node_ComponentBoundEvent_StepIndex' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_StepsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_StepsWidget, K2Node_ComponentBoundEvent_Value) == 0x0003B8, "Member 'WBP_Modern_Settings_StepsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_StepsWidget::K2Node_ComponentBoundEvent_Value' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_StepsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_StepsWidget, CallFunc_Conv_IntToDouble_ReturnValue) == 0x0003C8, "Member 'WBP_Modern_Settings_StepsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_StepsWidget::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_StepsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_StepsWidget, CallFunc_GetSettingRow_ReturnValue_2) == 0x0003D0, "Member 'WBP_Modern_Settings_StepsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_StepsWidget::CallFunc_GetSettingRow_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_StepsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_StepsWidget, CallFunc_GetSettingRow_ReturnValue_3) == 0x000508, "Member 'WBP_Modern_Settings_StepsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_StepsWidget::CallFunc_GetSettingRow_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_StepsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_StepsWidget, K2Node_Event_Value) == 0x000640, "Member 'WBP_Modern_Settings_StepsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_StepsWidget::K2Node_Event_Value' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_StepsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_StepsWidget, CallFunc_FTrunc_ReturnValue) == 0x000644, "Member 'WBP_Modern_Settings_StepsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_StepsWidget::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_StepsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_StepsWidget, CallFunc_GetCurrentIndex_Value) == 0x000648, "Member 'WBP_Modern_Settings_StepsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_StepsWidget::CallFunc_GetCurrentIndex_Value' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_StepsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_StepsWidget, CallFunc_Subtract_IntInt_ReturnValue) == 0x00064C, "Member 'WBP_Modern_Settings_StepsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_StepsWidget::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_StepsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_StepsWidget, CallFunc_GetCurrentIndex_Value_1) == 0x000650, "Member 'WBP_Modern_Settings_StepsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_StepsWidget::CallFunc_GetCurrentIndex_Value_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_StepsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_StepsWidget, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000654, "Member 'WBP_Modern_Settings_StepsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_StepsWidget::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_StepsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_StepsWidget, CallFunc_GetCurrentIndex_Value_2) == 0x000658, "Member 'WBP_Modern_Settings_StepsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_StepsWidget::CallFunc_GetCurrentIndex_Value_2' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_StepsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_StepsWidget, CallFunc_Add_IntInt_ReturnValue) == 0x00065C, "Member 'WBP_Modern_Settings_StepsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_StepsWidget::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_StepsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_StepsWidget, CallFunc_GetCurrentIndex_Value_3) == 0x000660, "Member 'WBP_Modern_Settings_StepsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_StepsWidget::CallFunc_GetCurrentIndex_Value_3' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_StepsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_StepsWidget, CallFunc_Add_IntInt_ReturnValue_1) == 0x000664, "Member 'WBP_Modern_Settings_StepsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_StepsWidget::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_StepsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_StepsWidget, K2Node_Event_IsDesignTime) == 0x000668, "Member 'WBP_Modern_Settings_StepsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_StepsWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_StepsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_StepsWidget, CallFunc_IsLocked_ReturnValue) == 0x000669, "Member 'WBP_Modern_Settings_StepsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_StepsWidget::CallFunc_IsLocked_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_StepsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_StepsWidget, CallFunc_IsLocked_ReturnValue_1) == 0x00066A, "Member 'WBP_Modern_Settings_StepsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_StepsWidget::CallFunc_IsLocked_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_StepsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_StepsWidget, CallFunc_Not_PreBool_ReturnValue) == 0x00066B, "Member 'WBP_Modern_Settings_StepsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_StepsWidget::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_StepsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_StepsWidget, CallFunc_Not_PreBool_ReturnValue_1) == 0x00066C, "Member 'WBP_Modern_Settings_StepsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_StepsWidget::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_StepsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_StepsWidget, CallFunc_IsLocked_ReturnValue_2) == 0x00066D, "Member 'WBP_Modern_Settings_StepsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_StepsWidget::CallFunc_IsLocked_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_StepsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_StepsWidget, CallFunc_GetCurrentIndex_Value_4) == 0x000670, "Member 'WBP_Modern_Settings_StepsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_StepsWidget::CallFunc_GetCurrentIndex_Value_4' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_StepsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_StepsWidget, CallFunc_Not_PreBool_ReturnValue_2) == 0x000674, "Member 'WBP_Modern_Settings_StepsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_StepsWidget::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_StepsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_StepsWidget, CallFunc_Add_IntInt_ReturnValue_2) == 0x000678, "Member 'WBP_Modern_Settings_StepsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_StepsWidget::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_StepsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_StepsWidget, CallFunc_IsLocked_ReturnValue_3) == 0x00067C, "Member 'WBP_Modern_Settings_StepsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_StepsWidget::CallFunc_IsLocked_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_StepsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_StepsWidget, CallFunc_IsLocked_ReturnValue_4) == 0x00067D, "Member 'WBP_Modern_Settings_StepsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_StepsWidget::CallFunc_IsLocked_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_StepsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_StepsWidget, CallFunc_Not_PreBool_ReturnValue_3) == 0x00067E, "Member 'WBP_Modern_Settings_StepsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_StepsWidget::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_StepsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_StepsWidget, CallFunc_Not_PreBool_ReturnValue_4) == 0x00067F, "Member 'WBP_Modern_Settings_StepsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_StepsWidget::CallFunc_Not_PreBool_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_StepsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_StepsWidget, CallFunc_IsLocked_ReturnValue_5) == 0x000680, "Member 'WBP_Modern_Settings_StepsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_StepsWidget::CallFunc_IsLocked_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_StepsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_StepsWidget, CallFunc_ApplyNewValue_WidgetValue_ImplicitCast) == 0x000684, "Member 'WBP_Modern_Settings_StepsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_StepsWidget::CallFunc_ApplyNewValue_WidgetValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_StepsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_StepsWidget, CallFunc_FTrunc_A_ImplicitCast) == 0x000688, "Member 'WBP_Modern_Settings_StepsWidget_C_ExecuteUbergraph_WBP_Modern_Settings_StepsWidget::CallFunc_FTrunc_A_ImplicitCast' has a wrong offset!");

// Function WBP_Modern_Settings_StepsWidget.WBP_Modern_Settings_StepsWidget_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct WBP_Modern_Settings_StepsWidget_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Settings_StepsWidget_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_Modern_Settings_StepsWidget_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_Modern_Settings_StepsWidget_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong size on WBP_Modern_Settings_StepsWidget_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_Modern_Settings_StepsWidget_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_Modern_Settings_StepsWidget_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");

}

