#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModernHud_CompassCardinalPoint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ModernHud_CompassCardinalPoint.WBP_ModernHud_CompassCardinalPoint_C
// 0x0080 (0x0368 - 0x02E8)
class UWBP_ModernHud_CompassCardinalPoint_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_AltarTextBlock_C*                  FaceText;                                          // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateFontInfo                         Font;                                              // 0x02F8(0x0058)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class FText                                   Text;                                              // 0x0350(0x0018)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_WBP_ModernHud_CompassCardinalPoint(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ModernHud_CompassCardinalPoint_C">();
	}
	static class UWBP_ModernHud_CompassCardinalPoint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ModernHud_CompassCardinalPoint_C>();
	}
};
static_assert(alignof(UWBP_ModernHud_CompassCardinalPoint_C) == 0x000008, "Wrong alignment on UWBP_ModernHud_CompassCardinalPoint_C");
static_assert(sizeof(UWBP_ModernHud_CompassCardinalPoint_C) == 0x000368, "Wrong size on UWBP_ModernHud_CompassCardinalPoint_C");
static_assert(offsetof(UWBP_ModernHud_CompassCardinalPoint_C, UberGraphFrame) == 0x0002E8, "Member 'UWBP_ModernHud_CompassCardinalPoint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_CompassCardinalPoint_C, FaceText) == 0x0002F0, "Member 'UWBP_ModernHud_CompassCardinalPoint_C::FaceText' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_CompassCardinalPoint_C, Font) == 0x0002F8, "Member 'UWBP_ModernHud_CompassCardinalPoint_C::Font' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_CompassCardinalPoint_C, Text) == 0x000350, "Member 'UWBP_ModernHud_CompassCardinalPoint_C::Text' has a wrong offset!");

}

