#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModernMenu_StatsSkillEntry

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "Altar_structs.hpp"
#include "Altar_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ModernMenu_StatsSkillEntry.WBP_ModernMenu_StatsSkillEntry_C
// 0x0210 (0x05A0 - 0x0390)
class UWBP_ModernMenu_StatsSkillEntry_C final : public UVAltarNavigableCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0390(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_AltarTextBlock_C*                  stat_header_text;                                  // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModernPrefab_Focusbox_C*           stat_skillentry_focus;                             // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               stat_skillentry_icon;                              // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AltarTextBlock_C*                  stat_skillentry_label;                             // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        stat_skillentry_switcher;                          // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AltarTextBlock_C*                  stat_skillentry_value;                             // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                TopSpacer;                                         // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsHeader;                                          // 0x03D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_3D1[0x7];                                      // 0x03D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   HeaderProperties;                                  // 0x03D8(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	struct FLegacyStatsMenuSkillItemProperties    ItemProperties;                                    // 0x03F0(0x0090)(Edit, BlueprintVisible, ExposeOnSpawn)
	struct FLinearColor                           NegativelyModifiedColour;                          // 0x0480(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           UnmodifiedColour;                                  // 0x0490(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           PositivelyModifiedColour;                          // 0x04A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            DefaultSecondaryAttributeBrush;                    // 0x04B0(0x00D0)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMulticastInlineDelegate<void(class UWBP_ModernMenu_StatsSkillEntry_C* NewParam)> OnFocusEvent;  // 0x0580(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         EntryIndex;                                        // 0x0590(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_ModernMenu_StatsSkillEntry(int32 EntryPoint);
	void OnFocus();
	void OnUnfocus();
	void SetIcon(class UTexture2D* Texture);
	void SetProperties(bool InIsHeader, const struct FLegacyStatsMenuSkillItemProperties& Properties, const class FText& HeaderText, int32 Index_0);
	void UpdateHeader();
	void UpdateItem();

	void GetValueColour(int32 Current, int32 base, struct FLinearColor* NewParam) const;
	bool IsNavigable() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ModernMenu_StatsSkillEntry_C">();
	}
	static class UWBP_ModernMenu_StatsSkillEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ModernMenu_StatsSkillEntry_C>();
	}
};
static_assert(alignof(UWBP_ModernMenu_StatsSkillEntry_C) == 0x000010, "Wrong alignment on UWBP_ModernMenu_StatsSkillEntry_C");
static_assert(sizeof(UWBP_ModernMenu_StatsSkillEntry_C) == 0x0005A0, "Wrong size on UWBP_ModernMenu_StatsSkillEntry_C");
static_assert(offsetof(UWBP_ModernMenu_StatsSkillEntry_C, UberGraphFrame) == 0x000390, "Member 'UWBP_ModernMenu_StatsSkillEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsSkillEntry_C, stat_header_text) == 0x000398, "Member 'UWBP_ModernMenu_StatsSkillEntry_C::stat_header_text' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsSkillEntry_C, stat_skillentry_focus) == 0x0003A0, "Member 'UWBP_ModernMenu_StatsSkillEntry_C::stat_skillentry_focus' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsSkillEntry_C, stat_skillentry_icon) == 0x0003A8, "Member 'UWBP_ModernMenu_StatsSkillEntry_C::stat_skillentry_icon' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsSkillEntry_C, stat_skillentry_label) == 0x0003B0, "Member 'UWBP_ModernMenu_StatsSkillEntry_C::stat_skillentry_label' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsSkillEntry_C, stat_skillentry_switcher) == 0x0003B8, "Member 'UWBP_ModernMenu_StatsSkillEntry_C::stat_skillentry_switcher' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsSkillEntry_C, stat_skillentry_value) == 0x0003C0, "Member 'UWBP_ModernMenu_StatsSkillEntry_C::stat_skillentry_value' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsSkillEntry_C, TopSpacer) == 0x0003C8, "Member 'UWBP_ModernMenu_StatsSkillEntry_C::TopSpacer' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsSkillEntry_C, IsHeader) == 0x0003D0, "Member 'UWBP_ModernMenu_StatsSkillEntry_C::IsHeader' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsSkillEntry_C, HeaderProperties) == 0x0003D8, "Member 'UWBP_ModernMenu_StatsSkillEntry_C::HeaderProperties' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsSkillEntry_C, ItemProperties) == 0x0003F0, "Member 'UWBP_ModernMenu_StatsSkillEntry_C::ItemProperties' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsSkillEntry_C, NegativelyModifiedColour) == 0x000480, "Member 'UWBP_ModernMenu_StatsSkillEntry_C::NegativelyModifiedColour' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsSkillEntry_C, UnmodifiedColour) == 0x000490, "Member 'UWBP_ModernMenu_StatsSkillEntry_C::UnmodifiedColour' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsSkillEntry_C, PositivelyModifiedColour) == 0x0004A0, "Member 'UWBP_ModernMenu_StatsSkillEntry_C::PositivelyModifiedColour' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsSkillEntry_C, DefaultSecondaryAttributeBrush) == 0x0004B0, "Member 'UWBP_ModernMenu_StatsSkillEntry_C::DefaultSecondaryAttributeBrush' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsSkillEntry_C, OnFocusEvent) == 0x000580, "Member 'UWBP_ModernMenu_StatsSkillEntry_C::OnFocusEvent' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsSkillEntry_C, EntryIndex) == 0x000590, "Member 'UWBP_ModernMenu_StatsSkillEntry_C::EntryIndex' has a wrong offset!");

}

