#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModernPrefab_Button

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_ModernPrefab_Button.WBP_ModernPrefab_Button_C.ExecuteUbergraph_WBP_ModernPrefab_Button
// 0x0020 (0x0020 - 0x0000)
struct WBP_ModernPrefab_Button_C_ExecuteUbergraph_WBP_ModernPrefab_Button final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ModernPrefab_ControllerInputHint_C* Temp_object_Variable;                             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ModernPrefab_ControllerInputHint_C* K2Node_Select_Default;                            // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernPrefab_Button_C_ExecuteUbergraph_WBP_ModernPrefab_Button) == 0x000008, "Wrong alignment on WBP_ModernPrefab_Button_C_ExecuteUbergraph_WBP_ModernPrefab_Button");
static_assert(sizeof(WBP_ModernPrefab_Button_C_ExecuteUbergraph_WBP_ModernPrefab_Button) == 0x000020, "Wrong size on WBP_ModernPrefab_Button_C_ExecuteUbergraph_WBP_ModernPrefab_Button");
static_assert(offsetof(WBP_ModernPrefab_Button_C_ExecuteUbergraph_WBP_ModernPrefab_Button, EntryPoint) == 0x000000, "Member 'WBP_ModernPrefab_Button_C_ExecuteUbergraph_WBP_ModernPrefab_Button::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ModernPrefab_Button_C_ExecuteUbergraph_WBP_ModernPrefab_Button, Temp_bool_Variable) == 0x000004, "Member 'WBP_ModernPrefab_Button_C_ExecuteUbergraph_WBP_ModernPrefab_Button::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernPrefab_Button_C_ExecuteUbergraph_WBP_ModernPrefab_Button, Temp_object_Variable) == 0x000008, "Member 'WBP_ModernPrefab_Button_C_ExecuteUbergraph_WBP_ModernPrefab_Button::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernPrefab_Button_C_ExecuteUbergraph_WBP_ModernPrefab_Button, K2Node_Event_IsDesignTime) == 0x000010, "Member 'WBP_ModernPrefab_Button_C_ExecuteUbergraph_WBP_ModernPrefab_Button::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_ModernPrefab_Button_C_ExecuteUbergraph_WBP_ModernPrefab_Button, K2Node_Select_Default) == 0x000018, "Member 'WBP_ModernPrefab_Button_C_ExecuteUbergraph_WBP_ModernPrefab_Button::K2Node_Select_Default' has a wrong offset!");

// Function WBP_ModernPrefab_Button.WBP_ModernPrefab_Button_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_ModernPrefab_Button_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernPrefab_Button_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_ModernPrefab_Button_C_PreConstruct");
static_assert(sizeof(WBP_ModernPrefab_Button_C_PreConstruct) == 0x000001, "Wrong size on WBP_ModernPrefab_Button_C_PreConstruct");
static_assert(offsetof(WBP_ModernPrefab_Button_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_ModernPrefab_Button_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

