#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModernMenu_DialogEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "WBP_ModernPrefab_NavigableButton_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ModernMenu_DialogEntry.WBP_ModernMenu_DialogEntry_C
// 0x0050 (0x1710 - 0x16C0)
class UWBP_ModernMenu_DialogEntry_C final : public UWBP_ModernPrefab_NavigableButton_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_ModernMenu_DialogEntry_C;       // 0x16C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HoverAnimation;                                    // 0x16C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_ModernPrefab_Selection_FocusBox_C* dialog_Selection_FocusBox;                         // 0x16D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AltarTextBlock_C*                  dialog_text;                                       // 0x16D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               DialogListPointSizeBox;                            // 0x16E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               WBP_OriginalImageTile;                             // 0x16E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsNewTopic;                                        // 0x16F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16F1[0x3];                                     // 0x16F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            TextIsNotNewColor;                                 // 0x16F4(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         TopicIndex;                                        // 0x1708(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_ModernMenu_DialogEntry(int32 EntryPoint);
	void OnFocus();
	void OnFocusEffect();
	void OnInitButtonWidgets();
	void OnUnfocus();
	void OnUnfocusEffect();
	void SetTextIsNotNewColor(bool IsNewTopic_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ModernMenu_DialogEntry_C">();
	}
	static class UWBP_ModernMenu_DialogEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ModernMenu_DialogEntry_C>();
	}
};
static_assert(alignof(UWBP_ModernMenu_DialogEntry_C) == 0x000010, "Wrong alignment on UWBP_ModernMenu_DialogEntry_C");
static_assert(sizeof(UWBP_ModernMenu_DialogEntry_C) == 0x001710, "Wrong size on UWBP_ModernMenu_DialogEntry_C");
static_assert(offsetof(UWBP_ModernMenu_DialogEntry_C, UberGraphFrame_WBP_ModernMenu_DialogEntry_C) == 0x0016C0, "Member 'UWBP_ModernMenu_DialogEntry_C::UberGraphFrame_WBP_ModernMenu_DialogEntry_C' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_DialogEntry_C, HoverAnimation) == 0x0016C8, "Member 'UWBP_ModernMenu_DialogEntry_C::HoverAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_DialogEntry_C, dialog_Selection_FocusBox) == 0x0016D0, "Member 'UWBP_ModernMenu_DialogEntry_C::dialog_Selection_FocusBox' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_DialogEntry_C, dialog_text) == 0x0016D8, "Member 'UWBP_ModernMenu_DialogEntry_C::dialog_text' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_DialogEntry_C, DialogListPointSizeBox) == 0x0016E0, "Member 'UWBP_ModernMenu_DialogEntry_C::DialogListPointSizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_DialogEntry_C, WBP_OriginalImageTile) == 0x0016E8, "Member 'UWBP_ModernMenu_DialogEntry_C::WBP_OriginalImageTile' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_DialogEntry_C, IsNewTopic) == 0x0016F0, "Member 'UWBP_ModernMenu_DialogEntry_C::IsNewTopic' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_DialogEntry_C, TextIsNotNewColor) == 0x0016F4, "Member 'UWBP_ModernMenu_DialogEntry_C::TextIsNotNewColor' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_DialogEntry_C, TopicIndex) == 0x001708, "Member 'UWBP_ModernMenu_DialogEntry_C::TopicIndex' has a wrong offset!");

}

