#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LegacyPrefab_FillBar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "LegacyFillBarColour_structs.hpp"
#include "Altar_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_LegacyPrefab_FillBar.WBP_LegacyPrefab_FillBar_C
// 0x0038 (0x0500 - 0x04C8)
class UWBP_LegacyPrefab_FillBar_C final : public UVAltarWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_LegacyImageTile_C*                 fillbar;                                           // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_LegacyImageTile_C*                 fillbar_full;                                      // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         fillbar_full_horizontalbox;                        // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        Fill;                                              // 0x04E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FillMax;                                           // 0x04F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         FillbarBackground;                                 // 0x04F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELegacyFillBarColour                          FillbarColour;                                     // 0x04FC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_LegacyPrefab_FillBar(int32 EntryPoint);
	void OnSynchronizeProperties();
	void SetFillbarBackground(int32 Fillbar_Number);
	void SetFillbarBackgroundRandom();
	void SetFillbarColour(ELegacyFillBarColour Colour_Number);
	void SetFillFraction(double Fill_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_LegacyPrefab_FillBar_C">();
	}
	static class UWBP_LegacyPrefab_FillBar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_LegacyPrefab_FillBar_C>();
	}
};
static_assert(alignof(UWBP_LegacyPrefab_FillBar_C) == 0x000008, "Wrong alignment on UWBP_LegacyPrefab_FillBar_C");
static_assert(sizeof(UWBP_LegacyPrefab_FillBar_C) == 0x000500, "Wrong size on UWBP_LegacyPrefab_FillBar_C");
static_assert(offsetof(UWBP_LegacyPrefab_FillBar_C, UberGraphFrame) == 0x0004C8, "Member 'UWBP_LegacyPrefab_FillBar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_LegacyPrefab_FillBar_C, fillbar) == 0x0004D0, "Member 'UWBP_LegacyPrefab_FillBar_C::fillbar' has a wrong offset!");
static_assert(offsetof(UWBP_LegacyPrefab_FillBar_C, fillbar_full) == 0x0004D8, "Member 'UWBP_LegacyPrefab_FillBar_C::fillbar_full' has a wrong offset!");
static_assert(offsetof(UWBP_LegacyPrefab_FillBar_C, fillbar_full_horizontalbox) == 0x0004E0, "Member 'UWBP_LegacyPrefab_FillBar_C::fillbar_full_horizontalbox' has a wrong offset!");
static_assert(offsetof(UWBP_LegacyPrefab_FillBar_C, Fill) == 0x0004E8, "Member 'UWBP_LegacyPrefab_FillBar_C::Fill' has a wrong offset!");
static_assert(offsetof(UWBP_LegacyPrefab_FillBar_C, FillMax) == 0x0004F0, "Member 'UWBP_LegacyPrefab_FillBar_C::FillMax' has a wrong offset!");
static_assert(offsetof(UWBP_LegacyPrefab_FillBar_C, FillbarBackground) == 0x0004F8, "Member 'UWBP_LegacyPrefab_FillBar_C::FillbarBackground' has a wrong offset!");
static_assert(offsetof(UWBP_LegacyPrefab_FillBar_C, FillbarColour) == 0x0004FC, "Member 'UWBP_LegacyPrefab_FillBar_C::FillbarColour' has a wrong offset!");

}

