#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Modern_QuestPage

#include "Basic.hpp"

#include "Altar_structs.hpp"
#include "EnhancedInput_structs.hpp"


namespace SDK::Params
{

// Function WBP_Modern_QuestPage.WBP_Modern_QuestPage_C.BndEvt__WBP_Modern_QuestPage_QuestListPanel_K2Node_ComponentBoundEvent_0_OnClickedQuest__DelegateSignature
// 0x0098 (0x0098 - 0x0000)
struct WBP_Modern_QuestPage_C_BndEvt__WBP_Modern_QuestPage_QuestListPanel_K2Node_ComponentBoundEvent_0_OnClickedQuest__DelegateSignature final
{
public:
	struct FLegacyMapMenuQuestProperties          ClickedQuestProperties;                            // 0x0000(0x0098)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Modern_QuestPage_C_BndEvt__WBP_Modern_QuestPage_QuestListPanel_K2Node_ComponentBoundEvent_0_OnClickedQuest__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Modern_QuestPage_C_BndEvt__WBP_Modern_QuestPage_QuestListPanel_K2Node_ComponentBoundEvent_0_OnClickedQuest__DelegateSignature");
static_assert(sizeof(WBP_Modern_QuestPage_C_BndEvt__WBP_Modern_QuestPage_QuestListPanel_K2Node_ComponentBoundEvent_0_OnClickedQuest__DelegateSignature) == 0x000098, "Wrong size on WBP_Modern_QuestPage_C_BndEvt__WBP_Modern_QuestPage_QuestListPanel_K2Node_ComponentBoundEvent_0_OnClickedQuest__DelegateSignature");
static_assert(offsetof(WBP_Modern_QuestPage_C_BndEvt__WBP_Modern_QuestPage_QuestListPanel_K2Node_ComponentBoundEvent_0_OnClickedQuest__DelegateSignature, ClickedQuestProperties) == 0x000000, "Member 'WBP_Modern_QuestPage_C_BndEvt__WBP_Modern_QuestPage_QuestListPanel_K2Node_ComponentBoundEvent_0_OnClickedQuest__DelegateSignature::ClickedQuestProperties' has a wrong offset!");

// Function WBP_Modern_QuestPage.WBP_Modern_QuestPage_C.BndEvt__WBP_Modern_QuestPage_QuestListPanel_K2Node_ComponentBoundEvent_2_OnHoverQuestPropertiesChanged__DelegateSignature
// 0x0098 (0x0098 - 0x0000)
struct WBP_Modern_QuestPage_C_BndEvt__WBP_Modern_QuestPage_QuestListPanel_K2Node_ComponentBoundEvent_2_OnHoverQuestPropertiesChanged__DelegateSignature final
{
public:
	struct FLegacyMapMenuQuestProperties          NewProperties;                                     // 0x0000(0x0098)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Modern_QuestPage_C_BndEvt__WBP_Modern_QuestPage_QuestListPanel_K2Node_ComponentBoundEvent_2_OnHoverQuestPropertiesChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Modern_QuestPage_C_BndEvt__WBP_Modern_QuestPage_QuestListPanel_K2Node_ComponentBoundEvent_2_OnHoverQuestPropertiesChanged__DelegateSignature");
static_assert(sizeof(WBP_Modern_QuestPage_C_BndEvt__WBP_Modern_QuestPage_QuestListPanel_K2Node_ComponentBoundEvent_2_OnHoverQuestPropertiesChanged__DelegateSignature) == 0x000098, "Wrong size on WBP_Modern_QuestPage_C_BndEvt__WBP_Modern_QuestPage_QuestListPanel_K2Node_ComponentBoundEvent_2_OnHoverQuestPropertiesChanged__DelegateSignature");
static_assert(offsetof(WBP_Modern_QuestPage_C_BndEvt__WBP_Modern_QuestPage_QuestListPanel_K2Node_ComponentBoundEvent_2_OnHoverQuestPropertiesChanged__DelegateSignature, NewProperties) == 0x000000, "Member 'WBP_Modern_QuestPage_C_BndEvt__WBP_Modern_QuestPage_QuestListPanel_K2Node_ComponentBoundEvent_2_OnHoverQuestPropertiesChanged__DelegateSignature::NewProperties' has a wrong offset!");

// Function WBP_Modern_QuestPage.WBP_Modern_QuestPage_C.BndEvt__WBP_Modern_QuestPage_QuestListPanel_K2Node_ComponentBoundEvent_6_OnRequestChangePage__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_Modern_QuestPage_C_BndEvt__WBP_Modern_QuestPage_QuestListPanel_K2Node_ComponentBoundEvent_6_OnRequestChangePage__DelegateSignature final
{
public:
	ELegacyMapMenuPage                            RequestedPage;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_QuestPage_C_BndEvt__WBP_Modern_QuestPage_QuestListPanel_K2Node_ComponentBoundEvent_6_OnRequestChangePage__DelegateSignature) == 0x000001, "Wrong alignment on WBP_Modern_QuestPage_C_BndEvt__WBP_Modern_QuestPage_QuestListPanel_K2Node_ComponentBoundEvent_6_OnRequestChangePage__DelegateSignature");
static_assert(sizeof(WBP_Modern_QuestPage_C_BndEvt__WBP_Modern_QuestPage_QuestListPanel_K2Node_ComponentBoundEvent_6_OnRequestChangePage__DelegateSignature) == 0x000001, "Wrong size on WBP_Modern_QuestPage_C_BndEvt__WBP_Modern_QuestPage_QuestListPanel_K2Node_ComponentBoundEvent_6_OnRequestChangePage__DelegateSignature");
static_assert(offsetof(WBP_Modern_QuestPage_C_BndEvt__WBP_Modern_QuestPage_QuestListPanel_K2Node_ComponentBoundEvent_6_OnRequestChangePage__DelegateSignature, RequestedPage) == 0x000000, "Member 'WBP_Modern_QuestPage_C_BndEvt__WBP_Modern_QuestPage_QuestListPanel_K2Node_ComponentBoundEvent_6_OnRequestChangePage__DelegateSignature::RequestedPage' has a wrong offset!");

// Function WBP_Modern_QuestPage.WBP_Modern_QuestPage_C.ExecuteUbergraph_WBP_Modern_QuestPage
// 0x02E0 (0x02E0 - 0x0000)
struct WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue;       // 0x0008(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime;       // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime;     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction;      // 0x0030(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable;                              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue;  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_0;                              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1_0;                            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FLegacyMapMenuQuestProperties>  K2Node_CustomEvent_NewQuestsInfo;                  // 0x0070(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLegacyMapMenuTitleProperties          K2Node_CustomEvent_NewTitleProperties;             // 0x0088(0x0030)()
	ELegacyMapMenuPage                            K2Node_CustomEvent_NewPage;                        // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLegacyMapMenuQuestProperties          K2Node_ComponentBoundEvent_NewProperties;          // 0x00C0(0x0098)()
	ELegacyMapMenuPage                            K2Node_ComponentBoundEvent_RequestedPage;          // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLegacyMapMenuQuestProperties          K2Node_ComponentBoundEvent_ClickedQuestProperties; // 0x0160(0x0098)()
	bool                                          CallFunc_GetIsFocussed_ReturnValue;                // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsFocussed_ReturnValue_1;              // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOnQuestListPage_IsOnQuestListPage;      // 0x01FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOnQuestListPage_IsOnQuestListPage_1;    // 0x01FB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x01FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FE[0x2];                                      // 0x01FE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFooterInputActionVisibility           K2Node_MakeStruct_FooterInputActionVisibility;     // 0x0200(0x0010)(NoDestructor)
	double                                        Temp_real_Variable_2;                              // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3;                              // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFooterInputActionVisibility           K2Node_MakeStruct_FooterInputActionVisibility_1;   // 0x0220(0x0010)(NoDestructor)
	struct FFooterInputActionVisibility           K2Node_MakeStruct_FooterInputActionVisibility_2;   // 0x0230(0x0010)(NoDestructor)
	double                                        Temp_real_Variable_4;                              // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           Temp_object_Variable_1;                            // 0x0250(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_1;     // 0x0258(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_1;     // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_1;   // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_1;    // 0x0280(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_289[0x7];                                      // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_4_0;                            // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_3_0;                            // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_InputActionValueToAxis1D_ReturnValue; // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFooterInputActionVisibility           K2Node_MakeStruct_FooterInputActionVisibility_3;   // 0x02B8(0x0010)(NoDestructor)
	class UVUINavigationGlobalSubsystem*          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x02C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IVEnhancedInputNavigable> CallFunc_NavigateToWidget_Widget_CastInput;     // 0x02D0(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage) == 0x000008, "Wrong alignment on WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage");
static_assert(sizeof(WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage) == 0x0002E0, "Wrong size on WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage");
static_assert(offsetof(WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage, EntryPoint) == 0x000000, "Member 'WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage, K2Node_EnhancedInputActionEvent_ActionValue) == 0x000008, "Member 'WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage::K2Node_EnhancedInputActionEvent_ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage, K2Node_EnhancedInputActionEvent_ElapsedTime) == 0x000028, "Member 'WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage::K2Node_EnhancedInputActionEvent_ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage, K2Node_EnhancedInputActionEvent_TriggeredTime) == 0x00002C, "Member 'WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage::K2Node_EnhancedInputActionEvent_TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage, K2Node_EnhancedInputActionEvent_SourceAction) == 0x000030, "Member 'WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage::K2Node_EnhancedInputActionEvent_SourceAction' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage, Temp_object_Variable) == 0x000038, "Member 'WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage, CallFunc_Conv_InputActionValueToBool_ReturnValue) == 0x000040, "Member 'WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage::CallFunc_Conv_InputActionValueToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage, Temp_real_Variable) == 0x000048, "Member 'WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage, Temp_real_Variable_1) == 0x000050, "Member 'WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage, Temp_real_Variable_0) == 0x000058, "Member 'WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage::Temp_real_Variable_0' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage, Temp_real_Variable_1_0) == 0x000060, "Member 'WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage::Temp_real_Variable_1_0' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage, Temp_bool_Variable) == 0x000068, "Member 'WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage, K2Node_CustomEvent_NewQuestsInfo) == 0x000070, "Member 'WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage::K2Node_CustomEvent_NewQuestsInfo' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage, CallFunc_Array_Length_ReturnValue) == 0x000080, "Member 'WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage, K2Node_CustomEvent_NewTitleProperties) == 0x000088, "Member 'WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage::K2Node_CustomEvent_NewTitleProperties' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage, K2Node_CustomEvent_NewPage) == 0x0000B8, "Member 'WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage::K2Node_CustomEvent_NewPage' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage, K2Node_ComponentBoundEvent_NewProperties) == 0x0000C0, "Member 'WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage::K2Node_ComponentBoundEvent_NewProperties' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage, K2Node_ComponentBoundEvent_RequestedPage) == 0x000158, "Member 'WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage::K2Node_ComponentBoundEvent_RequestedPage' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage, K2Node_ComponentBoundEvent_ClickedQuestProperties) == 0x000160, "Member 'WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage::K2Node_ComponentBoundEvent_ClickedQuestProperties' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage, CallFunc_GetIsFocussed_ReturnValue) == 0x0001F8, "Member 'WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage::CallFunc_GetIsFocussed_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage, CallFunc_GetIsFocussed_ReturnValue_1) == 0x0001F9, "Member 'WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage::CallFunc_GetIsFocussed_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage, CallFunc_IsOnQuestListPage_IsOnQuestListPage) == 0x0001FA, "Member 'WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage::CallFunc_IsOnQuestListPage_IsOnQuestListPage' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage, CallFunc_IsOnQuestListPage_IsOnQuestListPage_1) == 0x0001FB, "Member 'WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage::CallFunc_IsOnQuestListPage_IsOnQuestListPage_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage, CallFunc_BooleanAND_ReturnValue) == 0x0001FC, "Member 'WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage, CallFunc_BooleanAND_ReturnValue_1) == 0x0001FD, "Member 'WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage, K2Node_MakeStruct_FooterInputActionVisibility) == 0x000200, "Member 'WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage::K2Node_MakeStruct_FooterInputActionVisibility' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage, Temp_real_Variable_2) == 0x000210, "Member 'WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage, Temp_real_Variable_3) == 0x000218, "Member 'WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage, K2Node_MakeStruct_FooterInputActionVisibility_1) == 0x000220, "Member 'WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage::K2Node_MakeStruct_FooterInputActionVisibility_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage, K2Node_MakeStruct_FooterInputActionVisibility_2) == 0x000230, "Member 'WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage::K2Node_MakeStruct_FooterInputActionVisibility_2' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage, Temp_real_Variable_4) == 0x000240, "Member 'WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage::Temp_real_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000248, "Member 'WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage, Temp_object_Variable_1) == 0x000250, "Member 'WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage, K2Node_EnhancedInputActionEvent_ActionValue_1) == 0x000258, "Member 'WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage::K2Node_EnhancedInputActionEvent_ActionValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage, K2Node_EnhancedInputActionEvent_ElapsedTime_1) == 0x000278, "Member 'WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage::K2Node_EnhancedInputActionEvent_ElapsedTime_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage, K2Node_EnhancedInputActionEvent_TriggeredTime_1) == 0x00027C, "Member 'WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage::K2Node_EnhancedInputActionEvent_TriggeredTime_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage, K2Node_EnhancedInputActionEvent_SourceAction_1) == 0x000280, "Member 'WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage::K2Node_EnhancedInputActionEvent_SourceAction_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000288, "Member 'WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage, Temp_real_Variable_4_0) == 0x000290, "Member 'WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage::Temp_real_Variable_4_0' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage, CallFunc_Not_PreBool_ReturnValue) == 0x000298, "Member 'WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage, Temp_real_Variable_3_0) == 0x0002A0, "Member 'WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage::Temp_real_Variable_3_0' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage, CallFunc_Conv_InputActionValueToAxis1D_ReturnValue) == 0x0002A8, "Member 'WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage::CallFunc_Conv_InputActionValueToAxis1D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage, CallFunc_IsValid_ReturnValue) == 0x0002B0, "Member 'WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage, K2Node_MakeStruct_FooterInputActionVisibility_3) == 0x0002B8, "Member 'WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage::K2Node_MakeStruct_FooterInputActionVisibility_3' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x0002C8, "Member 'WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage, CallFunc_NavigateToWidget_Widget_CastInput) == 0x0002D0, "Member 'WBP_Modern_QuestPage_C_ExecuteUbergraph_WBP_Modern_QuestPage::CallFunc_NavigateToWidget_Widget_CastInput' has a wrong offset!");

// Function WBP_Modern_QuestPage.WBP_Modern_QuestPage_C.GetSubPageFromPageEnum
// 0x0010 (0x0010 - 0x0000)
struct WBP_Modern_QuestPage_C_GetSubPageFromPageEnum final
{
public:
	uint8                                         InByte;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_QuestPage_C_GetSubPageFromPageEnum) == 0x000004, "Wrong alignment on WBP_Modern_QuestPage_C_GetSubPageFromPageEnum");
static_assert(sizeof(WBP_Modern_QuestPage_C_GetSubPageFromPageEnum) == 0x000010, "Wrong size on WBP_Modern_QuestPage_C_GetSubPageFromPageEnum");
static_assert(offsetof(WBP_Modern_QuestPage_C_GetSubPageFromPageEnum, InByte) == 0x000000, "Member 'WBP_Modern_QuestPage_C_GetSubPageFromPageEnum::InByte' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_GetSubPageFromPageEnum, ReturnValue) == 0x000004, "Member 'WBP_Modern_QuestPage_C_GetSubPageFromPageEnum::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_GetSubPageFromPageEnum, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WBP_Modern_QuestPage_C_GetSubPageFromPageEnum::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_GetSubPageFromPageEnum, CallFunc_Subtract_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_Modern_QuestPage_C_GetSubPageFromPageEnum::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_Modern_QuestPage.WBP_Modern_QuestPage_C.HoverQuestPropertyAction
// 0x00D0 (0x00D0 - 0x0000)
struct WBP_Modern_QuestPage_C_HoverQuestPropertyAction final
{
public:
	struct FLegacyMapMenuQuestProperties          NewProperty;                                       // 0x0000(0x0098)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFooterInputActionVisibility           K2Node_MakeStruct_FooterInputActionVisibility;     // 0x00A0(0x0010)(NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELegacyMapMenuPage                            CallFunc_GetCurrentPage_ReturnValue;               // 0x00B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOnQuestListPage_IsOnQuestListPage;      // 0x00B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFooterInputActionVisibility           K2Node_MakeStruct_FooterInputActionVisibility_1;   // 0x00C0(0x0010)(NoDestructor)
};
static_assert(alignof(WBP_Modern_QuestPage_C_HoverQuestPropertyAction) == 0x000008, "Wrong alignment on WBP_Modern_QuestPage_C_HoverQuestPropertyAction");
static_assert(sizeof(WBP_Modern_QuestPage_C_HoverQuestPropertyAction) == 0x0000D0, "Wrong size on WBP_Modern_QuestPage_C_HoverQuestPropertyAction");
static_assert(offsetof(WBP_Modern_QuestPage_C_HoverQuestPropertyAction, NewProperty) == 0x000000, "Member 'WBP_Modern_QuestPage_C_HoverQuestPropertyAction::NewProperty' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_HoverQuestPropertyAction, CallFunc_Not_PreBool_ReturnValue) == 0x000098, "Member 'WBP_Modern_QuestPage_C_HoverQuestPropertyAction::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_HoverQuestPropertyAction, CallFunc_Not_PreBool_ReturnValue_1) == 0x000099, "Member 'WBP_Modern_QuestPage_C_HoverQuestPropertyAction::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_HoverQuestPropertyAction, K2Node_MakeStruct_FooterInputActionVisibility) == 0x0000A0, "Member 'WBP_Modern_QuestPage_C_HoverQuestPropertyAction::K2Node_MakeStruct_FooterInputActionVisibility' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_HoverQuestPropertyAction, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000B0, "Member 'WBP_Modern_QuestPage_C_HoverQuestPropertyAction::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_HoverQuestPropertyAction, CallFunc_Not_PreBool_ReturnValue_2) == 0x0000B1, "Member 'WBP_Modern_QuestPage_C_HoverQuestPropertyAction::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_HoverQuestPropertyAction, CallFunc_BooleanAND_ReturnValue) == 0x0000B2, "Member 'WBP_Modern_QuestPage_C_HoverQuestPropertyAction::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_HoverQuestPropertyAction, CallFunc_GetCurrentPage_ReturnValue) == 0x0000B3, "Member 'WBP_Modern_QuestPage_C_HoverQuestPropertyAction::CallFunc_GetCurrentPage_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_HoverQuestPropertyAction, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000B4, "Member 'WBP_Modern_QuestPage_C_HoverQuestPropertyAction::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_HoverQuestPropertyAction, CallFunc_IsOnQuestListPage_IsOnQuestListPage) == 0x0000B5, "Member 'WBP_Modern_QuestPage_C_HoverQuestPropertyAction::CallFunc_IsOnQuestListPage_IsOnQuestListPage' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_HoverQuestPropertyAction, CallFunc_BooleanAND_ReturnValue_1) == 0x0000B6, "Member 'WBP_Modern_QuestPage_C_HoverQuestPropertyAction::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_HoverQuestPropertyAction, CallFunc_IsValid_ReturnValue) == 0x0000B7, "Member 'WBP_Modern_QuestPage_C_HoverQuestPropertyAction::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_HoverQuestPropertyAction, CallFunc_BooleanAND_ReturnValue_2) == 0x0000B8, "Member 'WBP_Modern_QuestPage_C_HoverQuestPropertyAction::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_HoverQuestPropertyAction, K2Node_MakeStruct_FooterInputActionVisibility_1) == 0x0000C0, "Member 'WBP_Modern_QuestPage_C_HoverQuestPropertyAction::K2Node_MakeStruct_FooterInputActionVisibility_1' has a wrong offset!");

// Function WBP_Modern_QuestPage.WBP_Modern_QuestPage_C.InitFooter
// 0x0048 (0x0048 - 0x0000)
struct WBP_Modern_QuestPage_C_InitFooter final
{
public:
	class UWBP_Modern_Menu_Player_Footer_C*       Footer_0;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue_1;            // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FFooterInputActionVisibility           K2Node_MakeStruct_FooterInputActionVisibility;     // 0x0020(0x0010)(NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFooterInputActionVisibility           K2Node_MakeStruct_FooterInputActionVisibility_1;   // 0x0038(0x0010)(NoDestructor)
};
static_assert(alignof(WBP_Modern_QuestPage_C_InitFooter) == 0x000008, "Wrong alignment on WBP_Modern_QuestPage_C_InitFooter");
static_assert(sizeof(WBP_Modern_QuestPage_C_InitFooter) == 0x000048, "Wrong size on WBP_Modern_QuestPage_C_InitFooter");
static_assert(offsetof(WBP_Modern_QuestPage_C_InitFooter, Footer_0) == 0x000000, "Member 'WBP_Modern_QuestPage_C_InitFooter::Footer_0' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_InitFooter, CallFunc_GetActiveWidget_ReturnValue) == 0x000008, "Member 'WBP_Modern_QuestPage_C_InitFooter::CallFunc_GetActiveWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_InitFooter, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000010, "Member 'WBP_Modern_QuestPage_C_InitFooter::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_InitFooter, CallFunc_GetActiveWidget_ReturnValue_1) == 0x000018, "Member 'WBP_Modern_QuestPage_C_InitFooter::CallFunc_GetActiveWidget_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_InitFooter, K2Node_MakeStruct_FooterInputActionVisibility) == 0x000020, "Member 'WBP_Modern_QuestPage_C_InitFooter::K2Node_MakeStruct_FooterInputActionVisibility' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_InitFooter, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x000030, "Member 'WBP_Modern_QuestPage_C_InitFooter::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_InitFooter, K2Node_MakeStruct_FooterInputActionVisibility_1) == 0x000038, "Member 'WBP_Modern_QuestPage_C_InitFooter::K2Node_MakeStruct_FooterInputActionVisibility_1' has a wrong offset!");

// Function WBP_Modern_QuestPage.WBP_Modern_QuestPage_C.InpActEvt_IA_UI_Specific_QuestMenu_GoToQuestDetail_K2Node_EnhancedInputActionEvent_0
// 0x0030 (0x0030 - 0x0000)
struct WBP_Modern_QuestPage_C_InpActEvt_IA_UI_Specific_QuestMenu_GoToQuestDetail_K2Node_EnhancedInputActionEvent_0 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_QuestPage_C_InpActEvt_IA_UI_Specific_QuestMenu_GoToQuestDetail_K2Node_EnhancedInputActionEvent_0) == 0x000008, "Wrong alignment on WBP_Modern_QuestPage_C_InpActEvt_IA_UI_Specific_QuestMenu_GoToQuestDetail_K2Node_EnhancedInputActionEvent_0");
static_assert(sizeof(WBP_Modern_QuestPage_C_InpActEvt_IA_UI_Specific_QuestMenu_GoToQuestDetail_K2Node_EnhancedInputActionEvent_0) == 0x000030, "Wrong size on WBP_Modern_QuestPage_C_InpActEvt_IA_UI_Specific_QuestMenu_GoToQuestDetail_K2Node_EnhancedInputActionEvent_0");
static_assert(offsetof(WBP_Modern_QuestPage_C_InpActEvt_IA_UI_Specific_QuestMenu_GoToQuestDetail_K2Node_EnhancedInputActionEvent_0, ActionValue) == 0x000000, "Member 'WBP_Modern_QuestPage_C_InpActEvt_IA_UI_Specific_QuestMenu_GoToQuestDetail_K2Node_EnhancedInputActionEvent_0::ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_InpActEvt_IA_UI_Specific_QuestMenu_GoToQuestDetail_K2Node_EnhancedInputActionEvent_0, ElapsedTime) == 0x000020, "Member 'WBP_Modern_QuestPage_C_InpActEvt_IA_UI_Specific_QuestMenu_GoToQuestDetail_K2Node_EnhancedInputActionEvent_0::ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_InpActEvt_IA_UI_Specific_QuestMenu_GoToQuestDetail_K2Node_EnhancedInputActionEvent_0, TriggeredTime) == 0x000024, "Member 'WBP_Modern_QuestPage_C_InpActEvt_IA_UI_Specific_QuestMenu_GoToQuestDetail_K2Node_EnhancedInputActionEvent_0::TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_InpActEvt_IA_UI_Specific_QuestMenu_GoToQuestDetail_K2Node_EnhancedInputActionEvent_0, SourceAction) == 0x000028, "Member 'WBP_Modern_QuestPage_C_InpActEvt_IA_UI_Specific_QuestMenu_GoToQuestDetail_K2Node_EnhancedInputActionEvent_0::SourceAction' has a wrong offset!");

// Function WBP_Modern_QuestPage.WBP_Modern_QuestPage_C.InpActEvt_IA_UI_Specific_QuestMenu_ScrollFlavorText_K2Node_EnhancedInputActionEvent_1
// 0x0030 (0x0030 - 0x0000)
struct WBP_Modern_QuestPage_C_InpActEvt_IA_UI_Specific_QuestMenu_ScrollFlavorText_K2Node_EnhancedInputActionEvent_1 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_QuestPage_C_InpActEvt_IA_UI_Specific_QuestMenu_ScrollFlavorText_K2Node_EnhancedInputActionEvent_1) == 0x000008, "Wrong alignment on WBP_Modern_QuestPage_C_InpActEvt_IA_UI_Specific_QuestMenu_ScrollFlavorText_K2Node_EnhancedInputActionEvent_1");
static_assert(sizeof(WBP_Modern_QuestPage_C_InpActEvt_IA_UI_Specific_QuestMenu_ScrollFlavorText_K2Node_EnhancedInputActionEvent_1) == 0x000030, "Wrong size on WBP_Modern_QuestPage_C_InpActEvt_IA_UI_Specific_QuestMenu_ScrollFlavorText_K2Node_EnhancedInputActionEvent_1");
static_assert(offsetof(WBP_Modern_QuestPage_C_InpActEvt_IA_UI_Specific_QuestMenu_ScrollFlavorText_K2Node_EnhancedInputActionEvent_1, ActionValue) == 0x000000, "Member 'WBP_Modern_QuestPage_C_InpActEvt_IA_UI_Specific_QuestMenu_ScrollFlavorText_K2Node_EnhancedInputActionEvent_1::ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_InpActEvt_IA_UI_Specific_QuestMenu_ScrollFlavorText_K2Node_EnhancedInputActionEvent_1, ElapsedTime) == 0x000020, "Member 'WBP_Modern_QuestPage_C_InpActEvt_IA_UI_Specific_QuestMenu_ScrollFlavorText_K2Node_EnhancedInputActionEvent_1::ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_InpActEvt_IA_UI_Specific_QuestMenu_ScrollFlavorText_K2Node_EnhancedInputActionEvent_1, TriggeredTime) == 0x000024, "Member 'WBP_Modern_QuestPage_C_InpActEvt_IA_UI_Specific_QuestMenu_ScrollFlavorText_K2Node_EnhancedInputActionEvent_1::TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_InpActEvt_IA_UI_Specific_QuestMenu_ScrollFlavorText_K2Node_EnhancedInputActionEvent_1, SourceAction) == 0x000028, "Member 'WBP_Modern_QuestPage_C_InpActEvt_IA_UI_Specific_QuestMenu_ScrollFlavorText_K2Node_EnhancedInputActionEvent_1::SourceAction' has a wrong offset!");

// Function WBP_Modern_QuestPage.WBP_Modern_QuestPage_C.IsOnQuestListPage
// 0x0018 (0x0018 - 0x0000)
struct WBP_Modern_QuestPage_C_IsOnQuestListPage final
{
public:
	bool                                          IsOnQuestListPage_0;                               // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_QuestPage_C_IsOnQuestListPage) == 0x000008, "Wrong alignment on WBP_Modern_QuestPage_C_IsOnQuestListPage");
static_assert(sizeof(WBP_Modern_QuestPage_C_IsOnQuestListPage) == 0x000018, "Wrong size on WBP_Modern_QuestPage_C_IsOnQuestListPage");
static_assert(offsetof(WBP_Modern_QuestPage_C_IsOnQuestListPage, IsOnQuestListPage_0) == 0x000000, "Member 'WBP_Modern_QuestPage_C_IsOnQuestListPage::IsOnQuestListPage_0' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_IsOnQuestListPage, CallFunc_GetActiveWidget_ReturnValue) == 0x000008, "Member 'WBP_Modern_QuestPage_C_IsOnQuestListPage::CallFunc_GetActiveWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_IsOnQuestListPage, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000010, "Member 'WBP_Modern_QuestPage_C_IsOnQuestListPage::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function WBP_Modern_QuestPage.WBP_Modern_QuestPage_C.On Set Active Quest Pressed
// 0x00A0 (0x00A0 - 0x0000)
struct WBP_Modern_QuestPage_C_On_Set_Active_Quest_Pressed final
{
public:
	struct FLegacyMapMenuQuestProperties          QuestProperties;                                   // 0x0000(0x0098)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCurrentQuestPage_IsCurrentQuestPage;    // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_QuestPage_C_On_Set_Active_Quest_Pressed) == 0x000008, "Wrong alignment on WBP_Modern_QuestPage_C_On_Set_Active_Quest_Pressed");
static_assert(sizeof(WBP_Modern_QuestPage_C_On_Set_Active_Quest_Pressed) == 0x0000A0, "Wrong size on WBP_Modern_QuestPage_C_On_Set_Active_Quest_Pressed");
static_assert(offsetof(WBP_Modern_QuestPage_C_On_Set_Active_Quest_Pressed, QuestProperties) == 0x000000, "Member 'WBP_Modern_QuestPage_C_On_Set_Active_Quest_Pressed::QuestProperties' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_On_Set_Active_Quest_Pressed, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000098, "Member 'WBP_Modern_QuestPage_C_On_Set_Active_Quest_Pressed::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_On_Set_Active_Quest_Pressed, CallFunc_IsCurrentQuestPage_IsCurrentQuestPage) == 0x000099, "Member 'WBP_Modern_QuestPage_C_On_Set_Active_Quest_Pressed::CallFunc_IsCurrentQuestPage_IsCurrentQuestPage' has a wrong offset!");

// Function WBP_Modern_QuestPage.WBP_Modern_QuestPage_C.OnBackFromHistoric
// 0x0028 (0x0028 - 0x0000)
struct WBP_Modern_QuestPage_C_OnBackFromHistoric final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELegacyMapMenuPage                            Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELegacyMapMenuPage                            Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UVUINavigationGlobalSubsystem*          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IVEnhancedInputNavigable> CallFunc_NavigateToWidget_Widget_CastInput;     // 0x0010(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	ELegacyMapMenuPage                            K2Node_Select_Default;                             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_QuestPage_C_OnBackFromHistoric) == 0x000008, "Wrong alignment on WBP_Modern_QuestPage_C_OnBackFromHistoric");
static_assert(sizeof(WBP_Modern_QuestPage_C_OnBackFromHistoric) == 0x000028, "Wrong size on WBP_Modern_QuestPage_C_OnBackFromHistoric");
static_assert(offsetof(WBP_Modern_QuestPage_C_OnBackFromHistoric, Temp_bool_Variable) == 0x000000, "Member 'WBP_Modern_QuestPage_C_OnBackFromHistoric::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_OnBackFromHistoric, Temp_byte_Variable) == 0x000001, "Member 'WBP_Modern_QuestPage_C_OnBackFromHistoric::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_OnBackFromHistoric, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_Modern_QuestPage_C_OnBackFromHistoric::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_OnBackFromHistoric, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'WBP_Modern_QuestPage_C_OnBackFromHistoric::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_OnBackFromHistoric, CallFunc_NavigateToWidget_Widget_CastInput) == 0x000010, "Member 'WBP_Modern_QuestPage_C_OnBackFromHistoric::CallFunc_NavigateToWidget_Widget_CastInput' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_OnBackFromHistoric, K2Node_Select_Default) == 0x000020, "Member 'WBP_Modern_QuestPage_C_OnBackFromHistoric::K2Node_Select_Default' has a wrong offset!");

// Function WBP_Modern_QuestPage.WBP_Modern_QuestPage_C.OnRequestPageChange
// 0x0001 (0x0001 - 0x0000)
struct WBP_Modern_QuestPage_C_OnRequestPageChange final
{
public:
	ELegacyMapMenuPage                            NewPage;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_QuestPage_C_OnRequestPageChange) == 0x000001, "Wrong alignment on WBP_Modern_QuestPage_C_OnRequestPageChange");
static_assert(sizeof(WBP_Modern_QuestPage_C_OnRequestPageChange) == 0x000001, "Wrong size on WBP_Modern_QuestPage_C_OnRequestPageChange");
static_assert(offsetof(WBP_Modern_QuestPage_C_OnRequestPageChange, NewPage) == 0x000000, "Member 'WBP_Modern_QuestPage_C_OnRequestPageChange::NewPage' has a wrong offset!");

// Function WBP_Modern_QuestPage.WBP_Modern_QuestPage_C.OnRequestQuestDetail
// 0x0020 (0x0020 - 0x0000)
struct WBP_Modern_QuestPage_C_OnRequestQuestDetail final
{
public:
	bool                                          CallFunc_IsCurrentQuestPage_IsCurrentQuestPage;    // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UVUINavigationGlobalSubsystem*          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IVEnhancedInputNavigable> CallFunc_NavigateToWidget_Widget_CastInput;     // 0x0010(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_QuestPage_C_OnRequestQuestDetail) == 0x000008, "Wrong alignment on WBP_Modern_QuestPage_C_OnRequestQuestDetail");
static_assert(sizeof(WBP_Modern_QuestPage_C_OnRequestQuestDetail) == 0x000020, "Wrong size on WBP_Modern_QuestPage_C_OnRequestQuestDetail");
static_assert(offsetof(WBP_Modern_QuestPage_C_OnRequestQuestDetail, CallFunc_IsCurrentQuestPage_IsCurrentQuestPage) == 0x000000, "Member 'WBP_Modern_QuestPage_C_OnRequestQuestDetail::CallFunc_IsCurrentQuestPage_IsCurrentQuestPage' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_OnRequestQuestDetail, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000001, "Member 'WBP_Modern_QuestPage_C_OnRequestQuestDetail::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_OnRequestQuestDetail, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'WBP_Modern_QuestPage_C_OnRequestQuestDetail::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_OnRequestQuestDetail, CallFunc_NavigateToWidget_Widget_CastInput) == 0x000010, "Member 'WBP_Modern_QuestPage_C_OnRequestQuestDetail::CallFunc_NavigateToWidget_Widget_CastInput' has a wrong offset!");

// Function WBP_Modern_QuestPage.WBP_Modern_QuestPage_C.OnUpdateCurrentPage
// 0x0028 (0x0028 - 0x0000)
struct WBP_Modern_QuestPage_C_OnUpdateCurrentPage final
{
public:
	ELegacyMapMenuPage                            NewPage;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVUINavigationGlobalSubsystem*          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsFocussed_ReturnValue;                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IVEnhancedInputNavigable> CallFunc_NavigateToWidget_Widget_CastInput;     // 0x0018(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_QuestPage_C_OnUpdateCurrentPage) == 0x000008, "Wrong alignment on WBP_Modern_QuestPage_C_OnUpdateCurrentPage");
static_assert(sizeof(WBP_Modern_QuestPage_C_OnUpdateCurrentPage) == 0x000028, "Wrong size on WBP_Modern_QuestPage_C_OnUpdateCurrentPage");
static_assert(offsetof(WBP_Modern_QuestPage_C_OnUpdateCurrentPage, NewPage) == 0x000000, "Member 'WBP_Modern_QuestPage_C_OnUpdateCurrentPage::NewPage' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_OnUpdateCurrentPage, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'WBP_Modern_QuestPage_C_OnUpdateCurrentPage::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_OnUpdateCurrentPage, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000010, "Member 'WBP_Modern_QuestPage_C_OnUpdateCurrentPage::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_OnUpdateCurrentPage, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000011, "Member 'WBP_Modern_QuestPage_C_OnUpdateCurrentPage::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_OnUpdateCurrentPage, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000012, "Member 'WBP_Modern_QuestPage_C_OnUpdateCurrentPage::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_OnUpdateCurrentPage, CallFunc_BooleanOR_ReturnValue) == 0x000013, "Member 'WBP_Modern_QuestPage_C_OnUpdateCurrentPage::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_OnUpdateCurrentPage, CallFunc_GetIsFocussed_ReturnValue) == 0x000014, "Member 'WBP_Modern_QuestPage_C_OnUpdateCurrentPage::CallFunc_GetIsFocussed_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_QuestPage_C_OnUpdateCurrentPage, CallFunc_NavigateToWidget_Widget_CastInput) == 0x000018, "Member 'WBP_Modern_QuestPage_C_OnUpdateCurrentPage::CallFunc_NavigateToWidget_Widget_CastInput' has a wrong offset!");

// Function WBP_Modern_QuestPage.WBP_Modern_QuestPage_C.OnUpdateQuests
// 0x0038 (0x0038 - 0x0000)
struct WBP_Modern_QuestPage_C_OnUpdateQuests final
{
public:
