#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Modern_Settings_ButtonWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Altar_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Modern_Settings_ButtonWidget.WBP_Modern_Settings_ButtonWidget_C
// 0x0058 (0x0698 - 0x0640)
class UWBP_Modern_Settings_ButtonWidget_C final : public UVModernSettingWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0640(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVSettingsMenuViewModel*                VSettingsMenuViewModel;                            // 0x0648(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               FocusBackground;                                   // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModernPrefab_ControllerInputHint_C* HintKey;                                          // 0x0658(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                SettingsButton;                                    // 0x0660(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AltarTextBlock_C*                  SettingsButtonLabel;                               // 0x0668(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AltarTextBlock_C*                  SettingsLabel;                                     // 0x0670(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           FocusColor;                                        // 0x0678(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           UnfocusColor;                                      // 0x0688(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_Modern_VideoSettings_Button_SettingsButton_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void ExecuteUbergraph_WBP_Modern_Settings_ButtonWidget(int32 EntryPoint);
	void OnFocus();
	void OnSettingAccept();
	void OnSettingChanged(const struct FModernSettingTableRow& NewSettingRow);
	void OnUnfocus();
	void PreConstruct(bool IsDesignTime);
	void SetViewModel_Internal(class UVSettingsMenuViewModel* ViewModel);
	void SetVSettingsMenuViewModel(class UVSettingsMenuViewModel* ViewModel);
	void ThisIsForPluginCompliance(bool ThisIsForPluginCompliance_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Modern_Settings_ButtonWidget_C">();
	}
	static class UWBP_Modern_Settings_ButtonWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Modern_Settings_ButtonWidget_C>();
	}
};
static_assert(alignof(UWBP_Modern_Settings_ButtonWidget_C) == 0x000008, "Wrong alignment on UWBP_Modern_Settings_ButtonWidget_C");
static_assert(sizeof(UWBP_Modern_Settings_ButtonWidget_C) == 0x000698, "Wrong size on UWBP_Modern_Settings_ButtonWidget_C");
static_assert(offsetof(UWBP_Modern_Settings_ButtonWidget_C, UberGraphFrame) == 0x000640, "Member 'UWBP_Modern_Settings_ButtonWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_ButtonWidget_C, VSettingsMenuViewModel) == 0x000648, "Member 'UWBP_Modern_Settings_ButtonWidget_C::VSettingsMenuViewModel' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_ButtonWidget_C, FocusBackground) == 0x000650, "Member 'UWBP_Modern_Settings_ButtonWidget_C::FocusBackground' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_ButtonWidget_C, HintKey) == 0x000658, "Member 'UWBP_Modern_Settings_ButtonWidget_C::HintKey' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_ButtonWidget_C, SettingsButton) == 0x000660, "Member 'UWBP_Modern_Settings_ButtonWidget_C::SettingsButton' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_ButtonWidget_C, SettingsButtonLabel) == 0x000668, "Member 'UWBP_Modern_Settings_ButtonWidget_C::SettingsButtonLabel' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_ButtonWidget_C, SettingsLabel) == 0x000670, "Member 'UWBP_Modern_Settings_ButtonWidget_C::SettingsLabel' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_ButtonWidget_C, FocusColor) == 0x000678, "Member 'UWBP_Modern_Settings_ButtonWidget_C::FocusColor' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_ButtonWidget_C, UnfocusColor) == 0x000688, "Member 'UWBP_Modern_Settings_ButtonWidget_C::UnfocusColor' has a wrong offset!");

}

