#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModernMenu_SpellPurchaseItem

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Altar_structs.hpp"


namespace SDK::Params
{

// Function WBP_ModernMenu_SpellPurchaseItem.WBP_ModernMenu_SpellPurchaseItem_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_ModernMenu_SpellPurchaseItem_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_SpellPurchaseItem_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong alignment on WBP_ModernMenu_SpellPurchaseItem_C_BP_OnItemSelectionChanged");
static_assert(sizeof(WBP_ModernMenu_SpellPurchaseItem_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong size on WBP_ModernMenu_SpellPurchaseItem_C_BP_OnItemSelectionChanged");
static_assert(offsetof(WBP_ModernMenu_SpellPurchaseItem_C_BP_OnItemSelectionChanged, bIsSelected) == 0x000000, "Member 'WBP_ModernMenu_SpellPurchaseItem_C_BP_OnItemSelectionChanged::bIsSelected' has a wrong offset!");

// Function WBP_ModernMenu_SpellPurchaseItem.WBP_ModernMenu_SpellPurchaseItem_C.ExecuteUbergraph_WBP_ModernMenu_SpellPurchaseItem
// 0x0070 (0x0070 - 0x0000)
struct WBP_ModernMenu_SpellPurchaseItem_C_ExecuteUbergraph_WBP_ModernMenu_SpellPurchaseItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVLegacySpellPurchaseMenuItem*          K2Node_DynamicCast_AsVLegacy_Spell_Purchase_Menu_Item; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLegacySpellPurchaseMenuItemProperties CallFunc_GetProperties_ReturnValue;                // 0x0020(0x0050)(ConstParm)
};
static_assert(alignof(WBP_ModernMenu_SpellPurchaseItem_C_ExecuteUbergraph_WBP_ModernMenu_SpellPurchaseItem) == 0x000008, "Wrong alignment on WBP_ModernMenu_SpellPurchaseItem_C_ExecuteUbergraph_WBP_ModernMenu_SpellPurchaseItem");
static_assert(sizeof(WBP_ModernMenu_SpellPurchaseItem_C_ExecuteUbergraph_WBP_ModernMenu_SpellPurchaseItem) == 0x000070, "Wrong size on WBP_ModernMenu_SpellPurchaseItem_C_ExecuteUbergraph_WBP_ModernMenu_SpellPurchaseItem");
static_assert(offsetof(WBP_ModernMenu_SpellPurchaseItem_C_ExecuteUbergraph_WBP_ModernMenu_SpellPurchaseItem, EntryPoint) == 0x000000, "Member 'WBP_ModernMenu_SpellPurchaseItem_C_ExecuteUbergraph_WBP_ModernMenu_SpellPurchaseItem::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_SpellPurchaseItem_C_ExecuteUbergraph_WBP_ModernMenu_SpellPurchaseItem, K2Node_Event_bIsSelected) == 0x000004, "Member 'WBP_ModernMenu_SpellPurchaseItem_C_ExecuteUbergraph_WBP_ModernMenu_SpellPurchaseItem::K2Node_Event_bIsSelected' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_SpellPurchaseItem_C_ExecuteUbergraph_WBP_ModernMenu_SpellPurchaseItem, K2Node_Event_ListItemObject) == 0x000008, "Member 'WBP_ModernMenu_SpellPurchaseItem_C_ExecuteUbergraph_WBP_ModernMenu_SpellPurchaseItem::K2Node_Event_ListItemObject' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_SpellPurchaseItem_C_ExecuteUbergraph_WBP_ModernMenu_SpellPurchaseItem, K2Node_DynamicCast_AsVLegacy_Spell_Purchase_Menu_Item) == 0x000010, "Member 'WBP_ModernMenu_SpellPurchaseItem_C_ExecuteUbergraph_WBP_ModernMenu_SpellPurchaseItem::K2Node_DynamicCast_AsVLegacy_Spell_Purchase_Menu_Item' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_SpellPurchaseItem_C_ExecuteUbergraph_WBP_ModernMenu_SpellPurchaseItem, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_ModernMenu_SpellPurchaseItem_C_ExecuteUbergraph_WBP_ModernMenu_SpellPurchaseItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_SpellPurchaseItem_C_ExecuteUbergraph_WBP_ModernMenu_SpellPurchaseItem, CallFunc_GetProperties_ReturnValue) == 0x000020, "Member 'WBP_ModernMenu_SpellPurchaseItem_C_ExecuteUbergraph_WBP_ModernMenu_SpellPurchaseItem::CallFunc_GetProperties_ReturnValue' has a wrong offset!");

// Function WBP_ModernMenu_SpellPurchaseItem.WBP_ModernMenu_SpellPurchaseItem_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct WBP_ModernMenu_SpellPurchaseItem_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_SpellPurchaseItem_C_OnListItemObjectSet) == 0x000008, "Wrong alignment on WBP_ModernMenu_SpellPurchaseItem_C_OnListItemObjectSet");
static_assert(sizeof(WBP_ModernMenu_SpellPurchaseItem_C_OnListItemObjectSet) == 0x000008, "Wrong size on WBP_ModernMenu_SpellPurchaseItem_C_OnListItemObjectSet");
static_assert(offsetof(WBP_ModernMenu_SpellPurchaseItem_C_OnListItemObjectSet, ListItemObject) == 0x000000, "Member 'WBP_ModernMenu_SpellPurchaseItem_C_OnListItemObjectSet::ListItemObject' has a wrong offset!");

// Function WBP_ModernMenu_SpellPurchaseItem.WBP_ModernMenu_SpellPurchaseItem_C.SetIcon
// 0x00F0 (0x00F0 - 0x0000)
struct WBP_ModernMenu_SpellPurchaseItem_C_SetIcon final
{
public:
	class UTexture2D*                             Texture;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Blueprint_GetSizeY_ReturnValue;           // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Blueprint_GetSizeX_ReturnValue;           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0xC];                                       // 0x0014(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_MakeBrushFromTexture_ReturnValue;         // 0x0020(0x00D0)()
};
static_assert(alignof(WBP_ModernMenu_SpellPurchaseItem_C_SetIcon) == 0x000010, "Wrong alignment on WBP_ModernMenu_SpellPurchaseItem_C_SetIcon");
static_assert(sizeof(WBP_ModernMenu_SpellPurchaseItem_C_SetIcon) == 0x0000F0, "Wrong size on WBP_ModernMenu_SpellPurchaseItem_C_SetIcon");
static_assert(offsetof(WBP_ModernMenu_SpellPurchaseItem_C_SetIcon, Texture) == 0x000000, "Member 'WBP_ModernMenu_SpellPurchaseItem_C_SetIcon::Texture' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_SpellPurchaseItem_C_SetIcon, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WBP_ModernMenu_SpellPurchaseItem_C_SetIcon::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_SpellPurchaseItem_C_SetIcon, CallFunc_Blueprint_GetSizeY_ReturnValue) == 0x00000C, "Member 'WBP_ModernMenu_SpellPurchaseItem_C_SetIcon::CallFunc_Blueprint_GetSizeY_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_SpellPurchaseItem_C_SetIcon, CallFunc_Blueprint_GetSizeX_ReturnValue) == 0x000010, "Member 'WBP_ModernMenu_SpellPurchaseItem_C_SetIcon::CallFunc_Blueprint_GetSizeX_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_SpellPurchaseItem_C_SetIcon, CallFunc_MakeBrushFromTexture_ReturnValue) == 0x000020, "Member 'WBP_ModernMenu_SpellPurchaseItem_C_SetIcon::CallFunc_MakeBrushFromTexture_ReturnValue' has a wrong offset!");

// Function WBP_ModernMenu_SpellPurchaseItem.WBP_ModernMenu_SpellPurchaseItem_C.SetProperties
// 0x0050 (0x0050 - 0x0000)
struct WBP_ModernMenu_SpellPurchaseItem_C_SetProperties final
{
public:
	struct FLegacySpellPurchaseMenuItemProperties InProperties;                                      // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_ModernMenu_SpellPurchaseItem_C_SetProperties) == 0x000008, "Wrong alignment on WBP_ModernMenu_SpellPurchaseItem_C_SetProperties");
static_assert(sizeof(WBP_ModernMenu_SpellPurchaseItem_C_SetProperties) == 0x000050, "Wrong size on WBP_ModernMenu_SpellPurchaseItem_C_SetProperties");
static_assert(offsetof(WBP_ModernMenu_SpellPurchaseItem_C_SetProperties, InProperties) == 0x000000, "Member 'WBP_ModernMenu_SpellPurchaseItem_C_SetProperties::InProperties' has a wrong offset!");

// Function WBP_ModernMenu_SpellPurchaseItem.WBP_ModernMenu_SpellPurchaseItem_C.UpdateItem
// 0x0030 (0x0030 - 0x0000)
struct WBP_ModernMenu_SpellPurchaseItem_C_UpdateItem final
{
public:
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0000(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0018(0x0018)()
};
static_assert(alignof(WBP_ModernMenu_SpellPurchaseItem_C_UpdateItem) == 0x000008, "Wrong alignment on WBP_ModernMenu_SpellPurchaseItem_C_UpdateItem");
static_assert(sizeof(WBP_ModernMenu_SpellPurchaseItem_C_UpdateItem) == 0x000030, "Wrong size on WBP_ModernMenu_SpellPurchaseItem_C_UpdateItem");
static_assert(offsetof(WBP_ModernMenu_SpellPurchaseItem_C_UpdateItem, CallFunc_Conv_IntToText_ReturnValue) == 0x000000, "Member 'WBP_ModernMenu_SpellPurchaseItem_C_UpdateItem::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_SpellPurchaseItem_C_UpdateItem, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000018, "Member 'WBP_ModernMenu_SpellPurchaseItem_C_UpdateItem::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");

}

