#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModernHud_StatusBar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ModernHud_StatusBar.WBP_ModernHud_StatusBar_C
// 0x0070 (0x0358 - 0x02E8)
class UWBP_ModernHud_StatusBar_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOut;                                           // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       TriggerHighlighAnimation;                          // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ToggleHighlightAnimation;                          // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       DelayedProgressAnimation;                          // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ProgressAnimation;                                 // 0x0310(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 ProgressBar;                                       // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInterface*                     ProgressMaterial;                                  // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        Progress;                                          // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        OldProgress;                                       // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PreviousReversePlayValue;                          // 0x0338(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_339[0x7];                                      // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        AnimationDelay;                                    // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Play_Rate;                                         // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Reverse_Play;                                      // 0x0350(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_ModernHud_StatusBar(int32 EntryPoint);
	void HandleFadeOutAnimation();
	void PlayFadeOutAnimation(double Delay, double PlayRate, bool ReversePlay);
	void PreConstruct(bool IsDesignTime);
	void SetImmediateProgress(double In_Progress);
	void SetProgress(double InProgress, bool IsPreview);
	void ToggleBlinking(bool bOn);
	void TriggerBlinking();

	void GetProgress(double* Progress_0) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ModernHud_StatusBar_C">();
	}
	static class UWBP_ModernHud_StatusBar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ModernHud_StatusBar_C>();
	}
};
static_assert(alignof(UWBP_ModernHud_StatusBar_C) == 0x000008, "Wrong alignment on UWBP_ModernHud_StatusBar_C");
static_assert(sizeof(UWBP_ModernHud_StatusBar_C) == 0x000358, "Wrong size on UWBP_ModernHud_StatusBar_C");
static_assert(offsetof(UWBP_ModernHud_StatusBar_C, UberGraphFrame) == 0x0002E8, "Member 'UWBP_ModernHud_StatusBar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_StatusBar_C, FadeOut) == 0x0002F0, "Member 'UWBP_ModernHud_StatusBar_C::FadeOut' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_StatusBar_C, TriggerHighlighAnimation) == 0x0002F8, "Member 'UWBP_ModernHud_StatusBar_C::TriggerHighlighAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_StatusBar_C, ToggleHighlightAnimation) == 0x000300, "Member 'UWBP_ModernHud_StatusBar_C::ToggleHighlightAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_StatusBar_C, DelayedProgressAnimation) == 0x000308, "Member 'UWBP_ModernHud_StatusBar_C::DelayedProgressAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_StatusBar_C, ProgressAnimation) == 0x000310, "Member 'UWBP_ModernHud_StatusBar_C::ProgressAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_StatusBar_C, ProgressBar) == 0x000318, "Member 'UWBP_ModernHud_StatusBar_C::ProgressBar' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_StatusBar_C, ProgressMaterial) == 0x000320, "Member 'UWBP_ModernHud_StatusBar_C::ProgressMaterial' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_StatusBar_C, Progress) == 0x000328, "Member 'UWBP_ModernHud_StatusBar_C::Progress' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_StatusBar_C, OldProgress) == 0x000330, "Member 'UWBP_ModernHud_StatusBar_C::OldProgress' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_StatusBar_C, PreviousReversePlayValue) == 0x000338, "Member 'UWBP_ModernHud_StatusBar_C::PreviousReversePlayValue' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_StatusBar_C, AnimationDelay) == 0x000340, "Member 'UWBP_ModernHud_StatusBar_C::AnimationDelay' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_StatusBar_C, Play_Rate) == 0x000348, "Member 'UWBP_ModernHud_StatusBar_C::Play_Rate' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_StatusBar_C, Reverse_Play) == 0x000350, "Member 'UWBP_ModernHud_StatusBar_C::Reverse_Play' has a wrong offset!");

}

