#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Modern_Menu_Player_Footer

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Altar_structs.hpp"
#include "CommonInput_structs.hpp"


namespace SDK::Params
{

// Function WBP_Modern_Menu_Player_Footer.WBP_Modern_Menu_Player_Footer_C.AddInputHint
// 0x0040 (0x0040 - 0x0000)
struct WBP_Modern_Menu_Player_Footer_C_AddInputHint final
{
public:
	class UInputAction*                           New_IA;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bShouldHideWithKeyboard;                           // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShouldHideWithGamepad;                            // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   OverrideName;                                      // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UWBP_Modern_Menu_Player_BoundAction_C*  CallFunc_Create_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Menu_Player_Footer_C_AddInputHint) == 0x000008, "Wrong alignment on WBP_Modern_Menu_Player_Footer_C_AddInputHint");
static_assert(sizeof(WBP_Modern_Menu_Player_Footer_C_AddInputHint) == 0x000040, "Wrong size on WBP_Modern_Menu_Player_Footer_C_AddInputHint");
static_assert(offsetof(WBP_Modern_Menu_Player_Footer_C_AddInputHint, New_IA) == 0x000000, "Member 'WBP_Modern_Menu_Player_Footer_C_AddInputHint::New_IA' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Footer_C_AddInputHint, bShouldHideWithKeyboard) == 0x000008, "Member 'WBP_Modern_Menu_Player_Footer_C_AddInputHint::bShouldHideWithKeyboard' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Footer_C_AddInputHint, bShouldHideWithGamepad) == 0x000009, "Member 'WBP_Modern_Menu_Player_Footer_C_AddInputHint::bShouldHideWithGamepad' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Footer_C_AddInputHint, OverrideName) == 0x000010, "Member 'WBP_Modern_Menu_Player_Footer_C_AddInputHint::OverrideName' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Footer_C_AddInputHint, CallFunc_Create_ReturnValue) == 0x000028, "Member 'WBP_Modern_Menu_Player_Footer_C_AddInputHint::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Footer_C_AddInputHint, CallFunc_Array_Add_ReturnValue) == 0x000030, "Member 'WBP_Modern_Menu_Player_Footer_C_AddInputHint::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Footer_C_AddInputHint, CallFunc_AddChild_ReturnValue) == 0x000038, "Member 'WBP_Modern_Menu_Player_Footer_C_AddInputHint::CallFunc_AddChild_ReturnValue' has a wrong offset!");

// Function WBP_Modern_Menu_Player_Footer.WBP_Modern_Menu_Player_Footer_C.AddInputHintWithIMC
// 0x0048 (0x0048 - 0x0000)
struct WBP_Modern_Menu_Player_Footer_C_AddInputHintWithIMC final
{
public:
	class UInputAction*                           New_IA;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputMappingContext*                   NewIMC;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bShouldHideWithKeyboard;                           // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShouldHideWithGamepad;                            // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   OverrideName;                                      // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UWBP_Modern_Menu_Player_BoundAction_C*  CallFunc_Create_ReturnValue;                       // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Menu_Player_Footer_C_AddInputHintWithIMC) == 0x000008, "Wrong alignment on WBP_Modern_Menu_Player_Footer_C_AddInputHintWithIMC");
static_assert(sizeof(WBP_Modern_Menu_Player_Footer_C_AddInputHintWithIMC) == 0x000048, "Wrong size on WBP_Modern_Menu_Player_Footer_C_AddInputHintWithIMC");
static_assert(offsetof(WBP_Modern_Menu_Player_Footer_C_AddInputHintWithIMC, New_IA) == 0x000000, "Member 'WBP_Modern_Menu_Player_Footer_C_AddInputHintWithIMC::New_IA' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Footer_C_AddInputHintWithIMC, NewIMC) == 0x000008, "Member 'WBP_Modern_Menu_Player_Footer_C_AddInputHintWithIMC::NewIMC' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Footer_C_AddInputHintWithIMC, bShouldHideWithKeyboard) == 0x000010, "Member 'WBP_Modern_Menu_Player_Footer_C_AddInputHintWithIMC::bShouldHideWithKeyboard' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Footer_C_AddInputHintWithIMC, bShouldHideWithGamepad) == 0x000011, "Member 'WBP_Modern_Menu_Player_Footer_C_AddInputHintWithIMC::bShouldHideWithGamepad' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Footer_C_AddInputHintWithIMC, OverrideName) == 0x000018, "Member 'WBP_Modern_Menu_Player_Footer_C_AddInputHintWithIMC::OverrideName' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Footer_C_AddInputHintWithIMC, CallFunc_Create_ReturnValue) == 0x000030, "Member 'WBP_Modern_Menu_Player_Footer_C_AddInputHintWithIMC::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Footer_C_AddInputHintWithIMC, CallFunc_Array_Add_ReturnValue) == 0x000038, "Member 'WBP_Modern_Menu_Player_Footer_C_AddInputHintWithIMC::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Footer_C_AddInputHintWithIMC, CallFunc_AddChild_ReturnValue) == 0x000040, "Member 'WBP_Modern_Menu_Player_Footer_C_AddInputHintWithIMC::CallFunc_AddChild_ReturnValue' has a wrong offset!");

// Function WBP_Modern_Menu_Player_Footer.WBP_Modern_Menu_Player_Footer_C.ExecuteUbergraph_WBP_Modern_Menu_Player_Footer
// 0x00A0 (0x00A0 - 0x0000)
struct WBP_Modern_Menu_Player_Footer_C_ExecuteUbergraph_WBP_Modern_Menu_Player_Footer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bIsHidden)>               K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           K2Node_CustomEvent_InputAction_1;                  // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           K2Node_CustomEvent_InputAction;                    // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_Modern_Menu_Player_BoundAction_C*  CallFunc_Get_Bound_Action_Widget_Widget;           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Modern_Menu_Player_BoundAction_C*  CallFunc_Get_Bound_Action_Widget_Widget_1;         // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UInputAction* TriggerInputAction)> K2Node_CreateDelegate_OutputDelegate_1;  // 0x0048(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UInputAction* TriggerInputAction)> K2Node_CreateDelegate_OutputDelegate_2;  // 0x0058(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate_3;          // 0x0068(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FFooterInputActionDescription& NewInputActionDescription)> K2Node_CreateDelegate_OutputDelegate_4; // 0x0078(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FFooterInputActionVisibility& NewInputActionVisibility)> K2Node_CreateDelegate_OutputDelegate_5; // 0x0088(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAltarUISubsystem*                     CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Menu_Player_Footer_C_ExecuteUbergraph_WBP_Modern_Menu_Player_Footer) == 0x000008, "Wrong alignment on WBP_Modern_Menu_Player_Footer_C_ExecuteUbergraph_WBP_Modern_Menu_Player_Footer");
static_assert(sizeof(WBP_Modern_Menu_Player_Footer_C_ExecuteUbergraph_WBP_Modern_Menu_Player_Footer) == 0x0000A0, "Wrong size on WBP_Modern_Menu_Player_Footer_C_ExecuteUbergraph_WBP_Modern_Menu_Player_Footer");
static_assert(offsetof(WBP_Modern_Menu_Player_Footer_C_ExecuteUbergraph_WBP_Modern_Menu_Player_Footer, EntryPoint) == 0x000000, "Member 'WBP_Modern_Menu_Player_Footer_C_ExecuteUbergraph_WBP_Modern_Menu_Player_Footer::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Footer_C_ExecuteUbergraph_WBP_Modern_Menu_Player_Footer, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_Modern_Menu_Player_Footer_C_ExecuteUbergraph_WBP_Modern_Menu_Player_Footer::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Footer_C_ExecuteUbergraph_WBP_Modern_Menu_Player_Footer, K2Node_CustomEvent_InputAction_1) == 0x000018, "Member 'WBP_Modern_Menu_Player_Footer_C_ExecuteUbergraph_WBP_Modern_Menu_Player_Footer::K2Node_CustomEvent_InputAction_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Footer_C_ExecuteUbergraph_WBP_Modern_Menu_Player_Footer, K2Node_CustomEvent_InputAction) == 0x000020, "Member 'WBP_Modern_Menu_Player_Footer_C_ExecuteUbergraph_WBP_Modern_Menu_Player_Footer::K2Node_CustomEvent_InputAction' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Footer_C_ExecuteUbergraph_WBP_Modern_Menu_Player_Footer, CallFunc_Get_Bound_Action_Widget_Widget) == 0x000028, "Member 'WBP_Modern_Menu_Player_Footer_C_ExecuteUbergraph_WBP_Modern_Menu_Player_Footer::CallFunc_Get_Bound_Action_Widget_Widget' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Footer_C_ExecuteUbergraph_WBP_Modern_Menu_Player_Footer, CallFunc_Get_Bound_Action_Widget_Widget_1) == 0x000030, "Member 'WBP_Modern_Menu_Player_Footer_C_ExecuteUbergraph_WBP_Modern_Menu_Player_Footer::CallFunc_Get_Bound_Action_Widget_Widget_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Footer_C_ExecuteUbergraph_WBP_Modern_Menu_Player_Footer, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'WBP_Modern_Menu_Player_Footer_C_ExecuteUbergraph_WBP_Modern_Menu_Player_Footer::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Footer_C_ExecuteUbergraph_WBP_Modern_Menu_Player_Footer, CallFunc_IsValid_ReturnValue_1) == 0x000039, "Member 'WBP_Modern_Menu_Player_Footer_C_ExecuteUbergraph_WBP_Modern_Menu_Player_Footer::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Footer_C_ExecuteUbergraph_WBP_Modern_Menu_Player_Footer, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000040, "Member 'WBP_Modern_Menu_Player_Footer_C_ExecuteUbergraph_WBP_Modern_Menu_Player_Footer::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Footer_C_ExecuteUbergraph_WBP_Modern_Menu_Player_Footer, K2Node_CreateDelegate_OutputDelegate_1) == 0x000048, "Member 'WBP_Modern_Menu_Player_Footer_C_ExecuteUbergraph_WBP_Modern_Menu_Player_Footer::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Footer_C_ExecuteUbergraph_WBP_Modern_Menu_Player_Footer, K2Node_CreateDelegate_OutputDelegate_2) == 0x000058, "Member 'WBP_Modern_Menu_Player_Footer_C_ExecuteUbergraph_WBP_Modern_Menu_Player_Footer::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Footer_C_ExecuteUbergraph_WBP_Modern_Menu_Player_Footer, K2Node_CreateDelegate_OutputDelegate_3) == 0x000068, "Member 'WBP_Modern_Menu_Player_Footer_C_ExecuteUbergraph_WBP_Modern_Menu_Player_Footer::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Footer_C_ExecuteUbergraph_WBP_Modern_Menu_Player_Footer, K2Node_CreateDelegate_OutputDelegate_4) == 0x000078, "Member 'WBP_Modern_Menu_Player_Footer_C_ExecuteUbergraph_WBP_Modern_Menu_Player_Footer::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Footer_C_ExecuteUbergraph_WBP_Modern_Menu_Player_Footer, K2Node_CreateDelegate_OutputDelegate_5) == 0x000088, "Member 'WBP_Modern_Menu_Player_Footer_C_ExecuteUbergraph_WBP_Modern_Menu_Player_Footer::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Footer_C_ExecuteUbergraph_WBP_Modern_Menu_Player_Footer, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000098, "Member 'WBP_Modern_Menu_Player_Footer_C_ExecuteUbergraph_WBP_Modern_Menu_Player_Footer::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");

// Function WBP_Modern_Menu_Player_Footer.WBP_Modern_Menu_Player_Footer_C.Get Bound Action Widget
// 0x0040 (0x0040 - 0x0000)
struct WBP_Modern_Menu_Player_Footer_C_Get_Bound_Action_Widget final
{
public:
	class UInputAction*                           Input_Action;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_Modern_Menu_Player_BoundAction_C*  Widget;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Modern_Menu_Player_BoundAction_C*  CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UInputAction*                     CallFunc_GetBoundInputAction_ReturnValue;          // 0x0030(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Menu_Player_Footer_C_Get_Bound_Action_Widget) == 0x000008, "Wrong alignment on WBP_Modern_Menu_Player_Footer_C_Get_Bound_Action_Widget");
static_assert(sizeof(WBP_Modern_Menu_Player_Footer_C_Get_Bound_Action_Widget) == 0x000040, "Wrong size on WBP_Modern_Menu_Player_Footer_C_Get_Bound_Action_Widget");
static_assert(offsetof(WBP_Modern_Menu_Player_Footer_C_Get_Bound_Action_Widget, Input_Action) == 0x000000, "Member 'WBP_Modern_Menu_Player_Footer_C_Get_Bound_Action_Widget::Input_Action' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Footer_C_Get_Bound_Action_Widget, Widget) == 0x000008, "Member 'WBP_Modern_Menu_Player_Footer_C_Get_Bound_Action_Widget::Widget' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Footer_C_Get_Bound_Action_Widget, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WBP_Modern_Menu_Player_Footer_C_Get_Bound_Action_Widget::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Footer_C_Get_Bound_Action_Widget, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'WBP_Modern_Menu_Player_Footer_C_Get_Bound_Action_Widget::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Footer_C_Get_Bound_Action_Widget, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WBP_Modern_Menu_Player_Footer_C_Get_Bound_Action_Widget::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Footer_C_Get_Bound_Action_Widget, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'WBP_Modern_Menu_Player_Footer_C_Get_Bound_Action_Widget::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Footer_C_Get_Bound_Action_Widget, CallFunc_Array_Get_Item) == 0x000020, "Member 'WBP_Modern_Menu_Player_Footer_C_Get_Bound_Action_Widget::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Footer_C_Get_Bound_Action_Widget, CallFunc_Less_IntInt_ReturnValue) == 0x000028, "Member 'WBP_Modern_Menu_Player_Footer_C_Get_Bound_Action_Widget::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Footer_C_Get_Bound_Action_Widget, CallFunc_GetBoundInputAction_ReturnValue) == 0x000030, "Member 'WBP_Modern_Menu_Player_Footer_C_Get_Bound_Action_Widget::CallFunc_GetBoundInputAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Footer_C_Get_Bound_Action_Widget, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000038, "Member 'WBP_Modern_Menu_Player_Footer_C_Get_Bound_Action_Widget::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function WBP_Modern_Menu_Player_Footer.WBP_Modern_Menu_Player_Footer_C.On Input Method Changed
// 0x0040 (0x0040 - 0x0000)
struct WBP_Modern_Menu_Player_Footer_C_On_Input_Method_Changed final
{
public:
	ECommonInputType                              NewInputType;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Modern_Menu_Player_BoundAction_C*  Local_BoundAction;                                 // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Modern_Menu_Player_BoundAction_C*  CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Menu_Player_Footer_C_On_Input_Method_Changed) == 0x000008, "Wrong alignment on WBP_Modern_Menu_Player_Footer_C_On_Input_Method_Changed");
static_assert(sizeof(WBP_Modern_Menu_Player_Footer_C_On_Input_Method_Changed) == 0x000040, "Wrong size on WBP_Modern_Menu_Player_Footer_C_On_Input_Method_Changed");
static_assert(offsetof(WBP_Modern_Menu_Player_Footer_C_On_Input_Method_Changed, NewInputType) == 0x000000, "Member 'WBP_Modern_Menu_Player_Footer_C_On_Input_Method_Changed::NewInputType' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Footer_C_On_Input_Method_Changed, Local_BoundAction) == 0x000008, "Member 'WBP_Modern_Menu_Player_Footer_C_On_Input_Method_Changed::Local_BoundAction' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Footer_C_On_Input_Method_Changed, Temp_byte_Variable) == 0x000010, "Member 'WBP_Modern_Menu_Player_Footer_C_On_Input_Method_Changed::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Footer_C_On_Input_Method_Changed, Temp_byte_Variable_1) == 0x000011, "Member 'WBP_Modern_Menu_Player_Footer_C_On_Input_Method_Changed::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Footer_C_On_Input_Method_Changed, Temp_bool_Variable) == 0x000012, "Member 'WBP_Modern_Menu_Player_Footer_C_On_Input_Method_Changed::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Footer_C_On_Input_Method_Changed, Temp_byte_Variable_2) == 0x000013, "Member 'WBP_Modern_Menu_Player_Footer_C_On_Input_Method_Changed::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Footer_C_On_Input_Method_Changed, Temp_byte_Variable_3) == 0x000014, "Member 'WBP_Modern_Menu_Player_Footer_C_On_Input_Method_Changed::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Footer_C_On_Input_Method_Changed, Temp_int_Array_Index_Variable) == 0x000018, "Member 'WBP_Modern_Menu_Player_Footer_C_On_Input_Method_Changed::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Footer_C_On_Input_Method_Changed, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'WBP_Modern_Menu_Player_Footer_C_On_Input_Method_Changed::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Footer_C_On_Input_Method_Changed, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'WBP_Modern_Menu_Player_Footer_C_On_Input_Method_Changed::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Footer_C_On_Input_Method_Changed, Temp_bool_Variable_1) == 0x000024, "Member 'WBP_Modern_Menu_Player_Footer_C_On_Input_Method_Changed::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Footer_C_On_Input_Method_Changed, K2Node_Select_Default) == 0x000025, "Member 'WBP_Modern_Menu_Player_Footer_C_On_Input_Method_Changed::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Footer_C_On_Input_Method_Changed, K2Node_Select_Default_1) == 0x000026, "Member 'WBP_Modern_Menu_Player_Footer_C_On_Input_Method_Changed::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Footer_C_On_Input_Method_Changed, K2Node_SwitchEnum_CmpSuccess) == 0x000027, "Member 'WBP_Modern_Menu_Player_Footer_C_On_Input_Method_Changed::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Footer_C_On_Input_Method_Changed, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'WBP_Modern_Menu_Player_Footer_C_On_Input_Method_Changed::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Footer_C_On_Input_Method_Changed, CallFunc_Array_Get_Item) == 0x000030, "Member 'WBP_Modern_Menu_Player_Footer_C_On_Input_Method_Changed::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Footer_C_On_Input_Method_Changed, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'WBP_Modern_Menu_Player_Footer_C_On_Input_Method_Changed::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_Modern_Menu_Player_Footer.WBP_Modern_Menu_Player_Footer_C.On Toggle Input Visibility
// 0x0005 (0x0005 - 0x0000)
struct WBP_Modern_Menu_Player_Footer_C_On_Toggle_Input_Visibility final
{
public:
	bool                                          bInIsVisible;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Menu_Player_Footer_C_On_Toggle_Input_Visibility) == 0x000001, "Wrong alignment on WBP_Modern_Menu_Player_Footer_C_On_Toggle_Input_Visibility");
static_assert(sizeof(WBP_Modern_Menu_Player_Footer_C_On_Toggle_Input_Visibility) == 0x000005, "Wrong size on WBP_Modern_Menu_Player_Footer_C_On_Toggle_Input_Visibility");
static_assert(offsetof(WBP_Modern_Menu_Player_Footer_C_On_Toggle_Input_Visibility, bInIsVisible) == 0x000000, "Member 'WBP_Modern_Menu_Player_Footer_C_On_Toggle_Input_Visibility::bInIsVisible' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Footer_C_On_Toggle_Input_Visibility, Temp_bool_Variable) == 0x000001, "Member 'WBP_Modern_Menu_Player_Footer_C_On_Toggle_Input_Visibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Footer_C_On_Toggle_Input_Visibility, Temp_byte_Variable) == 0x000002, "Member 'WBP_Modern_Menu_Player_Footer_C_On_Toggle_Input_Visibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Footer_C_On_Toggle_Input_Visibility, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_Modern_Menu_Player_Footer_C_On_Toggle_Input_Visibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Footer_C_On_Toggle_Input_Visibility, K2Node_Select_Default) == 0x000004, "Member 'WBP_Modern_Menu_Player_Footer_C_On_Toggle_Input_Visibility::K2Node_Select_Default' has a wrong offset!");

// Function WBP_Modern_Menu_Player_Footer.WBP_Modern_Menu_Player_Footer_C.OnHoldInputCancel
// 0x0008 (0x0008 - 0x0000)
struct WBP_Modern_Menu_Player_Footer_C_OnHoldInputCancel final
{
public:
	class UInputAction*                           InputAction;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Menu_Player_Footer_C_OnHoldInputCancel) == 0x000008, "Wrong alignment on WBP_Modern_Menu_Player_Footer_C_OnHoldInputCancel");
static_assert(sizeof(WBP_Modern_Menu_Player_Footer_C_OnHoldInputCancel) == 0x000008, "Wrong size on WBP_Modern_Menu_Player_Footer_C_OnHoldInputCancel");
static_assert(offsetof(WBP_Modern_Menu_Player_Footer_C_OnHoldInputCancel, InputAction) == 0x000000, "Member 'WBP_Modern_Menu_Player_Footer_C_OnHoldInputCancel::InputAction' has a wrong offset!");

// Function WBP_Modern_Menu_Player_Footer.WBP_Modern_Menu_Player_Footer_C.OnHoldInputStart
// 0x0008 (0x0008 - 0x0000)
struct WBP_Modern_Menu_Player_Footer_C_OnHoldInputStart final
{
public:
	class UInputAction*                           InputAction;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Menu_Player_Footer_C_OnHoldInputStart) == 0x000008, "Wrong alignment on WBP_Modern_Menu_Player_Footer_C_OnHoldInputStart");
static_assert(sizeof(WBP_Modern_Menu_Player_Footer_C_OnHoldInputStart) == 0x000008, "Wrong size on WBP_Modern_Menu_Player_Footer_C_OnHoldInputStart");
static_assert(offsetof(WBP_Modern_Menu_Player_Footer_C_OnHoldInputStart, InputAction) == 0x000000, "Member 'WBP_Modern_Menu_Player_Footer_C_OnHoldInputStart::InputAction' has a wrong offset!");

// Function WBP_Modern_Menu_Player_Footer.WBP_Modern_Menu_Player_Footer_C.PluginCompliance
// 0x0001 (0x0001 - 0x0000)
struct WBP_Modern_Menu_Player_Footer_C_PluginCompliance final
{
public:
	bool                                          bPluginCompliance;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Menu_Player_Footer_C_PluginCompliance) == 0x000001, "Wrong alignment on WBP_Modern_Menu_Player_Footer_C_PluginCompliance");
static_assert(sizeof(WBP_Modern_Menu_Player_Footer_C_PluginCompliance) == 0x000001, "Wrong size on WBP_Modern_Menu_Player_Footer_C_PluginCompliance");
static_assert(offsetof(WBP_Modern_Menu_Player_Footer_C_PluginCompliance, bPluginCompliance) == 0x000000, "Member 'WBP_Modern_Menu_Player_Footer_C_PluginCompliance::bPluginCompliance' has a wrong offset!");

// Function WBP_Modern_Menu_Player_Footer.WBP_Modern_Menu_Player_Footer_C.UpdateInputActionDescription
// 0x0048 (0x0048 - 0x0000)
struct WBP_Modern_Menu_Player_Footer_C_UpdateInputActionDescription final
{
public:
	struct FFooterInputActionDescription          NewInputActionDescription;                         // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UWBP_Modern_Menu_Player_BoundAction_C*  CallFunc_Get_Bound_Action_Widget_Widget;           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Modern_Menu_Player_BoundAction_C*  CallFunc_Get_Bound_Action_Widget_Widget_1;         // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Modern_Menu_Player_BoundAction_C*  CallFunc_Get_Bound_Action_Widget_Widget_2;         // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Modern_Menu_Player_BoundAction_C*  CallFunc_Get_Bound_Action_Widget_Widget_3;         // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Menu_Player_Footer_C_UpdateInputActionDescription) == 0x000008, "Wrong alignment on WBP_Modern_Menu_Player_Footer_C_UpdateInputActionDescription");
static_assert(sizeof(WBP_Modern_Menu_Player_Footer_C_UpdateInputActionDescription) == 0x000048, "Wrong size on WBP_Modern_Menu_Player_Footer_C_UpdateInputActionDescription");
static_assert(offsetof(WBP_Modern_Menu_Player_Footer_C_UpdateInputActionDescription, NewInputActionDescription) == 0x000000, "Member 'WBP_Modern_Menu_Player_Footer_C_UpdateInputActionDescription::NewInputActionDescription' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Footer_C_UpdateInputActionDescription, CallFunc_Get_Bound_Action_Widget_Widget) == 0x000020, "Member 'WBP_Modern_Menu_Player_Footer_C_UpdateInputActionDescription::CallFunc_Get_Bound_Action_Widget_Widget' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Footer_C_UpdateInputActionDescription, CallFunc_Get_Bound_Action_Widget_Widget_1) == 0x000028, "Member 'WBP_Modern_Menu_Player_Footer_C_UpdateInputActionDescription::CallFunc_Get_Bound_Action_Widget_Widget_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Footer_C_UpdateInputActionDescription, CallFunc_Get_Bound_Action_Widget_Widget_2) == 0x000030, "Member 'WBP_Modern_Menu_Player_Footer_C_UpdateInputActionDescription::CallFunc_Get_Bound_Action_Widget_Widget_2' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Footer_C_UpdateInputActionDescription, CallFunc_Get_Bound_Action_Widget_Widget_3) == 0x000038, "Member 'WBP_Modern_Menu_Player_Footer_C_UpdateInputActionDescription::CallFunc_Get_Bound_Action_Widget_Widget_3' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Footer_C_UpdateInputActionDescription, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'WBP_Modern_Menu_Player_Footer_C_UpdateInputActionDescription::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_Modern_Menu_Player_Footer.WBP_Modern_Menu_Player_Footer_C.UpdateInputActionVisibility
// 0x0058 (0x0058 - 0x0000)
struct WBP_Modern_Menu_Player_Footer_C_UpdateInputActionVisibility final
{
public:
	struct FFooterInputActionVisibility           NewInputActionVisibility;                          // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	bool                                          Local_ForceHidden;                                 // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Local_IsVisible;                                   // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Modern_Menu_Player_BoundAction_C*  Local_BoundAction;                                 // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Modern_Menu_Player_BoundAction_C*  CallFunc_Get_Bound_Action_Widget_Widget;           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x003F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              Temp_byte_Variable_2;                              // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default;                             // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Menu_Player_Footer_C_UpdateInputActionVisibility) == 0x000008, "Wrong alignment on WBP_Modern_Menu_Player_Footer_C_UpdateInputActionVisibility");
static_assert(sizeof(WBP_Modern_Menu_Player_Footer_C_UpdateInputActionVisibility) == 0x000058, "Wrong size on WBP_Modern_Menu_Player_Footer_C_UpdateInputActionVisibility");
static_assert(offsetof(WBP_Modern_Menu_Player_Footer_C_UpdateInputActionVisibility, NewInputActionVisibility) == 0x000000, "Member 'WBP_Modern_Menu_Player_Footer_C_UpdateInputActionVisibility::NewInputActionVisibility' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Menu_Player_Footer_C_UpdateInputActionVisibility, Local_ForceHidden) == 0x000010, "Member 'WBP_Modern_Menu_Player_Footer_C_UpdateInputActionVisibility::Local_ForceHidden' has a wrong offset!");
