#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModernMenu_StatsPage1_Details

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Altar_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_ModernMenu_StatsPage1_Details.WBP_ModernMenu_StatsPage1_Details_C.AnimateTooltip
// 0x0028 (0x0028 - 0x0000)
struct WBP_ModernMenu_StatsPage1_Details_C_AnimateTooltip final
{
public:
	bool                                          In_Is_Visible;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Instant;                                           // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_1;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          K2Node_Select_Default;                             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimation_StartAtTime_ImplicitCast;   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_StatsPage1_Details_C_AnimateTooltip) == 0x000008, "Wrong alignment on WBP_ModernMenu_StatsPage1_Details_C_AnimateTooltip");
static_assert(sizeof(WBP_ModernMenu_StatsPage1_Details_C_AnimateTooltip) == 0x000028, "Wrong size on WBP_ModernMenu_StatsPage1_Details_C_AnimateTooltip");
static_assert(offsetof(WBP_ModernMenu_StatsPage1_Details_C_AnimateTooltip, In_Is_Visible) == 0x000000, "Member 'WBP_ModernMenu_StatsPage1_Details_C_AnimateTooltip::In_Is_Visible' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage1_Details_C_AnimateTooltip, Instant) == 0x000001, "Member 'WBP_ModernMenu_StatsPage1_Details_C_AnimateTooltip::Instant' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage1_Details_C_AnimateTooltip, Temp_bool_Variable) == 0x000002, "Member 'WBP_ModernMenu_StatsPage1_Details_C_AnimateTooltip::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage1_Details_C_AnimateTooltip, Temp_byte_Variable) == 0x000003, "Member 'WBP_ModernMenu_StatsPage1_Details_C_AnimateTooltip::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage1_Details_C_AnimateTooltip, Temp_byte_Variable_1) == 0x000004, "Member 'WBP_ModernMenu_StatsPage1_Details_C_AnimateTooltip::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage1_Details_C_AnimateTooltip, CallFunc_SelectFloat_ReturnValue) == 0x000008, "Member 'WBP_ModernMenu_StatsPage1_Details_C_AnimateTooltip::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage1_Details_C_AnimateTooltip, K2Node_Select_Default) == 0x000010, "Member 'WBP_ModernMenu_StatsPage1_Details_C_AnimateTooltip::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage1_Details_C_AnimateTooltip, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'WBP_ModernMenu_StatsPage1_Details_C_AnimateTooltip::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage1_Details_C_AnimateTooltip, CallFunc_PlayAnimation_StartAtTime_ImplicitCast) == 0x000020, "Member 'WBP_ModernMenu_StatsPage1_Details_C_AnimateTooltip::CallFunc_PlayAnimation_StartAtTime_ImplicitCast' has a wrong offset!");

// Function WBP_ModernMenu_StatsPage1_Details.WBP_ModernMenu_StatsPage1_Details_C.Set Visibility
// 0x0003 (0x0003 - 0x0000)
struct WBP_ModernMenu_StatsPage1_Details_C_Set_Visibility final
{
public:
	bool                                          InIsDisplayed;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InIsActive;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_StatsPage1_Details_C_Set_Visibility) == 0x000001, "Wrong alignment on WBP_ModernMenu_StatsPage1_Details_C_Set_Visibility");
static_assert(sizeof(WBP_ModernMenu_StatsPage1_Details_C_Set_Visibility) == 0x000003, "Wrong size on WBP_ModernMenu_StatsPage1_Details_C_Set_Visibility");
static_assert(offsetof(WBP_ModernMenu_StatsPage1_Details_C_Set_Visibility, InIsDisplayed) == 0x000000, "Member 'WBP_ModernMenu_StatsPage1_Details_C_Set_Visibility::InIsDisplayed' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage1_Details_C_Set_Visibility, InIsActive) == 0x000001, "Member 'WBP_ModernMenu_StatsPage1_Details_C_Set_Visibility::InIsActive' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage1_Details_C_Set_Visibility, CallFunc_Not_PreBool_ReturnValue) == 0x000002, "Member 'WBP_ModernMenu_StatsPage1_Details_C_Set_Visibility::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function WBP_ModernMenu_StatsPage1_Details.WBP_ModernMenu_StatsPage1_Details_C.SetContent
// 0x0200 (0x0200 - 0x0000)
struct WBP_ModernMenu_StatsPage1_Details_C_SetContent final
{
public:
	struct FLegacyStatsMenuPopupContent           Content;                                           // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_Map_Find_Value;                           // 0x0030(0x00D0)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector2D_X;                          // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            CallFunc_MakeBrushFromTexture_ReturnValue;         // 0x0120(0x00D0)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_StatsPage1_Details_C_SetContent) == 0x000010, "Wrong alignment on WBP_ModernMenu_StatsPage1_Details_C_SetContent");
static_assert(sizeof(WBP_ModernMenu_StatsPage1_Details_C_SetContent) == 0x000200, "Wrong size on WBP_ModernMenu_StatsPage1_Details_C_SetContent");
static_assert(offsetof(WBP_ModernMenu_StatsPage1_Details_C_SetContent, Content) == 0x000000, "Member 'WBP_ModernMenu_StatsPage1_Details_C_SetContent::Content' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage1_Details_C_SetContent, Temp_byte_Variable) == 0x000028, "Member 'WBP_ModernMenu_StatsPage1_Details_C_SetContent::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage1_Details_C_SetContent, Temp_byte_Variable_1) == 0x000029, "Member 'WBP_ModernMenu_StatsPage1_Details_C_SetContent::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage1_Details_C_SetContent, Temp_bool_Variable) == 0x00002A, "Member 'WBP_ModernMenu_StatsPage1_Details_C_SetContent::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage1_Details_C_SetContent, CallFunc_TextIsEmpty_ReturnValue) == 0x00002B, "Member 'WBP_ModernMenu_StatsPage1_Details_C_SetContent::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage1_Details_C_SetContent, K2Node_Select_Default) == 0x00002C, "Member 'WBP_ModernMenu_StatsPage1_Details_C_SetContent::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage1_Details_C_SetContent, CallFunc_Map_Find_Value) == 0x000030, "Member 'WBP_ModernMenu_StatsPage1_Details_C_SetContent::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage1_Details_C_SetContent, CallFunc_Map_Find_ReturnValue) == 0x000100, "Member 'WBP_ModernMenu_StatsPage1_Details_C_SetContent::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage1_Details_C_SetContent, CallFunc_BreakVector2D_X) == 0x000108, "Member 'WBP_ModernMenu_StatsPage1_Details_C_SetContent::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage1_Details_C_SetContent, CallFunc_BreakVector2D_Y) == 0x000110, "Member 'WBP_ModernMenu_StatsPage1_Details_C_SetContent::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage1_Details_C_SetContent, CallFunc_FTrunc_ReturnValue) == 0x000118, "Member 'WBP_ModernMenu_StatsPage1_Details_C_SetContent::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage1_Details_C_SetContent, CallFunc_FTrunc_ReturnValue_1) == 0x00011C, "Member 'WBP_ModernMenu_StatsPage1_Details_C_SetContent::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage1_Details_C_SetContent, CallFunc_MakeBrushFromTexture_ReturnValue) == 0x000120, "Member 'WBP_ModernMenu_StatsPage1_Details_C_SetContent::CallFunc_MakeBrushFromTexture_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage1_Details_C_SetContent, CallFunc_IsValid_ReturnValue) == 0x0001F0, "Member 'WBP_ModernMenu_StatsPage1_Details_C_SetContent::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_ModernMenu_StatsPage1_Details.WBP_ModernMenu_StatsPage1_Details_C.SetModernContent
// 0x0028 (0x0028 - 0x0000)
struct WBP_ModernMenu_StatsPage1_Details_C_SetModernContent final
{
public:
	ELegacyStatsMenuPage1Items                    ItemType;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   TitleText;                                         // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          LevelUpOverlayIsVisible;                           // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_StatsPage1_Details_C_SetModernContent) == 0x000008, "Wrong alignment on WBP_ModernMenu_StatsPage1_Details_C_SetModernContent");
static_assert(sizeof(WBP_ModernMenu_StatsPage1_Details_C_SetModernContent) == 0x000028, "Wrong size on WBP_ModernMenu_StatsPage1_Details_C_SetModernContent");
static_assert(offsetof(WBP_ModernMenu_StatsPage1_Details_C_SetModernContent, ItemType) == 0x000000, "Member 'WBP_ModernMenu_StatsPage1_Details_C_SetModernContent::ItemType' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage1_Details_C_SetModernContent, TitleText) == 0x000008, "Member 'WBP_ModernMenu_StatsPage1_Details_C_SetModernContent::TitleText' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage1_Details_C_SetModernContent, LevelUpOverlayIsVisible) == 0x000020, "Member 'WBP_ModernMenu_StatsPage1_Details_C_SetModernContent::LevelUpOverlayIsVisible' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage1_Details_C_SetModernContent, Temp_bool_Variable) == 0x000021, "Member 'WBP_ModernMenu_StatsPage1_Details_C_SetModernContent::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage1_Details_C_SetModernContent, Temp_byte_Variable) == 0x000022, "Member 'WBP_ModernMenu_StatsPage1_Details_C_SetModernContent::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage1_Details_C_SetModernContent, Temp_byte_Variable_1) == 0x000023, "Member 'WBP_ModernMenu_StatsPage1_Details_C_SetModernContent::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage1_Details_C_SetModernContent, K2Node_Select_Default) == 0x000024, "Member 'WBP_ModernMenu_StatsPage1_Details_C_SetModernContent::K2Node_Select_Default' has a wrong offset!");

// Function WBP_ModernMenu_StatsPage1_Details.WBP_ModernMenu_StatsPage1_Details_C.UpdateActiveEffectsIcon
// 0x0010 (0x0010 - 0x0000)
struct WBP_ModernMenu_StatsPage1_Details_C_UpdateActiveEffectsIcon final
{
public:
	TArray<class UTexture2D*>                     EffectsIcon;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_ModernMenu_StatsPage1_Details_C_UpdateActiveEffectsIcon) == 0x000008, "Wrong alignment on WBP_ModernMenu_StatsPage1_Details_C_UpdateActiveEffectsIcon");
static_assert(sizeof(WBP_ModernMenu_StatsPage1_Details_C_UpdateActiveEffectsIcon) == 0x000010, "Wrong size on WBP_ModernMenu_StatsPage1_Details_C_UpdateActiveEffectsIcon");
static_assert(offsetof(WBP_ModernMenu_StatsPage1_Details_C_UpdateActiveEffectsIcon, EffectsIcon) == 0x000000, "Member 'WBP_ModernMenu_StatsPage1_Details_C_UpdateActiveEffectsIcon::EffectsIcon' has a wrong offset!");

// Function WBP_ModernMenu_StatsPage1_Details.WBP_ModernMenu_StatsPage1_Details_C.UpdateActiveEffectsTimeLeft
// 0x0010 (0x0010 - 0x0000)
struct WBP_ModernMenu_StatsPage1_Details_C_UpdateActiveEffectsTimeLeft final
{
public:
	TArray<double>                                EffectsTimeLeft;                                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_ModernMenu_StatsPage1_Details_C_UpdateActiveEffectsTimeLeft) == 0x000008, "Wrong alignment on WBP_ModernMenu_StatsPage1_Details_C_UpdateActiveEffectsTimeLeft");
static_assert(sizeof(WBP_ModernMenu_StatsPage1_Details_C_UpdateActiveEffectsTimeLeft) == 0x000010, "Wrong size on WBP_ModernMenu_StatsPage1_Details_C_UpdateActiveEffectsTimeLeft");
static_assert(offsetof(WBP_ModernMenu_StatsPage1_Details_C_UpdateActiveEffectsTimeLeft, EffectsTimeLeft) == 0x000000, "Member 'WBP_ModernMenu_StatsPage1_Details_C_UpdateActiveEffectsTimeLeft::EffectsTimeLeft' has a wrong offset!");

}

