#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Modern_Settings_KeyboardRebindWidget

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Altar_structs.hpp"
#include "Altar_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Modern_Settings_KeyboardRebindWidget.WBP_Modern_Settings_KeyboardRebindWidget_C
// 0x0100 (0x0730 - 0x0630)
class UWBP_Modern_Settings_KeyboardRebindWidget_C final : public UVModernKeyboardRebindWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0630(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_OriginalImageTile_C*               FocusBackground;                                   // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModernPrefab_ControllerInputHint_C* HintKey;                                          // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AltarTextBlock_C*                  RebindLabel;                                       // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVNavigableInputKeySelector*            Last_Focussed_Widget;                              // 0x0650(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(int32 Index)>   OnChangeNavigationIndex;                           // 0x0658(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(bool NewState, class UVNavigableInputKeySelector* Widget)> OnListenStateChanged; // 0x0668(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FLinearColor                           FocusColor;                                        // 0x0678(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           UnfocusColor;                                      // 0x0688(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FModernRebindSettingTableRow           RebindSettings;                                    // 0x0698(0x0098)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void BindToRebindSubsystem();
	void ChangeErrorState(bool bErrorState);
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WBP_Modern_Settings_KeyboardRebindWidget(int32 EntryPoint);
	void OnFocus();
	void OnUnfocus();
	void PreConstruct(bool IsDesignTime);
	void UnbindToRebindSubsystem();
	void UpdateTexts(const class FText& NewText);

	class UWidget* BP_GetDesiredFocusTarget() const;
	void GetCurrentWidgetToFocus(class UVNavigableInputKeySelector** Widget) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Modern_Settings_KeyboardRebindWidget_C">();
	}
	static class UWBP_Modern_Settings_KeyboardRebindWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Modern_Settings_KeyboardRebindWidget_C>();
	}
};
static_assert(alignof(UWBP_Modern_Settings_KeyboardRebindWidget_C) == 0x000008, "Wrong alignment on UWBP_Modern_Settings_KeyboardRebindWidget_C");
static_assert(sizeof(UWBP_Modern_Settings_KeyboardRebindWidget_C) == 0x000730, "Wrong size on UWBP_Modern_Settings_KeyboardRebindWidget_C");
static_assert(offsetof(UWBP_Modern_Settings_KeyboardRebindWidget_C, UberGraphFrame) == 0x000630, "Member 'UWBP_Modern_Settings_KeyboardRebindWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_KeyboardRebindWidget_C, FocusBackground) == 0x000638, "Member 'UWBP_Modern_Settings_KeyboardRebindWidget_C::FocusBackground' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_KeyboardRebindWidget_C, HintKey) == 0x000640, "Member 'UWBP_Modern_Settings_KeyboardRebindWidget_C::HintKey' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_KeyboardRebindWidget_C, RebindLabel) == 0x000648, "Member 'UWBP_Modern_Settings_KeyboardRebindWidget_C::RebindLabel' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_KeyboardRebindWidget_C, Last_Focussed_Widget) == 0x000650, "Member 'UWBP_Modern_Settings_KeyboardRebindWidget_C::Last_Focussed_Widget' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_KeyboardRebindWidget_C, OnChangeNavigationIndex) == 0x000658, "Member 'UWBP_Modern_Settings_KeyboardRebindWidget_C::OnChangeNavigationIndex' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_KeyboardRebindWidget_C, OnListenStateChanged) == 0x000668, "Member 'UWBP_Modern_Settings_KeyboardRebindWidget_C::OnListenStateChanged' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_KeyboardRebindWidget_C, FocusColor) == 0x000678, "Member 'UWBP_Modern_Settings_KeyboardRebindWidget_C::FocusColor' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_KeyboardRebindWidget_C, UnfocusColor) == 0x000688, "Member 'UWBP_Modern_Settings_KeyboardRebindWidget_C::UnfocusColor' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_KeyboardRebindWidget_C, RebindSettings) == 0x000698, "Member 'UWBP_Modern_Settings_KeyboardRebindWidget_C::RebindSettings' has a wrong offset!");

}

