#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LegacyPrefab_ValueSwitcher

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_LegacyPrefab_ValueSwitcher.WBP_LegacyPrefab_ValueSwitcher_C.ExecuteUbergraph_WBP_LegacyPrefab_ValueSwitcher
// 0x0038 (0x0038 - 0x0000)
struct WBP_LegacyPrefab_ValueSwitcher_C_ExecuteUbergraph_WBP_LegacyPrefab_ValueSwitcher final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSelectedIndex_ReturnValue;             // 0x0004(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetSelectedValue_ReturnValue;             // 0x0008(0x0018)(ConstParm)
	class FText                                   CallFunc_GetSelectedValue_ReturnValue_1;           // 0x0020(0x0018)(ConstParm)
};
static_assert(alignof(WBP_LegacyPrefab_ValueSwitcher_C_ExecuteUbergraph_WBP_LegacyPrefab_ValueSwitcher) == 0x000008, "Wrong alignment on WBP_LegacyPrefab_ValueSwitcher_C_ExecuteUbergraph_WBP_LegacyPrefab_ValueSwitcher");
static_assert(sizeof(WBP_LegacyPrefab_ValueSwitcher_C_ExecuteUbergraph_WBP_LegacyPrefab_ValueSwitcher) == 0x000038, "Wrong size on WBP_LegacyPrefab_ValueSwitcher_C_ExecuteUbergraph_WBP_LegacyPrefab_ValueSwitcher");
static_assert(offsetof(WBP_LegacyPrefab_ValueSwitcher_C_ExecuteUbergraph_WBP_LegacyPrefab_ValueSwitcher, EntryPoint) == 0x000000, "Member 'WBP_LegacyPrefab_ValueSwitcher_C_ExecuteUbergraph_WBP_LegacyPrefab_ValueSwitcher::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_LegacyPrefab_ValueSwitcher_C_ExecuteUbergraph_WBP_LegacyPrefab_ValueSwitcher, CallFunc_GetSelectedIndex_ReturnValue) == 0x000004, "Member 'WBP_LegacyPrefab_ValueSwitcher_C_ExecuteUbergraph_WBP_LegacyPrefab_ValueSwitcher::CallFunc_GetSelectedIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LegacyPrefab_ValueSwitcher_C_ExecuteUbergraph_WBP_LegacyPrefab_ValueSwitcher, CallFunc_GetSelectedValue_ReturnValue) == 0x000008, "Member 'WBP_LegacyPrefab_ValueSwitcher_C_ExecuteUbergraph_WBP_LegacyPrefab_ValueSwitcher::CallFunc_GetSelectedValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LegacyPrefab_ValueSwitcher_C_ExecuteUbergraph_WBP_LegacyPrefab_ValueSwitcher, CallFunc_GetSelectedValue_ReturnValue_1) == 0x000020, "Member 'WBP_LegacyPrefab_ValueSwitcher_C_ExecuteUbergraph_WBP_LegacyPrefab_ValueSwitcher::CallFunc_GetSelectedValue_ReturnValue_1' has a wrong offset!");

// Function WBP_LegacyPrefab_ValueSwitcher.WBP_LegacyPrefab_ValueSwitcher_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct WBP_LegacyPrefab_ValueSwitcher_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LegacyPrefab_ValueSwitcher_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_LegacyPrefab_ValueSwitcher_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_LegacyPrefab_ValueSwitcher_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong size on WBP_LegacyPrefab_ValueSwitcher_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_LegacyPrefab_ValueSwitcher_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_LegacyPrefab_ValueSwitcher_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");

}

