#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LegacyMenu_DialogButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonInput_structs.hpp"
#include "Altar_structs.hpp"
#include "WBP_ModernPrefab_NavigableButton_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_LegacyMenu_DialogButton.WBP_LegacyMenu_DialogButton_C
// 0x0050 (0x1710 - 0x16C0)
class UWBP_LegacyMenu_DialogButton_C final : public UWBP_ModernPrefab_NavigableButton_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_LegacyMenu_DialogButton_C;      // 0x16C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_OriginalImageTile_C*               dialog_button_image;                               // 0x16C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AltarTextBlock_C*                  dialog_tootip_name;                                // 0x16D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               tooltip_sizebox;                                   // 0x16D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	ELegacyDialogButton                           ButtonType;                                        // 0x16E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16E1[0x7];                                     // 0x16E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             ButtonTexture;                                     // 0x16E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             FocusedButtonTexture;                              // 0x16F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             ControllerButtonTexture;                           // 0x16F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             FocussedControllerButtonTexture;                   // 0x1700(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Is_Focused;                                        // 0x1708(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_LegacyMenu_DialogButton(int32 EntryPoint);
	void OnFocus();
	void OnInputMethodChanged_Event(ECommonInputType bNewInputType);
	void OnUnfocus();
	void SetButtonIcon(bool IsFocused_0);
	void SetControllerTexture();
	void SetIconBrush(class UTexture2D* Texture);
	void SetKeyboardTexture();
	void UpdateGoodbyeButtonTexture(ECommonInputType InputType);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_LegacyMenu_DialogButton_C">();
	}
	static class UWBP_LegacyMenu_DialogButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_LegacyMenu_DialogButton_C>();
	}
};
static_assert(alignof(UWBP_LegacyMenu_DialogButton_C) == 0x000010, "Wrong alignment on UWBP_LegacyMenu_DialogButton_C");
static_assert(sizeof(UWBP_LegacyMenu_DialogButton_C) == 0x001710, "Wrong size on UWBP_LegacyMenu_DialogButton_C");
static_assert(offsetof(UWBP_LegacyMenu_DialogButton_C, UberGraphFrame_WBP_LegacyMenu_DialogButton_C) == 0x0016C0, "Member 'UWBP_LegacyMenu_DialogButton_C::UberGraphFrame_WBP_LegacyMenu_DialogButton_C' has a wrong offset!");
static_assert(offsetof(UWBP_LegacyMenu_DialogButton_C, dialog_button_image) == 0x0016C8, "Member 'UWBP_LegacyMenu_DialogButton_C::dialog_button_image' has a wrong offset!");
static_assert(offsetof(UWBP_LegacyMenu_DialogButton_C, dialog_tootip_name) == 0x0016D0, "Member 'UWBP_LegacyMenu_DialogButton_C::dialog_tootip_name' has a wrong offset!");
static_assert(offsetof(UWBP_LegacyMenu_DialogButton_C, tooltip_sizebox) == 0x0016D8, "Member 'UWBP_LegacyMenu_DialogButton_C::tooltip_sizebox' has a wrong offset!");
static_assert(offsetof(UWBP_LegacyMenu_DialogButton_C, ButtonType) == 0x0016E0, "Member 'UWBP_LegacyMenu_DialogButton_C::ButtonType' has a wrong offset!");
static_assert(offsetof(UWBP_LegacyMenu_DialogButton_C, ButtonTexture) == 0x0016E8, "Member 'UWBP_LegacyMenu_DialogButton_C::ButtonTexture' has a wrong offset!");
static_assert(offsetof(UWBP_LegacyMenu_DialogButton_C, FocusedButtonTexture) == 0x0016F0, "Member 'UWBP_LegacyMenu_DialogButton_C::FocusedButtonTexture' has a wrong offset!");
static_assert(offsetof(UWBP_LegacyMenu_DialogButton_C, ControllerButtonTexture) == 0x0016F8, "Member 'UWBP_LegacyMenu_DialogButton_C::ControllerButtonTexture' has a wrong offset!");
static_assert(offsetof(UWBP_LegacyMenu_DialogButton_C, FocussedControllerButtonTexture) == 0x001700, "Member 'UWBP_LegacyMenu_DialogButton_C::FocussedControllerButtonTexture' has a wrong offset!");
static_assert(offsetof(UWBP_LegacyMenu_DialogButton_C, Is_Focused) == 0x001708, "Member 'UWBP_LegacyMenu_DialogButton_C::Is_Focused' has a wrong offset!");

}

