#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_QuickCommandsMenu_FilteredBox

#include "Basic.hpp"

#include "BPS_SimpleArray_String_structs.hpp"
#include "SlateCore_structs.hpp"
#include "BPS_FormDetails_structs.hpp"


namespace SDK::Params
{

// Function WBP_QuickCommandsMenu_FilteredBox.WBP_QuickCommandsMenu_FilteredBox_C.SearchFor X(Filter) PatternInFilters
// 0x00D8 (0x00D8 - 0x0000)
struct WBP_QuickCommandsMenu_FilteredBox_C_SearchFor_X_Filter__PatternInFilters final
{
public:
	class FString                                 X;                                                 // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 X_Filter_;                                         // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Filter;                                            // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Prefix;                                            // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Full;                                              // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 FilterToUse;                                       // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Len_ReturnValue;                          // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Replace_ReturnValue;                      // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_FindSubstring_ReturnValue;                // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_LeftChop_ReturnValue;                     // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_LeftChop_ReturnValue_1;                   // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_FindSubstring_ReturnValue_1;              // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_RightChop_ReturnValue;                    // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_QuickCommandsMenu_FilteredBox_C_SearchFor_X_Filter__PatternInFilters) == 0x000008, "Wrong alignment on WBP_QuickCommandsMenu_FilteredBox_C_SearchFor_X_Filter__PatternInFilters");
static_assert(sizeof(WBP_QuickCommandsMenu_FilteredBox_C_SearchFor_X_Filter__PatternInFilters) == 0x0000D8, "Wrong size on WBP_QuickCommandsMenu_FilteredBox_C_SearchFor_X_Filter__PatternInFilters");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_SearchFor_X_Filter__PatternInFilters, X) == 0x000000, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_SearchFor_X_Filter__PatternInFilters::X' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_SearchFor_X_Filter__PatternInFilters, X_Filter_) == 0x000010, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_SearchFor_X_Filter__PatternInFilters::X_Filter_' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_SearchFor_X_Filter__PatternInFilters, Filter) == 0x000020, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_SearchFor_X_Filter__PatternInFilters::Filter' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_SearchFor_X_Filter__PatternInFilters, Prefix) == 0x000030, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_SearchFor_X_Filter__PatternInFilters::Prefix' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_SearchFor_X_Filter__PatternInFilters, Full) == 0x000040, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_SearchFor_X_Filter__PatternInFilters::Full' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_SearchFor_X_Filter__PatternInFilters, FilterToUse) == 0x000050, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_SearchFor_X_Filter__PatternInFilters::FilterToUse' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_SearchFor_X_Filter__PatternInFilters, CallFunc_Concat_StrStr_ReturnValue) == 0x000060, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_SearchFor_X_Filter__PatternInFilters::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_SearchFor_X_Filter__PatternInFilters, CallFunc_Len_ReturnValue) == 0x000070, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_SearchFor_X_Filter__PatternInFilters::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_SearchFor_X_Filter__PatternInFilters, CallFunc_Replace_ReturnValue) == 0x000078, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_SearchFor_X_Filter__PatternInFilters::CallFunc_Replace_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_SearchFor_X_Filter__PatternInFilters, CallFunc_FindSubstring_ReturnValue) == 0x000088, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_SearchFor_X_Filter__PatternInFilters::CallFunc_FindSubstring_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_SearchFor_X_Filter__PatternInFilters, CallFunc_Add_IntInt_ReturnValue) == 0x00008C, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_SearchFor_X_Filter__PatternInFilters::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_SearchFor_X_Filter__PatternInFilters, CallFunc_Greater_IntInt_ReturnValue) == 0x000090, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_SearchFor_X_Filter__PatternInFilters::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_SearchFor_X_Filter__PatternInFilters, CallFunc_Subtract_IntInt_ReturnValue) == 0x000094, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_SearchFor_X_Filter__PatternInFilters::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_SearchFor_X_Filter__PatternInFilters, CallFunc_LeftChop_ReturnValue) == 0x000098, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_SearchFor_X_Filter__PatternInFilters::CallFunc_LeftChop_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_SearchFor_X_Filter__PatternInFilters, CallFunc_LeftChop_ReturnValue_1) == 0x0000A8, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_SearchFor_X_Filter__PatternInFilters::CallFunc_LeftChop_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_SearchFor_X_Filter__PatternInFilters, CallFunc_FindSubstring_ReturnValue_1) == 0x0000B8, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_SearchFor_X_Filter__PatternInFilters::CallFunc_FindSubstring_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_SearchFor_X_Filter__PatternInFilters, CallFunc_RightChop_ReturnValue) == 0x0000C0, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_SearchFor_X_Filter__PatternInFilters::CallFunc_RightChop_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_SearchFor_X_Filter__PatternInFilters, CallFunc_Greater_IntInt_ReturnValue_1) == 0x0000D0, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_SearchFor_X_Filter__PatternInFilters::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_SearchFor_X_Filter__PatternInFilters, CallFunc_BooleanAND_ReturnValue) == 0x0000D1, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_SearchFor_X_Filter__PatternInFilters::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_QuickCommandsMenu_FilteredBox.WBP_QuickCommandsMenu_FilteredBox_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_QuickCommandsMenu_FilteredBox_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_QuickCommandsMenu_FilteredBox_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_QuickCommandsMenu_FilteredBox_C_PreConstruct");
static_assert(sizeof(WBP_QuickCommandsMenu_FilteredBox_C_PreConstruct) == 0x000001, "Wrong size on WBP_QuickCommandsMenu_FilteredBox_C_PreConstruct");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_QuickCommandsMenu_FilteredBox.WBP_QuickCommandsMenu_FilteredBox_C.Filter AND Process
// 0x0080 (0x0080 - 0x0000)
struct WBP_QuickCommandsMenu_FilteredBox_C_Filter_AND_Process final
{
public:
	class FString                                 ElementToFilter;                                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         FiltersInput;                                      // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          Found;                                             // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LastIndexLoopedOn;                                 // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FoundMissMatch;                                    // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_RightChop_ReturnValue;                    // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_LeftChop_ReturnValue;                     // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_StartsWith_ReturnValue;                   // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EndsWith_ReturnValue;                     // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x2];                                       // 0x0072(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EndsWith_ReturnValue_1;                   // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StartsWith_ReturnValue_1;                 // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x007E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_QuickCommandsMenu_FilteredBox_C_Filter_AND_Process) == 0x000008, "Wrong alignment on WBP_QuickCommandsMenu_FilteredBox_C_Filter_AND_Process");
static_assert(sizeof(WBP_QuickCommandsMenu_FilteredBox_C_Filter_AND_Process) == 0x000080, "Wrong size on WBP_QuickCommandsMenu_FilteredBox_C_Filter_AND_Process");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_Filter_AND_Process, ElementToFilter) == 0x000000, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_Filter_AND_Process::ElementToFilter' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_Filter_AND_Process, FiltersInput) == 0x000010, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_Filter_AND_Process::FiltersInput' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_Filter_AND_Process, Found) == 0x000020, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_Filter_AND_Process::Found' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_Filter_AND_Process, LastIndexLoopedOn) == 0x000024, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_Filter_AND_Process::LastIndexLoopedOn' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_Filter_AND_Process, FoundMissMatch) == 0x000028, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_Filter_AND_Process::FoundMissMatch' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_Filter_AND_Process, Temp_int_Loop_Counter_Variable) == 0x00002C, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_Filter_AND_Process::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_Filter_AND_Process, Temp_int_Array_Index_Variable) == 0x000030, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_Filter_AND_Process::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_Filter_AND_Process, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_Filter_AND_Process::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_Filter_AND_Process, CallFunc_Array_Get_Item) == 0x000038, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_Filter_AND_Process::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_Filter_AND_Process, CallFunc_Not_PreBool_ReturnValue) == 0x000048, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_Filter_AND_Process::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_Filter_AND_Process, CallFunc_RightChop_ReturnValue) == 0x000050, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_Filter_AND_Process::CallFunc_RightChop_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_Filter_AND_Process, CallFunc_LeftChop_ReturnValue) == 0x000060, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_Filter_AND_Process::CallFunc_LeftChop_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_Filter_AND_Process, CallFunc_StartsWith_ReturnValue) == 0x000070, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_Filter_AND_Process::CallFunc_StartsWith_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_Filter_AND_Process, CallFunc_EndsWith_ReturnValue) == 0x000071, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_Filter_AND_Process::CallFunc_EndsWith_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_Filter_AND_Process, CallFunc_Array_Length_ReturnValue) == 0x000074, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_Filter_AND_Process::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_Filter_AND_Process, CallFunc_Less_IntInt_ReturnValue) == 0x000078, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_Filter_AND_Process::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_Filter_AND_Process, CallFunc_Contains_ReturnValue) == 0x000079, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_Filter_AND_Process::CallFunc_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_Filter_AND_Process, CallFunc_EndsWith_ReturnValue_1) == 0x00007A, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_Filter_AND_Process::CallFunc_EndsWith_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_Filter_AND_Process, Temp_bool_True_if_break_was_hit_Variable) == 0x00007B, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_Filter_AND_Process::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_Filter_AND_Process, CallFunc_StartsWith_ReturnValue_1) == 0x00007C, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_Filter_AND_Process::CallFunc_StartsWith_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_Filter_AND_Process, CallFunc_Not_PreBool_ReturnValue_1) == 0x00007D, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_Filter_AND_Process::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_Filter_AND_Process, CallFunc_BooleanAND_ReturnValue) == 0x00007E, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_Filter_AND_Process::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_QuickCommandsMenu_FilteredBox.WBP_QuickCommandsMenu_FilteredBox_C.ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox
// 0x0338 (0x0338 - 0x0000)
struct WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable_1;        // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_5;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_6;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_5;                  // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_7;                   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x0070(0x0018)(ConstParm)
	ETextCommit                                   K2Node_ComponentBoundEvent_CommitMethod;           // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item;                           // 0x008C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x00BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BE[0x2];                                       // 0x00BE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_6;                  // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             CallFunc_Array_Get_Item_1;                         // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x00D0(0x0010)(ReferenceParm)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item_2;                         // 0x00E4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBPS_FormDetails                       CallFunc_GetDataTableRowFromName_OutRow;           // 0x00F0(0x0020)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CallFunc_ParseIntoArray_ReturnValue;               // 0x0120(0x0010)(ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBPS_SimpleArray_String                K2Node_MakeStruct_BPS_SimpleArray_String;          // 0x0138(0x0010)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_3;                         // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x015D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15E[0x2];                                      // 0x015E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBPS_SimpleArray_String                CallFunc_Map_Find_Value;                           // 0x0160(0x0010)(HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_1;          // 0x0178(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_MakeLiteralString_ReturnValue;            // 0x0188(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0198(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Replace_ReturnValue;                      // 0x01A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_ParseIntoArray_ReturnValue_1;             // 0x01B8(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Array_Get_Item_4;                         // 0x01C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item_5;                         // 0x01E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CallFunc_ParseIntoArray_ReturnValue_2;             // 0x0200(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_7;                  // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_5;                // 0x0219(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21A[0x2];                                      // 0x021A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_7;                 // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue_1;            // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_224[0x4];                                      // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x0228(0x0010)(ReferenceParm)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           K2Node_Select_Default;                             // 0x0240(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item_6;                         // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_6;               // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25C[0x4];                                      // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_2;          // 0x0260(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_6;                // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item_7;                         // 0x0278(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Filter_AND_Process_Found;                 // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_289[0x3];                                      // 0x0289(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_7;               // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_7;                // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_291[0x7];                                      // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_3;          // 0x0298(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         K2Node_MakeArray_Array_1;                          // 0x02A8(0x0010)(ReferenceParm)
	struct FBPS_SimpleArray_String                CallFunc_Map_Find_Value_1;                         // 0x02B8(0x0010)(HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue_1;                    // 0x02C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x02CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CB[0x5];                                      // 0x02CB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_SearchFor_X_Filter__PatternInFilters_X_Filter_; // 0x02D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_SearchFor_X_Filter__PatternInFilters_Filter; // 0x02E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_SearchFor_X_Filter__PatternInFilters_X_Filter__1; // 0x02F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_SearchFor_X_Filter__PatternInFilters_Filter_1; // 0x0300(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Replace_ReturnValue_1;                    // 0x0310(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Replace_ReturnValue_2;                    // 0x0320(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0331(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox) == 0x000008, "Wrong alignment on WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox");
static_assert(sizeof(WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox) == 0x000338, "Wrong size on WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox, EntryPoint) == 0x000000, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox, Temp_int_Array_Index_Variable_1) == 0x000008, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox, Temp_bool_True_if_break_was_hit_Variable) == 0x000014, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox, CallFunc_Not_PreBool_ReturnValue) == 0x000015, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox, Temp_int_Array_Index_Variable_2) == 0x000018, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox, CallFunc_Percent_IntInt_ReturnValue) == 0x00001C, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000020, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox, Temp_int_Loop_Counter_Variable_1) == 0x000024, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox, CallFunc_Add_IntInt_ReturnValue_1) == 0x000028, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox, Temp_int_Array_Index_Variable_3) == 0x00002C, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox, Temp_int_Loop_Counter_Variable_2) == 0x000030, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox, CallFunc_Add_IntInt_ReturnValue_2) == 0x000034, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox, Temp_int_Array_Index_Variable_4) == 0x000038, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox::Temp_int_Array_Index_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox, Temp_int_Loop_Counter_Variable_3) == 0x00003C, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox, CallFunc_Add_IntInt_ReturnValue_3) == 0x000040, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox, Temp_int_Loop_Counter_Variable_4) == 0x000044, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox::Temp_int_Loop_Counter_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox, CallFunc_Add_IntInt_ReturnValue_4) == 0x000048, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox, Temp_bool_True_if_break_was_hit_Variable_1) == 0x00004C, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox::Temp_bool_True_if_break_was_hit_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox, Temp_int_Array_Index_Variable_5) == 0x000050, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox::Temp_int_Array_Index_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox, CallFunc_Not_PreBool_ReturnValue_1) == 0x000054, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox, Temp_int_Array_Index_Variable_6) == 0x000058, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox::Temp_int_Array_Index_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox, Temp_int_Loop_Counter_Variable_5) == 0x00005C, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox::Temp_int_Loop_Counter_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox, CallFunc_Add_IntInt_ReturnValue_5) == 0x000060, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox::CallFunc_Add_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox, Temp_int_Array_Index_Variable_7) == 0x000064, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox::Temp_int_Array_Index_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox, Temp_bool_Variable) == 0x000068, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox, K2Node_Event_IsDesignTime) == 0x000069, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox, K2Node_ComponentBoundEvent_Text) == 0x000070, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox::K2Node_ComponentBoundEvent_Text' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox, K2Node_ComponentBoundEvent_CommitMethod) == 0x000088, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox::K2Node_ComponentBoundEvent_CommitMethod' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox, CallFunc_Array_Get_Item) == 0x00008C, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox, CallFunc_Conv_TextToString_ReturnValue) == 0x000098, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox, CallFunc_Conv_NameToString_ReturnValue) == 0x0000A8, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox, CallFunc_Array_Length_ReturnValue) == 0x0000B8, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox, CallFunc_IsEmpty_ReturnValue) == 0x0000BC, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox, CallFunc_Not_PreBool_ReturnValue_2) == 0x0000BD, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox, Temp_int_Loop_Counter_Variable_6) == 0x0000C0, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox::Temp_int_Loop_Counter_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox, CallFunc_Array_Get_Item_1) == 0x0000C8, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox, CallFunc_GetDataTableRowNames_OutRowNames) == 0x0000D0, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox, CallFunc_Less_IntInt_ReturnValue) == 0x0000E0, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox, CallFunc_Array_Get_Item_2) == 0x0000E4, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox, CallFunc_GetDataTableRowFromName_OutRow) == 0x0000F0, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000110, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox, CallFunc_Array_Length_ReturnValue_1) == 0x000114, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox, CallFunc_Less_IntInt_ReturnValue_1) == 0x000118, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox, CallFunc_ParseIntoArray_ReturnValue) == 0x000120, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox::CallFunc_ParseIntoArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox, CallFunc_Add_IntInt_ReturnValue_6) == 0x000130, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox::CallFunc_Add_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox, K2Node_MakeStruct_BPS_SimpleArray_String) == 0x000138, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox::K2Node_MakeStruct_BPS_SimpleArray_String' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox, CallFunc_Array_Length_ReturnValue_2) == 0x000148, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox, CallFunc_Array_Add_ReturnValue) == 0x00014C, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox, CallFunc_Array_Get_Item_3) == 0x000150, "Member 'WBP_QuickCommandsMenu_FilteredBox_C_ExecuteUbergraph_WBP_QuickCommandsMenu_FilteredBox::CallFunc_Array_Get_Item_3' has a wrong offset!");
