#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModernPrefab_NavigableButton

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_ModernPrefab_NavigableButton.WBP_ModernPrefab_NavigableButton_C.ApplyCustomButtonColor
// 0x0010 (0x0010 - 0x0000)
struct WBP_ModernPrefab_NavigableButton_C_ApplyCustomButtonColor final
{
public:
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue;      // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernPrefab_NavigableButton_C_ApplyCustomButtonColor) == 0x000004, "Wrong alignment on WBP_ModernPrefab_NavigableButton_C_ApplyCustomButtonColor");
static_assert(sizeof(WBP_ModernPrefab_NavigableButton_C_ApplyCustomButtonColor) == 0x000010, "Wrong size on WBP_ModernPrefab_NavigableButton_C_ApplyCustomButtonColor");
static_assert(offsetof(WBP_ModernPrefab_NavigableButton_C_ApplyCustomButtonColor, CallFunc_Conv_ColorToLinearColor_ReturnValue) == 0x000000, "Member 'WBP_ModernPrefab_NavigableButton_C_ApplyCustomButtonColor::CallFunc_Conv_ColorToLinearColor_ReturnValue' has a wrong offset!");

// Function WBP_ModernPrefab_NavigableButton.WBP_ModernPrefab_NavigableButton_C.ExecuteUbergraph_WBP_ModernPrefab_NavigableButton
// 0x0048 (0x0048 - 0x0000)
struct WBP_ModernPrefab_NavigableButton_C_ExecuteUbergraph_WBP_ModernPrefab_NavigableButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Value_1;                              // 0x0006(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_Value;                                // 0x0008(0x0018)(ConstParm)
	bool                                          CallFunc_GetIsControllerActive_ReturnValue;        // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetHasControllerSpecificBehavior_ReturnValue; // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetButtonText_ReturnValue;                // 0x0028(0x0018)()
	bool                                          CallFunc_GetShouldApplyFocusEffectOnHover_ReturnValue; // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetShouldApplyFocusEffectOnHover_ReturnValue_1; // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetHasControllerSpecificBehavior_ReturnValue_1; // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernPrefab_NavigableButton_C_ExecuteUbergraph_WBP_ModernPrefab_NavigableButton) == 0x000008, "Wrong alignment on WBP_ModernPrefab_NavigableButton_C_ExecuteUbergraph_WBP_ModernPrefab_NavigableButton");
static_assert(sizeof(WBP_ModernPrefab_NavigableButton_C_ExecuteUbergraph_WBP_ModernPrefab_NavigableButton) == 0x000048, "Wrong size on WBP_ModernPrefab_NavigableButton_C_ExecuteUbergraph_WBP_ModernPrefab_NavigableButton");
static_assert(offsetof(WBP_ModernPrefab_NavigableButton_C_ExecuteUbergraph_WBP_ModernPrefab_NavigableButton, EntryPoint) == 0x000000, "Member 'WBP_ModernPrefab_NavigableButton_C_ExecuteUbergraph_WBP_ModernPrefab_NavigableButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ModernPrefab_NavigableButton_C_ExecuteUbergraph_WBP_ModernPrefab_NavigableButton, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'WBP_ModernPrefab_NavigableButton_C_ExecuteUbergraph_WBP_ModernPrefab_NavigableButton::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernPrefab_NavigableButton_C_ExecuteUbergraph_WBP_ModernPrefab_NavigableButton, CallFunc_IsValid_ReturnValue_1) == 0x000005, "Member 'WBP_ModernPrefab_NavigableButton_C_ExecuteUbergraph_WBP_ModernPrefab_NavigableButton::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernPrefab_NavigableButton_C_ExecuteUbergraph_WBP_ModernPrefab_NavigableButton, K2Node_Event_Value_1) == 0x000006, "Member 'WBP_ModernPrefab_NavigableButton_C_ExecuteUbergraph_WBP_ModernPrefab_NavigableButton::K2Node_Event_Value_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernPrefab_NavigableButton_C_ExecuteUbergraph_WBP_ModernPrefab_NavigableButton, K2Node_Event_Value) == 0x000008, "Member 'WBP_ModernPrefab_NavigableButton_C_ExecuteUbergraph_WBP_ModernPrefab_NavigableButton::K2Node_Event_Value' has a wrong offset!");
static_assert(offsetof(WBP_ModernPrefab_NavigableButton_C_ExecuteUbergraph_WBP_ModernPrefab_NavigableButton, CallFunc_GetIsControllerActive_ReturnValue) == 0x000020, "Member 'WBP_ModernPrefab_NavigableButton_C_ExecuteUbergraph_WBP_ModernPrefab_NavigableButton::CallFunc_GetIsControllerActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernPrefab_NavigableButton_C_ExecuteUbergraph_WBP_ModernPrefab_NavigableButton, CallFunc_GetHasControllerSpecificBehavior_ReturnValue) == 0x000021, "Member 'WBP_ModernPrefab_NavigableButton_C_ExecuteUbergraph_WBP_ModernPrefab_NavigableButton::CallFunc_GetHasControllerSpecificBehavior_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernPrefab_NavigableButton_C_ExecuteUbergraph_WBP_ModernPrefab_NavigableButton, CallFunc_GetButtonText_ReturnValue) == 0x000028, "Member 'WBP_ModernPrefab_NavigableButton_C_ExecuteUbergraph_WBP_ModernPrefab_NavigableButton::CallFunc_GetButtonText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernPrefab_NavigableButton_C_ExecuteUbergraph_WBP_ModernPrefab_NavigableButton, CallFunc_GetShouldApplyFocusEffectOnHover_ReturnValue) == 0x000040, "Member 'WBP_ModernPrefab_NavigableButton_C_ExecuteUbergraph_WBP_ModernPrefab_NavigableButton::CallFunc_GetShouldApplyFocusEffectOnHover_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernPrefab_NavigableButton_C_ExecuteUbergraph_WBP_ModernPrefab_NavigableButton, CallFunc_GetShouldApplyFocusEffectOnHover_ReturnValue_1) == 0x000041, "Member 'WBP_ModernPrefab_NavigableButton_C_ExecuteUbergraph_WBP_ModernPrefab_NavigableButton::CallFunc_GetShouldApplyFocusEffectOnHover_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernPrefab_NavigableButton_C_ExecuteUbergraph_WBP_ModernPrefab_NavigableButton, CallFunc_GetHasControllerSpecificBehavior_ReturnValue_1) == 0x000042, "Member 'WBP_ModernPrefab_NavigableButton_C_ExecuteUbergraph_WBP_ModernPrefab_NavigableButton::CallFunc_GetHasControllerSpecificBehavior_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernPrefab_NavigableButton_C_ExecuteUbergraph_WBP_ModernPrefab_NavigableButton, CallFunc_Not_PreBool_ReturnValue) == 0x000043, "Member 'WBP_ModernPrefab_NavigableButton_C_ExecuteUbergraph_WBP_ModernPrefab_NavigableButton::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function WBP_ModernPrefab_NavigableButton.WBP_ModernPrefab_NavigableButton_C.InitButtonAttributes
// 0x0028 (0x0028 - 0x0000)
struct WBP_ModernPrefab_NavigableButton_C_InitButtonAttributes final
{
public:
	class UTextBlock*                             TextWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                BackgroundPanelWidget;                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                FocusPanelWidget;                                  // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                UnfocusPanelWidget;                                // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_ModernPrefab_ControllerInputHint_C* ControllerIconWidget;                             // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernPrefab_NavigableButton_C_InitButtonAttributes) == 0x000008, "Wrong alignment on WBP_ModernPrefab_NavigableButton_C_InitButtonAttributes");
static_assert(sizeof(WBP_ModernPrefab_NavigableButton_C_InitButtonAttributes) == 0x000028, "Wrong size on WBP_ModernPrefab_NavigableButton_C_InitButtonAttributes");
static_assert(offsetof(WBP_ModernPrefab_NavigableButton_C_InitButtonAttributes, TextWidget) == 0x000000, "Member 'WBP_ModernPrefab_NavigableButton_C_InitButtonAttributes::TextWidget' has a wrong offset!");
static_assert(offsetof(WBP_ModernPrefab_NavigableButton_C_InitButtonAttributes, BackgroundPanelWidget) == 0x000008, "Member 'WBP_ModernPrefab_NavigableButton_C_InitButtonAttributes::BackgroundPanelWidget' has a wrong offset!");
static_assert(offsetof(WBP_ModernPrefab_NavigableButton_C_InitButtonAttributes, FocusPanelWidget) == 0x000010, "Member 'WBP_ModernPrefab_NavigableButton_C_InitButtonAttributes::FocusPanelWidget' has a wrong offset!");
static_assert(offsetof(WBP_ModernPrefab_NavigableButton_C_InitButtonAttributes, UnfocusPanelWidget) == 0x000018, "Member 'WBP_ModernPrefab_NavigableButton_C_InitButtonAttributes::UnfocusPanelWidget' has a wrong offset!");
static_assert(offsetof(WBP_ModernPrefab_NavigableButton_C_InitButtonAttributes, ControllerIconWidget) == 0x000020, "Member 'WBP_ModernPrefab_NavigableButton_C_InitButtonAttributes::ControllerIconWidget' has a wrong offset!");

// Function WBP_ModernPrefab_NavigableButton.WBP_ModernPrefab_NavigableButton_C.OnButtonTextUpdated
// 0x0018 (0x0018 - 0x0000)
struct WBP_ModernPrefab_NavigableButton_C_OnButtonTextUpdated final
{
public:
	class FText                                   Value;                                             // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_ModernPrefab_NavigableButton_C_OnButtonTextUpdated) == 0x000008, "Wrong alignment on WBP_ModernPrefab_NavigableButton_C_OnButtonTextUpdated");
static_assert(sizeof(WBP_ModernPrefab_NavigableButton_C_OnButtonTextUpdated) == 0x000018, "Wrong size on WBP_ModernPrefab_NavigableButton_C_OnButtonTextUpdated");
static_assert(offsetof(WBP_ModernPrefab_NavigableButton_C_OnButtonTextUpdated, Value) == 0x000000, "Member 'WBP_ModernPrefab_NavigableButton_C_OnButtonTextUpdated::Value' has a wrong offset!");

// Function WBP_ModernPrefab_NavigableButton.WBP_ModernPrefab_NavigableButton_C.OnControllerActiveUpdated
// 0x0001 (0x0001 - 0x0000)
struct WBP_ModernPrefab_NavigableButton_C_OnControllerActiveUpdated final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernPrefab_NavigableButton_C_OnControllerActiveUpdated) == 0x000001, "Wrong alignment on WBP_ModernPrefab_NavigableButton_C_OnControllerActiveUpdated");
static_assert(sizeof(WBP_ModernPrefab_NavigableButton_C_OnControllerActiveUpdated) == 0x000001, "Wrong size on WBP_ModernPrefab_NavigableButton_C_OnControllerActiveUpdated");
static_assert(offsetof(WBP_ModernPrefab_NavigableButton_C_OnControllerActiveUpdated, Value) == 0x000000, "Member 'WBP_ModernPrefab_NavigableButton_C_OnControllerActiveUpdated::Value' has a wrong offset!");

// Function WBP_ModernPrefab_NavigableButton.WBP_ModernPrefab_NavigableButton_C.OnControllerActiveUpdatedEffect
// 0x000D (0x000D - 0x0000)
struct WBP_ModernPrefab_NavigableButton_C_OnControllerActiveUpdatedEffect final
{
public:
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsControllerActive_ReturnValue;        // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsControllerActive_ReturnValue_1;      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsControllerActive_ReturnValue_2;      // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernPrefab_NavigableButton_C_OnControllerActiveUpdatedEffect) == 0x000001, "Wrong alignment on WBP_ModernPrefab_NavigableButton_C_OnControllerActiveUpdatedEffect");
static_assert(sizeof(WBP_ModernPrefab_NavigableButton_C_OnControllerActiveUpdatedEffect) == 0x00000D, "Wrong size on WBP_ModernPrefab_NavigableButton_C_OnControllerActiveUpdatedEffect");
static_assert(offsetof(WBP_ModernPrefab_NavigableButton_C_OnControllerActiveUpdatedEffect, Temp_byte_Variable) == 0x000000, "Member 'WBP_ModernPrefab_NavigableButton_C_OnControllerActiveUpdatedEffect::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernPrefab_NavigableButton_C_OnControllerActiveUpdatedEffect, Temp_byte_Variable_1) == 0x000001, "Member 'WBP_ModernPrefab_NavigableButton_C_OnControllerActiveUpdatedEffect::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernPrefab_NavigableButton_C_OnControllerActiveUpdatedEffect, Temp_bool_Variable) == 0x000002, "Member 'WBP_ModernPrefab_NavigableButton_C_OnControllerActiveUpdatedEffect::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernPrefab_NavigableButton_C_OnControllerActiveUpdatedEffect, Temp_byte_Variable_2) == 0x000003, "Member 'WBP_ModernPrefab_NavigableButton_C_OnControllerActiveUpdatedEffect::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ModernPrefab_NavigableButton_C_OnControllerActiveUpdatedEffect, Temp_byte_Variable_3) == 0x000004, "Member 'WBP_ModernPrefab_NavigableButton_C_OnControllerActiveUpdatedEffect::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_ModernPrefab_NavigableButton_C_OnControllerActiveUpdatedEffect, CallFunc_GetIsControllerActive_ReturnValue) == 0x000005, "Member 'WBP_ModernPrefab_NavigableButton_C_OnControllerActiveUpdatedEffect::CallFunc_GetIsControllerActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernPrefab_NavigableButton_C_OnControllerActiveUpdatedEffect, Temp_bool_Variable_1) == 0x000006, "Member 'WBP_ModernPrefab_NavigableButton_C_OnControllerActiveUpdatedEffect::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernPrefab_NavigableButton_C_OnControllerActiveUpdatedEffect, CallFunc_IsValid_ReturnValue) == 0x000007, "Member 'WBP_ModernPrefab_NavigableButton_C_OnControllerActiveUpdatedEffect::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernPrefab_NavigableButton_C_OnControllerActiveUpdatedEffect, K2Node_Select_Default) == 0x000008, "Member 'WBP_ModernPrefab_NavigableButton_C_OnControllerActiveUpdatedEffect::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_ModernPrefab_NavigableButton_C_OnControllerActiveUpdatedEffect, CallFunc_GetIsControllerActive_ReturnValue_1) == 0x000009, "Member 'WBP_ModernPrefab_NavigableButton_C_OnControllerActiveUpdatedEffect::CallFunc_GetIsControllerActive_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernPrefab_NavigableButton_C_OnControllerActiveUpdatedEffect, K2Node_Select_Default_1) == 0x00000A, "Member 'WBP_ModernPrefab_NavigableButton_C_OnControllerActiveUpdatedEffect::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernPrefab_NavigableButton_C_OnControllerActiveUpdatedEffect, CallFunc_GetIsControllerActive_ReturnValue_2) == 0x00000B, "Member 'WBP_ModernPrefab_NavigableButton_C_OnControllerActiveUpdatedEffect::CallFunc_GetIsControllerActive_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ModernPrefab_NavigableButton_C_OnControllerActiveUpdatedEffect, CallFunc_IsValid_ReturnValue_1) == 0x00000C, "Member 'WBP_ModernPrefab_NavigableButton_C_OnControllerActiveUpdatedEffect::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function WBP_ModernPrefab_NavigableButton.WBP_ModernPrefab_NavigableButton_C.OnFocusEffect
// 0x0002 (0x0002 - 0x0000)
struct WBP_ModernPrefab_NavigableButton_C_OnFocusEffect final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernPrefab_NavigableButton_C_OnFocusEffect) == 0x000001, "Wrong alignment on WBP_ModernPrefab_NavigableButton_C_OnFocusEffect");
static_assert(sizeof(WBP_ModernPrefab_NavigableButton_C_OnFocusEffect) == 0x000002, "Wrong size on WBP_ModernPrefab_NavigableButton_C_OnFocusEffect");
static_assert(offsetof(WBP_ModernPrefab_NavigableButton_C_OnFocusEffect, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'WBP_ModernPrefab_NavigableButton_C_OnFocusEffect::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernPrefab_NavigableButton_C_OnFocusEffect, CallFunc_IsValid_ReturnValue_1) == 0x000001, "Member 'WBP_ModernPrefab_NavigableButton_C_OnFocusEffect::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function WBP_ModernPrefab_NavigableButton.WBP_ModernPrefab_NavigableButton_C.OnUnfocusEffect
// 0x0002 (0x0002 - 0x0000)
struct WBP_ModernPrefab_NavigableButton_C_OnUnfocusEffect final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernPrefab_NavigableButton_C_OnUnfocusEffect) == 0x000001, "Wrong alignment on WBP_ModernPrefab_NavigableButton_C_OnUnfocusEffect");
static_assert(sizeof(WBP_ModernPrefab_NavigableButton_C_OnUnfocusEffect) == 0x000002, "Wrong size on WBP_ModernPrefab_NavigableButton_C_OnUnfocusEffect");
static_assert(offsetof(WBP_ModernPrefab_NavigableButton_C_OnUnfocusEffect, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'WBP_ModernPrefab_NavigableButton_C_OnUnfocusEffect::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernPrefab_NavigableButton_C_OnUnfocusEffect, CallFunc_IsValid_ReturnValue_1) == 0x000001, "Member 'WBP_ModernPrefab_NavigableButton_C_OnUnfocusEffect::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function WBP_ModernPrefab_NavigableButton.WBP_ModernPrefab_NavigableButton_C.UpdateControllerSpecificFocus
// 0x0030 (0x0030 - 0x0000)
struct WBP_ModernPrefab_NavigableButton_C_UpdateControllerSpecificFocus final
{
public:
	class UVAltarMenu*                            Local_ParentMenu;                                  // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVUINavigationGlobalSubsystem*          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVUINavigationGlobalSubsystem*          CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IVEnhancedInputNavigable> CallFunc_NavigateToWidget_Widget_CastInput;     // 0x0018(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsControllerActive_ReturnValue;        // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsFocused_ReturnValue;                 // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernPrefab_NavigableButton_C_UpdateControllerSpecificFocus) == 0x000008, "Wrong alignment on WBP_ModernPrefab_NavigableButton_C_UpdateControllerSpecificFocus");
static_assert(sizeof(WBP_ModernPrefab_NavigableButton_C_UpdateControllerSpecificFocus) == 0x000030, "Wrong size on WBP_ModernPrefab_NavigableButton_C_UpdateControllerSpecificFocus");
static_assert(offsetof(WBP_ModernPrefab_NavigableButton_C_UpdateControllerSpecificFocus, Local_ParentMenu) == 0x000000, "Member 'WBP_ModernPrefab_NavigableButton_C_UpdateControllerSpecificFocus::Local_ParentMenu' has a wrong offset!");
static_assert(offsetof(WBP_ModernPrefab_NavigableButton_C_UpdateControllerSpecificFocus, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'WBP_ModernPrefab_NavigableButton_C_UpdateControllerSpecificFocus::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernPrefab_NavigableButton_C_UpdateControllerSpecificFocus, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000010, "Member 'WBP_ModernPrefab_NavigableButton_C_UpdateControllerSpecificFocus::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernPrefab_NavigableButton_C_UpdateControllerSpecificFocus, CallFunc_NavigateToWidget_Widget_CastInput) == 0x000018, "Member 'WBP_ModernPrefab_NavigableButton_C_UpdateControllerSpecificFocus::CallFunc_NavigateToWidget_Widget_CastInput' has a wrong offset!");
static_assert(offsetof(WBP_ModernPrefab_NavigableButton_C_UpdateControllerSpecificFocus, CallFunc_GetIsControllerActive_ReturnValue) == 0x000028, "Member 'WBP_ModernPrefab_NavigableButton_C_UpdateControllerSpecificFocus::CallFunc_GetIsControllerActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernPrefab_NavigableButton_C_UpdateControllerSpecificFocus, CallFunc_GetIsFocused_ReturnValue) == 0x000029, "Member 'WBP_ModernPrefab_NavigableButton_C_UpdateControllerSpecificFocus::CallFunc_GetIsFocused_ReturnValue' has a wrong offset!");

}

