#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModernHud_Subtitle

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_ModernHud_Subtitle.WBP_ModernHud_Subtitle_C.ShowHide
// 0x0018 (0x0018 - 0x0000)
struct WBP_ModernHud_Subtitle_C_ShowHide final
{
public:
	bool                                          InVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default;                             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_Subtitle_C_ShowHide) == 0x000008, "Wrong alignment on WBP_ModernHud_Subtitle_C_ShowHide");
static_assert(sizeof(WBP_ModernHud_Subtitle_C_ShowHide) == 0x000018, "Wrong size on WBP_ModernHud_Subtitle_C_ShowHide");
static_assert(offsetof(WBP_ModernHud_Subtitle_C_ShowHide, InVisibility) == 0x000000, "Member 'WBP_ModernHud_Subtitle_C_ShowHide::InVisibility' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Subtitle_C_ShowHide, Temp_bool_Variable) == 0x000001, "Member 'WBP_ModernHud_Subtitle_C_ShowHide::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Subtitle_C_ShowHide, K2Node_Select_Default) == 0x000008, "Member 'WBP_ModernHud_Subtitle_C_ShowHide::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Subtitle_C_ShowHide, CallFunc_PlayAnimation_ReturnValue) == 0x000010, "Member 'WBP_ModernHud_Subtitle_C_ShowHide::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_ModernHud_Subtitle.WBP_ModernHud_Subtitle_C.Update Subtitle Visibility
// 0x0010 (0x0010 - 0x0000)
struct WBP_ModernHud_Subtitle_C_Update_Subtitle_Visibility final
{
public:
	bool                                          InVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          K2Node_Select_Default;                             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_Subtitle_C_Update_Subtitle_Visibility) == 0x000008, "Wrong alignment on WBP_ModernHud_Subtitle_C_Update_Subtitle_Visibility");
static_assert(sizeof(WBP_ModernHud_Subtitle_C_Update_Subtitle_Visibility) == 0x000010, "Wrong size on WBP_ModernHud_Subtitle_C_Update_Subtitle_Visibility");
static_assert(offsetof(WBP_ModernHud_Subtitle_C_Update_Subtitle_Visibility, InVisibility) == 0x000000, "Member 'WBP_ModernHud_Subtitle_C_Update_Subtitle_Visibility::InVisibility' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Subtitle_C_Update_Subtitle_Visibility, Temp_bool_Variable) == 0x000001, "Member 'WBP_ModernHud_Subtitle_C_Update_Subtitle_Visibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Subtitle_C_Update_Subtitle_Visibility, Temp_byte_Variable) == 0x000002, "Member 'WBP_ModernHud_Subtitle_C_Update_Subtitle_Visibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Subtitle_C_Update_Subtitle_Visibility, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_ModernHud_Subtitle_C_Update_Subtitle_Visibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Subtitle_C_Update_Subtitle_Visibility, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000004, "Member 'WBP_ModernHud_Subtitle_C_Update_Subtitle_Visibility::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Subtitle_C_Update_Subtitle_Visibility, K2Node_Select_Default) == 0x000005, "Member 'WBP_ModernHud_Subtitle_C_Update_Subtitle_Visibility::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Subtitle_C_Update_Subtitle_Visibility, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_ModernHud_Subtitle_C_Update_Subtitle_Visibility::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_ModernHud_Subtitle.WBP_ModernHud_Subtitle_C.UpdateSubtitle
// 0x0018 (0x0018 - 0x0000)
struct WBP_ModernHud_Subtitle_C_UpdateSubtitle final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_ModernHud_Subtitle_C_UpdateSubtitle) == 0x000008, "Wrong alignment on WBP_ModernHud_Subtitle_C_UpdateSubtitle");
static_assert(sizeof(WBP_ModernHud_Subtitle_C_UpdateSubtitle) == 0x000018, "Wrong size on WBP_ModernHud_Subtitle_C_UpdateSubtitle");
static_assert(offsetof(WBP_ModernHud_Subtitle_C_UpdateSubtitle, InText) == 0x000000, "Member 'WBP_ModernHud_Subtitle_C_UpdateSubtitle::InText' has a wrong offset!");

// Function WBP_ModernHud_Subtitle.WBP_ModernHud_Subtitle_C.GetNewSubtitlePosition
// 0x0070 (0x0070 - 0x0000)
struct WBP_ModernHud_Subtitle_C_GetNewSubtitlePosition final
{
public:
	double                                        TopOfInfoMenu;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetDesiredSize_ReturnValue;               // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_1;                        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_1;                        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue;                         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_Subtitle_C_GetNewSubtitlePosition) == 0x000008, "Wrong alignment on WBP_ModernHud_Subtitle_C_GetNewSubtitlePosition");
static_assert(sizeof(WBP_ModernHud_Subtitle_C_GetNewSubtitlePosition) == 0x000070, "Wrong size on WBP_ModernHud_Subtitle_C_GetNewSubtitlePosition");
static_assert(offsetof(WBP_ModernHud_Subtitle_C_GetNewSubtitlePosition, TopOfInfoMenu) == 0x000000, "Member 'WBP_ModernHud_Subtitle_C_GetNewSubtitlePosition::TopOfInfoMenu' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Subtitle_C_GetNewSubtitlePosition, ReturnValue) == 0x000008, "Member 'WBP_ModernHud_Subtitle_C_GetNewSubtitlePosition::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Subtitle_C_GetNewSubtitlePosition, CallFunc_GetDesiredSize_ReturnValue) == 0x000018, "Member 'WBP_ModernHud_Subtitle_C_GetNewSubtitlePosition::CallFunc_GetDesiredSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Subtitle_C_GetNewSubtitlePosition, CallFunc_BreakVector2D_X) == 0x000028, "Member 'WBP_ModernHud_Subtitle_C_GetNewSubtitlePosition::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Subtitle_C_GetNewSubtitlePosition, CallFunc_BreakVector2D_Y) == 0x000030, "Member 'WBP_ModernHud_Subtitle_C_GetNewSubtitlePosition::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Subtitle_C_GetNewSubtitlePosition, CallFunc_BreakVector2D_X_1) == 0x000038, "Member 'WBP_ModernHud_Subtitle_C_GetNewSubtitlePosition::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Subtitle_C_GetNewSubtitlePosition, CallFunc_BreakVector2D_Y_1) == 0x000040, "Member 'WBP_ModernHud_Subtitle_C_GetNewSubtitlePosition::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Subtitle_C_GetNewSubtitlePosition, CallFunc_FMax_ReturnValue) == 0x000048, "Member 'WBP_ModernHud_Subtitle_C_GetNewSubtitlePosition::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Subtitle_C_GetNewSubtitlePosition, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000050, "Member 'WBP_ModernHud_Subtitle_C_GetNewSubtitlePosition::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Subtitle_C_GetNewSubtitlePosition, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000058, "Member 'WBP_ModernHud_Subtitle_C_GetNewSubtitlePosition::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Subtitle_C_GetNewSubtitlePosition, CallFunc_MakeVector2D_ReturnValue) == 0x000060, "Member 'WBP_ModernHud_Subtitle_C_GetNewSubtitlePosition::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");

}

