#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModernMenu_StatsPrimaryAttribute

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonInput_structs.hpp"
#include "Altar_structs.hpp"
#include "Altar_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ModernMenu_StatsPrimaryAttribute.WBP_ModernMenu_StatsPrimaryAttribute_C
// 0x00B0 (0x0578 - 0x04C8)
class UWBP_ModernMenu_StatsPrimaryAttribute_C final : public UVLegacyStatsMenuItemPage
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_ModernHud_StatusBar_C*             stat_primaryattr_bar;                              // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModernPrefab_Focusbox_C*           stat_primaryattr_focus;                            // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AltarTextBlock_C*                  stat_primaryattr_label;                            // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AltarTextBlock_C*                  stat_primaryattr_value;                            // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Label;                                             // 0x04F0(0x0018)(Edit, BlueprintVisible)
	struct FLegacyStatsMenuPrimaryAttributeValues Value;                                             // 0x0508(0x000C)(Edit, BlueprintVisible, NoDestructor)
	struct FLinearColor                           UnmodifiedColour;                                  // 0x0514(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           NegativelyModifiedColour;                          // 0x0524(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           PositivelyModifiedColour;                          // 0x0534(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_544[0x4];                                      // 0x0544(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              FocusDispatcher;                                   // 0x0548(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              UnfocusDispatcher;                                 // 0x0558(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UMaterialInterface*                     StatusBarProgressMaterial;                         // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsMouseKeyboardActive;                             // 0x0570(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnHovered();
	void Construct();
	void ExecuteUbergraph_WBP_ModernMenu_StatsPrimaryAttribute(int32 EntryPoint);
	void OnFocus();
	void OnInputMethodChanged(ECommonInputType bNewInputType);
	void OnSynchronizeProperties();
	void OnUnfocus();
	void PreConstruct(bool IsDesignTime);
	void SetLabel(const class FText& Text);
	void SetPrimaryAttribute(class UTextBlock* Text, class UWBP_ModernHud_StatusBar_C* fillbar, const struct FLegacyStatsMenuPrimaryAttributeValues& Attribute);
	void SetValue(const struct FLegacyStatsMenuPrimaryAttributeValues& NewValue);

	class UWidget* BP_GetDesiredFocusTarget() const;
	void GetColourFromModifier(double Modifier, struct FLinearColor* Return) const;
	void PrimaryAttributeToText(const struct FLegacyStatsMenuPrimaryAttributeValues& Attribute, class FText* Return_Value) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ModernMenu_StatsPrimaryAttribute_C">();
	}
	static class UWBP_ModernMenu_StatsPrimaryAttribute_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ModernMenu_StatsPrimaryAttribute_C>();
	}
};
static_assert(alignof(UWBP_ModernMenu_StatsPrimaryAttribute_C) == 0x000008, "Wrong alignment on UWBP_ModernMenu_StatsPrimaryAttribute_C");
static_assert(sizeof(UWBP_ModernMenu_StatsPrimaryAttribute_C) == 0x000578, "Wrong size on UWBP_ModernMenu_StatsPrimaryAttribute_C");
static_assert(offsetof(UWBP_ModernMenu_StatsPrimaryAttribute_C, UberGraphFrame) == 0x0004C8, "Member 'UWBP_ModernMenu_StatsPrimaryAttribute_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsPrimaryAttribute_C, stat_primaryattr_bar) == 0x0004D0, "Member 'UWBP_ModernMenu_StatsPrimaryAttribute_C::stat_primaryattr_bar' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsPrimaryAttribute_C, stat_primaryattr_focus) == 0x0004D8, "Member 'UWBP_ModernMenu_StatsPrimaryAttribute_C::stat_primaryattr_focus' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsPrimaryAttribute_C, stat_primaryattr_label) == 0x0004E0, "Member 'UWBP_ModernMenu_StatsPrimaryAttribute_C::stat_primaryattr_label' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsPrimaryAttribute_C, stat_primaryattr_value) == 0x0004E8, "Member 'UWBP_ModernMenu_StatsPrimaryAttribute_C::stat_primaryattr_value' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsPrimaryAttribute_C, Label) == 0x0004F0, "Member 'UWBP_ModernMenu_StatsPrimaryAttribute_C::Label' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsPrimaryAttribute_C, Value) == 0x000508, "Member 'UWBP_ModernMenu_StatsPrimaryAttribute_C::Value' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsPrimaryAttribute_C, UnmodifiedColour) == 0x000514, "Member 'UWBP_ModernMenu_StatsPrimaryAttribute_C::UnmodifiedColour' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsPrimaryAttribute_C, NegativelyModifiedColour) == 0x000524, "Member 'UWBP_ModernMenu_StatsPrimaryAttribute_C::NegativelyModifiedColour' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsPrimaryAttribute_C, PositivelyModifiedColour) == 0x000534, "Member 'UWBP_ModernMenu_StatsPrimaryAttribute_C::PositivelyModifiedColour' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsPrimaryAttribute_C, FocusDispatcher) == 0x000548, "Member 'UWBP_ModernMenu_StatsPrimaryAttribute_C::FocusDispatcher' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsPrimaryAttribute_C, UnfocusDispatcher) == 0x000558, "Member 'UWBP_ModernMenu_StatsPrimaryAttribute_C::UnfocusDispatcher' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsPrimaryAttribute_C, StatusBarProgressMaterial) == 0x000568, "Member 'UWBP_ModernMenu_StatsPrimaryAttribute_C::StatusBarProgressMaterial' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsPrimaryAttribute_C, IsMouseKeyboardActive) == 0x000570, "Member 'UWBP_ModernMenu_StatsPrimaryAttribute_C::IsMouseKeyboardActive' has a wrong offset!");

}

