#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModernMenu_Magic_Filters

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "Altar_structs.hpp"
#include "Altar_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ModernMenu_Magic_Filters.WBP_ModernMenu_Magic_Filters_C
// 0x0038 (0x05A0 - 0x0568)
class UWBP_ModernMenu_Magic_Filters_C final : public UVModernMagicFilter
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0568(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         Filter_InputHint_HorizontalBox;                    // 0x0570(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnExitFilter;                                      // 0x0578(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UWBP_ModernMenu_Magic_FilterIcon_C*     CurrentActiveFilter;                               // 0x0588(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<ELegacyMagicMenuSortType>              CurrentEnabled_Filters;                            // 0x0590(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	bool BP_OnHandleBackAction();
	void Construct();
	void ExecuteUbergraph_WBP_ModernMenu_Magic_Filters(int32 EntryPoint);
	void Initialize_Filter_Icon(class UCommonUserWidget* Icon, const struct FModernMagicFilterTableRow& Design);
	void OnFilterIconCreated(class UCommonUserWidget* NewFilter, const struct FModernMagicFilterTableRow& FilterDesign);
	void OnFocus();
	void RequestUpdateFilterWidget(class UCommonUserWidget* Filter, bool bIsDisplayed, bool bIsEnable);
	void SortIsReversedUpdated(bool bIsReversed);
	void UpdateFilter(TArray<ELegacyMagicMenuSortType>& EnabledFilters);
	void UpdateFilterIcon(class UCommonUserWidget* Icon, bool InIsDisplayed, bool InIsEnabled);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ModernMenu_Magic_Filters_C">();
	}
	static class UWBP_ModernMenu_Magic_Filters_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ModernMenu_Magic_Filters_C>();
	}
};
static_assert(alignof(UWBP_ModernMenu_Magic_Filters_C) == 0x000008, "Wrong alignment on UWBP_ModernMenu_Magic_Filters_C");
static_assert(sizeof(UWBP_ModernMenu_Magic_Filters_C) == 0x0005A0, "Wrong size on UWBP_ModernMenu_Magic_Filters_C");
static_assert(offsetof(UWBP_ModernMenu_Magic_Filters_C, UberGraphFrame) == 0x000568, "Member 'UWBP_ModernMenu_Magic_Filters_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_Magic_Filters_C, Filter_InputHint_HorizontalBox) == 0x000570, "Member 'UWBP_ModernMenu_Magic_Filters_C::Filter_InputHint_HorizontalBox' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_Magic_Filters_C, OnExitFilter) == 0x000578, "Member 'UWBP_ModernMenu_Magic_Filters_C::OnExitFilter' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_Magic_Filters_C, CurrentActiveFilter) == 0x000588, "Member 'UWBP_ModernMenu_Magic_Filters_C::CurrentActiveFilter' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_Magic_Filters_C, CurrentEnabled_Filters) == 0x000590, "Member 'UWBP_ModernMenu_Magic_Filters_C::CurrentEnabled_Filters' has a wrong offset!");

}

