#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_QuickCommandsMenu_View

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_QuickCommandsMenu_View.WBP_QuickCommandsMenu_View_C
// 0x0018 (0x02D8 - 0x02C0)
class UWBP_QuickCommandsMenu_View_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_QuickCommandsMenu_C*               WBP_CheatCommandsMenu;                             // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          CachedShowMouseCursor;                             // 0x02D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_QuickCommandsMenu_View(int32 EntryPoint);
	void RemoveCursorAndMode();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_QuickCommandsMenu_View_C">();
	}
	static class UWBP_QuickCommandsMenu_View_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_QuickCommandsMenu_View_C>();
	}
};
static_assert(alignof(UWBP_QuickCommandsMenu_View_C) == 0x000008, "Wrong alignment on UWBP_QuickCommandsMenu_View_C");
static_assert(sizeof(UWBP_QuickCommandsMenu_View_C) == 0x0002D8, "Wrong size on UWBP_QuickCommandsMenu_View_C");
static_assert(offsetof(UWBP_QuickCommandsMenu_View_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_QuickCommandsMenu_View_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_QuickCommandsMenu_View_C, WBP_CheatCommandsMenu) == 0x0002C8, "Member 'UWBP_QuickCommandsMenu_View_C::WBP_CheatCommandsMenu' has a wrong offset!");
static_assert(offsetof(UWBP_QuickCommandsMenu_View_C, CachedShowMouseCursor) == 0x0002D0, "Member 'UWBP_QuickCommandsMenu_View_C::CachedShowMouseCursor' has a wrong offset!");

}

