#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModernHud_PrimaryLayout

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "Altar_structs.hpp"
#include "Altar_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ModernHud_PrimaryLayout.WBP_ModernHud_PrimaryLayout_C
// 0x0060 (0x0548 - 0x04E8)
class UWBP_ModernHud_PrimaryLayout_C final : public UVModernHudPrimaryLayout
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeIn;                                            // 0x04F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UOverlay*                               Root;                                              // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Modern_Hud_Vignette_C*             WBP_Modern_Hud_Vignette;                           // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModernHud_Info_C*                  WBP_ModernHud_Info;                                // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModernHud_Main_C*                  WBP_ModernHud_Main;                                // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModernHud_Reticle_C*               WBP_ModernHud_Reticle;                             // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModernHud_Subtitle_C*              WBP_ModernHud_Subtitle;                            // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModernMenu_QuickKeys_C*            WBP_ModernMenu_QuickKeys;                          // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModernPrefab_NotificationInHUD_C*  WBP_ModernPrefab_NotificationInHUD;                // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModernTopStats_C*                  WBP_ModernTopStats;                                // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsQuickwheelOpen;                                  // 0x0540(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_ModernHud_PrimaryLayout_WBP_ModernMenu_QuickKeys_K2Node_ComponentBoundEvent_0_OnCloseAnimationEnd__DelegateSignature();
	void BP_OnActivated();
	void ExecuteUbergraph_WBP_ModernHud_PrimaryLayout(int32 EntryPoint);
	void InitializeHUD();
	void OnHUDGlobalVisibilityChanged(bool bVisible);
	void OnHUDVisibilityChanged(EHUDVisibility Flag, bool bVisible);
	void UpdateHUDGlobalVisibility(bool bInVisible);
	void UpdateHUDVisibility(EHUDVisibility& Flag, bool& NewVisibility);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ModernHud_PrimaryLayout_C">();
	}
	static class UWBP_ModernHud_PrimaryLayout_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ModernHud_PrimaryLayout_C>();
	}
};
static_assert(alignof(UWBP_ModernHud_PrimaryLayout_C) == 0x000008, "Wrong alignment on UWBP_ModernHud_PrimaryLayout_C");
static_assert(sizeof(UWBP_ModernHud_PrimaryLayout_C) == 0x000548, "Wrong size on UWBP_ModernHud_PrimaryLayout_C");
static_assert(offsetof(UWBP_ModernHud_PrimaryLayout_C, UberGraphFrame) == 0x0004E8, "Member 'UWBP_ModernHud_PrimaryLayout_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_PrimaryLayout_C, FadeIn) == 0x0004F0, "Member 'UWBP_ModernHud_PrimaryLayout_C::FadeIn' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_PrimaryLayout_C, Root) == 0x0004F8, "Member 'UWBP_ModernHud_PrimaryLayout_C::Root' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_PrimaryLayout_C, WBP_Modern_Hud_Vignette) == 0x000500, "Member 'UWBP_ModernHud_PrimaryLayout_C::WBP_Modern_Hud_Vignette' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_PrimaryLayout_C, WBP_ModernHud_Info) == 0x000508, "Member 'UWBP_ModernHud_PrimaryLayout_C::WBP_ModernHud_Info' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_PrimaryLayout_C, WBP_ModernHud_Main) == 0x000510, "Member 'UWBP_ModernHud_PrimaryLayout_C::WBP_ModernHud_Main' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_PrimaryLayout_C, WBP_ModernHud_Reticle) == 0x000518, "Member 'UWBP_ModernHud_PrimaryLayout_C::WBP_ModernHud_Reticle' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_PrimaryLayout_C, WBP_ModernHud_Subtitle) == 0x000520, "Member 'UWBP_ModernHud_PrimaryLayout_C::WBP_ModernHud_Subtitle' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_PrimaryLayout_C, WBP_ModernMenu_QuickKeys) == 0x000528, "Member 'UWBP_ModernHud_PrimaryLayout_C::WBP_ModernMenu_QuickKeys' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_PrimaryLayout_C, WBP_ModernPrefab_NotificationInHUD) == 0x000530, "Member 'UWBP_ModernHud_PrimaryLayout_C::WBP_ModernPrefab_NotificationInHUD' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_PrimaryLayout_C, WBP_ModernTopStats) == 0x000538, "Member 'UWBP_ModernHud_PrimaryLayout_C::WBP_ModernTopStats' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_PrimaryLayout_C, IsQuickwheelOpen) == 0x000540, "Member 'UWBP_ModernHud_PrimaryLayout_C::IsQuickwheelOpen' has a wrong offset!");

}

