#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Modern_QuestListViewCarousel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonInput_structs.hpp"
#include "Altar_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Modern_QuestListViewCarousel.WBP_Modern_QuestListViewCarousel_C
// 0x0048 (0x0598 - 0x0550)
class UWBP_Modern_QuestListViewCarousel_C final : public UVAltarNavigableListView
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0550(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVFooterViewModel*                      VFooterViewModel;                                  // 0x0558(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UObject*                                CurrentItem;                                       // 0x0560(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UObject*                                LastClickedItem;                                   // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(int32 EntryIndex)> OnNewEntrySelected;                             // 0x0570(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	double                                        Offset;                                            // 0x0580(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnValidateWithGamepad;                             // 0x0588(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__WBP_Modern_QuestListViewCarousel_ListView_K2Node_ComponentBoundEvent_0_OnListItemSelectionChangedDynamic__DelegateSignature(class UObject* Item, bool bIsSelected);
	void BndEvt__WBP_Modern_QuestListViewCarousel_ListView_K2Node_ComponentBoundEvent_1_SimpleListItemEventDynamic__DelegateSignature(class UObject* Item);
	void BndEvt__WBP_Modern_QuestListViewCarousel_ListView_K2Node_ComponentBoundEvent_2_OnListViewScrolledDynamic__DelegateSignature(float ItemOffset, float DistanceRemaining);
	void Construct();
	void ExecuteUbergraph_WBP_Modern_QuestListViewCarousel(int32 EntryPoint);
	void OnInputMethodChanged(ECommonInputType bNewInputType);
	void PreConstruct(bool IsDesignTime);
	void ResetCarousel();
	void SelectAndNavigateToBegin();
	void SelectAndNavigateToEnd();
	void SetVFooterViewModel(class UVFooterViewModel* ViewModel);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Modern_QuestListViewCarousel_C">();
	}
	static class UWBP_Modern_QuestListViewCarousel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Modern_QuestListViewCarousel_C>();
	}
};
static_assert(alignof(UWBP_Modern_QuestListViewCarousel_C) == 0x000008, "Wrong alignment on UWBP_Modern_QuestListViewCarousel_C");
static_assert(sizeof(UWBP_Modern_QuestListViewCarousel_C) == 0x000598, "Wrong size on UWBP_Modern_QuestListViewCarousel_C");
static_assert(offsetof(UWBP_Modern_QuestListViewCarousel_C, UberGraphFrame) == 0x000550, "Member 'UWBP_Modern_QuestListViewCarousel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_QuestListViewCarousel_C, VFooterViewModel) == 0x000558, "Member 'UWBP_Modern_QuestListViewCarousel_C::VFooterViewModel' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_QuestListViewCarousel_C, CurrentItem) == 0x000560, "Member 'UWBP_Modern_QuestListViewCarousel_C::CurrentItem' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_QuestListViewCarousel_C, LastClickedItem) == 0x000568, "Member 'UWBP_Modern_QuestListViewCarousel_C::LastClickedItem' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_QuestListViewCarousel_C, OnNewEntrySelected) == 0x000570, "Member 'UWBP_Modern_QuestListViewCarousel_C::OnNewEntrySelected' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_QuestListViewCarousel_C, Offset) == 0x000580, "Member 'UWBP_Modern_QuestListViewCarousel_C::Offset' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_QuestListViewCarousel_C, OnValidateWithGamepad) == 0x000588, "Member 'UWBP_Modern_QuestListViewCarousel_C::OnValidateWithGamepad' has a wrong offset!");

}

