#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PhysicsControllable

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Altar_structs.hpp"
#include "Altar_classes.hpp"
#include "UE5AltarPairing_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PhysicsControllable.WBP_PhysicsControllable_C
// 0x0190 (0x0468 - 0x02D8)
class UWBP_PhysicsControllable_C final : public UVPhysicsControllableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             AnchoredKeyText;                                   // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             AnchoredValueText;                                 // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             BuoyancyCoefficientValueText;                      // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ClassValueText;                                    // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTileView*                        ComponentsTileView;                                // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ConstraintValueText;                               // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             DampingValuesAuthorityValueText;                   // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             DefaultSelfSurfaceValueText;                       // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNavigationListview*                    DetectedActorsList;                                // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             EnabledKeyText;                                    // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             EnabledValueText;                                  // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             GeneratePontoonsKeyText;                           // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             GeneratePontoonsValueText;                         // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             GrabbableKeyText;                                  // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             GrabbableValueText;                                // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             GrabbedKeyText;                                    // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             GrabbedValueText;                                  // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             InstanceIDValueText;                               // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             LabelText;                                         // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             LevelNameText;                                     // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             LoadingBehaviourValueText;                         // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             NavigationAuthorityValueText;                      // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PairedKeyText;                                     // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PairedValueText;                                   // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PlayCollisionSoundKeyText;                         // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PlayCollisionSoundValueText;                       // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PontoonSizeScaleValueText;                         // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ProfileAuthorityValueText;                         // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ReattachOnLoadKeyText;                             // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ReattachOnLoadValueText;                           // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ReferenceIDValueText;                              // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             RepositionOnLoadKeyText;                           // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             RepositionOnLoadValueText;                         // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             RestoringAttachmentKeyText;                        // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             RestoringAttachmentValueText;                      // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SettingsAuthorityValueText;                        // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SimulationBehaviourValueText;                      // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SimulationKeyText;                                 // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SimulationValueText;                               // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SleepingKeyText;                                   // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SleepingValueText;                                 // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TelekinesisKeyText;                                // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TelekinesisValueText;                              // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             UsingBuoyancyKeyText;                              // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             UsingBuoyancyValueText;                            // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             WeightsAuthorityValueText;                         // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             XCoordValueText;                                   // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             YCoordValueText;                                   // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ZCoordValueText;                                   // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void DisplayBoolValue(bool Value, class UTextBlock* Text, class UTextBlock* LinkedText);
	void DisplayEnumValue(class FName EnumeratorName, class UTextBlock* Text, int32 CharacterCount);
	void DoUpdateDisplayData(const struct FVPhysicsControllableDebugData& ControllableData);
	void ExecuteUbergraph_WBP_PhysicsControllable(int32 EntryPoint);
	void UpdateDisplayAuthorityData(EVPhysicsSettingsAuthority ControlSettingsAuthority, EVPhysicsSettingsAuthority CollisionProfileAuthority, EVPhysicsSettingsAuthority WeightsAuthority, EVPhysicsSettingsAuthority DampingValuesAuthority, EVPhysicsSettingsAuthority NavigationSettingsAuthority);
	void UpdateDisplayedData(const struct FVPhysicsControllableDebugData& ControllableDebugData, int32 DataIndex);
	void UpdateDisplayIdentityData(class FName Label, class FName Class_0, class FName ReferenceID, class FName InstanceId);
	void UpdateDisplayLocationData(const struct FTransform& Transform);
	void UpdateDisplaySettingsData(bool IsGrabbable, bool IsTelekinesisTargetable, bool IsAnchored, bool IsRestoringAttachmentAfterSimulation, EVPhysicsSimulationBehaviour SimulationBehaviour, EVPhysicsLoadingBehaviour LoadingBehaviour, bool DoesRepositionOnLoad, bool DoesReattachOnLoad, bool DoesGeneratePontoonsAtRuntime, double PontoonSizeScale, double BuoyancyCoefficient, bool DoesPlayCollisionSounds, EVDefaultSurfaceType DefaultSurfaceType);
	void UpdateDisplayStatusData(bool IsPaired, bool IsEnabled, bool IsSimulating, EVConstrainingMode ConstrainingMode, bool IsSleeping, bool IsUsingBuoyancy, bool IsGrabbed);
	void UpdateEntries(const TArray<class UVControllableEntry*>& ControllableEntries);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PhysicsControllable_C">();
	}
	static class UWBP_PhysicsControllable_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PhysicsControllable_C>();
	}
};
static_assert(alignof(UWBP_PhysicsControllable_C) == 0x000008, "Wrong alignment on UWBP_PhysicsControllable_C");
static_assert(sizeof(UWBP_PhysicsControllable_C) == 0x000468, "Wrong size on UWBP_PhysicsControllable_C");
static_assert(offsetof(UWBP_PhysicsControllable_C, UberGraphFrame) == 0x0002D8, "Member 'UWBP_PhysicsControllable_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PhysicsControllable_C, AnchoredKeyText) == 0x0002E0, "Member 'UWBP_PhysicsControllable_C::AnchoredKeyText' has a wrong offset!");
static_assert(offsetof(UWBP_PhysicsControllable_C, AnchoredValueText) == 0x0002E8, "Member 'UWBP_PhysicsControllable_C::AnchoredValueText' has a wrong offset!");
static_assert(offsetof(UWBP_PhysicsControllable_C, BuoyancyCoefficientValueText) == 0x0002F0, "Member 'UWBP_PhysicsControllable_C::BuoyancyCoefficientValueText' has a wrong offset!");
static_assert(offsetof(UWBP_PhysicsControllable_C, ClassValueText) == 0x0002F8, "Member 'UWBP_PhysicsControllable_C::ClassValueText' has a wrong offset!");
static_assert(offsetof(UWBP_PhysicsControllable_C, ComponentsTileView) == 0x000300, "Member 'UWBP_PhysicsControllable_C::ComponentsTileView' has a wrong offset!");
static_assert(offsetof(UWBP_PhysicsControllable_C, ConstraintValueText) == 0x000308, "Member 'UWBP_PhysicsControllable_C::ConstraintValueText' has a wrong offset!");
static_assert(offsetof(UWBP_PhysicsControllable_C, DampingValuesAuthorityValueText) == 0x000310, "Member 'UWBP_PhysicsControllable_C::DampingValuesAuthorityValueText' has a wrong offset!");
static_assert(offsetof(UWBP_PhysicsControllable_C, DefaultSelfSurfaceValueText) == 0x000318, "Member 'UWBP_PhysicsControllable_C::DefaultSelfSurfaceValueText' has a wrong offset!");
static_assert(offsetof(UWBP_PhysicsControllable_C, DetectedActorsList) == 0x000320, "Member 'UWBP_PhysicsControllable_C::DetectedActorsList' has a wrong offset!");
static_assert(offsetof(UWBP_PhysicsControllable_C, EnabledKeyText) == 0x000328, "Member 'UWBP_PhysicsControllable_C::EnabledKeyText' has a wrong offset!");
static_assert(offsetof(UWBP_PhysicsControllable_C, EnabledValueText) == 0x000330, "Member 'UWBP_PhysicsControllable_C::EnabledValueText' has a wrong offset!");
static_assert(offsetof(UWBP_PhysicsControllable_C, GeneratePontoonsKeyText) == 0x000338, "Member 'UWBP_PhysicsControllable_C::GeneratePontoonsKeyText' has a wrong offset!");
static_assert(offsetof(UWBP_PhysicsControllable_C, GeneratePontoonsValueText) == 0x000340, "Member 'UWBP_PhysicsControllable_C::GeneratePontoonsValueText' has a wrong offset!");
static_assert(offsetof(UWBP_PhysicsControllable_C, GrabbableKeyText) == 0x000348, "Member 'UWBP_PhysicsControllable_C::GrabbableKeyText' has a wrong offset!");
static_assert(offsetof(UWBP_PhysicsControllable_C, GrabbableValueText) == 0x000350, "Member 'UWBP_PhysicsControllable_C::GrabbableValueText' has a wrong offset!");
static_assert(offsetof(UWBP_PhysicsControllable_C, GrabbedKeyText) == 0x000358, "Member 'UWBP_PhysicsControllable_C::GrabbedKeyText' has a wrong offset!");
static_assert(offsetof(UWBP_PhysicsControllable_C, GrabbedValueText) == 0x000360, "Member 'UWBP_PhysicsControllable_C::GrabbedValueText' has a wrong offset!");
static_assert(offsetof(UWBP_PhysicsControllable_C, InstanceIDValueText) == 0x000368, "Member 'UWBP_PhysicsControllable_C::InstanceIDValueText' has a wrong offset!");
static_assert(offsetof(UWBP_PhysicsControllable_C, LabelText) == 0x000370, "Member 'UWBP_PhysicsControllable_C::LabelText' has a wrong offset!");
static_assert(offsetof(UWBP_PhysicsControllable_C, LevelNameText) == 0x000378, "Member 'UWBP_PhysicsControllable_C::LevelNameText' has a wrong offset!");
static_assert(offsetof(UWBP_PhysicsControllable_C, LoadingBehaviourValueText) == 0x000380, "Member 'UWBP_PhysicsControllable_C::LoadingBehaviourValueText' has a wrong offset!");
static_assert(offsetof(UWBP_PhysicsControllable_C, NavigationAuthorityValueText) == 0x000388, "Member 'UWBP_PhysicsControllable_C::NavigationAuthorityValueText' has a wrong offset!");
static_assert(offsetof(UWBP_PhysicsControllable_C, PairedKeyText) == 0x000390, "Member 'UWBP_PhysicsControllable_C::PairedKeyText' has a wrong offset!");
static_assert(offsetof(UWBP_PhysicsControllable_C, PairedValueText) == 0x000398, "Member 'UWBP_PhysicsControllable_C::PairedValueText' has a wrong offset!");
static_assert(offsetof(UWBP_PhysicsControllable_C, PlayCollisionSoundKeyText) == 0x0003A0, "Member 'UWBP_PhysicsControllable_C::PlayCollisionSoundKeyText' has a wrong offset!");
static_assert(offsetof(UWBP_PhysicsControllable_C, PlayCollisionSoundValueText) == 0x0003A8, "Member 'UWBP_PhysicsControllable_C::PlayCollisionSoundValueText' has a wrong offset!");
static_assert(offsetof(UWBP_PhysicsControllable_C, PontoonSizeScaleValueText) == 0x0003B0, "Member 'UWBP_PhysicsControllable_C::PontoonSizeScaleValueText' has a wrong offset!");
static_assert(offsetof(UWBP_PhysicsControllable_C, ProfileAuthorityValueText) == 0x0003B8, "Member 'UWBP_PhysicsControllable_C::ProfileAuthorityValueText' has a wrong offset!");
static_assert(offsetof(UWBP_PhysicsControllable_C, ReattachOnLoadKeyText) == 0x0003C0, "Member 'UWBP_PhysicsControllable_C::ReattachOnLoadKeyText' has a wrong offset!");
static_assert(offsetof(UWBP_PhysicsControllable_C, ReattachOnLoadValueText) == 0x0003C8, "Member 'UWBP_PhysicsControllable_C::ReattachOnLoadValueText' has a wrong offset!");
static_assert(offsetof(UWBP_PhysicsControllable_C, ReferenceIDValueText) == 0x0003D0, "Member 'UWBP_PhysicsControllable_C::ReferenceIDValueText' has a wrong offset!");
static_assert(offsetof(UWBP_PhysicsControllable_C, RepositionOnLoadKeyText) == 0x0003D8, "Member 'UWBP_PhysicsControllable_C::RepositionOnLoadKeyText' has a wrong offset!");
static_assert(offsetof(UWBP_PhysicsControllable_C, RepositionOnLoadValueText) == 0x0003E0, "Member 'UWBP_PhysicsControllable_C::RepositionOnLoadValueText' has a wrong offset!");
static_assert(offsetof(UWBP_PhysicsControllable_C, RestoringAttachmentKeyText) == 0x0003E8, "Member 'UWBP_PhysicsControllable_C::RestoringAttachmentKeyText' has a wrong offset!");
static_assert(offsetof(UWBP_PhysicsControllable_C, RestoringAttachmentValueText) == 0x0003F0, "Member 'UWBP_PhysicsControllable_C::RestoringAttachmentValueText' has a wrong offset!");
static_assert(offsetof(UWBP_PhysicsControllable_C, SettingsAuthorityValueText) == 0x0003F8, "Member 'UWBP_PhysicsControllable_C::SettingsAuthorityValueText' has a wrong offset!");
static_assert(offsetof(UWBP_PhysicsControllable_C, SimulationBehaviourValueText) == 0x000400, "Member 'UWBP_PhysicsControllable_C::SimulationBehaviourValueText' has a wrong offset!");
static_assert(offsetof(UWBP_PhysicsControllable_C, SimulationKeyText) == 0x000408, "Member 'UWBP_PhysicsControllable_C::SimulationKeyText' has a wrong offset!");
static_assert(offsetof(UWBP_PhysicsControllable_C, SimulationValueText) == 0x000410, "Member 'UWBP_PhysicsControllable_C::SimulationValueText' has a wrong offset!");
static_assert(offsetof(UWBP_PhysicsControllable_C, SleepingKeyText) == 0x000418, "Member 'UWBP_PhysicsControllable_C::SleepingKeyText' has a wrong offset!");
static_assert(offsetof(UWBP_PhysicsControllable_C, SleepingValueText) == 0x000420, "Member 'UWBP_PhysicsControllable_C::SleepingValueText' has a wrong offset!");
static_assert(offsetof(UWBP_PhysicsControllable_C, TelekinesisKeyText) == 0x000428, "Member 'UWBP_PhysicsControllable_C::TelekinesisKeyText' has a wrong offset!");
static_assert(offsetof(UWBP_PhysicsControllable_C, TelekinesisValueText) == 0x000430, "Member 'UWBP_PhysicsControllable_C::TelekinesisValueText' has a wrong offset!");
static_assert(offsetof(UWBP_PhysicsControllable_C, UsingBuoyancyKeyText) == 0x000438, "Member 'UWBP_PhysicsControllable_C::UsingBuoyancyKeyText' has a wrong offset!");
static_assert(offsetof(UWBP_PhysicsControllable_C, UsingBuoyancyValueText) == 0x000440, "Member 'UWBP_PhysicsControllable_C::UsingBuoyancyValueText' has a wrong offset!");
static_assert(offsetof(UWBP_PhysicsControllable_C, WeightsAuthorityValueText) == 0x000448, "Member 'UWBP_PhysicsControllable_C::WeightsAuthorityValueText' has a wrong offset!");
static_assert(offsetof(UWBP_PhysicsControllable_C, XCoordValueText) == 0x000450, "Member 'UWBP_PhysicsControllable_C::XCoordValueText' has a wrong offset!");
static_assert(offsetof(UWBP_PhysicsControllable_C, YCoordValueText) == 0x000458, "Member 'UWBP_PhysicsControllable_C::YCoordValueText' has a wrong offset!");
static_assert(offsetof(UWBP_PhysicsControllable_C, ZCoordValueText) == 0x000460, "Member 'UWBP_PhysicsControllable_C::ZCoordValueText' has a wrong offset!");

}

