#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MainMenu_Button

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WBP_ModernPrefab_NavigableButton_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MainMenu_Button.WBP_MainMenu_Button_C
// 0x0050 (0x1710 - 0x16C0)
class UWBP_MainMenu_Button_C final : public UWBP_ModernPrefab_NavigableButton_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_MainMenu_Button_C;              // 0x16C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           button_background_panel;                           // 0x16C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         button_long_off;                                   // 0x16D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               button_long_on;                                    // 0x16D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AltarTextBlock_C*                  button_long_text;                                  // 0x16E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModernPrefab_ControllerInputHint_C* ControllerInput;                                  // 0x16E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               State_Default_Middle_Middle;                       // 0x16F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               State_Hover_Middle_Left;                           // 0x16F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               State_Hover_Middle_Middle;                         // 0x1700(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               State_Hover_Middle_Right;                          // 0x1708(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void OnInitButtonWidgets();
	void ExecuteUbergraph_WBP_MainMenu_Button(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MainMenu_Button_C">();
	}
	static class UWBP_MainMenu_Button_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MainMenu_Button_C>();
	}
};
static_assert(alignof(UWBP_MainMenu_Button_C) == 0x000010, "Wrong alignment on UWBP_MainMenu_Button_C");
static_assert(sizeof(UWBP_MainMenu_Button_C) == 0x001710, "Wrong size on UWBP_MainMenu_Button_C");
static_assert(offsetof(UWBP_MainMenu_Button_C, UberGraphFrame_WBP_MainMenu_Button_C) == 0x0016C0, "Member 'UWBP_MainMenu_Button_C::UberGraphFrame_WBP_MainMenu_Button_C' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Button_C, button_background_panel) == 0x0016C8, "Member 'UWBP_MainMenu_Button_C::button_background_panel' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Button_C, button_long_off) == 0x0016D0, "Member 'UWBP_MainMenu_Button_C::button_long_off' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Button_C, button_long_on) == 0x0016D8, "Member 'UWBP_MainMenu_Button_C::button_long_on' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Button_C, button_long_text) == 0x0016E0, "Member 'UWBP_MainMenu_Button_C::button_long_text' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Button_C, ControllerInput) == 0x0016E8, "Member 'UWBP_MainMenu_Button_C::ControllerInput' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Button_C, State_Default_Middle_Middle) == 0x0016F0, "Member 'UWBP_MainMenu_Button_C::State_Default_Middle_Middle' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Button_C, State_Hover_Middle_Left) == 0x0016F8, "Member 'UWBP_MainMenu_Button_C::State_Hover_Middle_Left' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Button_C, State_Hover_Middle_Middle) == 0x001700, "Member 'UWBP_MainMenu_Button_C::State_Hover_Middle_Middle' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Button_C, State_Hover_Middle_Right) == 0x001708, "Member 'UWBP_MainMenu_Button_C::State_Hover_Middle_Right' has a wrong offset!");

}

