#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LegacyMenu_MapIcon

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Altar_structs.hpp"
#include "Altar_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_LegacyMenu_MapIcon.WBP_LegacyMenu_MapIcon_C
// 0x0100 (0x05C8 - 0x04C8)
class UWBP_LegacyMenu_MapIcon_C final : public UVAltarWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_LegacyImageTile_C*                 Icon;                                              // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                icon_button;                                       // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        icon_switcher;                                     // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_LegacyMenu_MapPopup_C*             map_popup;                                         // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_LegacyImageTile_C*                 Player;                                            // 0x04F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               player_sizebox;                                    // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_LegacyImageTile_C*                 playermarker_icon_filling;                         // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_LegacyImageTile_C*                 quest_icon_filling;                                // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UWBP_LegacyMenu_MapIcon_C* Ico)> OnIconHovered;              // 0x0510(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UWBP_LegacyMenu_MapIcon_C* Icon)> OnIconUnhovered;           // 0x0520(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class FText Name)> OnIconClicked;                                  // 0x0530(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FLegacyMapMenuIconProperties           Properties;                                        // 0x0540(0x0050)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          ConstructionIsFinished;                            // 0x0590(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_591[0x3];                                      // 0x0591(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           QuestColorDefault;                                 // 0x0594(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           QuestColorIsThroughLoadDoor;                       // 0x05A4(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           PlayerMarkerColor;                                 // 0x05B4(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_LegacyMenu_MapIcon_icon_button_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_LegacyMenu_MapIcon_icon_button_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_LegacyMenu_MapIcon_icon_button_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature();
	void ExecuteUbergraph_WBP_LegacyMenu_MapIcon(int32 EntryPoint);
	void GetName(class FText* Name_0);
	void HidePopup();
	void InitPlayerMarkerColor();
	void OnInitialized();
	void OnSynchronizeProperties();
	void SetIconCrop();
	void SetPlayerRotation();
	void SetProperties(const struct FLegacyMapMenuIconProperties& Properties_0);
	void SetQuestColour();
	void ShowPopup(bool ShowLeft);

	void GetPopupText(class FText* Popup_Text) const;
	void GetPosition(struct FVector2D* NewParam) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_LegacyMenu_MapIcon_C">();
	}
	static class UWBP_LegacyMenu_MapIcon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_LegacyMenu_MapIcon_C>();
	}
};
static_assert(alignof(UWBP_LegacyMenu_MapIcon_C) == 0x000008, "Wrong alignment on UWBP_LegacyMenu_MapIcon_C");
static_assert(sizeof(UWBP_LegacyMenu_MapIcon_C) == 0x0005C8, "Wrong size on UWBP_LegacyMenu_MapIcon_C");
static_assert(offsetof(UWBP_LegacyMenu_MapIcon_C, UberGraphFrame) == 0x0004C8, "Member 'UWBP_LegacyMenu_MapIcon_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_LegacyMenu_MapIcon_C, Icon) == 0x0004D0, "Member 'UWBP_LegacyMenu_MapIcon_C::Icon' has a wrong offset!");
static_assert(offsetof(UWBP_LegacyMenu_MapIcon_C, icon_button) == 0x0004D8, "Member 'UWBP_LegacyMenu_MapIcon_C::icon_button' has a wrong offset!");
static_assert(offsetof(UWBP_LegacyMenu_MapIcon_C, icon_switcher) == 0x0004E0, "Member 'UWBP_LegacyMenu_MapIcon_C::icon_switcher' has a wrong offset!");
static_assert(offsetof(UWBP_LegacyMenu_MapIcon_C, map_popup) == 0x0004E8, "Member 'UWBP_LegacyMenu_MapIcon_C::map_popup' has a wrong offset!");
static_assert(offsetof(UWBP_LegacyMenu_MapIcon_C, Player) == 0x0004F0, "Member 'UWBP_LegacyMenu_MapIcon_C::Player' has a wrong offset!");
static_assert(offsetof(UWBP_LegacyMenu_MapIcon_C, player_sizebox) == 0x0004F8, "Member 'UWBP_LegacyMenu_MapIcon_C::player_sizebox' has a wrong offset!");
static_assert(offsetof(UWBP_LegacyMenu_MapIcon_C, playermarker_icon_filling) == 0x000500, "Member 'UWBP_LegacyMenu_MapIcon_C::playermarker_icon_filling' has a wrong offset!");
static_assert(offsetof(UWBP_LegacyMenu_MapIcon_C, quest_icon_filling) == 0x000508, "Member 'UWBP_LegacyMenu_MapIcon_C::quest_icon_filling' has a wrong offset!");
static_assert(offsetof(UWBP_LegacyMenu_MapIcon_C, OnIconHovered) == 0x000510, "Member 'UWBP_LegacyMenu_MapIcon_C::OnIconHovered' has a wrong offset!");
static_assert(offsetof(UWBP_LegacyMenu_MapIcon_C, OnIconUnhovered) == 0x000520, "Member 'UWBP_LegacyMenu_MapIcon_C::OnIconUnhovered' has a wrong offset!");
static_assert(offsetof(UWBP_LegacyMenu_MapIcon_C, OnIconClicked) == 0x000530, "Member 'UWBP_LegacyMenu_MapIcon_C::OnIconClicked' has a wrong offset!");
static_assert(offsetof(UWBP_LegacyMenu_MapIcon_C, Properties) == 0x000540, "Member 'UWBP_LegacyMenu_MapIcon_C::Properties' has a wrong offset!");
static_assert(offsetof(UWBP_LegacyMenu_MapIcon_C, ConstructionIsFinished) == 0x000590, "Member 'UWBP_LegacyMenu_MapIcon_C::ConstructionIsFinished' has a wrong offset!");
static_assert(offsetof(UWBP_LegacyMenu_MapIcon_C, QuestColorDefault) == 0x000594, "Member 'UWBP_LegacyMenu_MapIcon_C::QuestColorDefault' has a wrong offset!");
static_assert(offsetof(UWBP_LegacyMenu_MapIcon_C, QuestColorIsThroughLoadDoor) == 0x0005A4, "Member 'UWBP_LegacyMenu_MapIcon_C::QuestColorIsThroughLoadDoor' has a wrong offset!");
static_assert(offsetof(UWBP_LegacyMenu_MapIcon_C, PlayerMarkerColor) == 0x0005B4, "Member 'UWBP_LegacyMenu_MapIcon_C::PlayerMarkerColor' has a wrong offset!");

}

