#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Modern_SettingsMenu_TimedRevertPopup

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Modern_SettingsMenu_TimedRevertPopup.WBP_Modern_SettingsMenu_TimedRevertPopup_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_Modern_SettingsMenu_TimedRevertPopup_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_SettingsMenu_TimedRevertPopup_C_Tick) == 0x000004, "Wrong alignment on WBP_Modern_SettingsMenu_TimedRevertPopup_C_Tick");
static_assert(sizeof(WBP_Modern_SettingsMenu_TimedRevertPopup_C_Tick) == 0x00003C, "Wrong size on WBP_Modern_SettingsMenu_TimedRevertPopup_C_Tick");
static_assert(offsetof(WBP_Modern_SettingsMenu_TimedRevertPopup_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_Modern_SettingsMenu_TimedRevertPopup_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_TimedRevertPopup_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_Modern_SettingsMenu_TimedRevertPopup_C_Tick::InDeltaTime' has a wrong offset!");

// Function WBP_Modern_SettingsMenu_TimedRevertPopup.WBP_Modern_SettingsMenu_TimedRevertPopup_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Modern_SettingsMenu_TimedRevertPopup_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_SettingsMenu_TimedRevertPopup_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_Modern_SettingsMenu_TimedRevertPopup_C_PreConstruct");
static_assert(sizeof(WBP_Modern_SettingsMenu_TimedRevertPopup_C_PreConstruct) == 0x000001, "Wrong size on WBP_Modern_SettingsMenu_TimedRevertPopup_C_PreConstruct");
static_assert(offsetof(WBP_Modern_SettingsMenu_TimedRevertPopup_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_Modern_SettingsMenu_TimedRevertPopup_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_Modern_SettingsMenu_TimedRevertPopup.WBP_Modern_SettingsMenu_TimedRevertPopup_C.MenuFadeInOut
// 0x0048 (0x0048 - 0x0000)
struct WBP_Modern_SettingsMenu_TimedRevertPopup_C_MenuFadeInOut final
{
public:
	bool                                          InIsVisible;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        AnimationTime;                                     // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_1;                              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13[0x1];                                       // 0x0013(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          K2Node_Select_Default;                             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimation_PlaybackSpeed_ImplicitCast; // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_SettingsMenu_TimedRevertPopup_C_MenuFadeInOut) == 0x000008, "Wrong alignment on WBP_Modern_SettingsMenu_TimedRevertPopup_C_MenuFadeInOut");
static_assert(sizeof(WBP_Modern_SettingsMenu_TimedRevertPopup_C_MenuFadeInOut) == 0x000048, "Wrong size on WBP_Modern_SettingsMenu_TimedRevertPopup_C_MenuFadeInOut");
static_assert(offsetof(WBP_Modern_SettingsMenu_TimedRevertPopup_C_MenuFadeInOut, InIsVisible) == 0x000000, "Member 'WBP_Modern_SettingsMenu_TimedRevertPopup_C_MenuFadeInOut::InIsVisible' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_TimedRevertPopup_C_MenuFadeInOut, AnimationTime) == 0x000008, "Member 'WBP_Modern_SettingsMenu_TimedRevertPopup_C_MenuFadeInOut::AnimationTime' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_TimedRevertPopup_C_MenuFadeInOut, Temp_byte_Variable) == 0x000010, "Member 'WBP_Modern_SettingsMenu_TimedRevertPopup_C_MenuFadeInOut::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_TimedRevertPopup_C_MenuFadeInOut, Temp_byte_Variable_1) == 0x000011, "Member 'WBP_Modern_SettingsMenu_TimedRevertPopup_C_MenuFadeInOut::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_TimedRevertPopup_C_MenuFadeInOut, Temp_bool_Variable) == 0x000012, "Member 'WBP_Modern_SettingsMenu_TimedRevertPopup_C_MenuFadeInOut::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_TimedRevertPopup_C_MenuFadeInOut, CallFunc_GetEndTime_ReturnValue) == 0x000014, "Member 'WBP_Modern_SettingsMenu_TimedRevertPopup_C_MenuFadeInOut::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_TimedRevertPopup_C_MenuFadeInOut, K2Node_Select_Default) == 0x000018, "Member 'WBP_Modern_SettingsMenu_TimedRevertPopup_C_MenuFadeInOut::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_TimedRevertPopup_C_MenuFadeInOut, CallFunc_SelectFloat_ReturnValue) == 0x000020, "Member 'WBP_Modern_SettingsMenu_TimedRevertPopup_C_MenuFadeInOut::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_TimedRevertPopup_C_MenuFadeInOut, CallFunc_PlayAnimation_ReturnValue) == 0x000028, "Member 'WBP_Modern_SettingsMenu_TimedRevertPopup_C_MenuFadeInOut::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_TimedRevertPopup_C_MenuFadeInOut, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000030, "Member 'WBP_Modern_SettingsMenu_TimedRevertPopup_C_MenuFadeInOut::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_TimedRevertPopup_C_MenuFadeInOut, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x000038, "Member 'WBP_Modern_SettingsMenu_TimedRevertPopup_C_MenuFadeInOut::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_TimedRevertPopup_C_MenuFadeInOut, CallFunc_PlayAnimation_PlaybackSpeed_ImplicitCast) == 0x000040, "Member 'WBP_Modern_SettingsMenu_TimedRevertPopup_C_MenuFadeInOut::CallFunc_PlayAnimation_PlaybackSpeed_ImplicitCast' has a wrong offset!");

// Function WBP_Modern_SettingsMenu_TimedRevertPopup.WBP_Modern_SettingsMenu_TimedRevertPopup_C.ManageCountDown
// 0x0038 (0x0038 - 0x0000)
struct WBP_Modern_SettingsMenu_TimedRevertPopup_C_ManageCountDown final
{
public:
	double                                        DeltaTime;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0010(0x0018)()
	int32                                         CallFunc_FCeil_ReturnValue;                        // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_SettingsMenu_TimedRevertPopup_C_ManageCountDown) == 0x000008, "Wrong alignment on WBP_Modern_SettingsMenu_TimedRevertPopup_C_ManageCountDown");
static_assert(sizeof(WBP_Modern_SettingsMenu_TimedRevertPopup_C_ManageCountDown) == 0x000038, "Wrong size on WBP_Modern_SettingsMenu_TimedRevertPopup_C_ManageCountDown");
static_assert(offsetof(WBP_Modern_SettingsMenu_TimedRevertPopup_C_ManageCountDown, DeltaTime) == 0x000000, "Member 'WBP_Modern_SettingsMenu_TimedRevertPopup_C_ManageCountDown::DeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_TimedRevertPopup_C_ManageCountDown, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000008, "Member 'WBP_Modern_SettingsMenu_TimedRevertPopup_C_ManageCountDown::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_TimedRevertPopup_C_ManageCountDown, CallFunc_Conv_IntToText_ReturnValue) == 0x000010, "Member 'WBP_Modern_SettingsMenu_TimedRevertPopup_C_ManageCountDown::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_TimedRevertPopup_C_ManageCountDown, CallFunc_FCeil_ReturnValue) == 0x000028, "Member 'WBP_Modern_SettingsMenu_TimedRevertPopup_C_ManageCountDown::CallFunc_FCeil_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_TimedRevertPopup_C_ManageCountDown, CallFunc_Greater_IntInt_ReturnValue) == 0x00002C, "Member 'WBP_Modern_SettingsMenu_TimedRevertPopup_C_ManageCountDown::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_TimedRevertPopup_C_ManageCountDown, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000030, "Member 'WBP_Modern_SettingsMenu_TimedRevertPopup_C_ManageCountDown::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");

// Function WBP_Modern_SettingsMenu_TimedRevertPopup.WBP_Modern_SettingsMenu_TimedRevertPopup_C.InitPopup
// 0x0088 (0x0088 - 0x0000)
struct WBP_Modern_SettingsMenu_TimedRevertPopup_C_InitPopup final
{
public:
	class FText                                   NewTitle;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   NewMessage;                                        // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   NewButton1Text;                                    // 0x0030(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   NewButton2Text;                                    // 0x0048(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         NewTimer;                                          // 0x0060(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0070(0x0018)()
};
static_assert(alignof(WBP_Modern_SettingsMenu_TimedRevertPopup_C_InitPopup) == 0x000008, "Wrong alignment on WBP_Modern_SettingsMenu_TimedRevertPopup_C_InitPopup");
static_assert(sizeof(WBP_Modern_SettingsMenu_TimedRevertPopup_C_InitPopup) == 0x000088, "Wrong size on WBP_Modern_SettingsMenu_TimedRevertPopup_C_InitPopup");
static_assert(offsetof(WBP_Modern_SettingsMenu_TimedRevertPopup_C_InitPopup, NewTitle) == 0x000000, "Member 'WBP_Modern_SettingsMenu_TimedRevertPopup_C_InitPopup::NewTitle' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_TimedRevertPopup_C_InitPopup, NewMessage) == 0x000018, "Member 'WBP_Modern_SettingsMenu_TimedRevertPopup_C_InitPopup::NewMessage' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_TimedRevertPopup_C_InitPopup, NewButton1Text) == 0x000030, "Member 'WBP_Modern_SettingsMenu_TimedRevertPopup_C_InitPopup::NewButton1Text' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_TimedRevertPopup_C_InitPopup, NewButton2Text) == 0x000048, "Member 'WBP_Modern_SettingsMenu_TimedRevertPopup_C_InitPopup::NewButton2Text' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_TimedRevertPopup_C_InitPopup, NewTimer) == 0x000060, "Member 'WBP_Modern_SettingsMenu_TimedRevertPopup_C_InitPopup::NewTimer' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_TimedRevertPopup_C_InitPopup, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000068, "Member 'WBP_Modern_SettingsMenu_TimedRevertPopup_C_InitPopup::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_TimedRevertPopup_C_InitPopup, CallFunc_Conv_IntToText_ReturnValue) == 0x000070, "Member 'WBP_Modern_SettingsMenu_TimedRevertPopup_C_InitPopup::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

// Function WBP_Modern_SettingsMenu_TimedRevertPopup.WBP_Modern_SettingsMenu_TimedRevertPopup_C.ExecuteUbergraph_WBP_Modern_SettingsMenu_TimedRevertPopup
// 0x0068 (0x0068 - 0x0000)
struct WBP_Modern_SettingsMenu_TimedRevertPopup_C_ExecuteUbergraph_WBP_Modern_SettingsMenu_TimedRevertPopup final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MenuFadeInOut_AnimationTime;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0020(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_ManageCountDown_DeltaTime_ImplicitCast;   // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_SettingsMenu_TimedRevertPopup_C_ExecuteUbergraph_WBP_Modern_SettingsMenu_TimedRevertPopup) == 0x000008, "Wrong alignment on WBP_Modern_SettingsMenu_TimedRevertPopup_C_ExecuteUbergraph_WBP_Modern_SettingsMenu_TimedRevertPopup");
static_assert(sizeof(WBP_Modern_SettingsMenu_TimedRevertPopup_C_ExecuteUbergraph_WBP_Modern_SettingsMenu_TimedRevertPopup) == 0x000068, "Wrong size on WBP_Modern_SettingsMenu_TimedRevertPopup_C_ExecuteUbergraph_WBP_Modern_SettingsMenu_TimedRevertPopup");
static_assert(offsetof(WBP_Modern_SettingsMenu_TimedRevertPopup_C_ExecuteUbergraph_WBP_Modern_SettingsMenu_TimedRevertPopup, EntryPoint) == 0x000000, "Member 'WBP_Modern_SettingsMenu_TimedRevertPopup_C_ExecuteUbergraph_WBP_Modern_SettingsMenu_TimedRevertPopup::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_TimedRevertPopup_C_ExecuteUbergraph_WBP_Modern_SettingsMenu_TimedRevertPopup, CallFunc_MenuFadeInOut_AnimationTime) == 0x000008, "Member 'WBP_Modern_SettingsMenu_TimedRevertPopup_C_ExecuteUbergraph_WBP_Modern_SettingsMenu_TimedRevertPopup::CallFunc_MenuFadeInOut_AnimationTime' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_TimedRevertPopup_C_ExecuteUbergraph_WBP_Modern_SettingsMenu_TimedRevertPopup, K2Node_ComponentBoundEvent_Button_1) == 0x000010, "Member 'WBP_Modern_SettingsMenu_TimedRevertPopup_C_ExecuteUbergraph_WBP_Modern_SettingsMenu_TimedRevertPopup::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_TimedRevertPopup_C_ExecuteUbergraph_WBP_Modern_SettingsMenu_TimedRevertPopup, K2Node_ComponentBoundEvent_Button) == 0x000018, "Member 'WBP_Modern_SettingsMenu_TimedRevertPopup_C_ExecuteUbergraph_WBP_Modern_SettingsMenu_TimedRevertPopup::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_TimedRevertPopup_C_ExecuteUbergraph_WBP_Modern_SettingsMenu_TimedRevertPopup, K2Node_Event_MyGeometry) == 0x000020, "Member 'WBP_Modern_SettingsMenu_TimedRevertPopup_C_ExecuteUbergraph_WBP_Modern_SettingsMenu_TimedRevertPopup::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_TimedRevertPopup_C_ExecuteUbergraph_WBP_Modern_SettingsMenu_TimedRevertPopup, K2Node_Event_InDeltaTime) == 0x000058, "Member 'WBP_Modern_SettingsMenu_TimedRevertPopup_C_ExecuteUbergraph_WBP_Modern_SettingsMenu_TimedRevertPopup::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_TimedRevertPopup_C_ExecuteUbergraph_WBP_Modern_SettingsMenu_TimedRevertPopup, K2Node_Event_IsDesignTime) == 0x00005C, "Member 'WBP_Modern_SettingsMenu_TimedRevertPopup_C_ExecuteUbergraph_WBP_Modern_SettingsMenu_TimedRevertPopup::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_Modern_SettingsMenu_TimedRevertPopup_C_ExecuteUbergraph_WBP_Modern_SettingsMenu_TimedRevertPopup, CallFunc_ManageCountDown_DeltaTime_ImplicitCast) == 0x000060, "Member 'WBP_Modern_SettingsMenu_TimedRevertPopup_C_ExecuteUbergraph_WBP_Modern_SettingsMenu_TimedRevertPopup::CallFunc_ManageCountDown_DeltaTime_ImplicitCast' has a wrong offset!");

// Function WBP_Modern_SettingsMenu_TimedRevertPopup.WBP_Modern_SettingsMenu_TimedRevertPopup_C.BP_OnHandleBackAction
// 0x0001 (0x0001 - 0x0000)
struct WBP_Modern_SettingsMenu_TimedRevertPopup_C_BP_OnHandleBackAction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_SettingsMenu_TimedRevertPopup_C_BP_OnHandleBackAction) == 0x000001, "Wrong alignment on WBP_Modern_SettingsMenu_TimedRevertPopup_C_BP_OnHandleBackAction");
static_assert(sizeof(WBP_Modern_SettingsMenu_TimedRevertPopup_C_BP_OnHandleBackAction) == 0x000001, "Wrong size on WBP_Modern_SettingsMenu_TimedRevertPopup_C_BP_OnHandleBackAction");
static_assert(offsetof(WBP_Modern_SettingsMenu_TimedRevertPopup_C_BP_OnHandleBackAction, ReturnValue) == 0x000000, "Member 'WBP_Modern_SettingsMenu_TimedRevertPopup_C_BP_OnHandleBackAction::ReturnValue' has a wrong offset!");

// Function WBP_Modern_SettingsMenu_TimedRevertPopup.WBP_Modern_SettingsMenu_TimedRevertPopup_C.BndEvt__WBP_Modern_SettingsMenu_ValidationPopup_Button_2_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Modern_SettingsMenu_TimedRevertPopup_C_BndEvt__WBP_Modern_SettingsMenu_ValidationPopup_Button_2_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_SettingsMenu_TimedRevertPopup_C_BndEvt__WBP_Modern_SettingsMenu_ValidationPopup_Button_2_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Modern_SettingsMenu_TimedRevertPopup_C_BndEvt__WBP_Modern_SettingsMenu_ValidationPopup_Button_2_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_Modern_SettingsMenu_TimedRevertPopup_C_BndEvt__WBP_Modern_SettingsMenu_ValidationPopup_Button_2_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Modern_SettingsMenu_TimedRevertPopup_C_BndEvt__WBP_Modern_SettingsMenu_ValidationPopup_Button_2_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_Modern_SettingsMenu_TimedRevertPopup_C_BndEvt__WBP_Modern_SettingsMenu_ValidationPopup_Button_2_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_Modern_SettingsMenu_TimedRevertPopup_C_BndEvt__WBP_Modern_SettingsMenu_ValidationPopup_Button_2_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_Modern_SettingsMenu_TimedRevertPopup.WBP_Modern_SettingsMenu_TimedRevertPopup_C.BndEvt__WBP_Modern_SettingsMenu_ValidationPopup_Button_1_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Modern_SettingsMenu_TimedRevertPopup_C_BndEvt__WBP_Modern_SettingsMenu_ValidationPopup_Button_1_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_SettingsMenu_TimedRevertPopup_C_BndEvt__WBP_Modern_SettingsMenu_ValidationPopup_Button_1_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Modern_SettingsMenu_TimedRevertPopup_C_BndEvt__WBP_Modern_SettingsMenu_ValidationPopup_Button_1_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_Modern_SettingsMenu_TimedRevertPopup_C_BndEvt__WBP_Modern_SettingsMenu_ValidationPopup_Button_1_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Modern_SettingsMenu_TimedRevertPopup_C_BndEvt__WBP_Modern_SettingsMenu_ValidationPopup_Button_1_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_Modern_SettingsMenu_TimedRevertPopup_C_BndEvt__WBP_Modern_SettingsMenu_ValidationPopup_Button_1_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_Modern_SettingsMenu_TimedRevertPopup_C_BndEvt__WBP_Modern_SettingsMenu_ValidationPopup_Button_1_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_Modern_SettingsMenu_TimedRevertPopup.WBP_Modern_SettingsMenu_TimedRevertPopup_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct WBP_Modern_SettingsMenu_TimedRevertPopup_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_SettingsMenu_TimedRevertPopup_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_Modern_SettingsMenu_TimedRevertPopup_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_Modern_SettingsMenu_TimedRevertPopup_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong size on WBP_Modern_SettingsMenu_TimedRevertPopup_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_Modern_SettingsMenu_TimedRevertPopup_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_Modern_SettingsMenu_TimedRevertPopup_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");

}

