#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModernMenu_ContainerInventory_MainContent

#include "Basic.hpp"

#include "CommonInput_structs.hpp"
#include "Altar_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_ModernMenu_ContainerInventory_MainContent.WBP_ModernMenu_ContainerInventory_MainContent_C.BndEvt__WBP_ModernMenu_ContainerInventory_MainContent_inv_cont_listview_K2Node_ComponentBoundEvent_2_OnItemClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ModernMenu_ContainerInventory_MainContent_C_BndEvt__WBP_ModernMenu_ContainerInventory_MainContent_inv_cont_listview_K2Node_ComponentBoundEvent_2_OnItemClicked__DelegateSignature final
{
public:
	class UObject*                                SelectedItem;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_ContainerInventory_MainContent_C_BndEvt__WBP_ModernMenu_ContainerInventory_MainContent_inv_cont_listview_K2Node_ComponentBoundEvent_2_OnItemClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ModernMenu_ContainerInventory_MainContent_C_BndEvt__WBP_ModernMenu_ContainerInventory_MainContent_inv_cont_listview_K2Node_ComponentBoundEvent_2_OnItemClicked__DelegateSignature");
static_assert(sizeof(WBP_ModernMenu_ContainerInventory_MainContent_C_BndEvt__WBP_ModernMenu_ContainerInventory_MainContent_inv_cont_listview_K2Node_ComponentBoundEvent_2_OnItemClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_ModernMenu_ContainerInventory_MainContent_C_BndEvt__WBP_ModernMenu_ContainerInventory_MainContent_inv_cont_listview_K2Node_ComponentBoundEvent_2_OnItemClicked__DelegateSignature");
static_assert(offsetof(WBP_ModernMenu_ContainerInventory_MainContent_C_BndEvt__WBP_ModernMenu_ContainerInventory_MainContent_inv_cont_listview_K2Node_ComponentBoundEvent_2_OnItemClicked__DelegateSignature, SelectedItem) == 0x000000, "Member 'WBP_ModernMenu_ContainerInventory_MainContent_C_BndEvt__WBP_ModernMenu_ContainerInventory_MainContent_inv_cont_listview_K2Node_ComponentBoundEvent_2_OnItemClicked__DelegateSignature::SelectedItem' has a wrong offset!");

// Function WBP_ModernMenu_ContainerInventory_MainContent.WBP_ModernMenu_ContainerInventory_MainContent_C.BndEvt__WBP_ModernMenu_ContainerInventory_MainContent_inv_cont_listview_K2Node_ComponentBoundEvent_5_OnItemHovered__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ModernMenu_ContainerInventory_MainContent_C_BndEvt__WBP_ModernMenu_ContainerInventory_MainContent_inv_cont_listview_K2Node_ComponentBoundEvent_5_OnItemHovered__DelegateSignature final
{
public:
	class UObject*                                HoveredItem;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_ContainerInventory_MainContent_C_BndEvt__WBP_ModernMenu_ContainerInventory_MainContent_inv_cont_listview_K2Node_ComponentBoundEvent_5_OnItemHovered__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ModernMenu_ContainerInventory_MainContent_C_BndEvt__WBP_ModernMenu_ContainerInventory_MainContent_inv_cont_listview_K2Node_ComponentBoundEvent_5_OnItemHovered__DelegateSignature");
static_assert(sizeof(WBP_ModernMenu_ContainerInventory_MainContent_C_BndEvt__WBP_ModernMenu_ContainerInventory_MainContent_inv_cont_listview_K2Node_ComponentBoundEvent_5_OnItemHovered__DelegateSignature) == 0x000008, "Wrong size on WBP_ModernMenu_ContainerInventory_MainContent_C_BndEvt__WBP_ModernMenu_ContainerInventory_MainContent_inv_cont_listview_K2Node_ComponentBoundEvent_5_OnItemHovered__DelegateSignature");
static_assert(offsetof(WBP_ModernMenu_ContainerInventory_MainContent_C_BndEvt__WBP_ModernMenu_ContainerInventory_MainContent_inv_cont_listview_K2Node_ComponentBoundEvent_5_OnItemHovered__DelegateSignature, HoveredItem) == 0x000000, "Member 'WBP_ModernMenu_ContainerInventory_MainContent_C_BndEvt__WBP_ModernMenu_ContainerInventory_MainContent_inv_cont_listview_K2Node_ComponentBoundEvent_5_OnItemHovered__DelegateSignature::HoveredItem' has a wrong offset!");

// Function WBP_ModernMenu_ContainerInventory_MainContent.WBP_ModernMenu_ContainerInventory_MainContent_C.BndEvt__WBP_ModernMenu_ContainerInventory_MainContent_inv_cont_listview_K2Node_ComponentBoundEvent_6_OnScrollBarVisibilityChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_ModernMenu_ContainerInventory_MainContent_C_BndEvt__WBP_ModernMenu_ContainerInventory_MainContent_inv_cont_listview_K2Node_ComponentBoundEvent_6_OnScrollBarVisibilityChanged__DelegateSignature final
{
public:
	ESlateVisibility                              NewParam;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_ContainerInventory_MainContent_C_BndEvt__WBP_ModernMenu_ContainerInventory_MainContent_inv_cont_listview_K2Node_ComponentBoundEvent_6_OnScrollBarVisibilityChanged__DelegateSignature) == 0x000001, "Wrong alignment on WBP_ModernMenu_ContainerInventory_MainContent_C_BndEvt__WBP_ModernMenu_ContainerInventory_MainContent_inv_cont_listview_K2Node_ComponentBoundEvent_6_OnScrollBarVisibilityChanged__DelegateSignature");
static_assert(sizeof(WBP_ModernMenu_ContainerInventory_MainContent_C_BndEvt__WBP_ModernMenu_ContainerInventory_MainContent_inv_cont_listview_K2Node_ComponentBoundEvent_6_OnScrollBarVisibilityChanged__DelegateSignature) == 0x000001, "Wrong size on WBP_ModernMenu_ContainerInventory_MainContent_C_BndEvt__WBP_ModernMenu_ContainerInventory_MainContent_inv_cont_listview_K2Node_ComponentBoundEvent_6_OnScrollBarVisibilityChanged__DelegateSignature");
static_assert(offsetof(WBP_ModernMenu_ContainerInventory_MainContent_C_BndEvt__WBP_ModernMenu_ContainerInventory_MainContent_inv_cont_listview_K2Node_ComponentBoundEvent_6_OnScrollBarVisibilityChanged__DelegateSignature, NewParam) == 0x000000, "Member 'WBP_ModernMenu_ContainerInventory_MainContent_C_BndEvt__WBP_ModernMenu_ContainerInventory_MainContent_inv_cont_listview_K2Node_ComponentBoundEvent_6_OnScrollBarVisibilityChanged__DelegateSignature::NewParam' has a wrong offset!");

// Function WBP_ModernMenu_ContainerInventory_MainContent.WBP_ModernMenu_ContainerInventory_MainContent_C.BndEvt__WBP_ModernMenu_ContainerInventory_MainContent_inv_cont_listview_K2Node_ComponentBoundEvent_8_OnMouseHoverListViewChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_ModernMenu_ContainerInventory_MainContent_C_BndEvt__WBP_ModernMenu_ContainerInventory_MainContent_inv_cont_listview_K2Node_ComponentBoundEvent_8_OnMouseHoverListViewChanged__DelegateSignature final
{
public:
	bool                                          IsHovered_0;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_ContainerInventory_MainContent_C_BndEvt__WBP_ModernMenu_ContainerInventory_MainContent_inv_cont_listview_K2Node_ComponentBoundEvent_8_OnMouseHoverListViewChanged__DelegateSignature) == 0x000001, "Wrong alignment on WBP_ModernMenu_ContainerInventory_MainContent_C_BndEvt__WBP_ModernMenu_ContainerInventory_MainContent_inv_cont_listview_K2Node_ComponentBoundEvent_8_OnMouseHoverListViewChanged__DelegateSignature");
static_assert(sizeof(WBP_ModernMenu_ContainerInventory_MainContent_C_BndEvt__WBP_ModernMenu_ContainerInventory_MainContent_inv_cont_listview_K2Node_ComponentBoundEvent_8_OnMouseHoverListViewChanged__DelegateSignature) == 0x000001, "Wrong size on WBP_ModernMenu_ContainerInventory_MainContent_C_BndEvt__WBP_ModernMenu_ContainerInventory_MainContent_inv_cont_listview_K2Node_ComponentBoundEvent_8_OnMouseHoverListViewChanged__DelegateSignature");
static_assert(offsetof(WBP_ModernMenu_ContainerInventory_MainContent_C_BndEvt__WBP_ModernMenu_ContainerInventory_MainContent_inv_cont_listview_K2Node_ComponentBoundEvent_8_OnMouseHoverListViewChanged__DelegateSignature, IsHovered_0) == 0x000000, "Member 'WBP_ModernMenu_ContainerInventory_MainContent_C_BndEvt__WBP_ModernMenu_ContainerInventory_MainContent_inv_cont_listview_K2Node_ComponentBoundEvent_8_OnMouseHoverListViewChanged__DelegateSignature::IsHovered_0' has a wrong offset!");

// Function WBP_ModernMenu_ContainerInventory_MainContent.WBP_ModernMenu_ContainerInventory_MainContent_C.BndEvt__WBP_ModernMenu_ContainerInventory_MainContent_inv_cont_spell_listview_K2Node_ComponentBoundEvent_3_OnItemHovered__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ModernMenu_ContainerInventory_MainContent_C_BndEvt__WBP_ModernMenu_ContainerInventory_MainContent_inv_cont_spell_listview_K2Node_ComponentBoundEvent_3_OnItemHovered__DelegateSignature final
{
public:
	class UObject*                                HoveredItem;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_ContainerInventory_MainContent_C_BndEvt__WBP_ModernMenu_ContainerInventory_MainContent_inv_cont_spell_listview_K2Node_ComponentBoundEvent_3_OnItemHovered__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ModernMenu_ContainerInventory_MainContent_C_BndEvt__WBP_ModernMenu_ContainerInventory_MainContent_inv_cont_spell_listview_K2Node_ComponentBoundEvent_3_OnItemHovered__DelegateSignature");
static_assert(sizeof(WBP_ModernMenu_ContainerInventory_MainContent_C_BndEvt__WBP_ModernMenu_ContainerInventory_MainContent_inv_cont_spell_listview_K2Node_ComponentBoundEvent_3_OnItemHovered__DelegateSignature) == 0x000008, "Wrong size on WBP_ModernMenu_ContainerInventory_MainContent_C_BndEvt__WBP_ModernMenu_ContainerInventory_MainContent_inv_cont_spell_listview_K2Node_ComponentBoundEvent_3_OnItemHovered__DelegateSignature");
static_assert(offsetof(WBP_ModernMenu_ContainerInventory_MainContent_C_BndEvt__WBP_ModernMenu_ContainerInventory_MainContent_inv_cont_spell_listview_K2Node_ComponentBoundEvent_3_OnItemHovered__DelegateSignature, HoveredItem) == 0x000000, "Member 'WBP_ModernMenu_ContainerInventory_MainContent_C_BndEvt__WBP_ModernMenu_ContainerInventory_MainContent_inv_cont_spell_listview_K2Node_ComponentBoundEvent_3_OnItemHovered__DelegateSignature::HoveredItem' has a wrong offset!");

// Function WBP_ModernMenu_ContainerInventory_MainContent.WBP_ModernMenu_ContainerInventory_MainContent_C.BndEvt__WBP_ModernMenu_ContainerInventory_MainContent_inv_cont_spell_listview_K2Node_ComponentBoundEvent_4_OnItemClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ModernMenu_ContainerInventory_MainContent_C_BndEvt__WBP_ModernMenu_ContainerInventory_MainContent_inv_cont_spell_listview_K2Node_ComponentBoundEvent_4_OnItemClicked__DelegateSignature final
{
public:
	class UObject*                                SelectedItem;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_ContainerInventory_MainContent_C_BndEvt__WBP_ModernMenu_ContainerInventory_MainContent_inv_cont_spell_listview_K2Node_ComponentBoundEvent_4_OnItemClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ModernMenu_ContainerInventory_MainContent_C_BndEvt__WBP_ModernMenu_ContainerInventory_MainContent_inv_cont_spell_listview_K2Node_ComponentBoundEvent_4_OnItemClicked__DelegateSignature");
static_assert(sizeof(WBP_ModernMenu_ContainerInventory_MainContent_C_BndEvt__WBP_ModernMenu_ContainerInventory_MainContent_inv_cont_spell_listview_K2Node_ComponentBoundEvent_4_OnItemClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_ModernMenu_ContainerInventory_MainContent_C_BndEvt__WBP_ModernMenu_ContainerInventory_MainContent_inv_cont_spell_listview_K2Node_ComponentBoundEvent_4_OnItemClicked__DelegateSignature");
static_assert(offsetof(WBP_ModernMenu_ContainerInventory_MainContent_C_BndEvt__WBP_ModernMenu_ContainerInventory_MainContent_inv_cont_spell_listview_K2Node_ComponentBoundEvent_4_OnItemClicked__DelegateSignature, SelectedItem) == 0x000000, "Member 'WBP_ModernMenu_ContainerInventory_MainContent_C_BndEvt__WBP_ModernMenu_ContainerInventory_MainContent_inv_cont_spell_listview_K2Node_ComponentBoundEvent_4_OnItemClicked__DelegateSignature::SelectedItem' has a wrong offset!");

// Function WBP_ModernMenu_ContainerInventory_MainContent.WBP_ModernMenu_ContainerInventory_MainContent_C.BndEvt__WBP_ModernMenu_ContainerInventory_MainContent_inv_filter_K2Node_ComponentBoundEvent_0_OnSortTypeUpdated__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_ModernMenu_ContainerInventory_MainContent_C_BndEvt__WBP_ModernMenu_ContainerInventory_MainContent_inv_filter_K2Node_ComponentBoundEvent_0_OnSortTypeUpdated__DelegateSignature final
{
public:
	EOriginalInventoryMenuSortType                SortType;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_ContainerInventory_MainContent_C_BndEvt__WBP_ModernMenu_ContainerInventory_MainContent_inv_filter_K2Node_ComponentBoundEvent_0_OnSortTypeUpdated__DelegateSignature) == 0x000001, "Wrong alignment on WBP_ModernMenu_ContainerInventory_MainContent_C_BndEvt__WBP_ModernMenu_ContainerInventory_MainContent_inv_filter_K2Node_ComponentBoundEvent_0_OnSortTypeUpdated__DelegateSignature");
static_assert(sizeof(WBP_ModernMenu_ContainerInventory_MainContent_C_BndEvt__WBP_ModernMenu_ContainerInventory_MainContent_inv_filter_K2Node_ComponentBoundEvent_0_OnSortTypeUpdated__DelegateSignature) == 0x000001, "Wrong size on WBP_ModernMenu_ContainerInventory_MainContent_C_BndEvt__WBP_ModernMenu_ContainerInventory_MainContent_inv_filter_K2Node_ComponentBoundEvent_0_OnSortTypeUpdated__DelegateSignature");
static_assert(offsetof(WBP_ModernMenu_ContainerInventory_MainContent_C_BndEvt__WBP_ModernMenu_ContainerInventory_MainContent_inv_filter_K2Node_ComponentBoundEvent_0_OnSortTypeUpdated__DelegateSignature, SortType) == 0x000000, "Member 'WBP_ModernMenu_ContainerInventory_MainContent_C_BndEvt__WBP_ModernMenu_ContainerInventory_MainContent_inv_filter_K2Node_ComponentBoundEvent_0_OnSortTypeUpdated__DelegateSignature::SortType' has a wrong offset!");

// Function WBP_ModernMenu_ContainerInventory_MainContent.WBP_ModernMenu_ContainerInventory_MainContent_C.BndEvt__WBP_ModernMenu_ContainerInventory_MainContent_inv_filter_K2Node_ComponentBoundEvent_1_OnIsReversedUpdated__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_ModernMenu_ContainerInventory_MainContent_C_BndEvt__WBP_ModernMenu_ContainerInventory_MainContent_inv_filter_K2Node_ComponentBoundEvent_1_OnIsReversedUpdated__DelegateSignature final
{
public:
	bool                                          bIsReversed;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_ContainerInventory_MainContent_C_BndEvt__WBP_ModernMenu_ContainerInventory_MainContent_inv_filter_K2Node_ComponentBoundEvent_1_OnIsReversedUpdated__DelegateSignature) == 0x000001, "Wrong alignment on WBP_ModernMenu_ContainerInventory_MainContent_C_BndEvt__WBP_ModernMenu_ContainerInventory_MainContent_inv_filter_K2Node_ComponentBoundEvent_1_OnIsReversedUpdated__DelegateSignature");
static_assert(sizeof(WBP_ModernMenu_ContainerInventory_MainContent_C_BndEvt__WBP_ModernMenu_ContainerInventory_MainContent_inv_filter_K2Node_ComponentBoundEvent_1_OnIsReversedUpdated__DelegateSignature) == 0x000001, "Wrong size on WBP_ModernMenu_ContainerInventory_MainContent_C_BndEvt__WBP_ModernMenu_ContainerInventory_MainContent_inv_filter_K2Node_ComponentBoundEvent_1_OnIsReversedUpdated__DelegateSignature");
static_assert(offsetof(WBP_ModernMenu_ContainerInventory_MainContent_C_BndEvt__WBP_ModernMenu_ContainerInventory_MainContent_inv_filter_K2Node_ComponentBoundEvent_1_OnIsReversedUpdated__DelegateSignature, bIsReversed) == 0x000000, "Member 'WBP_ModernMenu_ContainerInventory_MainContent_C_BndEvt__WBP_ModernMenu_ContainerInventory_MainContent_inv_filter_K2Node_ComponentBoundEvent_1_OnIsReversedUpdated__DelegateSignature::bIsReversed' has a wrong offset!");

// Function WBP_ModernMenu_ContainerInventory_MainContent.WBP_ModernMenu_ContainerInventory_MainContent_C.ExecuteUbergraph_WBP_ModernMenu_ContainerInventory_MainContent
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_ModernMenu_ContainerInventory_MainContent_C_ExecuteUbergraph_WBP_ModernMenu_ContainerInventory_MainContent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_ComponentBoundEvent_SelectedItem_1;         // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EOriginalInventoryMenuSortType                K2Node_ComponentBoundEvent_SortType;               // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsReversed;            // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_ComponentBoundEvent_HoveredItem_1;          // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate_1;          // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              K2Node_CustomEvent_bNewInputType;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53[0x5];                                       // 0x0053(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_ComponentBoundEvent_HoveredItem;            // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_ComponentBoundEvent_SelectedItem;           // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVNavigableListView*                    CallFunc_GetActiveListView_ListView;               // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_ComponentBoundEvent_NewParam;               // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_IsHovered;              // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool IsEmpty)>                 K2Node_CreateDelegate_OutputDelegate_2;            // 0x0074(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsEmpty;                        // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_86[0x2];                                       // 0x0086(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UVUINavigationGlobalSubsystem*          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IVEnhancedInputNavigable> CallFunc_NavigateToWidget_Widget_CastInput;     // 0x0090(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_ContainerInventory_MainContent_C_ExecuteUbergraph_WBP_ModernMenu_ContainerInventory_MainContent) == 0x000008, "Wrong alignment on WBP_ModernMenu_ContainerInventory_MainContent_C_ExecuteUbergraph_WBP_ModernMenu_ContainerInventory_MainContent");
static_assert(sizeof(WBP_ModernMenu_ContainerInventory_MainContent_C_ExecuteUbergraph_WBP_ModernMenu_ContainerInventory_MainContent) == 0x0000B0, "Wrong size on WBP_ModernMenu_ContainerInventory_MainContent_C_ExecuteUbergraph_WBP_ModernMenu_ContainerInventory_MainContent");
static_assert(offsetof(WBP_ModernMenu_ContainerInventory_MainContent_C_ExecuteUbergraph_WBP_ModernMenu_ContainerInventory_MainContent, EntryPoint) == 0x000000, "Member 'WBP_ModernMenu_ContainerInventory_MainContent_C_ExecuteUbergraph_WBP_ModernMenu_ContainerInventory_MainContent::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_ContainerInventory_MainContent_C_ExecuteUbergraph_WBP_ModernMenu_ContainerInventory_MainContent, Temp_byte_Variable) == 0x000004, "Member 'WBP_ModernMenu_ContainerInventory_MainContent_C_ExecuteUbergraph_WBP_ModernMenu_ContainerInventory_MainContent::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_ContainerInventory_MainContent_C_ExecuteUbergraph_WBP_ModernMenu_ContainerInventory_MainContent, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000008, "Member 'WBP_ModernMenu_ContainerInventory_MainContent_C_ExecuteUbergraph_WBP_ModernMenu_ContainerInventory_MainContent::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_ContainerInventory_MainContent_C_ExecuteUbergraph_WBP_ModernMenu_ContainerInventory_MainContent, CallFunc_GetCurrentInputType_ReturnValue) == 0x000010, "Member 'WBP_ModernMenu_ContainerInventory_MainContent_C_ExecuteUbergraph_WBP_ModernMenu_ContainerInventory_MainContent::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_ContainerInventory_MainContent_C_ExecuteUbergraph_WBP_ModernMenu_ContainerInventory_MainContent, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000011, "Member 'WBP_ModernMenu_ContainerInventory_MainContent_C_ExecuteUbergraph_WBP_ModernMenu_ContainerInventory_MainContent::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_ContainerInventory_MainContent_C_ExecuteUbergraph_WBP_ModernMenu_ContainerInventory_MainContent, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'WBP_ModernMenu_ContainerInventory_MainContent_C_ExecuteUbergraph_WBP_ModernMenu_ContainerInventory_MainContent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_ContainerInventory_MainContent_C_ExecuteUbergraph_WBP_ModernMenu_ContainerInventory_MainContent, K2Node_ComponentBoundEvent_SelectedItem_1) == 0x000028, "Member 'WBP_ModernMenu_ContainerInventory_MainContent_C_ExecuteUbergraph_WBP_ModernMenu_ContainerInventory_MainContent::K2Node_ComponentBoundEvent_SelectedItem_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_ContainerInventory_MainContent_C_ExecuteUbergraph_WBP_ModernMenu_ContainerInventory_MainContent, K2Node_ComponentBoundEvent_SortType) == 0x000030, "Member 'WBP_ModernMenu_ContainerInventory_MainContent_C_ExecuteUbergraph_WBP_ModernMenu_ContainerInventory_MainContent::K2Node_ComponentBoundEvent_SortType' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_ContainerInventory_MainContent_C_ExecuteUbergraph_WBP_ModernMenu_ContainerInventory_MainContent, K2Node_ComponentBoundEvent_bIsReversed) == 0x000031, "Member 'WBP_ModernMenu_ContainerInventory_MainContent_C_ExecuteUbergraph_WBP_ModernMenu_ContainerInventory_MainContent::K2Node_ComponentBoundEvent_bIsReversed' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_ContainerInventory_MainContent_C_ExecuteUbergraph_WBP_ModernMenu_ContainerInventory_MainContent, K2Node_ComponentBoundEvent_HoveredItem_1) == 0x000038, "Member 'WBP_ModernMenu_ContainerInventory_MainContent_C_ExecuteUbergraph_WBP_ModernMenu_ContainerInventory_MainContent::K2Node_ComponentBoundEvent_HoveredItem_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_ContainerInventory_MainContent_C_ExecuteUbergraph_WBP_ModernMenu_ContainerInventory_MainContent, K2Node_CreateDelegate_OutputDelegate_1) == 0x000040, "Member 'WBP_ModernMenu_ContainerInventory_MainContent_C_ExecuteUbergraph_WBP_ModernMenu_ContainerInventory_MainContent::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_ContainerInventory_MainContent_C_ExecuteUbergraph_WBP_ModernMenu_ContainerInventory_MainContent, K2Node_CustomEvent_bNewInputType) == 0x000050, "Member 'WBP_ModernMenu_ContainerInventory_MainContent_C_ExecuteUbergraph_WBP_ModernMenu_ContainerInventory_MainContent::K2Node_CustomEvent_bNewInputType' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_ContainerInventory_MainContent_C_ExecuteUbergraph_WBP_ModernMenu_ContainerInventory_MainContent, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000051, "Member 'WBP_ModernMenu_ContainerInventory_MainContent_C_ExecuteUbergraph_WBP_ModernMenu_ContainerInventory_MainContent::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_ContainerInventory_MainContent_C_ExecuteUbergraph_WBP_ModernMenu_ContainerInventory_MainContent, Temp_byte_Variable_1) == 0x000052, "Member 'WBP_ModernMenu_ContainerInventory_MainContent_C_ExecuteUbergraph_WBP_ModernMenu_ContainerInventory_MainContent::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_ContainerInventory_MainContent_C_ExecuteUbergraph_WBP_ModernMenu_ContainerInventory_MainContent, K2Node_ComponentBoundEvent_HoveredItem) == 0x000058, "Member 'WBP_ModernMenu_ContainerInventory_MainContent_C_ExecuteUbergraph_WBP_ModernMenu_ContainerInventory_MainContent::K2Node_ComponentBoundEvent_HoveredItem' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_ContainerInventory_MainContent_C_ExecuteUbergraph_WBP_ModernMenu_ContainerInventory_MainContent, K2Node_ComponentBoundEvent_SelectedItem) == 0x000060, "Member 'WBP_ModernMenu_ContainerInventory_MainContent_C_ExecuteUbergraph_WBP_ModernMenu_ContainerInventory_MainContent::K2Node_ComponentBoundEvent_SelectedItem' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_ContainerInventory_MainContent_C_ExecuteUbergraph_WBP_ModernMenu_ContainerInventory_MainContent, CallFunc_GetActiveListView_ListView) == 0x000068, "Member 'WBP_ModernMenu_ContainerInventory_MainContent_C_ExecuteUbergraph_WBP_ModernMenu_ContainerInventory_MainContent::CallFunc_GetActiveListView_ListView' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_ContainerInventory_MainContent_C_ExecuteUbergraph_WBP_ModernMenu_ContainerInventory_MainContent, K2Node_ComponentBoundEvent_NewParam) == 0x000070, "Member 'WBP_ModernMenu_ContainerInventory_MainContent_C_ExecuteUbergraph_WBP_ModernMenu_ContainerInventory_MainContent::K2Node_ComponentBoundEvent_NewParam' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_ContainerInventory_MainContent_C_ExecuteUbergraph_WBP_ModernMenu_ContainerInventory_MainContent, Temp_bool_Variable) == 0x000071, "Member 'WBP_ModernMenu_ContainerInventory_MainContent_C_ExecuteUbergraph_WBP_ModernMenu_ContainerInventory_MainContent::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_ContainerInventory_MainContent_C_ExecuteUbergraph_WBP_ModernMenu_ContainerInventory_MainContent, K2Node_Select_Default) == 0x000072, "Member 'WBP_ModernMenu_ContainerInventory_MainContent_C_ExecuteUbergraph_WBP_ModernMenu_ContainerInventory_MainContent::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_ContainerInventory_MainContent_C_ExecuteUbergraph_WBP_ModernMenu_ContainerInventory_MainContent, K2Node_ComponentBoundEvent_IsHovered) == 0x000073, "Member 'WBP_ModernMenu_ContainerInventory_MainContent_C_ExecuteUbergraph_WBP_ModernMenu_ContainerInventory_MainContent::K2Node_ComponentBoundEvent_IsHovered' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_ContainerInventory_MainContent_C_ExecuteUbergraph_WBP_ModernMenu_ContainerInventory_MainContent, K2Node_CreateDelegate_OutputDelegate_2) == 0x000074, "Member 'WBP_ModernMenu_ContainerInventory_MainContent_C_ExecuteUbergraph_WBP_ModernMenu_ContainerInventory_MainContent::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_ContainerInventory_MainContent_C_ExecuteUbergraph_WBP_ModernMenu_ContainerInventory_MainContent, K2Node_CustomEvent_IsEmpty) == 0x000084, "Member 'WBP_ModernMenu_ContainerInventory_MainContent_C_ExecuteUbergraph_WBP_ModernMenu_ContainerInventory_MainContent::K2Node_CustomEvent_IsEmpty' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_ContainerInventory_MainContent_C_ExecuteUbergraph_WBP_ModernMenu_ContainerInventory_MainContent, CallFunc_Not_PreBool_ReturnValue) == 0x000085, "Member 'WBP_ModernMenu_ContainerInventory_MainContent_C_ExecuteUbergraph_WBP_ModernMenu_ContainerInventory_MainContent::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_ContainerInventory_MainContent_C_ExecuteUbergraph_WBP_ModernMenu_ContainerInventory_MainContent, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000088, "Member 'WBP_ModernMenu_ContainerInventory_MainContent_C_ExecuteUbergraph_WBP_ModernMenu_ContainerInventory_MainContent::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_ContainerInventory_MainContent_C_ExecuteUbergraph_WBP_ModernMenu_ContainerInventory_MainContent, CallFunc_NavigateToWidget_Widget_CastInput) == 0x000090, "Member 'WBP_ModernMenu_ContainerInventory_MainContent_C_ExecuteUbergraph_WBP_ModernMenu_ContainerInventory_MainContent::CallFunc_NavigateToWidget_Widget_CastInput' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_ContainerInventory_MainContent_C_ExecuteUbergraph_WBP_ModernMenu_ContainerInventory_MainContent, CallFunc_GetLocalPlayerSubsystem_ReturnValue_1) == 0x0000A0, "Member 'WBP_ModernMenu_ContainerInventory_MainContent_C_ExecuteUbergraph_WBP_ModernMenu_ContainerInventory_MainContent::CallFunc_GetLocalPlayerSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_ContainerInventory_MainContent_C_ExecuteUbergraph_WBP_ModernMenu_ContainerInventory_MainContent, CallFunc_Not_PreBool_ReturnValue_1) == 0x0000A8, "Member 'WBP_ModernMenu_ContainerInventory_MainContent_C_ExecuteUbergraph_WBP_ModernMenu_ContainerInventory_MainContent::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");

// Function WBP_ModernMenu_ContainerInventory_MainContent.WBP_ModernMenu_ContainerInventory_MainContent_C.GetCurrentItem
// 0x0028 (0x0028 - 0x0000)
struct WBP_ModernMenu_ContainerInventory_MainContent_C_GetCurrentItem final
{
public:
	class UObject*                                CurrentItem;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVNavigableListView*                    Local_ListView;                                    // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVNavigableListView*                    CallFunc_GetActiveListView_ListView;               // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCurrentElementIndex_ReturnValue;       // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetItemAt_ReturnValue;                    // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_ContainerInventory_MainContent_C_GetCurrentItem) == 0x000008, "Wrong alignment on WBP_ModernMenu_ContainerInventory_MainContent_C_GetCurrentItem");
static_assert(sizeof(WBP_ModernMenu_ContainerInventory_MainContent_C_GetCurrentItem) == 0x000028, "Wrong size on WBP_ModernMenu_ContainerInventory_MainContent_C_GetCurrentItem");
static_assert(offsetof(WBP_ModernMenu_ContainerInventory_MainContent_C_GetCurrentItem, CurrentItem) == 0x000000, "Member 'WBP_ModernMenu_ContainerInventory_MainContent_C_GetCurrentItem::CurrentItem' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_ContainerInventory_MainContent_C_GetCurrentItem, Local_ListView) == 0x000008, "Member 'WBP_ModernMenu_ContainerInventory_MainContent_C_GetCurrentItem::Local_ListView' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_ContainerInventory_MainContent_C_GetCurrentItem, CallFunc_GetActiveListView_ListView) == 0x000010, "Member 'WBP_ModernMenu_ContainerInventory_MainContent_C_GetCurrentItem::CallFunc_GetActiveListView_ListView' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_ContainerInventory_MainContent_C_GetCurrentItem, CallFunc_GetCurrentElementIndex_ReturnValue) == 0x000018, "Member 'WBP_ModernMenu_ContainerInventory_MainContent_C_GetCurrentItem::CallFunc_GetCurrentElementIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_ContainerInventory_MainContent_C_GetCurrentItem, CallFunc_GetItemAt_ReturnValue) == 0x000020, "Member 'WBP_ModernMenu_ContainerInventory_MainContent_C_GetCurrentItem::CallFunc_GetItemAt_ReturnValue' has a wrong offset!");

// Function WBP_ModernMenu_ContainerInventory_MainContent.WBP_ModernMenu_ContainerInventory_MainContent_C.GetEnabledFilterEnumsForGivenPage
// 0x0070 (0x0070 - 0x0000)
struct WBP_ModernMenu_ContainerInventory_MainContent_C_GetEnabledFilterEnumsForGivenPage final
{
public:
	ELegacyInventoryMenuPage                      Page;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EOriginalInventoryMenuSortType>        EnabledFilterEnums;                                // 0x0008(0x0010)(Parm, OutParm)
	TArray<EOriginalInventoryMenuSortType>        K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ReferenceParm)
	TArray<EOriginalInventoryMenuSortType>        K2Node_MakeArray_Array_1;                          // 0x0028(0x0010)(ReferenceParm)
	TArray<EOriginalInventoryMenuSortType>        K2Node_MakeArray_Array_2;                          // 0x0038(0x0010)(ReferenceParm)
	TArray<EOriginalInventoryMenuSortType>        K2Node_MakeArray_Array_3;                          // 0x0048(0x0010)(ReferenceParm)
	TArray<EOriginalInventoryMenuSortType>        K2Node_MakeArray_Array_4;                          // 0x0058(0x0010)(ReferenceParm)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_ContainerInventory_MainContent_C_GetEnabledFilterEnumsForGivenPage) == 0x000008, "Wrong alignment on WBP_ModernMenu_ContainerInventory_MainContent_C_GetEnabledFilterEnumsForGivenPage");
static_assert(sizeof(WBP_ModernMenu_ContainerInventory_MainContent_C_GetEnabledFilterEnumsForGivenPage) == 0x000070, "Wrong size on WBP_ModernMenu_ContainerInventory_MainContent_C_GetEnabledFilterEnumsForGivenPage");
static_assert(offsetof(WBP_ModernMenu_ContainerInventory_MainContent_C_GetEnabledFilterEnumsForGivenPage, Page) == 0x000000, "Member 'WBP_ModernMenu_ContainerInventory_MainContent_C_GetEnabledFilterEnumsForGivenPage::Page' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_ContainerInventory_MainContent_C_GetEnabledFilterEnumsForGivenPage, EnabledFilterEnums) == 0x000008, "Member 'WBP_ModernMenu_ContainerInventory_MainContent_C_GetEnabledFilterEnumsForGivenPage::EnabledFilterEnums' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_ContainerInventory_MainContent_C_GetEnabledFilterEnumsForGivenPage, K2Node_MakeArray_Array) == 0x000018, "Member 'WBP_ModernMenu_ContainerInventory_MainContent_C_GetEnabledFilterEnumsForGivenPage::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_ContainerInventory_MainContent_C_GetEnabledFilterEnumsForGivenPage, K2Node_MakeArray_Array_1) == 0x000028, "Member 'WBP_ModernMenu_ContainerInventory_MainContent_C_GetEnabledFilterEnumsForGivenPage::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_ContainerInventory_MainContent_C_GetEnabledFilterEnumsForGivenPage, K2Node_MakeArray_Array_2) == 0x000038, "Member 'WBP_ModernMenu_ContainerInventory_MainContent_C_GetEnabledFilterEnumsForGivenPage::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_ContainerInventory_MainContent_C_GetEnabledFilterEnumsForGivenPage, K2Node_MakeArray_Array_3) == 0x000048, "Member 'WBP_ModernMenu_ContainerInventory_MainContent_C_GetEnabledFilterEnumsForGivenPage::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_ContainerInventory_MainContent_C_GetEnabledFilterEnumsForGivenPage, K2Node_MakeArray_Array_4) == 0x000058, "Member 'WBP_ModernMenu_ContainerInventory_MainContent_C_GetEnabledFilterEnumsForGivenPage::K2Node_MakeArray_Array_4' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_ContainerInventory_MainContent_C_GetEnabledFilterEnumsForGivenPage, K2Node_SwitchEnum_CmpSuccess) == 0x000068, "Member 'WBP_ModernMenu_ContainerInventory_MainContent_C_GetEnabledFilterEnumsForGivenPage::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_ModernMenu_ContainerInventory_MainContent.WBP_ModernMenu_ContainerInventory_MainContent_C.InitContainerType
// 0x0010 (0x0010 - 0x0000)
struct WBP_ModernMenu_ContainerInventory_MainContent_C_InitContainerType final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default;                             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_ContainerInventory_MainContent_C_InitContainerType) == 0x000008, "Wrong alignment on WBP_ModernMenu_ContainerInventory_MainContent_C_InitContainerType");
static_assert(sizeof(WBP_ModernMenu_ContainerInventory_MainContent_C_InitContainerType) == 0x000010, "Wrong size on WBP_ModernMenu_ContainerInventory_MainContent_C_InitContainerType");
static_assert(offsetof(WBP_ModernMenu_ContainerInventory_MainContent_C_InitContainerType, Temp_bool_Variable) == 0x000000, "Member 'WBP_ModernMenu_ContainerInventory_MainContent_C_InitContainerType::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_ContainerInventory_MainContent_C_InitContainerType, K2Node_Select_Default) == 0x000008, "Member 'WBP_ModernMenu_ContainerInventory_MainContent_C_InitContainerType::K2Node_Select_Default' has a wrong offset!");

// Function WBP_ModernMenu_ContainerInventory_MainContent.WBP_ModernMenu_ContainerInventory_MainContent_C.OnInputMethodChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_ModernMenu_ContainerInventory_MainContent_C_OnInputMethodChanged final
{
public:
	ECommonInputType                              bNewInputType;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_ContainerInventory_MainContent_C_OnInputMethodChanged) == 0x000001, "Wrong alignment on WBP_ModernMenu_ContainerInventory_MainContent_C_OnInputMethodChanged");
static_assert(sizeof(WBP_ModernMenu_ContainerInventory_MainContent_C_OnInputMethodChanged) == 0x000001, "Wrong size on WBP_ModernMenu_ContainerInventory_MainContent_C_OnInputMethodChanged");
static_assert(offsetof(WBP_ModernMenu_ContainerInventory_MainContent_C_OnInputMethodChanged, bNewInputType) == 0x000000, "Member 'WBP_ModernMenu_ContainerInventory_MainContent_C_OnInputMethodChanged::bNewInputType' has a wrong offset!");

// Function WBP_ModernMenu_ContainerInventory_MainContent.WBP_ModernMenu_ContainerInventory_MainContent_C.OnListViewUpdatedEvent
// 0x0001 (0x0001 - 0x0000)
struct WBP_ModernMenu_ContainerInventory_MainContent_C_OnListViewUpdatedEvent final
{
public:
	bool                                          IsEmpty;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_ContainerInventory_MainContent_C_OnListViewUpdatedEvent) == 0x000001, "Wrong alignment on WBP_ModernMenu_ContainerInventory_MainContent_C_OnListViewUpdatedEvent");
static_assert(sizeof(WBP_ModernMenu_ContainerInventory_MainContent_C_OnListViewUpdatedEvent) == 0x000001, "Wrong size on WBP_ModernMenu_ContainerInventory_MainContent_C_OnListViewUpdatedEvent");
static_assert(offsetof(WBP_ModernMenu_ContainerInventory_MainContent_C_OnListViewUpdatedEvent, IsEmpty) == 0x000000, "Member 'WBP_ModernMenu_ContainerInventory_MainContent_C_OnListViewUpdatedEvent::IsEmpty' has a wrong offset!");

// Function WBP_ModernMenu_ContainerInventory_MainContent.WBP_ModernMenu_ContainerInventory_MainContent_C.SetAlphabeticalIconVisibility
// 0x0001 (0x0001 - 0x0000)
struct WBP_ModernMenu_ContainerInventory_MainContent_C_SetAlphabeticalIconVisibility final
{
public:
	ESlateVisibility                              NewVisibility;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_ContainerInventory_MainContent_C_SetAlphabeticalIconVisibility) == 0x000001, "Wrong alignment on WBP_ModernMenu_ContainerInventory_MainContent_C_SetAlphabeticalIconVisibility");
static_assert(sizeof(WBP_ModernMenu_ContainerInventory_MainContent_C_SetAlphabeticalIconVisibility) == 0x000001, "Wrong size on WBP_ModernMenu_ContainerInventory_MainContent_C_SetAlphabeticalIconVisibility");
static_assert(offsetof(WBP_ModernMenu_ContainerInventory_MainContent_C_SetAlphabeticalIconVisibility, NewVisibility) == 0x000000, "Member 'WBP_ModernMenu_ContainerInventory_MainContent_C_SetAlphabeticalIconVisibility::NewVisibility' has a wrong offset!");

// Function WBP_ModernMenu_ContainerInventory_MainContent.WBP_ModernMenu_ContainerInventory_MainContent_C.SetFilterVisibility
// 0x0018 (0x0018 - 0x0000)
struct WBP_ModernMenu_ContainerInventory_MainContent_C_SetFilterVisibility final
{
public:
	ESlateVisibility                              NewVisibility;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bForce;                                            // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_ContainerInventory_MainContent_C_SetFilterVisibility) == 0x000008, "Wrong alignment on WBP_ModernMenu_ContainerInventory_MainContent_C_SetFilterVisibility");
static_assert(sizeof(WBP_ModernMenu_ContainerInventory_MainContent_C_SetFilterVisibility) == 0x000018, "Wrong size on WBP_ModernMenu_ContainerInventory_MainContent_C_SetFilterVisibility");
static_assert(offsetof(WBP_ModernMenu_ContainerInventory_MainContent_C_SetFilterVisibility, NewVisibility) == 0x000000, "Member 'WBP_ModernMenu_ContainerInventory_MainContent_C_SetFilterVisibility::NewVisibility' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_ContainerInventory_MainContent_C_SetFilterVisibility, bForce) == 0x000001, "Member 'WBP_ModernMenu_ContainerInventory_MainContent_C_SetFilterVisibility::bForce' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_ContainerInventory_MainContent_C_SetFilterVisibility, CallFunc_Not_PreBool_ReturnValue) == 0x000002, "Member 'WBP_ModernMenu_ContainerInventory_MainContent_C_SetFilterVisibility::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_ContainerInventory_MainContent_C_SetFilterVisibility, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000008, "Member 'WBP_ModernMenu_ContainerInventory_MainContent_C_SetFilterVisibility::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_ContainerInventory_MainContent_C_SetFilterVisibility, CallFunc_GetCurrentInputType_ReturnValue) == 0x000010, "Member 'WBP_ModernMenu_ContainerInventory_MainContent_C_SetFilterVisibility::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_ContainerInventory_MainContent_C_SetFilterVisibility, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000011, "Member 'WBP_ModernMenu_ContainerInventory_MainContent_C_SetFilterVisibility::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_ContainerInventory_MainContent_C_SetFilterVisibility, CallFunc_BooleanAND_ReturnValue) == 0x000012, "Member 'WBP_ModernMenu_ContainerInventory_MainContent_C_SetFilterVisibility::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_ModernMenu_ContainerInventory_MainContent.WBP_ModernMenu_ContainerInventory_MainContent_C.SetTitle
// 0x0020 (0x0020 - 0x0000)
struct WBP_ModernMenu_ContainerInventory_MainContent_C_SetTitle final
{
public:
	class FText                                   Title;                                             // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_ContainerInventory_MainContent_C_SetTitle) == 0x000008, "Wrong alignment on WBP_ModernMenu_ContainerInventory_MainContent_C_SetTitle");
static_assert(sizeof(WBP_ModernMenu_ContainerInventory_MainContent_C_SetTitle) == 0x000020, "Wrong size on WBP_ModernMenu_ContainerInventory_MainContent_C_SetTitle");
static_assert(offsetof(WBP_ModernMenu_ContainerInventory_MainContent_C_SetTitle, Title) == 0x000000, "Member 'WBP_ModernMenu_ContainerInventory_MainContent_C_SetTitle::Title' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_ContainerInventory_MainContent_C_SetTitle, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'WBP_ModernMenu_ContainerInventory_MainContent_C_SetTitle::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_ModernMenu_ContainerInventory_MainContent.WBP_ModernMenu_ContainerInventory_MainContent_C.UpdateFilterFocus
// 0x0058 (0x0058 - 0x0000)
struct WBP_ModernMenu_ContainerInventory_MainContent_C_UpdateFilterFocus final
{
public:
	bool                                          InIsFilterFocused;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVUINavigationGlobalSubsystem*          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IVEnhancedInputNavigable> CallFunc_NavigateToWidget_Widget_CastInput;     // 0x0020(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsFocussed_ReturnValue;                // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UVUINavigationGlobalSubsystem*          CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IVEnhancedInputNavigable> CallFunc_NavigateToWidget_Widget_CastInput_1;   // 0x0040(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_ContainerInventory_MainContent_C_UpdateFilterFocus) == 0x000008, "Wrong alignment on WBP_ModernMenu_ContainerInventory_MainContent_C_UpdateFilterFocus");
static_assert(sizeof(WBP_ModernMenu_ContainerInventory_MainContent_C_UpdateFilterFocus) == 0x000058, "Wrong size on WBP_ModernMenu_ContainerInventory_MainContent_C_UpdateFilterFocus");
static_assert(offsetof(WBP_ModernMenu_ContainerInventory_MainContent_C_UpdateFilterFocus, InIsFilterFocused) == 0x000000, "Member 'WBP_ModernMenu_ContainerInventory_MainContent_C_UpdateFilterFocus::InIsFilterFocused' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_ContainerInventory_MainContent_C_UpdateFilterFocus, Temp_byte_Variable) == 0x000001, "Member 'WBP_ModernMenu_ContainerInventory_MainContent_C_UpdateFilterFocus::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_ContainerInventory_MainContent_C_UpdateFilterFocus, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000008, "Member 'WBP_ModernMenu_ContainerInventory_MainContent_C_UpdateFilterFocus::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_ContainerInventory_MainContent_C_UpdateFilterFocus, CallFunc_GetCurrentInputType_ReturnValue) == 0x000010, "Member 'WBP_ModernMenu_ContainerInventory_MainContent_C_UpdateFilterFocus::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_ContainerInventory_MainContent_C_UpdateFilterFocus, Temp_byte_Variable_1) == 0x000011, "Member 'WBP_ModernMenu_ContainerInventory_MainContent_C_UpdateFilterFocus::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_ContainerInventory_MainContent_C_UpdateFilterFocus, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000012, "Member 'WBP_ModernMenu_ContainerInventory_MainContent_C_UpdateFilterFocus::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_ContainerInventory_MainContent_C_UpdateFilterFocus, Temp_bool_Variable) == 0x000013, "Member 'WBP_ModernMenu_ContainerInventory_MainContent_C_UpdateFilterFocus::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_ContainerInventory_MainContent_C_UpdateFilterFocus, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000018, "Member 'WBP_ModernMenu_ContainerInventory_MainContent_C_UpdateFilterFocus::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_ContainerInventory_MainContent_C_UpdateFilterFocus, CallFunc_NavigateToWidget_Widget_CastInput) == 0x000020, "Member 'WBP_ModernMenu_ContainerInventory_MainContent_C_UpdateFilterFocus::CallFunc_NavigateToWidget_Widget_CastInput' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_ContainerInventory_MainContent_C_UpdateFilterFocus, K2Node_Select_Default) == 0x000030, "Member 'WBP_ModernMenu_ContainerInventory_MainContent_C_UpdateFilterFocus::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_ContainerInventory_MainContent_C_UpdateFilterFocus, CallFunc_GetIsFocussed_ReturnValue) == 0x000031, "Member 'WBP_ModernMenu_ContainerInventory_MainContent_C_UpdateFilterFocus::CallFunc_GetIsFocussed_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_ContainerInventory_MainContent_C_UpdateFilterFocus, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000038, "Member 'WBP_ModernMenu_ContainerInventory_MainContent_C_UpdateFilterFocus::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_ContainerInventory_MainContent_C_UpdateFilterFocus, CallFunc_NavigateToWidget_Widget_CastInput_1) == 0x000040, "Member 'WBP_ModernMenu_ContainerInventory_MainContent_C_UpdateFilterFocus::CallFunc_NavigateToWidget_Widget_CastInput_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_ContainerInventory_MainContent_C_UpdateFilterFocus, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000050, "Member 'WBP_ModernMenu_ContainerInventory_MainContent_C_UpdateFilterFocus::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function WBP_ModernMenu_ContainerInventory_MainContent.WBP_ModernMenu_ContainerInventory_MainContent_C.UpdateFiltersToDisplay
// 0x00C0 (0x00C0 - 0x0000)
struct WBP_ModernMenu_ContainerInventory_MainContent_C_UpdateFiltersToDisplay final
{
public:
	ELegacyInventoryMenuPage                      Page;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOriginalInventoryMenuSortType                CurrentSortType;                                   // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOriginalInventoryMenuSortType                NewSortType;                                       // 0x0002(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
