#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModernMenu_StatsPage3

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "EnhancedInput_structs.hpp"
#include "UMG_structs.hpp"
#include "CommonInput_structs.hpp"
#include "Altar_structs.hpp"


namespace SDK::Params
{

// Function WBP_ModernMenu_StatsPage3.WBP_ModernMenu_StatsPage3_C.CreateHeader
// 0x0050 (0x0050 - 0x0000)
struct WBP_ModernMenu_StatsPage3_C_CreateHeader final
{
public:
	bool                                          IsMajorSkill;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ItemIndex;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_ModernMenu_StatsSkillEntry_C*      Local_NewHeader;                                   // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   Local_HeaderText;                                  // 0x0010(0x0018)(Edit, BlueprintVisible)
	class UVLegacyStatsMenuSkillHeader*           Local_NewHeader_temp;                              // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ModernMenu_StatsSkillEntry_C*      CallFunc_SpawnObject_ReturnValue;                  // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_StatsPage3_C_CreateHeader) == 0x000008, "Wrong alignment on WBP_ModernMenu_StatsPage3_C_CreateHeader");
static_assert(sizeof(WBP_ModernMenu_StatsPage3_C_CreateHeader) == 0x000050, "Wrong size on WBP_ModernMenu_StatsPage3_C_CreateHeader");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_CreateHeader, IsMajorSkill) == 0x000000, "Member 'WBP_ModernMenu_StatsPage3_C_CreateHeader::IsMajorSkill' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_CreateHeader, ItemIndex) == 0x000004, "Member 'WBP_ModernMenu_StatsPage3_C_CreateHeader::ItemIndex' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_CreateHeader, Local_NewHeader) == 0x000008, "Member 'WBP_ModernMenu_StatsPage3_C_CreateHeader::Local_NewHeader' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_CreateHeader, Local_HeaderText) == 0x000010, "Member 'WBP_ModernMenu_StatsPage3_C_CreateHeader::Local_HeaderText' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_CreateHeader, Local_NewHeader_temp) == 0x000028, "Member 'WBP_ModernMenu_StatsPage3_C_CreateHeader::Local_NewHeader_temp' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_CreateHeader, CallFunc_AddChild_ReturnValue) == 0x000030, "Member 'WBP_ModernMenu_StatsPage3_C_CreateHeader::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_CreateHeader, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'WBP_ModernMenu_StatsPage3_C_CreateHeader::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_CreateHeader, CallFunc_SpawnObject_ReturnValue) == 0x000040, "Member 'WBP_ModernMenu_StatsPage3_C_CreateHeader::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_CreateHeader, CallFunc_Not_PreBool_ReturnValue) == 0x000048, "Member 'WBP_ModernMenu_StatsPage3_C_CreateHeader::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_CreateHeader, CallFunc_BooleanAND_ReturnValue) == 0x000049, "Member 'WBP_ModernMenu_StatsPage3_C_CreateHeader::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_CreateHeader, CallFunc_Less_IntInt_ReturnValue_1) == 0x00004A, "Member 'WBP_ModernMenu_StatsPage3_C_CreateHeader::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_CreateHeader, CallFunc_BooleanAND_ReturnValue_1) == 0x00004B, "Member 'WBP_ModernMenu_StatsPage3_C_CreateHeader::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function WBP_ModernMenu_StatsPage3.WBP_ModernMenu_StatsPage3_C.DoScroll
// 0x0038 (0x0038 - 0x0000)
struct WBP_ModernMenu_StatsPage3_C_DoScroll final
{
public:
	double                                        ScrollDelta;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScrollOffset_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScrollOffsetOfEnd_ReturnValue;         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_Max_ImplicitCast;                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScrollOffset_NewScrollOffset_ImplicitCast; // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_StatsPage3_C_DoScroll) == 0x000008, "Wrong alignment on WBP_ModernMenu_StatsPage3_C_DoScroll");
static_assert(sizeof(WBP_ModernMenu_StatsPage3_C_DoScroll) == 0x000038, "Wrong size on WBP_ModernMenu_StatsPage3_C_DoScroll");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_DoScroll, ScrollDelta) == 0x000000, "Member 'WBP_ModernMenu_StatsPage3_C_DoScroll::ScrollDelta' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_DoScroll, CallFunc_GetScrollOffset_ReturnValue) == 0x000008, "Member 'WBP_ModernMenu_StatsPage3_C_DoScroll::CallFunc_GetScrollOffset_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_DoScroll, CallFunc_GetScrollOffsetOfEnd_ReturnValue) == 0x00000C, "Member 'WBP_ModernMenu_StatsPage3_C_DoScroll::CallFunc_GetScrollOffsetOfEnd_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_DoScroll, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000010, "Member 'WBP_ModernMenu_StatsPage3_C_DoScroll::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_DoScroll, CallFunc_FClamp_ReturnValue) == 0x000018, "Member 'WBP_ModernMenu_StatsPage3_C_DoScroll::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_DoScroll, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000020, "Member 'WBP_ModernMenu_StatsPage3_C_DoScroll::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_DoScroll, CallFunc_FClamp_Max_ImplicitCast) == 0x000028, "Member 'WBP_ModernMenu_StatsPage3_C_DoScroll::CallFunc_FClamp_Max_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_DoScroll, CallFunc_SetScrollOffset_NewScrollOffset_ImplicitCast) == 0x000030, "Member 'WBP_ModernMenu_StatsPage3_C_DoScroll::CallFunc_SetScrollOffset_NewScrollOffset_ImplicitCast' has a wrong offset!");

// Function WBP_ModernMenu_StatsPage3.WBP_ModernMenu_StatsPage3_C.ExecuteUbergraph_WBP_ModernMenu_StatsPage3
// 0x01D0 (0x01D0 - 0x0000)
struct WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable;                                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2;                              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              Temp_byte_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable_3;                              // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_4;                              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_5;                              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_6;                              // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVUINavigationGlobalSubsystem*          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B[0x5];                                       // 0x004B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UVUINavigationGlobalSubsystem*          CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue;       // 0x0058(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime;       // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime;     // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction;      // 0x0080(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FLegacyStatsMenuSkillItemProperties> K2Node_CustomEvent_NewSkills;                 // 0x0088(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_0;                              // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1_0;                            // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_InputActionValueToAxis1D_ReturnValue; // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLegacyStatsMenuLevelProgression       K2Node_CustomEvent_NewLevelProgression;            // 0x00B8(0x0008)(NoDestructor)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_CanLevelUp;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLegacyStatsMenuPlayerInfo             K2Node_CustomEvent_PlayerInfos;                    // 0x00D0(0x0070)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate;            // 0x0150(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue; // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              K2Node_CustomEvent_bNewInputType;                  // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16A[0x2];                                      // 0x016A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetEffectMaterial_ReturnValue;            // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IVEnhancedInputNavigable> CallFunc_NavigateToWidget_Widget_CastInput;     // 0x0190(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x01A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A3[0x5];                                      // 0x01A3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IVEnhancedInputNavigable> CallFunc_IsWidgetInTopMostFocusedStack_Widget_CastInput; // 0x01A8(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsWidgetInTopMostFocusedStack_ReturnValue; // 0x01B8(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x01BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BB[0x5];                                      // 0x01BB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast;       // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3) == 0x000008, "Wrong alignment on WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3");
static_assert(sizeof(WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3) == 0x0001D0, "Wrong size on WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3, EntryPoint) == 0x000000, "Member 'WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3, Temp_object_Variable) == 0x000008, "Member 'WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3, Temp_real_Variable) == 0x000010, "Member 'WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3, Temp_real_Variable_1) == 0x000018, "Member 'WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3, Temp_real_Variable_2) == 0x000020, "Member 'WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3, Temp_byte_Variable) == 0x000028, "Member 'WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3, Temp_real_Variable_3) == 0x00002C, "Member 'WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3, Temp_real_Variable_4) == 0x000030, "Member 'WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3::Temp_real_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3, Temp_real_Variable_5) == 0x000034, "Member 'WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3::Temp_real_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3, Temp_real_Variable_6) == 0x000038, "Member 'WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3::Temp_real_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000040, "Member 'WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3, Temp_bool_Variable) == 0x000048, "Member 'WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3, Temp_byte_Variable_1) == 0x000049, "Member 'WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3, Temp_byte_Variable_2) == 0x00004A, "Member 'WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000050, "Member 'WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3, K2Node_EnhancedInputActionEvent_ActionValue) == 0x000058, "Member 'WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3::K2Node_EnhancedInputActionEvent_ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3, K2Node_EnhancedInputActionEvent_ElapsedTime) == 0x000078, "Member 'WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3::K2Node_EnhancedInputActionEvent_ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3, K2Node_EnhancedInputActionEvent_TriggeredTime) == 0x00007C, "Member 'WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3::K2Node_EnhancedInputActionEvent_TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3, K2Node_EnhancedInputActionEvent_SourceAction) == 0x000080, "Member 'WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3::K2Node_EnhancedInputActionEvent_SourceAction' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3, K2Node_CustomEvent_NewSkills) == 0x000088, "Member 'WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3::K2Node_CustomEvent_NewSkills' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3, CallFunc_Array_Length_ReturnValue) == 0x000098, "Member 'WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3, CallFunc_Greater_IntInt_ReturnValue) == 0x00009C, "Member 'WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3, Temp_real_Variable_0) == 0x0000A0, "Member 'WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3::Temp_real_Variable_0' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3, Temp_real_Variable_1_0) == 0x0000A8, "Member 'WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3::Temp_real_Variable_1_0' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3, CallFunc_Conv_InputActionValueToAxis1D_ReturnValue) == 0x0000B0, "Member 'WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3::CallFunc_Conv_InputActionValueToAxis1D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3, K2Node_CustomEvent_NewLevelProgression) == 0x0000B8, "Member 'WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3::K2Node_CustomEvent_NewLevelProgression' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x0000C0, "Member 'WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3, K2Node_CustomEvent_CanLevelUp) == 0x0000C8, "Member 'WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3::K2Node_CustomEvent_CanLevelUp' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3, K2Node_CustomEvent_PlayerInfos) == 0x0000D0, "Member 'WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3::K2Node_CustomEvent_PlayerInfos' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3, CallFunc_PlayAnimation_ReturnValue) == 0x000140, "Member 'WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3, CallFunc_GetPlayerController_ReturnValue) == 0x000148, "Member 'WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3, K2Node_CreateDelegate_OutputDelegate) == 0x000150, "Member 'WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3, CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue) == 0x000160, "Member 'WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3::CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3, K2Node_CustomEvent_bNewInputType) == 0x000168, "Member 'WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3::K2Node_CustomEvent_bNewInputType' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000169, "Member 'WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3, K2Node_Select_Default) == 0x00016C, "Member 'WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3, K2Node_Select_Default_1) == 0x000170, "Member 'WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000178, "Member 'WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000180, "Member 'WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3, CallFunc_GetEffectMaterial_ReturnValue) == 0x000188, "Member 'WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3::CallFunc_GetEffectMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3, CallFunc_NavigateToWidget_Widget_CastInput) == 0x000190, "Member 'WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3::CallFunc_NavigateToWidget_Widget_CastInput' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3, Temp_byte_Variable_3) == 0x0001A0, "Member 'WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3, Temp_byte_Variable_4) == 0x0001A1, "Member 'WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3, Temp_bool_Variable_1) == 0x0001A2, "Member 'WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3, CallFunc_IsWidgetInTopMostFocusedStack_Widget_CastInput) == 0x0001A8, "Member 'WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3::CallFunc_IsWidgetInTopMostFocusedStack_Widget_CastInput' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3, CallFunc_IsWidgetInTopMostFocusedStack_ReturnValue) == 0x0001B8, "Member 'WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3::CallFunc_IsWidgetInTopMostFocusedStack_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3, CallFunc_BooleanAND_ReturnValue) == 0x0001B9, "Member 'WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3, K2Node_Select_Default_2) == 0x0001BA, "Member 'WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3, CallFunc_Divide_DoubleDouble_B_ImplicitCast) == 0x0001C0, "Member 'WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3::CallFunc_Divide_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x0001C8, "Member 'WBP_ModernMenu_StatsPage3_C_ExecuteUbergraph_WBP_ModernMenu_StatsPage3::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function WBP_ModernMenu_StatsPage3.WBP_ModernMenu_StatsPage3_C.InpActEvt_IA_UI_Specific_StatsMenu_ScrollDetails_K2Node_EnhancedInputActionEvent_0
// 0x0030 (0x0030 - 0x0000)
struct WBP_ModernMenu_StatsPage3_C_InpActEvt_IA_UI_Specific_StatsMenu_ScrollDetails_K2Node_EnhancedInputActionEvent_0 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_StatsPage3_C_InpActEvt_IA_UI_Specific_StatsMenu_ScrollDetails_K2Node_EnhancedInputActionEvent_0) == 0x000008, "Wrong alignment on WBP_ModernMenu_StatsPage3_C_InpActEvt_IA_UI_Specific_StatsMenu_ScrollDetails_K2Node_EnhancedInputActionEvent_0");
static_assert(sizeof(WBP_ModernMenu_StatsPage3_C_InpActEvt_IA_UI_Specific_StatsMenu_ScrollDetails_K2Node_EnhancedInputActionEvent_0) == 0x000030, "Wrong size on WBP_ModernMenu_StatsPage3_C_InpActEvt_IA_UI_Specific_StatsMenu_ScrollDetails_K2Node_EnhancedInputActionEvent_0");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_InpActEvt_IA_UI_Specific_StatsMenu_ScrollDetails_K2Node_EnhancedInputActionEvent_0, ActionValue) == 0x000000, "Member 'WBP_ModernMenu_StatsPage3_C_InpActEvt_IA_UI_Specific_StatsMenu_ScrollDetails_K2Node_EnhancedInputActionEvent_0::ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_InpActEvt_IA_UI_Specific_StatsMenu_ScrollDetails_K2Node_EnhancedInputActionEvent_0, ElapsedTime) == 0x000020, "Member 'WBP_ModernMenu_StatsPage3_C_InpActEvt_IA_UI_Specific_StatsMenu_ScrollDetails_K2Node_EnhancedInputActionEvent_0::ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_InpActEvt_IA_UI_Specific_StatsMenu_ScrollDetails_K2Node_EnhancedInputActionEvent_0, TriggeredTime) == 0x000024, "Member 'WBP_ModernMenu_StatsPage3_C_InpActEvt_IA_UI_Specific_StatsMenu_ScrollDetails_K2Node_EnhancedInputActionEvent_0::TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_InpActEvt_IA_UI_Specific_StatsMenu_ScrollDetails_K2Node_EnhancedInputActionEvent_0, SourceAction) == 0x000028, "Member 'WBP_ModernMenu_StatsPage3_C_InpActEvt_IA_UI_Specific_StatsMenu_ScrollDetails_K2Node_EnhancedInputActionEvent_0::SourceAction' has a wrong offset!");

// Function WBP_ModernMenu_StatsPage3.WBP_ModernMenu_StatsPage3_C.IsDetailsDisplayed
// 0x0001 (0x0001 - 0x0000)
struct WBP_ModernMenu_StatsPage3_C_IsDetailsDisplayed final
{
public:
	bool                                          IsDisplayed;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_StatsPage3_C_IsDetailsDisplayed) == 0x000001, "Wrong alignment on WBP_ModernMenu_StatsPage3_C_IsDetailsDisplayed");
static_assert(sizeof(WBP_ModernMenu_StatsPage3_C_IsDetailsDisplayed) == 0x000001, "Wrong size on WBP_ModernMenu_StatsPage3_C_IsDetailsDisplayed");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_IsDetailsDisplayed, IsDisplayed) == 0x000000, "Member 'WBP_ModernMenu_StatsPage3_C_IsDetailsDisplayed::IsDisplayed' has a wrong offset!");

// Function WBP_ModernMenu_StatsPage3.WBP_ModernMenu_StatsPage3_C.OnFocusSkillEntry
// 0x0010 (0x0010 - 0x0000)
struct WBP_ModernMenu_StatsPage3_C_OnFocusSkillEntry final
{
public:
	class UWBP_ModernMenu_StatsSkillEntry_C*      SkillEntry;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SetModernContent_Progression_ImplicitCast; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_StatsPage3_C_OnFocusSkillEntry) == 0x000008, "Wrong alignment on WBP_ModernMenu_StatsPage3_C_OnFocusSkillEntry");
static_assert(sizeof(WBP_ModernMenu_StatsPage3_C_OnFocusSkillEntry) == 0x000010, "Wrong size on WBP_ModernMenu_StatsPage3_C_OnFocusSkillEntry");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_OnFocusSkillEntry, SkillEntry) == 0x000000, "Member 'WBP_ModernMenu_StatsPage3_C_OnFocusSkillEntry::SkillEntry' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_OnFocusSkillEntry, CallFunc_SetModernContent_Progression_ImplicitCast) == 0x000008, "Member 'WBP_ModernMenu_StatsPage3_C_OnFocusSkillEntry::CallFunc_SetModernContent_Progression_ImplicitCast' has a wrong offset!");

// Function WBP_ModernMenu_StatsPage3.WBP_ModernMenu_StatsPage3_C.OnInputMethodChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_ModernMenu_StatsPage3_C_OnInputMethodChanged final
{
public:
	ECommonInputType                              bNewInputType;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_StatsPage3_C_OnInputMethodChanged) == 0x000001, "Wrong alignment on WBP_ModernMenu_StatsPage3_C_OnInputMethodChanged");
static_assert(sizeof(WBP_ModernMenu_StatsPage3_C_OnInputMethodChanged) == 0x000001, "Wrong size on WBP_ModernMenu_StatsPage3_C_OnInputMethodChanged");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_OnInputMethodChanged, bNewInputType) == 0x000000, "Member 'WBP_ModernMenu_StatsPage3_C_OnInputMethodChanged::bNewInputType' has a wrong offset!");

// Function WBP_ModernMenu_StatsPage3.WBP_ModernMenu_StatsPage3_C.PopulateSkillsListView
// 0x0188 (0x0188 - 0x0000)
struct WBP_ModernMenu_StatsPage3_C_PopulateSkillsListView final
{
public:
	TArray<struct FLegacyStatsMenuSkillItemProperties> NewSkills;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UPanelSlot*                             NewLocalVar;                                       // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_ModernMenu_StatsSkillEntry_C*      Local_NewItem;                                     // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVLegacyStatsMenuSkillItem*             Local_NewItem_temp;                                // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Local_SkillIndex;                                  // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLegacyStatsMenuSkillItemProperties    Local_CurrentSkill;                                // 0x0030(0x0090)(Edit, BlueprintVisible)
	class UWBP_ModernMenu_StatsSkillEntry_C*      CallFunc_SpawnObject_ReturnValue;                  // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_ModernMenu_StatsSkillEntry_C* NewParam)> K2Node_CreateDelegate_OutputDelegate; // 0x00D4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FLegacyStatsMenuSkillItemProperties    CallFunc_Array_Get_Item;                           // 0x00F0(0x0090)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0184(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_StatsPage3_C_PopulateSkillsListView) == 0x000008, "Wrong alignment on WBP_ModernMenu_StatsPage3_C_PopulateSkillsListView");
static_assert(sizeof(WBP_ModernMenu_StatsPage3_C_PopulateSkillsListView) == 0x000188, "Wrong size on WBP_ModernMenu_StatsPage3_C_PopulateSkillsListView");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_PopulateSkillsListView, NewSkills) == 0x000000, "Member 'WBP_ModernMenu_StatsPage3_C_PopulateSkillsListView::NewSkills' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_PopulateSkillsListView, NewLocalVar) == 0x000010, "Member 'WBP_ModernMenu_StatsPage3_C_PopulateSkillsListView::NewLocalVar' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_PopulateSkillsListView, Local_NewItem) == 0x000018, "Member 'WBP_ModernMenu_StatsPage3_C_PopulateSkillsListView::Local_NewItem' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_PopulateSkillsListView, Local_NewItem_temp) == 0x000020, "Member 'WBP_ModernMenu_StatsPage3_C_PopulateSkillsListView::Local_NewItem_temp' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_PopulateSkillsListView, Local_SkillIndex) == 0x000028, "Member 'WBP_ModernMenu_StatsPage3_C_PopulateSkillsListView::Local_SkillIndex' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_PopulateSkillsListView, Local_CurrentSkill) == 0x000030, "Member 'WBP_ModernMenu_StatsPage3_C_PopulateSkillsListView::Local_CurrentSkill' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_PopulateSkillsListView, CallFunc_SpawnObject_ReturnValue) == 0x0000C0, "Member 'WBP_ModernMenu_StatsPage3_C_PopulateSkillsListView::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_PopulateSkillsListView, Temp_int_Array_Index_Variable) == 0x0000C8, "Member 'WBP_ModernMenu_StatsPage3_C_PopulateSkillsListView::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_PopulateSkillsListView, Temp_int_Loop_Counter_Variable) == 0x0000CC, "Member 'WBP_ModernMenu_StatsPage3_C_PopulateSkillsListView::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_PopulateSkillsListView, CallFunc_Add_IntInt_ReturnValue) == 0x0000D0, "Member 'WBP_ModernMenu_StatsPage3_C_PopulateSkillsListView::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_PopulateSkillsListView, K2Node_CreateDelegate_OutputDelegate) == 0x0000D4, "Member 'WBP_ModernMenu_StatsPage3_C_PopulateSkillsListView::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_PopulateSkillsListView, CallFunc_AddChild_ReturnValue) == 0x0000E8, "Member 'WBP_ModernMenu_StatsPage3_C_PopulateSkillsListView::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_PopulateSkillsListView, CallFunc_Array_Get_Item) == 0x0000F0, "Member 'WBP_ModernMenu_StatsPage3_C_PopulateSkillsListView::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_PopulateSkillsListView, CallFunc_Array_Length_ReturnValue) == 0x000180, "Member 'WBP_ModernMenu_StatsPage3_C_PopulateSkillsListView::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_PopulateSkillsListView, CallFunc_Less_IntInt_ReturnValue) == 0x000184, "Member 'WBP_ModernMenu_StatsPage3_C_PopulateSkillsListView::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_ModernMenu_StatsPage3.WBP_ModernMenu_StatsPage3_C.Set Details State
// 0x0009 (0x0009 - 0x0000)
struct WBP_ModernMenu_StatsPage3_C_Set_Details_State final
{
public:
	bool                                          InIsDisplayed;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_StatsPage3_C_Set_Details_State) == 0x000001, "Wrong alignment on WBP_ModernMenu_StatsPage3_C_Set_Details_State");
static_assert(sizeof(WBP_ModernMenu_StatsPage3_C_Set_Details_State) == 0x000009, "Wrong size on WBP_ModernMenu_StatsPage3_C_Set_Details_State");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_Set_Details_State, InIsDisplayed) == 0x000000, "Member 'WBP_ModernMenu_StatsPage3_C_Set_Details_State::InIsDisplayed' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_Set_Details_State, Temp_bool_Variable) == 0x000001, "Member 'WBP_ModernMenu_StatsPage3_C_Set_Details_State::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_Set_Details_State, Temp_byte_Variable) == 0x000002, "Member 'WBP_ModernMenu_StatsPage3_C_Set_Details_State::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_Set_Details_State, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_ModernMenu_StatsPage3_C_Set_Details_State::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_Set_Details_State, Temp_bool_Variable_1) == 0x000004, "Member 'WBP_ModernMenu_StatsPage3_C_Set_Details_State::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_Set_Details_State, Temp_byte_Variable_2) == 0x000005, "Member 'WBP_ModernMenu_StatsPage3_C_Set_Details_State::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_Set_Details_State, Temp_byte_Variable_3) == 0x000006, "Member 'WBP_ModernMenu_StatsPage3_C_Set_Details_State::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_Set_Details_State, K2Node_Select_Default) == 0x000007, "Member 'WBP_ModernMenu_StatsPage3_C_Set_Details_State::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_Set_Details_State, K2Node_Select_Default_1) == 0x000008, "Member 'WBP_ModernMenu_StatsPage3_C_Set_Details_State::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_ModernMenu_StatsPage3.WBP_ModernMenu_StatsPage3_C.Set Scrollbar Input Hint
// 0x0100 (0x0100 - 0x0000)
struct WBP_ModernMenu_StatsPage3_C_Set_Scrollbar_Input_Hint final
{
public:
	class UVAltarUISubsystem*                     CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_TryGetBrushFromKey_OutBrush;              // 0x0010(0x00D0)()
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               K2Node_DynamicCast_AsTexture;                      // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_StatsPage3_C_Set_Scrollbar_Input_Hint) == 0x000010, "Wrong alignment on WBP_ModernMenu_StatsPage3_C_Set_Scrollbar_Input_Hint");
static_assert(sizeof(WBP_ModernMenu_StatsPage3_C_Set_Scrollbar_Input_Hint) == 0x000100, "Wrong size on WBP_ModernMenu_StatsPage3_C_Set_Scrollbar_Input_Hint");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_Set_Scrollbar_Input_Hint, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000000, "Member 'WBP_ModernMenu_StatsPage3_C_Set_Scrollbar_Input_Hint::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_Set_Scrollbar_Input_Hint, CallFunc_TryGetBrushFromKey_OutBrush) == 0x000010, "Member 'WBP_ModernMenu_StatsPage3_C_Set_Scrollbar_Input_Hint::CallFunc_TryGetBrushFromKey_OutBrush' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_Set_Scrollbar_Input_Hint, CallFunc_GetDynamicMaterial_ReturnValue) == 0x0000E0, "Member 'WBP_ModernMenu_StatsPage3_C_Set_Scrollbar_Input_Hint::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_Set_Scrollbar_Input_Hint, K2Node_DynamicCast_AsTexture) == 0x0000E8, "Member 'WBP_ModernMenu_StatsPage3_C_Set_Scrollbar_Input_Hint::K2Node_DynamicCast_AsTexture' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_Set_Scrollbar_Input_Hint, K2Node_DynamicCast_bSuccess) == 0x0000F0, "Member 'WBP_ModernMenu_StatsPage3_C_Set_Scrollbar_Input_Hint::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_ModernMenu_StatsPage3.WBP_ModernMenu_StatsPage3_C.UpdateCanLevelUp
// 0x0001 (0x0001 - 0x0000)
struct WBP_ModernMenu_StatsPage3_C_UpdateCanLevelUp final
{
public:
	bool                                          CanLevelUp;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_StatsPage3_C_UpdateCanLevelUp) == 0x000001, "Wrong alignment on WBP_ModernMenu_StatsPage3_C_UpdateCanLevelUp");
static_assert(sizeof(WBP_ModernMenu_StatsPage3_C_UpdateCanLevelUp) == 0x000001, "Wrong size on WBP_ModernMenu_StatsPage3_C_UpdateCanLevelUp");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_UpdateCanLevelUp, CanLevelUp) == 0x000000, "Member 'WBP_ModernMenu_StatsPage3_C_UpdateCanLevelUp::CanLevelUp' has a wrong offset!");

// Function WBP_ModernMenu_StatsPage3.WBP_ModernMenu_StatsPage3_C.updateLevelProgression
// 0x0008 (0x0008 - 0x0000)
struct WBP_ModernMenu_StatsPage3_C_updateLevelProgression final
{
public:
	struct FLegacyStatsMenuLevelProgression       NewLevelProgression;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_ModernMenu_StatsPage3_C_updateLevelProgression) == 0x000004, "Wrong alignment on WBP_ModernMenu_StatsPage3_C_updateLevelProgression");
static_assert(sizeof(WBP_ModernMenu_StatsPage3_C_updateLevelProgression) == 0x000008, "Wrong size on WBP_ModernMenu_StatsPage3_C_updateLevelProgression");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_updateLevelProgression, NewLevelProgression) == 0x000000, "Member 'WBP_ModernMenu_StatsPage3_C_updateLevelProgression::NewLevelProgression' has a wrong offset!");

// Function WBP_ModernMenu_StatsPage3.WBP_ModernMenu_StatsPage3_C.UpdateLevelTexts
// 0x0038 (0x0038 - 0x0000)
struct WBP_ModernMenu_StatsPage3_C_UpdateLevelTexts final
{
public:
	int32                                         CurrentLevel;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0020(0x0018)()
};
static_assert(alignof(WBP_ModernMenu_StatsPage3_C_UpdateLevelTexts) == 0x000008, "Wrong alignment on WBP_ModernMenu_StatsPage3_C_UpdateLevelTexts");
static_assert(sizeof(WBP_ModernMenu_StatsPage3_C_UpdateLevelTexts) == 0x000038, "Wrong size on WBP_ModernMenu_StatsPage3_C_UpdateLevelTexts");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_UpdateLevelTexts, CurrentLevel) == 0x000000, "Member 'WBP_ModernMenu_StatsPage3_C_UpdateLevelTexts::CurrentLevel' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_UpdateLevelTexts, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'WBP_ModernMenu_StatsPage3_C_UpdateLevelTexts::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_UpdateLevelTexts, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'WBP_ModernMenu_StatsPage3_C_UpdateLevelTexts::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_UpdateLevelTexts, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000020, "Member 'WBP_ModernMenu_StatsPage3_C_UpdateLevelTexts::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");

// Function WBP_ModernMenu_StatsPage3.WBP_ModernMenu_StatsPage3_C.UpdatePlayerInfos
// 0x0070 (0x0070 - 0x0000)
struct WBP_ModernMenu_StatsPage3_C_UpdatePlayerInfos final
{
public:
	struct FLegacyStatsMenuPlayerInfo             PlayerInfos;                                       // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_ModernMenu_StatsPage3_C_UpdatePlayerInfos) == 0x000008, "Wrong alignment on WBP_ModernMenu_StatsPage3_C_UpdatePlayerInfos");
static_assert(sizeof(WBP_ModernMenu_StatsPage3_C_UpdatePlayerInfos) == 0x000070, "Wrong size on WBP_ModernMenu_StatsPage3_C_UpdatePlayerInfos");
static_assert(offsetof(WBP_ModernMenu_StatsPage3_C_UpdatePlayerInfos, PlayerInfos) == 0x000000, "Member 'WBP_ModernMenu_StatsPage3_C_UpdatePlayerInfos::PlayerInfos' has a wrong offset!");

// Function WBP_ModernMenu_StatsPage3.WBP_ModernMenu_StatsPage3_C.UpdateSkills
// 0x0010 (0x0010 - 0x0000)
struct WBP_ModernMenu_StatsPage3_C_UpdateSkills final
{
public:
	TArray<struct FLegacyStatsMenuSkillItemProperties> NewSkills;                                    // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_ModernMenu_StatsPage3_C_UpdateSkills) == 0x000008, "Wrong alignment on WBP_ModernMenu_StatsPage3_C_UpdateSkills");
static_assert(sizeof(WBP_ModernMenu_StatsPage3_C_UpdateSkills) == 0x000010, "Wrong size on WBP_ModernMenu_StatsPage3_C_UpdateSkills");
