#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Modern_OnboardingMenu

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Modern_OnboardingMenu.WBP_Modern_OnboardingMenu_C.ThisIsForPluginCompliance 
// 0x0001 (0x0001 - 0x0000)
struct WBP_Modern_OnboardingMenu_C_ThisIsForPluginCompliance_ final
{
public:
	bool                                          NewParam;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_OnboardingMenu_C_ThisIsForPluginCompliance_) == 0x000001, "Wrong alignment on WBP_Modern_OnboardingMenu_C_ThisIsForPluginCompliance_");
static_assert(sizeof(WBP_Modern_OnboardingMenu_C_ThisIsForPluginCompliance_) == 0x000001, "Wrong size on WBP_Modern_OnboardingMenu_C_ThisIsForPluginCompliance_");
static_assert(offsetof(WBP_Modern_OnboardingMenu_C_ThisIsForPluginCompliance_, NewParam) == 0x000000, "Member 'WBP_Modern_OnboardingMenu_C_ThisIsForPluginCompliance_::NewParam' has a wrong offset!");

// Function WBP_Modern_OnboardingMenu.WBP_Modern_OnboardingMenu_C.SetGamerTagText
// 0x0020 (0x0020 - 0x0000)
struct WBP_Modern_OnboardingMenu_C_SetGamerTagText final
{
public:
	class FText                                   NewGamerTag;                                       // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_OnboardingMenu_C_SetGamerTagText) == 0x000008, "Wrong alignment on WBP_Modern_OnboardingMenu_C_SetGamerTagText");
static_assert(sizeof(WBP_Modern_OnboardingMenu_C_SetGamerTagText) == 0x000020, "Wrong size on WBP_Modern_OnboardingMenu_C_SetGamerTagText");
static_assert(offsetof(WBP_Modern_OnboardingMenu_C_SetGamerTagText, NewGamerTag) == 0x000000, "Member 'WBP_Modern_OnboardingMenu_C_SetGamerTagText::NewGamerTag' has a wrong offset!");
static_assert(offsetof(WBP_Modern_OnboardingMenu_C_SetGamerTagText, CallFunc_TextIsEmpty_ReturnValue) == 0x000018, "Member 'WBP_Modern_OnboardingMenu_C_SetGamerTagText::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");

// Function WBP_Modern_OnboardingMenu.WBP_Modern_OnboardingMenu_C.OnPageChanged
// 0x0004 (0x0004 - 0x0000)
struct WBP_Modern_OnboardingMenu_C_OnPageChanged final
{
public:
	int32                                         NewIndex;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_OnboardingMenu_C_OnPageChanged) == 0x000004, "Wrong alignment on WBP_Modern_OnboardingMenu_C_OnPageChanged");
static_assert(sizeof(WBP_Modern_OnboardingMenu_C_OnPageChanged) == 0x000004, "Wrong size on WBP_Modern_OnboardingMenu_C_OnPageChanged");
static_assert(offsetof(WBP_Modern_OnboardingMenu_C_OnPageChanged, NewIndex) == 0x000000, "Member 'WBP_Modern_OnboardingMenu_C_OnPageChanged::NewIndex' has a wrong offset!");

// Function WBP_Modern_OnboardingMenu.WBP_Modern_OnboardingMenu_C.ExecuteUbergraph_WBP_Modern_OnboardingMenu
// 0x0068 (0x0068 - 0x0000)
struct WBP_Modern_OnboardingMenu_C_ExecuteUbergraph_WBP_Modern_OnboardingMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_NewIndex;                             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetGamertagText_ReturnValue;              // 0x0008(0x0018)()
	TScriptInterface<class IVOnboardingPageInterface> CallFunc_GetPage_ReturnValue;                  // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_InterfaceToObject_ReturnValue;       // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAltarWidget*                          K2Node_DynamicCast_AsVAltar_Widget;                // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVUINavigationGlobalSubsystem*          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IVEnhancedInputNavigable> CallFunc_NavigateToWidget_Widget_CastInput;     // 0x0050(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_OnboardingMenu_C_ExecuteUbergraph_WBP_Modern_OnboardingMenu) == 0x000008, "Wrong alignment on WBP_Modern_OnboardingMenu_C_ExecuteUbergraph_WBP_Modern_OnboardingMenu");
static_assert(sizeof(WBP_Modern_OnboardingMenu_C_ExecuteUbergraph_WBP_Modern_OnboardingMenu) == 0x000068, "Wrong size on WBP_Modern_OnboardingMenu_C_ExecuteUbergraph_WBP_Modern_OnboardingMenu");
static_assert(offsetof(WBP_Modern_OnboardingMenu_C_ExecuteUbergraph_WBP_Modern_OnboardingMenu, EntryPoint) == 0x000000, "Member 'WBP_Modern_OnboardingMenu_C_ExecuteUbergraph_WBP_Modern_OnboardingMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Modern_OnboardingMenu_C_ExecuteUbergraph_WBP_Modern_OnboardingMenu, K2Node_Event_NewIndex) == 0x000004, "Member 'WBP_Modern_OnboardingMenu_C_ExecuteUbergraph_WBP_Modern_OnboardingMenu::K2Node_Event_NewIndex' has a wrong offset!");
static_assert(offsetof(WBP_Modern_OnboardingMenu_C_ExecuteUbergraph_WBP_Modern_OnboardingMenu, CallFunc_GetGamertagText_ReturnValue) == 0x000008, "Member 'WBP_Modern_OnboardingMenu_C_ExecuteUbergraph_WBP_Modern_OnboardingMenu::CallFunc_GetGamertagText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_OnboardingMenu_C_ExecuteUbergraph_WBP_Modern_OnboardingMenu, CallFunc_GetPage_ReturnValue) == 0x000020, "Member 'WBP_Modern_OnboardingMenu_C_ExecuteUbergraph_WBP_Modern_OnboardingMenu::CallFunc_GetPage_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_OnboardingMenu_C_ExecuteUbergraph_WBP_Modern_OnboardingMenu, CallFunc_Conv_InterfaceToObject_ReturnValue) == 0x000030, "Member 'WBP_Modern_OnboardingMenu_C_ExecuteUbergraph_WBP_Modern_OnboardingMenu::CallFunc_Conv_InterfaceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_OnboardingMenu_C_ExecuteUbergraph_WBP_Modern_OnboardingMenu, K2Node_DynamicCast_AsVAltar_Widget) == 0x000038, "Member 'WBP_Modern_OnboardingMenu_C_ExecuteUbergraph_WBP_Modern_OnboardingMenu::K2Node_DynamicCast_AsVAltar_Widget' has a wrong offset!");
static_assert(offsetof(WBP_Modern_OnboardingMenu_C_ExecuteUbergraph_WBP_Modern_OnboardingMenu, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'WBP_Modern_OnboardingMenu_C_ExecuteUbergraph_WBP_Modern_OnboardingMenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Modern_OnboardingMenu_C_ExecuteUbergraph_WBP_Modern_OnboardingMenu, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000048, "Member 'WBP_Modern_OnboardingMenu_C_ExecuteUbergraph_WBP_Modern_OnboardingMenu::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_OnboardingMenu_C_ExecuteUbergraph_WBP_Modern_OnboardingMenu, CallFunc_NavigateToWidget_Widget_CastInput) == 0x000050, "Member 'WBP_Modern_OnboardingMenu_C_ExecuteUbergraph_WBP_Modern_OnboardingMenu::CallFunc_NavigateToWidget_Widget_CastInput' has a wrong offset!");
static_assert(offsetof(WBP_Modern_OnboardingMenu_C_ExecuteUbergraph_WBP_Modern_OnboardingMenu, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'WBP_Modern_OnboardingMenu_C_ExecuteUbergraph_WBP_Modern_OnboardingMenu::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

