#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModernMenu_ContainerInventory_MainContent

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "CommonInput_structs.hpp"
#include "Altar_structs.hpp"
#include "Altar_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ModernMenu_ContainerInventory_MainContent.WBP_ModernMenu_ContainerInventory_MainContent_C
// 0x00C0 (0x0588 - 0x04C8)
class UWBP_ModernMenu_ContainerInventory_MainContent_C final : public UVAltarWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       CategorySwitch;                                    // 0x04D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_OriginalMenu_Inventory_Filter_C*   inv_cont_filter;                                   // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                inv_cont_filter_spacer;                            // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalMenu_InventoryListView_C*  inv_cont_listview;                                 // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        inv_cont_listview_switcher;                        // 0x04F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModernMenu_SpellPurchaseListView_C* inv_cont_spell_listview;                          // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AltarTextBlock_C*                  inv_cont_title;                                    // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAnimatableRetainerBox*                 RetainerBox_Listview;                              // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_List_EmptyLabel_C*                 WBP_List_EmptyLabel;                               // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          ForcedFilterVisibility;                            // 0x0518(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFilterFocused;                                   // 0x0519(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51A[0x6];                                      // 0x051A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(EOriginalInventoryMenuSortType SortType)> OnSortTypeUpdated;       // 0x0520(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(bool IsReversed)> OnSortIsReversedUpdated;                         // 0x0530(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          IsContainerMainContent;                            // 0x0540(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSpellPurchaseMainContent;                        // 0x0541(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOriginalInventoryMenuSortType                DefaultSortType;                                   // 0x0542(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_543[0x5];                                      // 0x0543(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class UObject* Item)> OnListViewItemClicked;                       // 0x0548(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnListViewUpdated;                                 // 0x0558(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UObject* Item)> OnListViewItemHovered;                       // 0x0568(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(bool IsHovered)> OnMouseHoverListViewChanged;                      // 0x0578(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__WBP_ModernMenu_ContainerInventory_MainContent_inv_cont_listview_K2Node_ComponentBoundEvent_2_OnItemClicked__DelegateSignature(class UObject* SelectedItem);
	void BndEvt__WBP_ModernMenu_ContainerInventory_MainContent_inv_cont_listview_K2Node_ComponentBoundEvent_5_OnItemHovered__DelegateSignature(class UObject* HoveredItem);
	void BndEvt__WBP_ModernMenu_ContainerInventory_MainContent_inv_cont_listview_K2Node_ComponentBoundEvent_6_OnScrollBarVisibilityChanged__DelegateSignature(ESlateVisibility NewParam);
	void BndEvt__WBP_ModernMenu_ContainerInventory_MainContent_inv_cont_listview_K2Node_ComponentBoundEvent_8_OnMouseHoverListViewChanged__DelegateSignature(bool IsHovered_0);
	void BndEvt__WBP_ModernMenu_ContainerInventory_MainContent_inv_cont_spell_listview_K2Node_ComponentBoundEvent_3_OnItemHovered__DelegateSignature(class UObject* HoveredItem);
	void BndEvt__WBP_ModernMenu_ContainerInventory_MainContent_inv_cont_spell_listview_K2Node_ComponentBoundEvent_4_OnItemClicked__DelegateSignature(class UObject* SelectedItem);
	void BndEvt__WBP_ModernMenu_ContainerInventory_MainContent_inv_filter_K2Node_ComponentBoundEvent_0_OnSortTypeUpdated__DelegateSignature(EOriginalInventoryMenuSortType SortType);
	void BndEvt__WBP_ModernMenu_ContainerInventory_MainContent_inv_filter_K2Node_ComponentBoundEvent_1_OnIsReversedUpdated__DelegateSignature(bool bIsReversed);
	void Construct();
	void ExecuteUbergraph_WBP_ModernMenu_ContainerInventory_MainContent(int32 EntryPoint);
	void GetCurrentItem(class UObject** CurrentItem);
	void GetEnabledFilterEnumsForGivenPage(ELegacyInventoryMenuPage Page, TArray<EOriginalInventoryMenuSortType>* EnabledFilterEnums);
	void InitContainerType();
	void NavigateToFirstListViewItem();
	void OnExitFilter();
	void OnFocus();
	void OnInputMethodChanged(ECommonInputType bNewInputType);
	void OnListViewUpdatedEvent(bool IsEmpty);
	void ResetFilter();
	void SetAlphabeticalIconVisibility(ESlateVisibility NewVisibility);
	void SetFilterVisibility(ESlateVisibility NewVisibility, bool bForce);
	void SetTitle(const class FText& Title);
	void UpdateFilterFocus(bool InIsFilterFocused);
	void UpdateFiltersToDisplay(ELegacyInventoryMenuPage Page, EOriginalInventoryMenuSortType CurrentSortType, EOriginalInventoryMenuSortType* NewSortType);
	void UpdateListViewContent(TArray<struct FOriginalInventoryMenuItemProperties>& Items);
	void UpdateSpellListViewContent(TArray<struct FLegacySpellPurchaseMenuItemProperties>& Items);

	class UWidget* BP_GetDesiredFocusTarget() const;
	void GetActiveListView(class UVNavigableListView** ListView) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ModernMenu_ContainerInventory_MainContent_C">();
	}
	static class UWBP_ModernMenu_ContainerInventory_MainContent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ModernMenu_ContainerInventory_MainContent_C>();
	}
};
static_assert(alignof(UWBP_ModernMenu_ContainerInventory_MainContent_C) == 0x000008, "Wrong alignment on UWBP_ModernMenu_ContainerInventory_MainContent_C");
static_assert(sizeof(UWBP_ModernMenu_ContainerInventory_MainContent_C) == 0x000588, "Wrong size on UWBP_ModernMenu_ContainerInventory_MainContent_C");
static_assert(offsetof(UWBP_ModernMenu_ContainerInventory_MainContent_C, UberGraphFrame) == 0x0004C8, "Member 'UWBP_ModernMenu_ContainerInventory_MainContent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_ContainerInventory_MainContent_C, CategorySwitch) == 0x0004D0, "Member 'UWBP_ModernMenu_ContainerInventory_MainContent_C::CategorySwitch' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_ContainerInventory_MainContent_C, inv_cont_filter) == 0x0004D8, "Member 'UWBP_ModernMenu_ContainerInventory_MainContent_C::inv_cont_filter' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_ContainerInventory_MainContent_C, inv_cont_filter_spacer) == 0x0004E0, "Member 'UWBP_ModernMenu_ContainerInventory_MainContent_C::inv_cont_filter_spacer' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_ContainerInventory_MainContent_C, inv_cont_listview) == 0x0004E8, "Member 'UWBP_ModernMenu_ContainerInventory_MainContent_C::inv_cont_listview' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_ContainerInventory_MainContent_C, inv_cont_listview_switcher) == 0x0004F0, "Member 'UWBP_ModernMenu_ContainerInventory_MainContent_C::inv_cont_listview_switcher' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_ContainerInventory_MainContent_C, inv_cont_spell_listview) == 0x0004F8, "Member 'UWBP_ModernMenu_ContainerInventory_MainContent_C::inv_cont_spell_listview' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_ContainerInventory_MainContent_C, inv_cont_title) == 0x000500, "Member 'UWBP_ModernMenu_ContainerInventory_MainContent_C::inv_cont_title' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_ContainerInventory_MainContent_C, RetainerBox_Listview) == 0x000508, "Member 'UWBP_ModernMenu_ContainerInventory_MainContent_C::RetainerBox_Listview' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_ContainerInventory_MainContent_C, WBP_List_EmptyLabel) == 0x000510, "Member 'UWBP_ModernMenu_ContainerInventory_MainContent_C::WBP_List_EmptyLabel' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_ContainerInventory_MainContent_C, ForcedFilterVisibility) == 0x000518, "Member 'UWBP_ModernMenu_ContainerInventory_MainContent_C::ForcedFilterVisibility' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_ContainerInventory_MainContent_C, IsFilterFocused) == 0x000519, "Member 'UWBP_ModernMenu_ContainerInventory_MainContent_C::IsFilterFocused' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_ContainerInventory_MainContent_C, OnSortTypeUpdated) == 0x000520, "Member 'UWBP_ModernMenu_ContainerInventory_MainContent_C::OnSortTypeUpdated' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_ContainerInventory_MainContent_C, OnSortIsReversedUpdated) == 0x000530, "Member 'UWBP_ModernMenu_ContainerInventory_MainContent_C::OnSortIsReversedUpdated' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_ContainerInventory_MainContent_C, IsContainerMainContent) == 0x000540, "Member 'UWBP_ModernMenu_ContainerInventory_MainContent_C::IsContainerMainContent' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_ContainerInventory_MainContent_C, IsSpellPurchaseMainContent) == 0x000541, "Member 'UWBP_ModernMenu_ContainerInventory_MainContent_C::IsSpellPurchaseMainContent' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_ContainerInventory_MainContent_C, DefaultSortType) == 0x000542, "Member 'UWBP_ModernMenu_ContainerInventory_MainContent_C::DefaultSortType' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_ContainerInventory_MainContent_C, OnListViewItemClicked) == 0x000548, "Member 'UWBP_ModernMenu_ContainerInventory_MainContent_C::OnListViewItemClicked' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_ContainerInventory_MainContent_C, OnListViewUpdated) == 0x000558, "Member 'UWBP_ModernMenu_ContainerInventory_MainContent_C::OnListViewUpdated' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_ContainerInventory_MainContent_C, OnListViewItemHovered) == 0x000568, "Member 'UWBP_ModernMenu_ContainerInventory_MainContent_C::OnListViewItemHovered' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_ContainerInventory_MainContent_C, OnMouseHoverListViewChanged) == 0x000578, "Member 'UWBP_ModernMenu_ContainerInventory_MainContent_C::OnMouseHoverListViewChanged' has a wrong offset!");

}

