#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PrimaryGameLayout

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_PrimaryGameLayout.WBP_PrimaryGameLayout_C.ExecuteUbergraph_WBP_PrimaryGameLayout
// 0x0004 (0x0004 - 0x0000)
struct WBP_PrimaryGameLayout_C_ExecuteUbergraph_WBP_PrimaryGameLayout final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PrimaryGameLayout_C_ExecuteUbergraph_WBP_PrimaryGameLayout) == 0x000004, "Wrong alignment on WBP_PrimaryGameLayout_C_ExecuteUbergraph_WBP_PrimaryGameLayout");
static_assert(sizeof(WBP_PrimaryGameLayout_C_ExecuteUbergraph_WBP_PrimaryGameLayout) == 0x000004, "Wrong size on WBP_PrimaryGameLayout_C_ExecuteUbergraph_WBP_PrimaryGameLayout");
static_assert(offsetof(WBP_PrimaryGameLayout_C_ExecuteUbergraph_WBP_PrimaryGameLayout, EntryPoint) == 0x000000, "Member 'WBP_PrimaryGameLayout_C_ExecuteUbergraph_WBP_PrimaryGameLayout::EntryPoint' has a wrong offset!");

// Function WBP_PrimaryGameLayout.WBP_PrimaryGameLayout_C.GetBackgroundWidget
// 0x0008 (0x0008 - 0x0000)
struct WBP_PrimaryGameLayout_C_GetBackgroundWidget final
{
public:
	class UVBackgroundWidgetBase*                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PrimaryGameLayout_C_GetBackgroundWidget) == 0x000008, "Wrong alignment on WBP_PrimaryGameLayout_C_GetBackgroundWidget");
static_assert(sizeof(WBP_PrimaryGameLayout_C_GetBackgroundWidget) == 0x000008, "Wrong size on WBP_PrimaryGameLayout_C_GetBackgroundWidget");
static_assert(offsetof(WBP_PrimaryGameLayout_C_GetBackgroundWidget, ReturnValue) == 0x000000, "Member 'WBP_PrimaryGameLayout_C_GetBackgroundWidget::ReturnValue' has a wrong offset!");

}

