#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LegacyPrefab_PageTab

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_LegacyPrefab_PageTab.WBP_LegacyPrefab_PageTab_C.ExecuteUbergraph_WBP_LegacyPrefab_PageTab
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_LegacyPrefab_PageTab_C_ExecuteUbergraph_WBP_LegacyPrefab_PageTab final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsSelected_ReturnValue;                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0xB];                                        // 0x0005(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_GetIconBrush_ReturnValue;                 // 0x0010(0x00D0)(ConstParm)
	struct FSlateBrush                            CallFunc_GetIconBrush_ReturnValue_1;               // 0x00E0(0x00D0)(ConstParm)
};
static_assert(alignof(WBP_LegacyPrefab_PageTab_C_ExecuteUbergraph_WBP_LegacyPrefab_PageTab) == 0x000010, "Wrong alignment on WBP_LegacyPrefab_PageTab_C_ExecuteUbergraph_WBP_LegacyPrefab_PageTab");
static_assert(sizeof(WBP_LegacyPrefab_PageTab_C_ExecuteUbergraph_WBP_LegacyPrefab_PageTab) == 0x0001B0, "Wrong size on WBP_LegacyPrefab_PageTab_C_ExecuteUbergraph_WBP_LegacyPrefab_PageTab");
static_assert(offsetof(WBP_LegacyPrefab_PageTab_C_ExecuteUbergraph_WBP_LegacyPrefab_PageTab, EntryPoint) == 0x000000, "Member 'WBP_LegacyPrefab_PageTab_C_ExecuteUbergraph_WBP_LegacyPrefab_PageTab::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_LegacyPrefab_PageTab_C_ExecuteUbergraph_WBP_LegacyPrefab_PageTab, CallFunc_GetIsSelected_ReturnValue) == 0x000004, "Member 'WBP_LegacyPrefab_PageTab_C_ExecuteUbergraph_WBP_LegacyPrefab_PageTab::CallFunc_GetIsSelected_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LegacyPrefab_PageTab_C_ExecuteUbergraph_WBP_LegacyPrefab_PageTab, CallFunc_GetIconBrush_ReturnValue) == 0x000010, "Member 'WBP_LegacyPrefab_PageTab_C_ExecuteUbergraph_WBP_LegacyPrefab_PageTab::CallFunc_GetIconBrush_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LegacyPrefab_PageTab_C_ExecuteUbergraph_WBP_LegacyPrefab_PageTab, CallFunc_GetIconBrush_ReturnValue_1) == 0x0000E0, "Member 'WBP_LegacyPrefab_PageTab_C_ExecuteUbergraph_WBP_LegacyPrefab_PageTab::CallFunc_GetIconBrush_ReturnValue_1' has a wrong offset!");

// Function WBP_LegacyPrefab_PageTab.WBP_LegacyPrefab_PageTab_C.SetSelected
// 0x0005 (0x0005 - 0x0000)
struct WBP_LegacyPrefab_PageTab_C_SetSelected final
{
public:
	bool                                          Condition;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LegacyPrefab_PageTab_C_SetSelected) == 0x000001, "Wrong alignment on WBP_LegacyPrefab_PageTab_C_SetSelected");
static_assert(sizeof(WBP_LegacyPrefab_PageTab_C_SetSelected) == 0x000005, "Wrong size on WBP_LegacyPrefab_PageTab_C_SetSelected");
static_assert(offsetof(WBP_LegacyPrefab_PageTab_C_SetSelected, Condition) == 0x000000, "Member 'WBP_LegacyPrefab_PageTab_C_SetSelected::Condition' has a wrong offset!");
static_assert(offsetof(WBP_LegacyPrefab_PageTab_C_SetSelected, Temp_bool_Variable) == 0x000001, "Member 'WBP_LegacyPrefab_PageTab_C_SetSelected::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_LegacyPrefab_PageTab_C_SetSelected, Temp_byte_Variable) == 0x000002, "Member 'WBP_LegacyPrefab_PageTab_C_SetSelected::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_LegacyPrefab_PageTab_C_SetSelected, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_LegacyPrefab_PageTab_C_SetSelected::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_LegacyPrefab_PageTab_C_SetSelected, K2Node_Select_Default) == 0x000004, "Member 'WBP_LegacyPrefab_PageTab_C_SetSelected::K2Node_Select_Default' has a wrong offset!");

}

