#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Cursor

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_Cursor.WBP_Cursor_C.ExecuteUbergraph_WBP_Cursor
// 0x0068 (0x0068 - 0x0000)
struct WBP_Cursor_C_ExecuteUbergraph_WBP_Cursor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bVisible;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Delta;                                // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector2D_X;                          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast_1;        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_BreakVector2D_InVec_ImplicitCast;         // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Cursor_C_ExecuteUbergraph_WBP_Cursor) == 0x000008, "Wrong alignment on WBP_Cursor_C_ExecuteUbergraph_WBP_Cursor");
static_assert(sizeof(WBP_Cursor_C_ExecuteUbergraph_WBP_Cursor) == 0x000068, "Wrong size on WBP_Cursor_C_ExecuteUbergraph_WBP_Cursor");
static_assert(offsetof(WBP_Cursor_C_ExecuteUbergraph_WBP_Cursor, EntryPoint) == 0x000000, "Member 'WBP_Cursor_C_ExecuteUbergraph_WBP_Cursor::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Cursor_C_ExecuteUbergraph_WBP_Cursor, K2Node_Event_bVisible) == 0x000004, "Member 'WBP_Cursor_C_ExecuteUbergraph_WBP_Cursor::K2Node_Event_bVisible' has a wrong offset!");
static_assert(offsetof(WBP_Cursor_C_ExecuteUbergraph_WBP_Cursor, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000008, "Member 'WBP_Cursor_C_ExecuteUbergraph_WBP_Cursor::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cursor_C_ExecuteUbergraph_WBP_Cursor, K2Node_Event_Delta) == 0x000010, "Member 'WBP_Cursor_C_ExecuteUbergraph_WBP_Cursor::K2Node_Event_Delta' has a wrong offset!");
static_assert(offsetof(WBP_Cursor_C_ExecuteUbergraph_WBP_Cursor, CallFunc_BreakVector2D_X) == 0x000018, "Member 'WBP_Cursor_C_ExecuteUbergraph_WBP_Cursor::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_Cursor_C_ExecuteUbergraph_WBP_Cursor, CallFunc_BreakVector2D_Y) == 0x000020, "Member 'WBP_Cursor_C_ExecuteUbergraph_WBP_Cursor::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_Cursor_C_ExecuteUbergraph_WBP_Cursor, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000028, "Member 'WBP_Cursor_C_ExecuteUbergraph_WBP_Cursor::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cursor_C_ExecuteUbergraph_WBP_Cursor, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000030, "Member 'WBP_Cursor_C_ExecuteUbergraph_WBP_Cursor::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Cursor_C_ExecuteUbergraph_WBP_Cursor, CallFunc_MakeVector2D_ReturnValue) == 0x000038, "Member 'WBP_Cursor_C_ExecuteUbergraph_WBP_Cursor::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Cursor_C_ExecuteUbergraph_WBP_Cursor, CallFunc_Add_DoubleDouble_B_ImplicitCast) == 0x000048, "Member 'WBP_Cursor_C_ExecuteUbergraph_WBP_Cursor::CallFunc_Add_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Cursor_C_ExecuteUbergraph_WBP_Cursor, CallFunc_Add_DoubleDouble_B_ImplicitCast_1) == 0x000050, "Member 'WBP_Cursor_C_ExecuteUbergraph_WBP_Cursor::CallFunc_Add_DoubleDouble_B_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_Cursor_C_ExecuteUbergraph_WBP_Cursor, CallFunc_BreakVector2D_InVec_ImplicitCast) == 0x000058, "Member 'WBP_Cursor_C_ExecuteUbergraph_WBP_Cursor::CallFunc_BreakVector2D_InVec_ImplicitCast' has a wrong offset!");

// Function WBP_Cursor.WBP_Cursor_C.OnUpdateCursorSize
// 0x0004 (0x0004 - 0x0000)
struct WBP_Cursor_C_OnUpdateCursorSize final
{
public:
	float                                         Delta;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Cursor_C_OnUpdateCursorSize) == 0x000004, "Wrong alignment on WBP_Cursor_C_OnUpdateCursorSize");
static_assert(sizeof(WBP_Cursor_C_OnUpdateCursorSize) == 0x000004, "Wrong size on WBP_Cursor_C_OnUpdateCursorSize");
static_assert(offsetof(WBP_Cursor_C_OnUpdateCursorSize, Delta) == 0x000000, "Member 'WBP_Cursor_C_OnUpdateCursorSize::Delta' has a wrong offset!");

// Function WBP_Cursor.WBP_Cursor_C.OnUpdateCursorVisibility
// 0x0001 (0x0001 - 0x0000)
struct WBP_Cursor_C_OnUpdateCursorVisibility final
{
public:
	bool                                          bVisible;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Cursor_C_OnUpdateCursorVisibility) == 0x000001, "Wrong alignment on WBP_Cursor_C_OnUpdateCursorVisibility");
static_assert(sizeof(WBP_Cursor_C_OnUpdateCursorVisibility) == 0x000001, "Wrong size on WBP_Cursor_C_OnUpdateCursorVisibility");
static_assert(offsetof(WBP_Cursor_C_OnUpdateCursorVisibility, bVisible) == 0x000000, "Member 'WBP_Cursor_C_OnUpdateCursorVisibility::bVisible' has a wrong offset!");

}

