#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModernMenu_StatsPage3_Details

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CommonInput_structs.hpp"
#include "Altar_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ModernMenu_StatsPage3_Details.WBP_ModernMenu_StatsPage3_Details_C
// 0x00E0 (0x05A8 - 0x04C8)
class UWBP_ModernMenu_StatsPage3_Details_C final : public UVAltarWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USizeBox*                               Scrollbox_sizebox;                                 // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Shadow;                                            // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AltarRichTextBlock_C*              stat_detailsp3_description;                        // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               stat_detailsp3_downarrow;                          // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModernMenu_Stats_LevelDescription_C* stat_detailsp3_level_apprentice;                 // 0x04F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModernMenu_Stats_LevelDescription_C* stat_detailsp3_level_expert;                     // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModernMenu_Stats_LevelDescription_C* stat_detailsp3_level_journeyman;                 // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModernMenu_Stats_LevelDescription_C* stat_detailsp3_level_master;                     // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModernMenu_Stats_LevelDescription_C* stat_detailsp3_level_novice;                     // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             stat_detailsp3_leveldesciptions_scrollbox;         // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               stat_detailsp3_progressbar;                        // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               stat_detailsp3_skill_icon;                         // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AltarTextBlock_C*                  stat_detailsp3_skillbase;                          // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AltarTextBlock_C*                  stat_detailsp3_skillmodifier;                      // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         stat_detailsp3_skillmodifier_horizontalbox;        // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AltarTextBlock_C*                  stat_detailsp3_title_inv;                          // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AltarTextBlock_C*                  stat_detailsp3_title_stats;                        // 0x0550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               stat_detailsp3_uparrow;                            // 0x0558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               stats_detailsp3_invheader_overlay;                 // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           stats_detailsp3_statsheader_verticalbox;           // 0x0568(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsDisplayed;                                       // 0x0570(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_571[0x3];                                      // 0x0571(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           PositiveSkillModifierColor;                        // 0x0574(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           NegativeSkillModifierColor;                        // 0x0584(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_594[0x4];                                      // 0x0594(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ScrollSpeed;                                       // 0x0598(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInStatsMenu;                                     // 0x05A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void DoScroll(double ScrollDelta);
	void ExecuteUbergraph_WBP_ModernMenu_StatsPage3_Details(int32 EntryPoint);
	void InitializeWidget();
	void InpActEvt_IA_UI_Specific_QuickKeys_RightStick_K2Node_EnhancedInputActionEvent_0(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void OnInputMethodChanged(ECommonInputType bNewInputType);
	void PreConstruct(bool IsDesignTime);
	void Set_Scrollbar_Input_Hint();
	void SetArrowsVisibility(bool IsUpArrowVisible, bool IsDownArrowVisible);
	void SetDescription(const class FText& Description);
	void SetImage(class UTexture2D* Texture);
	void SetModernContent(const class FText& TitleText, const class FText& LevelText, const class FText& DescriptionText, double Progression, int32 CurrentSkill, int32 SkillBase, class UTexture2D* Icon, class UTexture2D* BigIcon, const class FText& SkillNameKey);
	void SetSkillModifier(int32 SkillModifier);
	void UpdateLevelDescriptionsState(int32 BaseLevel, const class FText& SkillNameKey);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ModernMenu_StatsPage3_Details_C">();
	}
	static class UWBP_ModernMenu_StatsPage3_Details_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ModernMenu_StatsPage3_Details_C>();
	}
};
static_assert(alignof(UWBP_ModernMenu_StatsPage3_Details_C) == 0x000008, "Wrong alignment on UWBP_ModernMenu_StatsPage3_Details_C");
static_assert(sizeof(UWBP_ModernMenu_StatsPage3_Details_C) == 0x0005A8, "Wrong size on UWBP_ModernMenu_StatsPage3_Details_C");
static_assert(offsetof(UWBP_ModernMenu_StatsPage3_Details_C, UberGraphFrame) == 0x0004C8, "Member 'UWBP_ModernMenu_StatsPage3_Details_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsPage3_Details_C, Scrollbox_sizebox) == 0x0004D0, "Member 'UWBP_ModernMenu_StatsPage3_Details_C::Scrollbox_sizebox' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsPage3_Details_C, Shadow) == 0x0004D8, "Member 'UWBP_ModernMenu_StatsPage3_Details_C::Shadow' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsPage3_Details_C, stat_detailsp3_description) == 0x0004E0, "Member 'UWBP_ModernMenu_StatsPage3_Details_C::stat_detailsp3_description' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsPage3_Details_C, stat_detailsp3_downarrow) == 0x0004E8, "Member 'UWBP_ModernMenu_StatsPage3_Details_C::stat_detailsp3_downarrow' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsPage3_Details_C, stat_detailsp3_level_apprentice) == 0x0004F0, "Member 'UWBP_ModernMenu_StatsPage3_Details_C::stat_detailsp3_level_apprentice' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsPage3_Details_C, stat_detailsp3_level_expert) == 0x0004F8, "Member 'UWBP_ModernMenu_StatsPage3_Details_C::stat_detailsp3_level_expert' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsPage3_Details_C, stat_detailsp3_level_journeyman) == 0x000500, "Member 'UWBP_ModernMenu_StatsPage3_Details_C::stat_detailsp3_level_journeyman' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsPage3_Details_C, stat_detailsp3_level_master) == 0x000508, "Member 'UWBP_ModernMenu_StatsPage3_Details_C::stat_detailsp3_level_master' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsPage3_Details_C, stat_detailsp3_level_novice) == 0x000510, "Member 'UWBP_ModernMenu_StatsPage3_Details_C::stat_detailsp3_level_novice' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsPage3_Details_C, stat_detailsp3_leveldesciptions_scrollbox) == 0x000518, "Member 'UWBP_ModernMenu_StatsPage3_Details_C::stat_detailsp3_leveldesciptions_scrollbox' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsPage3_Details_C, stat_detailsp3_progressbar) == 0x000520, "Member 'UWBP_ModernMenu_StatsPage3_Details_C::stat_detailsp3_progressbar' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsPage3_Details_C, stat_detailsp3_skill_icon) == 0x000528, "Member 'UWBP_ModernMenu_StatsPage3_Details_C::stat_detailsp3_skill_icon' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsPage3_Details_C, stat_detailsp3_skillbase) == 0x000530, "Member 'UWBP_ModernMenu_StatsPage3_Details_C::stat_detailsp3_skillbase' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsPage3_Details_C, stat_detailsp3_skillmodifier) == 0x000538, "Member 'UWBP_ModernMenu_StatsPage3_Details_C::stat_detailsp3_skillmodifier' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsPage3_Details_C, stat_detailsp3_skillmodifier_horizontalbox) == 0x000540, "Member 'UWBP_ModernMenu_StatsPage3_Details_C::stat_detailsp3_skillmodifier_horizontalbox' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsPage3_Details_C, stat_detailsp3_title_inv) == 0x000548, "Member 'UWBP_ModernMenu_StatsPage3_Details_C::stat_detailsp3_title_inv' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsPage3_Details_C, stat_detailsp3_title_stats) == 0x000550, "Member 'UWBP_ModernMenu_StatsPage3_Details_C::stat_detailsp3_title_stats' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsPage3_Details_C, stat_detailsp3_uparrow) == 0x000558, "Member 'UWBP_ModernMenu_StatsPage3_Details_C::stat_detailsp3_uparrow' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsPage3_Details_C, stats_detailsp3_invheader_overlay) == 0x000560, "Member 'UWBP_ModernMenu_StatsPage3_Details_C::stats_detailsp3_invheader_overlay' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsPage3_Details_C, stats_detailsp3_statsheader_verticalbox) == 0x000568, "Member 'UWBP_ModernMenu_StatsPage3_Details_C::stats_detailsp3_statsheader_verticalbox' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsPage3_Details_C, IsDisplayed) == 0x000570, "Member 'UWBP_ModernMenu_StatsPage3_Details_C::IsDisplayed' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsPage3_Details_C, PositiveSkillModifierColor) == 0x000574, "Member 'UWBP_ModernMenu_StatsPage3_Details_C::PositiveSkillModifierColor' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsPage3_Details_C, NegativeSkillModifierColor) == 0x000584, "Member 'UWBP_ModernMenu_StatsPage3_Details_C::NegativeSkillModifierColor' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsPage3_Details_C, ScrollSpeed) == 0x000598, "Member 'UWBP_ModernMenu_StatsPage3_Details_C::ScrollSpeed' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_StatsPage3_Details_C, IsInStatsMenu) == 0x0005A0, "Member 'UWBP_ModernMenu_StatsPage3_Details_C::IsInStatsMenu' has a wrong offset!");

}

