#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BasicDebugInfo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Altar_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_BasicDebugInfo.WBP_BasicDebugInfo_C
// 0x0020 (0x02F8 - 0x02D8)
class UWBP_BasicDebugInfo_C final : public UAltarGraphicsSettingsDebugInfo
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             FPS;                                               // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             VRAM;                                              // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         UsedVram;                                          // 0x02F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TotalVram;                                         // 0x02F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_BasicDebugInfo(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_BasicDebugInfo_C">();
	}
	static class UWBP_BasicDebugInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_BasicDebugInfo_C>();
	}
};
static_assert(alignof(UWBP_BasicDebugInfo_C) == 0x000008, "Wrong alignment on UWBP_BasicDebugInfo_C");
static_assert(sizeof(UWBP_BasicDebugInfo_C) == 0x0002F8, "Wrong size on UWBP_BasicDebugInfo_C");
static_assert(offsetof(UWBP_BasicDebugInfo_C, UberGraphFrame) == 0x0002D8, "Member 'UWBP_BasicDebugInfo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_BasicDebugInfo_C, FPS) == 0x0002E0, "Member 'UWBP_BasicDebugInfo_C::FPS' has a wrong offset!");
static_assert(offsetof(UWBP_BasicDebugInfo_C, VRAM) == 0x0002E8, "Member 'UWBP_BasicDebugInfo_C::VRAM' has a wrong offset!");
static_assert(offsetof(UWBP_BasicDebugInfo_C, UsedVram) == 0x0002F0, "Member 'UWBP_BasicDebugInfo_C::UsedVram' has a wrong offset!");
static_assert(offsetof(UWBP_BasicDebugInfo_C, TotalVram) == 0x0002F4, "Member 'UWBP_BasicDebugInfo_C::TotalVram' has a wrong offset!");

}

