#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BorderMovePlayer

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "FInventoryPreviewInitializationSettings_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_BorderMovePlayer.WBP_BorderMovePlayer_C.ClampToDeadZone
// 0x00B8 (0x00B8 - 0x0000)
struct WBP_BorderMovePlayer_C_ClampToDeadZone final
{
public:
	struct FVector2D                              ThumbstickInput;                                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              ClampedThumbstickInput;                            // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ClampedY;                                          // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ClampedX;                                          // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_1;                        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_1;                        // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_2;                        // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_2;                        // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_3;                        // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_3;                        // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue;                          // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_4;                        // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_4;                        // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue_1;                        // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_5;                        // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_5;                        // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1;  // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BorderMovePlayer_C_ClampToDeadZone) == 0x000008, "Wrong alignment on WBP_BorderMovePlayer_C_ClampToDeadZone");
static_assert(sizeof(WBP_BorderMovePlayer_C_ClampToDeadZone) == 0x0000B8, "Wrong size on WBP_BorderMovePlayer_C_ClampToDeadZone");
static_assert(offsetof(WBP_BorderMovePlayer_C_ClampToDeadZone, ThumbstickInput) == 0x000000, "Member 'WBP_BorderMovePlayer_C_ClampToDeadZone::ThumbstickInput' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_ClampToDeadZone, ClampedThumbstickInput) == 0x000010, "Member 'WBP_BorderMovePlayer_C_ClampToDeadZone::ClampedThumbstickInput' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_ClampToDeadZone, ClampedY) == 0x000020, "Member 'WBP_BorderMovePlayer_C_ClampToDeadZone::ClampedY' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_ClampToDeadZone, ClampedX) == 0x000028, "Member 'WBP_BorderMovePlayer_C_ClampToDeadZone::ClampedX' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_ClampToDeadZone, CallFunc_BreakVector2D_X) == 0x000030, "Member 'WBP_BorderMovePlayer_C_ClampToDeadZone::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_ClampToDeadZone, CallFunc_BreakVector2D_Y) == 0x000038, "Member 'WBP_BorderMovePlayer_C_ClampToDeadZone::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_ClampToDeadZone, CallFunc_MakeVector2D_ReturnValue) == 0x000040, "Member 'WBP_BorderMovePlayer_C_ClampToDeadZone::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_ClampToDeadZone, CallFunc_BreakVector2D_X_1) == 0x000050, "Member 'WBP_BorderMovePlayer_C_ClampToDeadZone::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_ClampToDeadZone, CallFunc_BreakVector2D_Y_1) == 0x000058, "Member 'WBP_BorderMovePlayer_C_ClampToDeadZone::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_ClampToDeadZone, CallFunc_BreakVector2D_X_2) == 0x000060, "Member 'WBP_BorderMovePlayer_C_ClampToDeadZone::CallFunc_BreakVector2D_X_2' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_ClampToDeadZone, CallFunc_BreakVector2D_Y_2) == 0x000068, "Member 'WBP_BorderMovePlayer_C_ClampToDeadZone::CallFunc_BreakVector2D_Y_2' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_ClampToDeadZone, CallFunc_BreakVector2D_X_3) == 0x000070, "Member 'WBP_BorderMovePlayer_C_ClampToDeadZone::CallFunc_BreakVector2D_X_3' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_ClampToDeadZone, CallFunc_BreakVector2D_Y_3) == 0x000078, "Member 'WBP_BorderMovePlayer_C_ClampToDeadZone::CallFunc_BreakVector2D_Y_3' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_ClampToDeadZone, CallFunc_Abs_ReturnValue) == 0x000080, "Member 'WBP_BorderMovePlayer_C_ClampToDeadZone::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_ClampToDeadZone, CallFunc_BreakVector2D_X_4) == 0x000088, "Member 'WBP_BorderMovePlayer_C_ClampToDeadZone::CallFunc_BreakVector2D_X_4' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_ClampToDeadZone, CallFunc_BreakVector2D_Y_4) == 0x000090, "Member 'WBP_BorderMovePlayer_C_ClampToDeadZone::CallFunc_BreakVector2D_Y_4' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_ClampToDeadZone, CallFunc_Abs_ReturnValue_1) == 0x000098, "Member 'WBP_BorderMovePlayer_C_ClampToDeadZone::CallFunc_Abs_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_ClampToDeadZone, CallFunc_BreakVector2D_X_5) == 0x0000A0, "Member 'WBP_BorderMovePlayer_C_ClampToDeadZone::CallFunc_BreakVector2D_X_5' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_ClampToDeadZone, CallFunc_BreakVector2D_Y_5) == 0x0000A8, "Member 'WBP_BorderMovePlayer_C_ClampToDeadZone::CallFunc_BreakVector2D_Y_5' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_ClampToDeadZone, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x0000B0, "Member 'WBP_BorderMovePlayer_C_ClampToDeadZone::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_ClampToDeadZone, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1) == 0x0000B1, "Member 'WBP_BorderMovePlayer_C_ClampToDeadZone::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");

// Function WBP_BorderMovePlayer.WBP_BorderMovePlayer_C.ExecuteUbergraph_WBP_BorderMovePlayer
// 0x00D0 (0x00D0 - 0x0000)
struct WBP_BorderMovePlayer_C_ExecuteUbergraph_WBP_BorderMovePlayer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsZero2D_ReturnValue;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsZero2D_ReturnValue_1;                   // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FVector2D& ThumbstickValue)> K2Node_CreateDelegate_OutputDelegate;   // 0x0048(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAltarUISubsystem*                     CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNavigationUISubsystem*                 CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAltarUISubsystem*                     CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAltarUISubsystem*                     CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAltarUISubsystem*                     CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0090(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x00A0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AVAltarPlayerController*                K2Node_DynamicCast_AsVAltar_Player_Controller;     // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AVOblivionPlayerCharacter*              CallFunc_GetPlayerCharacter_ReturnValue;           // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BorderMovePlayer_C_ExecuteUbergraph_WBP_BorderMovePlayer) == 0x000008, "Wrong alignment on WBP_BorderMovePlayer_C_ExecuteUbergraph_WBP_BorderMovePlayer");
static_assert(sizeof(WBP_BorderMovePlayer_C_ExecuteUbergraph_WBP_BorderMovePlayer) == 0x0000D0, "Wrong size on WBP_BorderMovePlayer_C_ExecuteUbergraph_WBP_BorderMovePlayer");
static_assert(offsetof(WBP_BorderMovePlayer_C_ExecuteUbergraph_WBP_BorderMovePlayer, EntryPoint) == 0x000000, "Member 'WBP_BorderMovePlayer_C_ExecuteUbergraph_WBP_BorderMovePlayer::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_ExecuteUbergraph_WBP_BorderMovePlayer, K2Node_Event_MyGeometry) == 0x000004, "Member 'WBP_BorderMovePlayer_C_ExecuteUbergraph_WBP_BorderMovePlayer::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_ExecuteUbergraph_WBP_BorderMovePlayer, K2Node_Event_InDeltaTime) == 0x00003C, "Member 'WBP_BorderMovePlayer_C_ExecuteUbergraph_WBP_BorderMovePlayer::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_ExecuteUbergraph_WBP_BorderMovePlayer, CallFunc_IsZero2D_ReturnValue) == 0x000040, "Member 'WBP_BorderMovePlayer_C_ExecuteUbergraph_WBP_BorderMovePlayer::CallFunc_IsZero2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_ExecuteUbergraph_WBP_BorderMovePlayer, CallFunc_IsZero2D_ReturnValue_1) == 0x000041, "Member 'WBP_BorderMovePlayer_C_ExecuteUbergraph_WBP_BorderMovePlayer::CallFunc_IsZero2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_ExecuteUbergraph_WBP_BorderMovePlayer, CallFunc_Not_PreBool_ReturnValue) == 0x000042, "Member 'WBP_BorderMovePlayer_C_ExecuteUbergraph_WBP_BorderMovePlayer::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_ExecuteUbergraph_WBP_BorderMovePlayer, CallFunc_Not_PreBool_ReturnValue_1) == 0x000043, "Member 'WBP_BorderMovePlayer_C_ExecuteUbergraph_WBP_BorderMovePlayer::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_ExecuteUbergraph_WBP_BorderMovePlayer, CallFunc_BooleanAND_ReturnValue) == 0x000044, "Member 'WBP_BorderMovePlayer_C_ExecuteUbergraph_WBP_BorderMovePlayer::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_ExecuteUbergraph_WBP_BorderMovePlayer, K2Node_CreateDelegate_OutputDelegate) == 0x000048, "Member 'WBP_BorderMovePlayer_C_ExecuteUbergraph_WBP_BorderMovePlayer::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_ExecuteUbergraph_WBP_BorderMovePlayer, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000058, "Member 'WBP_BorderMovePlayer_C_ExecuteUbergraph_WBP_BorderMovePlayer::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_ExecuteUbergraph_WBP_BorderMovePlayer, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'WBP_BorderMovePlayer_C_ExecuteUbergraph_WBP_BorderMovePlayer::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_ExecuteUbergraph_WBP_BorderMovePlayer, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000068, "Member 'WBP_BorderMovePlayer_C_ExecuteUbergraph_WBP_BorderMovePlayer::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_ExecuteUbergraph_WBP_BorderMovePlayer, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000070, "Member 'WBP_BorderMovePlayer_C_ExecuteUbergraph_WBP_BorderMovePlayer::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_ExecuteUbergraph_WBP_BorderMovePlayer, CallFunc_IsValid_ReturnValue_1) == 0x000078, "Member 'WBP_BorderMovePlayer_C_ExecuteUbergraph_WBP_BorderMovePlayer::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_ExecuteUbergraph_WBP_BorderMovePlayer, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x000080, "Member 'WBP_BorderMovePlayer_C_ExecuteUbergraph_WBP_BorderMovePlayer::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_ExecuteUbergraph_WBP_BorderMovePlayer, CallFunc_GetGameInstanceSubsystem_ReturnValue_3) == 0x000088, "Member 'WBP_BorderMovePlayer_C_ExecuteUbergraph_WBP_BorderMovePlayer::CallFunc_GetGameInstanceSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_ExecuteUbergraph_WBP_BorderMovePlayer, K2Node_CreateDelegate_OutputDelegate_1) == 0x000090, "Member 'WBP_BorderMovePlayer_C_ExecuteUbergraph_WBP_BorderMovePlayer::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_ExecuteUbergraph_WBP_BorderMovePlayer, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000A0, "Member 'WBP_BorderMovePlayer_C_ExecuteUbergraph_WBP_BorderMovePlayer::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_ExecuteUbergraph_WBP_BorderMovePlayer, CallFunc_GetPlayerController_ReturnValue) == 0x0000B0, "Member 'WBP_BorderMovePlayer_C_ExecuteUbergraph_WBP_BorderMovePlayer::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_ExecuteUbergraph_WBP_BorderMovePlayer, K2Node_DynamicCast_AsVAltar_Player_Controller) == 0x0000B8, "Member 'WBP_BorderMovePlayer_C_ExecuteUbergraph_WBP_BorderMovePlayer::K2Node_DynamicCast_AsVAltar_Player_Controller' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_ExecuteUbergraph_WBP_BorderMovePlayer, K2Node_DynamicCast_bSuccess) == 0x0000C0, "Member 'WBP_BorderMovePlayer_C_ExecuteUbergraph_WBP_BorderMovePlayer::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_ExecuteUbergraph_WBP_BorderMovePlayer, CallFunc_GetPlayerCharacter_ReturnValue) == 0x0000C8, "Member 'WBP_BorderMovePlayer_C_ExecuteUbergraph_WBP_BorderMovePlayer::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");

// Function WBP_BorderMovePlayer.WBP_BorderMovePlayer_C.Get New And Last Mouse Pos
// 0x0040 (0x0040 - 0x0000)
struct WBP_BorderMovePlayer_C_Get_New_And_Last_Mouse_Pos final
{
public:
	bool                                          CallFunc_IsZero2D_ReturnValue;                     // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetMousePosition_LocationX;               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMousePosition_LocationY;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetMousePosition_ReturnValue;             // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector2D_X_ImplicitCast;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector2D_Y_ImplicitCast;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BorderMovePlayer_C_Get_New_And_Last_Mouse_Pos) == 0x000008, "Wrong alignment on WBP_BorderMovePlayer_C_Get_New_And_Last_Mouse_Pos");
static_assert(sizeof(WBP_BorderMovePlayer_C_Get_New_And_Last_Mouse_Pos) == 0x000040, "Wrong size on WBP_BorderMovePlayer_C_Get_New_And_Last_Mouse_Pos");
static_assert(offsetof(WBP_BorderMovePlayer_C_Get_New_And_Last_Mouse_Pos, CallFunc_IsZero2D_ReturnValue) == 0x000000, "Member 'WBP_BorderMovePlayer_C_Get_New_And_Last_Mouse_Pos::CallFunc_IsZero2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_Get_New_And_Last_Mouse_Pos, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'WBP_BorderMovePlayer_C_Get_New_And_Last_Mouse_Pos::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_Get_New_And_Last_Mouse_Pos, CallFunc_Not_PreBool_ReturnValue) == 0x000010, "Member 'WBP_BorderMovePlayer_C_Get_New_And_Last_Mouse_Pos::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_Get_New_And_Last_Mouse_Pos, CallFunc_GetMousePosition_LocationX) == 0x000014, "Member 'WBP_BorderMovePlayer_C_Get_New_And_Last_Mouse_Pos::CallFunc_GetMousePosition_LocationX' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_Get_New_And_Last_Mouse_Pos, CallFunc_GetMousePosition_LocationY) == 0x000018, "Member 'WBP_BorderMovePlayer_C_Get_New_And_Last_Mouse_Pos::CallFunc_GetMousePosition_LocationY' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_Get_New_And_Last_Mouse_Pos, CallFunc_GetMousePosition_ReturnValue) == 0x00001C, "Member 'WBP_BorderMovePlayer_C_Get_New_And_Last_Mouse_Pos::CallFunc_GetMousePosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_Get_New_And_Last_Mouse_Pos, CallFunc_MakeVector2D_ReturnValue) == 0x000020, "Member 'WBP_BorderMovePlayer_C_Get_New_And_Last_Mouse_Pos::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_Get_New_And_Last_Mouse_Pos, CallFunc_MakeVector2D_X_ImplicitCast) == 0x000030, "Member 'WBP_BorderMovePlayer_C_Get_New_And_Last_Mouse_Pos::CallFunc_MakeVector2D_X_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_Get_New_And_Last_Mouse_Pos, CallFunc_MakeVector2D_Y_ImplicitCast) == 0x000038, "Member 'WBP_BorderMovePlayer_C_Get_New_And_Last_Mouse_Pos::CallFunc_MakeVector2D_Y_ImplicitCast' has a wrong offset!");

// Function WBP_BorderMovePlayer.WBP_BorderMovePlayer_C.GetNewDelta
// 0x0020 (0x0020 - 0x0000)
struct WBP_BorderMovePlayer_C_GetNewDelta final
{
public:
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue;    // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BorderMovePlayer_C_GetNewDelta) == 0x000008, "Wrong alignment on WBP_BorderMovePlayer_C_GetNewDelta");
static_assert(sizeof(WBP_BorderMovePlayer_C_GetNewDelta) == 0x000020, "Wrong size on WBP_BorderMovePlayer_C_GetNewDelta");
static_assert(offsetof(WBP_BorderMovePlayer_C_GetNewDelta, CallFunc_Subtract_Vector2DVector2D_ReturnValue) == 0x000000, "Member 'WBP_BorderMovePlayer_C_GetNewDelta::CallFunc_Subtract_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_GetNewDelta, CallFunc_BreakVector2D_X) == 0x000010, "Member 'WBP_BorderMovePlayer_C_GetNewDelta::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_GetNewDelta, CallFunc_BreakVector2D_Y) == 0x000018, "Member 'WBP_BorderMovePlayer_C_GetNewDelta::CallFunc_BreakVector2D_Y' has a wrong offset!");

// Function WBP_BorderMovePlayer.WBP_BorderMovePlayer_C.GetNewDirectionFromStick
// 0x0088 (0x0088 - 0x0000)
struct WBP_BorderMovePlayer_C_GetNewDirectionFromStick final
{
public:
	struct FVector2D                              ThumbstickValue;                                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Local_ClampedInput;                                // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_DoubleToVector2D_ReturnValue;        // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DVector2D_ReturnValue;    // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_ClampToDeadZone_ClampedThumbstickInput;   // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue;                          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Abs_ReturnValue_1;                        // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_DoubleToVector2D_InDouble_ImplicitCast; // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BorderMovePlayer_C_GetNewDirectionFromStick) == 0x000008, "Wrong alignment on WBP_BorderMovePlayer_C_GetNewDirectionFromStick");
static_assert(sizeof(WBP_BorderMovePlayer_C_GetNewDirectionFromStick) == 0x000088, "Wrong size on WBP_BorderMovePlayer_C_GetNewDirectionFromStick");
static_assert(offsetof(WBP_BorderMovePlayer_C_GetNewDirectionFromStick, ThumbstickValue) == 0x000000, "Member 'WBP_BorderMovePlayer_C_GetNewDirectionFromStick::ThumbstickValue' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_GetNewDirectionFromStick, Local_ClampedInput) == 0x000010, "Member 'WBP_BorderMovePlayer_C_GetNewDirectionFromStick::Local_ClampedInput' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_GetNewDirectionFromStick, CallFunc_Conv_DoubleToVector2D_ReturnValue) == 0x000020, "Member 'WBP_BorderMovePlayer_C_GetNewDirectionFromStick::CallFunc_Conv_DoubleToVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_GetNewDirectionFromStick, CallFunc_Multiply_Vector2DVector2D_ReturnValue) == 0x000030, "Member 'WBP_BorderMovePlayer_C_GetNewDirectionFromStick::CallFunc_Multiply_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_GetNewDirectionFromStick, CallFunc_BreakVector2D_X) == 0x000040, "Member 'WBP_BorderMovePlayer_C_GetNewDirectionFromStick::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_GetNewDirectionFromStick, CallFunc_BreakVector2D_Y) == 0x000048, "Member 'WBP_BorderMovePlayer_C_GetNewDirectionFromStick::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_GetNewDirectionFromStick, CallFunc_ClampToDeadZone_ClampedThumbstickInput) == 0x000050, "Member 'WBP_BorderMovePlayer_C_GetNewDirectionFromStick::CallFunc_ClampToDeadZone_ClampedThumbstickInput' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_GetNewDirectionFromStick, CallFunc_Abs_ReturnValue) == 0x000060, "Member 'WBP_BorderMovePlayer_C_GetNewDirectionFromStick::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_GetNewDirectionFromStick, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000068, "Member 'WBP_BorderMovePlayer_C_GetNewDirectionFromStick::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_GetNewDirectionFromStick, CallFunc_Abs_ReturnValue_1) == 0x000070, "Member 'WBP_BorderMovePlayer_C_GetNewDirectionFromStick::CallFunc_Abs_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_GetNewDirectionFromStick, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x000078, "Member 'WBP_BorderMovePlayer_C_GetNewDirectionFromStick::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_GetNewDirectionFromStick, CallFunc_BooleanOR_ReturnValue) == 0x000079, "Member 'WBP_BorderMovePlayer_C_GetNewDirectionFromStick::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_GetNewDirectionFromStick, CallFunc_Conv_DoubleToVector2D_InDouble_ImplicitCast) == 0x000080, "Member 'WBP_BorderMovePlayer_C_GetNewDirectionFromStick::CallFunc_Conv_DoubleToVector2D_InDouble_ImplicitCast' has a wrong offset!");

// Function WBP_BorderMovePlayer.WBP_BorderMovePlayer_C.GetNewStickDelta
// 0x0020 (0x0020 - 0x0000)
struct WBP_BorderMovePlayer_C_GetNewStickDelta final
{
public:
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue;         // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BorderMovePlayer_C_GetNewStickDelta) == 0x000008, "Wrong alignment on WBP_BorderMovePlayer_C_GetNewStickDelta");
static_assert(sizeof(WBP_BorderMovePlayer_C_GetNewStickDelta) == 0x000020, "Wrong size on WBP_BorderMovePlayer_C_GetNewStickDelta");
static_assert(offsetof(WBP_BorderMovePlayer_C_GetNewStickDelta, CallFunc_Add_Vector2DVector2D_ReturnValue) == 0x000000, "Member 'WBP_BorderMovePlayer_C_GetNewStickDelta::CallFunc_Add_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_GetNewStickDelta, CallFunc_BreakVector2D_X) == 0x000010, "Member 'WBP_BorderMovePlayer_C_GetNewStickDelta::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_GetNewStickDelta, CallFunc_BreakVector2D_Y) == 0x000018, "Member 'WBP_BorderMovePlayer_C_GetNewStickDelta::CallFunc_BreakVector2D_Y' has a wrong offset!");

// Function WBP_BorderMovePlayer.WBP_BorderMovePlayer_C.Init or Enable Box Preview
// 0x0068 (0x0068 - 0x0000)
struct WBP_BorderMovePlayer_C_Init_or_Enable_Box_Preview final
{
public:
	struct FFInventoryPreviewInitializationSettings Settings;                                        // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AVAltarPlayerController*                K2Node_DynamicCast_AsVAltar_Player_Controller;     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AVOblivionPlayerCharacter*              CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AVInventoryPlayerCharacter*             CallFunc_GetInventoryPlayer_ReturnValue;           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_InventoryPlayer_C*                  K2Node_DynamicCast_AsBP_Inventory_Player;          // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Box_Preview_Inventory_C*            K2Node_DynamicCast_AsBP_Box_Preview_Inventory;     // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BorderMovePlayer_C_Init_or_Enable_Box_Preview) == 0x000008, "Wrong alignment on WBP_BorderMovePlayer_C_Init_or_Enable_Box_Preview");
static_assert(sizeof(WBP_BorderMovePlayer_C_Init_or_Enable_Box_Preview) == 0x000068, "Wrong size on WBP_BorderMovePlayer_C_Init_or_Enable_Box_Preview");
static_assert(offsetof(WBP_BorderMovePlayer_C_Init_or_Enable_Box_Preview, Settings) == 0x000000, "Member 'WBP_BorderMovePlayer_C_Init_or_Enable_Box_Preview::Settings' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_Init_or_Enable_Box_Preview, CallFunc_GetPlayerController_ReturnValue) == 0x000010, "Member 'WBP_BorderMovePlayer_C_Init_or_Enable_Box_Preview::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_Init_or_Enable_Box_Preview, K2Node_DynamicCast_AsVAltar_Player_Controller) == 0x000018, "Member 'WBP_BorderMovePlayer_C_Init_or_Enable_Box_Preview::K2Node_DynamicCast_AsVAltar_Player_Controller' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_Init_or_Enable_Box_Preview, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_BorderMovePlayer_C_Init_or_Enable_Box_Preview::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_Init_or_Enable_Box_Preview, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000028, "Member 'WBP_BorderMovePlayer_C_Init_or_Enable_Box_Preview::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_Init_or_Enable_Box_Preview, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'WBP_BorderMovePlayer_C_Init_or_Enable_Box_Preview::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_Init_or_Enable_Box_Preview, CallFunc_GetInventoryPlayer_ReturnValue) == 0x000038, "Member 'WBP_BorderMovePlayer_C_Init_or_Enable_Box_Preview::CallFunc_GetInventoryPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_Init_or_Enable_Box_Preview, CallFunc_IsValid_ReturnValue_1) == 0x000040, "Member 'WBP_BorderMovePlayer_C_Init_or_Enable_Box_Preview::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_Init_or_Enable_Box_Preview, K2Node_DynamicCast_AsBP_Inventory_Player) == 0x000048, "Member 'WBP_BorderMovePlayer_C_Init_or_Enable_Box_Preview::K2Node_DynamicCast_AsBP_Inventory_Player' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_Init_or_Enable_Box_Preview, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'WBP_BorderMovePlayer_C_Init_or_Enable_Box_Preview::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_Init_or_Enable_Box_Preview, K2Node_DynamicCast_AsBP_Box_Preview_Inventory) == 0x000058, "Member 'WBP_BorderMovePlayer_C_Init_or_Enable_Box_Preview::K2Node_DynamicCast_AsBP_Box_Preview_Inventory' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_Init_or_Enable_Box_Preview, K2Node_DynamicCast_bSuccess_2) == 0x000060, "Member 'WBP_BorderMovePlayer_C_Init_or_Enable_Box_Preview::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_Init_or_Enable_Box_Preview, CallFunc_IsValid_ReturnValue_2) == 0x000061, "Member 'WBP_BorderMovePlayer_C_Init_or_Enable_Box_Preview::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function WBP_BorderMovePlayer.WBP_BorderMovePlayer_C.IsRenderVisible
// 0x0004 (0x0004 - 0x0000)
struct WBP_BorderMovePlayer_C_IsRenderVisible final
{
public:
	bool                                          IsVisible_0;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BorderMovePlayer_C_IsRenderVisible) == 0x000001, "Wrong alignment on WBP_BorderMovePlayer_C_IsRenderVisible");
static_assert(sizeof(WBP_BorderMovePlayer_C_IsRenderVisible) == 0x000004, "Wrong size on WBP_BorderMovePlayer_C_IsRenderVisible");
static_assert(offsetof(WBP_BorderMovePlayer_C_IsRenderVisible, IsVisible_0) == 0x000000, "Member 'WBP_BorderMovePlayer_C_IsRenderVisible::IsVisible_0' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_IsRenderVisible, CallFunc_IsVisible_ReturnValue) == 0x000001, "Member 'WBP_BorderMovePlayer_C_IsRenderVisible::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_IsRenderVisible, CallFunc_IsValid_ReturnValue) == 0x000002, "Member 'WBP_BorderMovePlayer_C_IsRenderVisible::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_IsRenderVisible, CallFunc_BooleanAND_ReturnValue) == 0x000003, "Member 'WBP_BorderMovePlayer_C_IsRenderVisible::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_BorderMovePlayer.WBP_BorderMovePlayer_C.MoveCharacterToRoot
// 0x0210 (0x0210 - 0x0000)
struct WBP_BorderMovePlayer_C_MoveCharacterToRoot final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AVInventoryPlayerCharacter*             CallFunc_GetInventoryPlayer_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_InventoryPlayer_C*                  K2Node_DynamicCast_AsBP_Inventory_Player;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0028(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0110(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult; // 0x0128(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(WBP_BorderMovePlayer_C_MoveCharacterToRoot) == 0x000008, "Wrong alignment on WBP_BorderMovePlayer_C_MoveCharacterToRoot");
static_assert(sizeof(WBP_BorderMovePlayer_C_MoveCharacterToRoot) == 0x000210, "Wrong size on WBP_BorderMovePlayer_C_MoveCharacterToRoot");
static_assert(offsetof(WBP_BorderMovePlayer_C_MoveCharacterToRoot, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'WBP_BorderMovePlayer_C_MoveCharacterToRoot::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_MoveCharacterToRoot, CallFunc_GetInventoryPlayer_ReturnValue) == 0x000008, "Member 'WBP_BorderMovePlayer_C_MoveCharacterToRoot::CallFunc_GetInventoryPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_MoveCharacterToRoot, CallFunc_IsValid_ReturnValue_1) == 0x000010, "Member 'WBP_BorderMovePlayer_C_MoveCharacterToRoot::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_MoveCharacterToRoot, K2Node_DynamicCast_AsBP_Inventory_Player) == 0x000018, "Member 'WBP_BorderMovePlayer_C_MoveCharacterToRoot::K2Node_DynamicCast_AsBP_Inventory_Player' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_MoveCharacterToRoot, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_BorderMovePlayer_C_MoveCharacterToRoot::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_MoveCharacterToRoot, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x000028, "Member 'WBP_BorderMovePlayer_C_MoveCharacterToRoot::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_MoveCharacterToRoot, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000110, "Member 'WBP_BorderMovePlayer_C_MoveCharacterToRoot::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_MoveCharacterToRoot, CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult) == 0x000128, "Member 'WBP_BorderMovePlayer_C_MoveCharacterToRoot::CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult' has a wrong offset!");

// Function WBP_BorderMovePlayer.WBP_BorderMovePlayer_C.OnMouseButtonDown_Border
// 0x02A0 (0x02A0 - 0x0000)
struct WBP_BorderMovePlayer_C_OnMouseButtonDown_Border final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00B0(0x00B8)(Parm, OutParm, ReturnParm)
	struct FKey                                   Temp_struct_Variable;                              // 0x0168(0x0018)(ConstParm, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0180(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0190(0x00B8)()
	struct FVector2D                              CallFunc_Vector2D_Zero_ReturnValue;                // 0x0248(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVAltarUISubsystem*                     CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0258(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0260(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMousePosition_LocationX;               // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMousePosition_LocationY;               // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetMousePosition_ReturnValue;             // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0278(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x028C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28D[0x3];                                      // 0x028D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MakeVector2D_X_ImplicitCast;              // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector2D_Y_ImplicitCast;              // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BorderMovePlayer_C_OnMouseButtonDown_Border) == 0x000008, "Wrong alignment on WBP_BorderMovePlayer_C_OnMouseButtonDown_Border");
static_assert(sizeof(WBP_BorderMovePlayer_C_OnMouseButtonDown_Border) == 0x0002A0, "Wrong size on WBP_BorderMovePlayer_C_OnMouseButtonDown_Border");
static_assert(offsetof(WBP_BorderMovePlayer_C_OnMouseButtonDown_Border, MyGeometry) == 0x000000, "Member 'WBP_BorderMovePlayer_C_OnMouseButtonDown_Border::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_OnMouseButtonDown_Border, MouseEvent) == 0x000038, "Member 'WBP_BorderMovePlayer_C_OnMouseButtonDown_Border::MouseEvent' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_OnMouseButtonDown_Border, ReturnValue) == 0x0000B0, "Member 'WBP_BorderMovePlayer_C_OnMouseButtonDown_Border::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_OnMouseButtonDown_Border, Temp_struct_Variable) == 0x000168, "Member 'WBP_BorderMovePlayer_C_OnMouseButtonDown_Border::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_OnMouseButtonDown_Border, K2Node_CreateDelegate_OutputDelegate) == 0x000180, "Member 'WBP_BorderMovePlayer_C_OnMouseButtonDown_Border::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_OnMouseButtonDown_Border, CallFunc_Handled_ReturnValue) == 0x000190, "Member 'WBP_BorderMovePlayer_C_OnMouseButtonDown_Border::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_OnMouseButtonDown_Border, CallFunc_Vector2D_Zero_ReturnValue) == 0x000248, "Member 'WBP_BorderMovePlayer_C_OnMouseButtonDown_Border::CallFunc_Vector2D_Zero_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_OnMouseButtonDown_Border, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000258, "Member 'WBP_BorderMovePlayer_C_OnMouseButtonDown_Border::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_OnMouseButtonDown_Border, CallFunc_GetPlayerController_ReturnValue) == 0x000260, "Member 'WBP_BorderMovePlayer_C_OnMouseButtonDown_Border::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_OnMouseButtonDown_Border, CallFunc_GetMousePosition_LocationX) == 0x000268, "Member 'WBP_BorderMovePlayer_C_OnMouseButtonDown_Border::CallFunc_GetMousePosition_LocationX' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_OnMouseButtonDown_Border, CallFunc_GetMousePosition_LocationY) == 0x00026C, "Member 'WBP_BorderMovePlayer_C_OnMouseButtonDown_Border::CallFunc_GetMousePosition_LocationY' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_OnMouseButtonDown_Border, CallFunc_GetMousePosition_ReturnValue) == 0x000270, "Member 'WBP_BorderMovePlayer_C_OnMouseButtonDown_Border::CallFunc_GetMousePosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_OnMouseButtonDown_Border, CallFunc_MakeVector2D_ReturnValue) == 0x000278, "Member 'WBP_BorderMovePlayer_C_OnMouseButtonDown_Border::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_OnMouseButtonDown_Border, CallFunc_Array_Find_ReturnValue) == 0x000288, "Member 'WBP_BorderMovePlayer_C_OnMouseButtonDown_Border::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_OnMouseButtonDown_Border, CallFunc_NotEqual_IntInt_ReturnValue) == 0x00028C, "Member 'WBP_BorderMovePlayer_C_OnMouseButtonDown_Border::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_OnMouseButtonDown_Border, CallFunc_MakeVector2D_X_ImplicitCast) == 0x000290, "Member 'WBP_BorderMovePlayer_C_OnMouseButtonDown_Border::CallFunc_MakeVector2D_X_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_OnMouseButtonDown_Border, CallFunc_MakeVector2D_Y_ImplicitCast) == 0x000298, "Member 'WBP_BorderMovePlayer_C_OnMouseButtonDown_Border::CallFunc_MakeVector2D_Y_ImplicitCast' has a wrong offset!");

// Function WBP_BorderMovePlayer.WBP_BorderMovePlayer_C.OnMouseButtonUp_Border
// 0x0248 (0x0248 - 0x0000)
struct WBP_BorderMovePlayer_C_OnMouseButtonUp_Border final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00B0(0x00B8)(Parm, OutParm, ReturnParm)
	struct FKey                                   Temp_struct_Variable;                              // 0x0168(0x0018)(ConstParm, HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0180(0x00B8)()
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0244(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BorderMovePlayer_C_OnMouseButtonUp_Border) == 0x000008, "Wrong alignment on WBP_BorderMovePlayer_C_OnMouseButtonUp_Border");
static_assert(sizeof(WBP_BorderMovePlayer_C_OnMouseButtonUp_Border) == 0x000248, "Wrong size on WBP_BorderMovePlayer_C_OnMouseButtonUp_Border");
static_assert(offsetof(WBP_BorderMovePlayer_C_OnMouseButtonUp_Border, MyGeometry) == 0x000000, "Member 'WBP_BorderMovePlayer_C_OnMouseButtonUp_Border::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_OnMouseButtonUp_Border, MouseEvent) == 0x000038, "Member 'WBP_BorderMovePlayer_C_OnMouseButtonUp_Border::MouseEvent' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_OnMouseButtonUp_Border, ReturnValue) == 0x0000B0, "Member 'WBP_BorderMovePlayer_C_OnMouseButtonUp_Border::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_OnMouseButtonUp_Border, Temp_struct_Variable) == 0x000168, "Member 'WBP_BorderMovePlayer_C_OnMouseButtonUp_Border::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_OnMouseButtonUp_Border, CallFunc_Handled_ReturnValue) == 0x000180, "Member 'WBP_BorderMovePlayer_C_OnMouseButtonUp_Border::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_OnMouseButtonUp_Border, CallFunc_GetPlayerController_ReturnValue) == 0x000238, "Member 'WBP_BorderMovePlayer_C_OnMouseButtonUp_Border::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_OnMouseButtonUp_Border, CallFunc_Array_Find_ReturnValue) == 0x000240, "Member 'WBP_BorderMovePlayer_C_OnMouseButtonUp_Border::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BorderMovePlayer_C_OnMouseButtonUp_Border, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000244, "Member 'WBP_BorderMovePlayer_C_OnMouseButtonUp_Border::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_BorderMovePlayer.WBP_BorderMovePlayer_C.ResetMouseControlDelta
// 0x0038 (0x0038 - 0x0000)
struct WBP_BorderMovePlayer_C_ResetMouseControlDelta final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAltarUISubsystem*                     CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Vector2D_Zero_ReturnValue;                // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Vector2D_Zero_ReturnValue_1;              // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BorderMovePlayer_C_ResetMouseControlDelta) == 0x000008, "Wrong alignment on WBP_BorderMovePlayer_C_ResetMouseControlDelta");
static_assert(sizeof(WBP_BorderMovePlayer_C_ResetMouseControlDelta) == 0x000038, "Wrong size on WBP_BorderMovePlayer_C_ResetMouseControlDelta");
static_assert(offsetof(WBP_BorderMovePlayer_C_ResetMouseControlDelta, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_BorderMovePlayer_C_ResetMouseControlDelta::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
