#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModernPrefab_Focusbox

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_ModernPrefab_Focusbox.WBP_ModernPrefab_Focusbox_C.ExecuteUbergraph_WBP_ModernPrefab_Focusbox
// 0x0004 (0x0004 - 0x0000)
struct WBP_ModernPrefab_Focusbox_C_ExecuteUbergraph_WBP_ModernPrefab_Focusbox final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernPrefab_Focusbox_C_ExecuteUbergraph_WBP_ModernPrefab_Focusbox) == 0x000004, "Wrong alignment on WBP_ModernPrefab_Focusbox_C_ExecuteUbergraph_WBP_ModernPrefab_Focusbox");
static_assert(sizeof(WBP_ModernPrefab_Focusbox_C_ExecuteUbergraph_WBP_ModernPrefab_Focusbox) == 0x000004, "Wrong size on WBP_ModernPrefab_Focusbox_C_ExecuteUbergraph_WBP_ModernPrefab_Focusbox");
static_assert(offsetof(WBP_ModernPrefab_Focusbox_C_ExecuteUbergraph_WBP_ModernPrefab_Focusbox, EntryPoint) == 0x000000, "Member 'WBP_ModernPrefab_Focusbox_C_ExecuteUbergraph_WBP_ModernPrefab_Focusbox::EntryPoint' has a wrong offset!");

// Function WBP_ModernPrefab_Focusbox.WBP_ModernPrefab_Focusbox_C.SetIsEquiped
// 0x0005 (0x0005 - 0x0000)
struct WBP_ModernPrefab_Focusbox_C_SetIsEquiped final
{
public:
	bool                                          InIsEquiped;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernPrefab_Focusbox_C_SetIsEquiped) == 0x000001, "Wrong alignment on WBP_ModernPrefab_Focusbox_C_SetIsEquiped");
static_assert(sizeof(WBP_ModernPrefab_Focusbox_C_SetIsEquiped) == 0x000005, "Wrong size on WBP_ModernPrefab_Focusbox_C_SetIsEquiped");
static_assert(offsetof(WBP_ModernPrefab_Focusbox_C_SetIsEquiped, InIsEquiped) == 0x000000, "Member 'WBP_ModernPrefab_Focusbox_C_SetIsEquiped::InIsEquiped' has a wrong offset!");
static_assert(offsetof(WBP_ModernPrefab_Focusbox_C_SetIsEquiped, Temp_bool_Variable) == 0x000001, "Member 'WBP_ModernPrefab_Focusbox_C_SetIsEquiped::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernPrefab_Focusbox_C_SetIsEquiped, Temp_byte_Variable) == 0x000002, "Member 'WBP_ModernPrefab_Focusbox_C_SetIsEquiped::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernPrefab_Focusbox_C_SetIsEquiped, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_ModernPrefab_Focusbox_C_SetIsEquiped::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernPrefab_Focusbox_C_SetIsEquiped, K2Node_Select_Default) == 0x000004, "Member 'WBP_ModernPrefab_Focusbox_C_SetIsEquiped::K2Node_Select_Default' has a wrong offset!");

// Function WBP_ModernPrefab_Focusbox.WBP_ModernPrefab_Focusbox_C.SetIsFocused
// 0x0005 (0x0005 - 0x0000)
struct WBP_ModernPrefab_Focusbox_C_SetIsFocused final
{
public:
	bool                                          InIsFocused;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernPrefab_Focusbox_C_SetIsFocused) == 0x000001, "Wrong alignment on WBP_ModernPrefab_Focusbox_C_SetIsFocused");
static_assert(sizeof(WBP_ModernPrefab_Focusbox_C_SetIsFocused) == 0x000005, "Wrong size on WBP_ModernPrefab_Focusbox_C_SetIsFocused");
static_assert(offsetof(WBP_ModernPrefab_Focusbox_C_SetIsFocused, InIsFocused) == 0x000000, "Member 'WBP_ModernPrefab_Focusbox_C_SetIsFocused::InIsFocused' has a wrong offset!");
static_assert(offsetof(WBP_ModernPrefab_Focusbox_C_SetIsFocused, Temp_bool_Variable) == 0x000001, "Member 'WBP_ModernPrefab_Focusbox_C_SetIsFocused::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernPrefab_Focusbox_C_SetIsFocused, Temp_byte_Variable) == 0x000002, "Member 'WBP_ModernPrefab_Focusbox_C_SetIsFocused::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernPrefab_Focusbox_C_SetIsFocused, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_ModernPrefab_Focusbox_C_SetIsFocused::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernPrefab_Focusbox_C_SetIsFocused, K2Node_Select_Default) == 0x000004, "Member 'WBP_ModernPrefab_Focusbox_C_SetIsFocused::K2Node_Select_Default' has a wrong offset!");

}

