#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Graphics_TogglerButtons5

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Altar_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Graphics_TogglerButtons5.WBP_Graphics_TogglerButtons5_C
// 0x0068 (0x0568 - 0x0500)
class UWBP_Graphics_TogglerButtons5_C final : public UVDebugGraphicsSettingWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0500(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_01;                                         // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_02;                                         // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_03;                                         // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_04;                                         // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_05;                                         // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             RowLabel_Text;                                     // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Value_Text;                                        // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   CurrentButtonLabel;                                // 0x0540(0x0018)(Edit, BlueprintVisible)
	TArray<class FText>                           Local_OptionsTextArray;                            // 0x0558(0x0010)(Edit, BlueprintVisible)

public:
	void BindRefreshDelegate();
	void BndEvt__WBP_Graphics_TogglerButtons_Button_01_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_Graphics_TogglerButtons_Button_02_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_Graphics_TogglerButtons_Button_03_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_Graphics_TogglerButtons_Button_04_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_Graphics_TogglerButtons_Button_05_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature();
	void ButtonSwitch(bool Btn1On, bool Btn2On, bool Btn3On, bool Btn4On, bool Btn5On);
	void ExecuteUbergraph_WBP_Graphics_TogglerButtons5(int32 EntryPoint);
	void GetSingleQualityLevel(int32* Out);
	void OnRefresh();
	void Refresh();
	void RefreshMenuOptions();
	void RefreshQualityPresetsOptions();
	void UpdateValue();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Graphics_TogglerButtons5_C">();
	}
	static class UWBP_Graphics_TogglerButtons5_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Graphics_TogglerButtons5_C>();
	}
};
static_assert(alignof(UWBP_Graphics_TogglerButtons5_C) == 0x000008, "Wrong alignment on UWBP_Graphics_TogglerButtons5_C");
static_assert(sizeof(UWBP_Graphics_TogglerButtons5_C) == 0x000568, "Wrong size on UWBP_Graphics_TogglerButtons5_C");
static_assert(offsetof(UWBP_Graphics_TogglerButtons5_C, UberGraphFrame) == 0x000500, "Member 'UWBP_Graphics_TogglerButtons5_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Graphics_TogglerButtons5_C, Button_01) == 0x000508, "Member 'UWBP_Graphics_TogglerButtons5_C::Button_01' has a wrong offset!");
static_assert(offsetof(UWBP_Graphics_TogglerButtons5_C, Button_02) == 0x000510, "Member 'UWBP_Graphics_TogglerButtons5_C::Button_02' has a wrong offset!");
static_assert(offsetof(UWBP_Graphics_TogglerButtons5_C, Button_03) == 0x000518, "Member 'UWBP_Graphics_TogglerButtons5_C::Button_03' has a wrong offset!");
static_assert(offsetof(UWBP_Graphics_TogglerButtons5_C, Button_04) == 0x000520, "Member 'UWBP_Graphics_TogglerButtons5_C::Button_04' has a wrong offset!");
static_assert(offsetof(UWBP_Graphics_TogglerButtons5_C, Button_05) == 0x000528, "Member 'UWBP_Graphics_TogglerButtons5_C::Button_05' has a wrong offset!");
static_assert(offsetof(UWBP_Graphics_TogglerButtons5_C, RowLabel_Text) == 0x000530, "Member 'UWBP_Graphics_TogglerButtons5_C::RowLabel_Text' has a wrong offset!");
static_assert(offsetof(UWBP_Graphics_TogglerButtons5_C, Value_Text) == 0x000538, "Member 'UWBP_Graphics_TogglerButtons5_C::Value_Text' has a wrong offset!");
static_assert(offsetof(UWBP_Graphics_TogglerButtons5_C, CurrentButtonLabel) == 0x000540, "Member 'UWBP_Graphics_TogglerButtons5_C::CurrentButtonLabel' has a wrong offset!");
static_assert(offsetof(UWBP_Graphics_TogglerButtons5_C, Local_OptionsTextArray) == 0x000558, "Member 'UWBP_Graphics_TogglerButtons5_C::Local_OptionsTextArray' has a wrong offset!");

}

