#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Modern_Settings_SettingsPanel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CommonInput_structs.hpp"
#include "Altar_structs.hpp"
#include "Altar_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Modern_Settings_SettingsPanel.WBP_Modern_Settings_SettingsPanel_C
// 0x0050 (0x0558 - 0x0508)
class UWBP_Modern_Settings_SettingsPanel_C final : public UVAltarNavigableScrollBox
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0508(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FMargin                                ItemsPadding;                                      // 0x0510(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	TMulticastInlineDelegate<void(const struct FModernSettingTableRow& SettingData)> OnSettingsHoverred; // 0x0520(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<struct FModernSettingCategoryTableRow> Data;                                              // 0x0530(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	TArray<class UVModernSettingWidget*>          SettingsWidget;                                    // 0x0540(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                          IsPopulated;                                       // 0x0550(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnActivated();
	void BP_Update_Lock_State(bool NewLockState);
	void Clear();
	void Construct();
	void CreateSettingCategoryWidget(const struct FModernSettingCategoryTableRow& CurrentData);
	void CreateSettingWidget(const struct FModernSettingTableRow& CurrentSettingData);
	void Destruct();
	void ExecuteUbergraph_WBP_Modern_Settings_SettingsPanel(int32 EntryPoint);
	void HaveAnySettingsForCurrentPlatform(const struct FModernSettingCategoryTableRow& Category, bool* Value);
	void OnChildHoveredBP(const TScriptInterface<class IVEnhancedInputNavigable>& HoveredWidget);
	void OnInputMethodChanged(ECommonInputType bNewInputType);
	void OnRequestChangeScrollState(bool NewState);
	void OnSettingFocussed(class UVModernSettingWidget* FocussedSettings);
	void Populate(TArray<struct FModernSettingCategoryTableRow>& NewData);
	void PreConstruct(bool IsDesignTime);
	void ResetSettingsToDefault();
	void SetScrollbarInputHint();

	bool DoesAllowNavigation() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Modern_Settings_SettingsPanel_C">();
	}
	static class UWBP_Modern_Settings_SettingsPanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Modern_Settings_SettingsPanel_C>();
	}
};
static_assert(alignof(UWBP_Modern_Settings_SettingsPanel_C) == 0x000008, "Wrong alignment on UWBP_Modern_Settings_SettingsPanel_C");
static_assert(sizeof(UWBP_Modern_Settings_SettingsPanel_C) == 0x000558, "Wrong size on UWBP_Modern_Settings_SettingsPanel_C");
static_assert(offsetof(UWBP_Modern_Settings_SettingsPanel_C, UberGraphFrame) == 0x000508, "Member 'UWBP_Modern_Settings_SettingsPanel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_SettingsPanel_C, ItemsPadding) == 0x000510, "Member 'UWBP_Modern_Settings_SettingsPanel_C::ItemsPadding' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_SettingsPanel_C, OnSettingsHoverred) == 0x000520, "Member 'UWBP_Modern_Settings_SettingsPanel_C::OnSettingsHoverred' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_SettingsPanel_C, Data) == 0x000530, "Member 'UWBP_Modern_Settings_SettingsPanel_C::Data' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_SettingsPanel_C, SettingsWidget) == 0x000540, "Member 'UWBP_Modern_Settings_SettingsPanel_C::SettingsWidget' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_SettingsPanel_C, IsPopulated) == 0x000550, "Member 'UWBP_Modern_Settings_SettingsPanel_C::IsPopulated' has a wrong offset!");

}

