#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PrimitiveComponentEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Altar_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PrimitiveComponentEntry.WBP_PrimitiveComponentEntry_C
// 0x0050 (0x0320 - 0x02D0)
class UWBP_PrimitiveComponentEntry_C final : public UNavigationListviewEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             AffectNavigationKeyText;                           // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             AffectNavigationValueText;                         // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_0;                                          // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CollisionProfileName;                              // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ComponentName;                                     // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_65;                                          // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             MobilityText;                                      // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             OverlapEventKeyText;                               // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             OverlapEventValueText;                             // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void DisplayBoolValue(bool Value, class UTextBlock* Text, class UTextBlock* LinkedText);
	void ExecuteUbergraph_WBP_PrimitiveComponentEntry(int32 EntryPoint);
	void OnListItemObjectSet(class UObject* ListItemObject);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PrimitiveComponentEntry_C">();
	}
	static class UWBP_PrimitiveComponentEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PrimitiveComponentEntry_C>();
	}
};
static_assert(alignof(UWBP_PrimitiveComponentEntry_C) == 0x000008, "Wrong alignment on UWBP_PrimitiveComponentEntry_C");
static_assert(sizeof(UWBP_PrimitiveComponentEntry_C) == 0x000320, "Wrong size on UWBP_PrimitiveComponentEntry_C");
static_assert(offsetof(UWBP_PrimitiveComponentEntry_C, UberGraphFrame) == 0x0002D0, "Member 'UWBP_PrimitiveComponentEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PrimitiveComponentEntry_C, AffectNavigationKeyText) == 0x0002D8, "Member 'UWBP_PrimitiveComponentEntry_C::AffectNavigationKeyText' has a wrong offset!");
static_assert(offsetof(UWBP_PrimitiveComponentEntry_C, AffectNavigationValueText) == 0x0002E0, "Member 'UWBP_PrimitiveComponentEntry_C::AffectNavigationValueText' has a wrong offset!");
static_assert(offsetof(UWBP_PrimitiveComponentEntry_C, Border_0) == 0x0002E8, "Member 'UWBP_PrimitiveComponentEntry_C::Border_0' has a wrong offset!");
static_assert(offsetof(UWBP_PrimitiveComponentEntry_C, CollisionProfileName) == 0x0002F0, "Member 'UWBP_PrimitiveComponentEntry_C::CollisionProfileName' has a wrong offset!");
static_assert(offsetof(UWBP_PrimitiveComponentEntry_C, ComponentName) == 0x0002F8, "Member 'UWBP_PrimitiveComponentEntry_C::ComponentName' has a wrong offset!");
static_assert(offsetof(UWBP_PrimitiveComponentEntry_C, Image_65) == 0x000300, "Member 'UWBP_PrimitiveComponentEntry_C::Image_65' has a wrong offset!");
static_assert(offsetof(UWBP_PrimitiveComponentEntry_C, MobilityText) == 0x000308, "Member 'UWBP_PrimitiveComponentEntry_C::MobilityText' has a wrong offset!");
static_assert(offsetof(UWBP_PrimitiveComponentEntry_C, OverlapEventKeyText) == 0x000310, "Member 'UWBP_PrimitiveComponentEntry_C::OverlapEventKeyText' has a wrong offset!");
static_assert(offsetof(UWBP_PrimitiveComponentEntry_C, OverlapEventValueText) == 0x000318, "Member 'UWBP_PrimitiveComponentEntry_C::OverlapEventValueText' has a wrong offset!");

}

