#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Altar_structs.hpp"


namespace SDK::Params
{

// Function WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects.WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C.ExecuteUbergraph_WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects
// 0x0004 (0x0004 - 0x0000)
struct WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects) == 0x000004, "Wrong alignment on WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects");
static_assert(sizeof(WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects) == 0x000004, "Wrong size on WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects, EntryPoint) == 0x000000, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects::EntryPoint' has a wrong offset!");

// Function WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects.WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C.HideAllEffects
// 0x0048 (0x0048 - 0x0000)
struct WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_HideAllEffects final
{
public:
	class UWidget*                                Local_CurrentWidget;                               // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue_1;              // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_OriginalImageTile_C*               CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_OriginalMenu_IngredientEffect_C*   CallFunc_Array_Get_Item_1;                         // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_HideAllEffects) == 0x000008, "Wrong alignment on WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_HideAllEffects");
static_assert(sizeof(WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_HideAllEffects) == 0x000048, "Wrong size on WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_HideAllEffects");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_HideAllEffects, Local_CurrentWidget) == 0x000000, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_HideAllEffects::Local_CurrentWidget' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_HideAllEffects, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_HideAllEffects::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_HideAllEffects, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_HideAllEffects::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_HideAllEffects, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_HideAllEffects::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_HideAllEffects, Temp_int_Array_Index_Variable_1) == 0x000014, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_HideAllEffects::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_HideAllEffects, Temp_int_Loop_Counter_Variable_1) == 0x000018, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_HideAllEffects::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_HideAllEffects, CallFunc_Add_IntInt_ReturnValue_1) == 0x00001C, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_HideAllEffects::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_HideAllEffects, CallFunc_GetVisibility_ReturnValue) == 0x000020, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_HideAllEffects::CallFunc_GetVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_HideAllEffects, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000021, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_HideAllEffects::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_HideAllEffects, CallFunc_GetVisibility_ReturnValue_1) == 0x000022, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_HideAllEffects::CallFunc_GetVisibility_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_HideAllEffects, CallFunc_NotEqual_ByteByte_ReturnValue_1) == 0x000023, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_HideAllEffects::CallFunc_NotEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_HideAllEffects, CallFunc_Array_Get_Item) == 0x000028, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_HideAllEffects::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_HideAllEffects, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_HideAllEffects::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_HideAllEffects, CallFunc_Less_IntInt_ReturnValue) == 0x000034, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_HideAllEffects::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_HideAllEffects, CallFunc_Array_Get_Item_1) == 0x000038, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_HideAllEffects::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_HideAllEffects, CallFunc_Array_Length_ReturnValue_1) == 0x000040, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_HideAllEffects::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_HideAllEffects, CallFunc_Less_IntInt_ReturnValue_1) == 0x000044, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_HideAllEffects::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects.WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C.MakeArraysIfNeeded
// 0x000C (0x000C - 0x0000)
struct WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_MakeArraysIfNeeded final
{
public:
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_MakeArraysIfNeeded) == 0x000004, "Wrong alignment on WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_MakeArraysIfNeeded");
static_assert(sizeof(WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_MakeArraysIfNeeded) == 0x00000C, "Wrong size on WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_MakeArraysIfNeeded");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_MakeArraysIfNeeded, CallFunc_Array_Length_ReturnValue) == 0x000000, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_MakeArraysIfNeeded::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_MakeArraysIfNeeded, CallFunc_Array_Length_ReturnValue_1) == 0x000004, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_MakeArraysIfNeeded::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_MakeArraysIfNeeded, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000008, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_MakeArraysIfNeeded::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_MakeArraysIfNeeded, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000009, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_MakeArraysIfNeeded::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");

// Function WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects.WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C.MakeEffectsArray
// 0x0010 (0x0010 - 0x0000)
struct WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_MakeEffectsArray final
{
public:
	TArray<class UWBP_OriginalMenu_IngredientEffect_C*> K2Node_MakeArray_Array;                      // 0x0000(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_MakeEffectsArray) == 0x000008, "Wrong alignment on WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_MakeEffectsArray");
static_assert(sizeof(WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_MakeEffectsArray) == 0x000010, "Wrong size on WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_MakeEffectsArray");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_MakeEffectsArray, K2Node_MakeArray_Array) == 0x000000, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_MakeEffectsArray::K2Node_MakeArray_Array' has a wrong offset!");

// Function WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects.WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C.MakeSeperatorsArray
// 0x0010 (0x0010 - 0x0000)
struct WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_MakeSeperatorsArray final
{
public:
	TArray<class UWBP_OriginalImageTile_C*>       K2Node_MakeArray_Array;                            // 0x0000(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_MakeSeperatorsArray) == 0x000008, "Wrong alignment on WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_MakeSeperatorsArray");
static_assert(sizeof(WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_MakeSeperatorsArray) == 0x000010, "Wrong size on WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_MakeSeperatorsArray");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_MakeSeperatorsArray, K2Node_MakeArray_Array) == 0x000000, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_MakeSeperatorsArray::K2Node_MakeArray_Array' has a wrong offset!");

// Function WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects.WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C.SetEffect
// 0x0100 (0x0100 - 0x0000)
struct WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_SetEffect final
{
public:
	class UWBP_Original_ImageAndText_C*           Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Icon;                                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   Text;                                              // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0030(0x00D0)()
};
static_assert(alignof(WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_SetEffect) == 0x000010, "Wrong alignment on WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_SetEffect");
static_assert(sizeof(WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_SetEffect) == 0x000100, "Wrong size on WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_SetEffect");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_SetEffect, Target) == 0x000000, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_SetEffect::Target' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_SetEffect, Icon) == 0x000008, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_SetEffect::Icon' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_SetEffect, Text) == 0x000010, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_SetEffect::Text' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_SetEffect, K2Node_MakeStruct_SlateBrush) == 0x000030, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_SetEffect::K2Node_MakeStruct_SlateBrush' has a wrong offset!");

// Function WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects.WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C.UpdateEffects
// 0x0050 (0x0050 - 0x0000)
struct WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_UpdateEffects final
{
public:
	TArray<struct FOriginalInventoryMenuIngredientEffects> NewEffects;                               // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         Local_CurrentIndex;                                // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_OriginalMenu_IngredientEffect_C*   CallFunc_Array_Get_Item_1;                         // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_OriginalMenu_IngredientEffect_C*   CallFunc_Array_Get_Item_2;                         // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_UpdateEffects) == 0x000008, "Wrong alignment on WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_UpdateEffects");
static_assert(sizeof(WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_UpdateEffects) == 0x000050, "Wrong size on WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_UpdateEffects");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_UpdateEffects, NewEffects) == 0x000000, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_UpdateEffects::NewEffects' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_UpdateEffects, Local_CurrentIndex) == 0x000010, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_UpdateEffects::Local_CurrentIndex' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_UpdateEffects, Temp_int_Variable) == 0x000014, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_UpdateEffects::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_UpdateEffects, CallFunc_Array_Get_Item) == 0x000018, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_UpdateEffects::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_UpdateEffects, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_UpdateEffects::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_UpdateEffects, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_UpdateEffects::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_UpdateEffects, CallFunc_Array_Get_Item_1) == 0x000028, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_UpdateEffects::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_UpdateEffects, CallFunc_Array_Length_ReturnValue_1) == 0x000030, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_UpdateEffects::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_UpdateEffects, CallFunc_Array_Get_Item_2) == 0x000038, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_UpdateEffects::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_UpdateEffects, CallFunc_Greater_IntInt_ReturnValue) == 0x000040, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_UpdateEffects::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_UpdateEffects, CallFunc_Array_Length_ReturnValue_2) == 0x000044, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_UpdateEffects::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_UpdateEffects, CallFunc_Subtract_IntInt_ReturnValue) == 0x000048, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_UpdateEffects::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_UpdateEffects, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00004C, "Member 'WBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C_UpdateEffects::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

}

