#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModernMenu_StatsPage2_Details

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Altar_structs.hpp"


namespace SDK::Params
{

// Function WBP_ModernMenu_StatsPage2_Details.WBP_ModernMenu_StatsPage2_Details_C.SetContent
// 0x0028 (0x0028 - 0x0000)
struct WBP_ModernMenu_StatsPage2_Details_C_SetContent final
{
public:
	struct FLegacyStatsMenuPopupContent           Content;                                           // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_ModernMenu_StatsPage2_Details_C_SetContent) == 0x000008, "Wrong alignment on WBP_ModernMenu_StatsPage2_Details_C_SetContent");
static_assert(sizeof(WBP_ModernMenu_StatsPage2_Details_C_SetContent) == 0x000028, "Wrong size on WBP_ModernMenu_StatsPage2_Details_C_SetContent");
static_assert(offsetof(WBP_ModernMenu_StatsPage2_Details_C_SetContent, Content) == 0x000000, "Member 'WBP_ModernMenu_StatsPage2_Details_C_SetContent::Content' has a wrong offset!");

// Function WBP_ModernMenu_StatsPage2_Details.WBP_ModernMenu_StatsPage2_Details_C.SetImage
// 0x00F0 (0x00F0 - 0x0000)
struct WBP_ModernMenu_StatsPage2_Details_C_SetImage final
{
public:
	class UTexture2D*                             Texture;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Blueprint_GetSizeY_ReturnValue;           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Blueprint_GetSizeX_ReturnValue;           // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            CallFunc_MakeBrushFromTexture_ReturnValue;         // 0x0010(0x00D0)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_StatsPage2_Details_C_SetImage) == 0x000010, "Wrong alignment on WBP_ModernMenu_StatsPage2_Details_C_SetImage");
static_assert(sizeof(WBP_ModernMenu_StatsPage2_Details_C_SetImage) == 0x0000F0, "Wrong size on WBP_ModernMenu_StatsPage2_Details_C_SetImage");
static_assert(offsetof(WBP_ModernMenu_StatsPage2_Details_C_SetImage, Texture) == 0x000000, "Member 'WBP_ModernMenu_StatsPage2_Details_C_SetImage::Texture' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage2_Details_C_SetImage, CallFunc_Blueprint_GetSizeY_ReturnValue) == 0x000008, "Member 'WBP_ModernMenu_StatsPage2_Details_C_SetImage::CallFunc_Blueprint_GetSizeY_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage2_Details_C_SetImage, CallFunc_Blueprint_GetSizeX_ReturnValue) == 0x00000C, "Member 'WBP_ModernMenu_StatsPage2_Details_C_SetImage::CallFunc_Blueprint_GetSizeX_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage2_Details_C_SetImage, CallFunc_MakeBrushFromTexture_ReturnValue) == 0x000010, "Member 'WBP_ModernMenu_StatsPage2_Details_C_SetImage::CallFunc_MakeBrushFromTexture_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_StatsPage2_Details_C_SetImage, CallFunc_IsValid_ReturnValue) == 0x0000E0, "Member 'WBP_ModernMenu_StatsPage2_Details_C_SetImage::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_ModernMenu_StatsPage2_Details.WBP_ModernMenu_StatsPage2_Details_C.SetModernContent
// 0x0018 (0x0018 - 0x0000)
struct WBP_ModernMenu_StatsPage2_Details_C_SetModernContent final
{
public:
	class FText                                   TitleText;                                         // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_ModernMenu_StatsPage2_Details_C_SetModernContent) == 0x000008, "Wrong alignment on WBP_ModernMenu_StatsPage2_Details_C_SetModernContent");
static_assert(sizeof(WBP_ModernMenu_StatsPage2_Details_C_SetModernContent) == 0x000018, "Wrong size on WBP_ModernMenu_StatsPage2_Details_C_SetModernContent");
static_assert(offsetof(WBP_ModernMenu_StatsPage2_Details_C_SetModernContent, TitleText) == 0x000000, "Member 'WBP_ModernMenu_StatsPage2_Details_C_SetModernContent::TitleText' has a wrong offset!");

}

