#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModernMenu_Stats_LevelDescription

#include "Basic.hpp"

#include "CommonInput_structs.hpp"
#include "Altar_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_ModernMenu_Stats_LevelDescription.WBP_ModernMenu_Stats_LevelDescription_C.ExecuteUbergraph_WBP_ModernMenu_Stats_LevelDescription
// 0x0028 (0x0028 - 0x0000)
struct WBP_ModernMenu_Stats_LevelDescription_C_ExecuteUbergraph_WBP_ModernMenu_Stats_LevelDescription final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              K2Node_CustomEvent_bNewInputType;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_Stats_LevelDescription_C_ExecuteUbergraph_WBP_ModernMenu_Stats_LevelDescription) == 0x000008, "Wrong alignment on WBP_ModernMenu_Stats_LevelDescription_C_ExecuteUbergraph_WBP_ModernMenu_Stats_LevelDescription");
static_assert(sizeof(WBP_ModernMenu_Stats_LevelDescription_C_ExecuteUbergraph_WBP_ModernMenu_Stats_LevelDescription) == 0x000028, "Wrong size on WBP_ModernMenu_Stats_LevelDescription_C_ExecuteUbergraph_WBP_ModernMenu_Stats_LevelDescription");
static_assert(offsetof(WBP_ModernMenu_Stats_LevelDescription_C_ExecuteUbergraph_WBP_ModernMenu_Stats_LevelDescription, EntryPoint) == 0x000000, "Member 'WBP_ModernMenu_Stats_LevelDescription_C_ExecuteUbergraph_WBP_ModernMenu_Stats_LevelDescription::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Stats_LevelDescription_C_ExecuteUbergraph_WBP_ModernMenu_Stats_LevelDescription, K2Node_CustomEvent_bNewInputType) == 0x000004, "Member 'WBP_ModernMenu_Stats_LevelDescription_C_ExecuteUbergraph_WBP_ModernMenu_Stats_LevelDescription::K2Node_CustomEvent_bNewInputType' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Stats_LevelDescription_C_ExecuteUbergraph_WBP_ModernMenu_Stats_LevelDescription, K2Node_Event_IsDesignTime) == 0x000005, "Member 'WBP_ModernMenu_Stats_LevelDescription_C_ExecuteUbergraph_WBP_ModernMenu_Stats_LevelDescription::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Stats_LevelDescription_C_ExecuteUbergraph_WBP_ModernMenu_Stats_LevelDescription, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'WBP_ModernMenu_Stats_LevelDescription_C_ExecuteUbergraph_WBP_ModernMenu_Stats_LevelDescription::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Stats_LevelDescription_C_ExecuteUbergraph_WBP_ModernMenu_Stats_LevelDescription, CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue) == 0x000010, "Member 'WBP_ModernMenu_Stats_LevelDescription_C_ExecuteUbergraph_WBP_ModernMenu_Stats_LevelDescription::CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Stats_LevelDescription_C_ExecuteUbergraph_WBP_ModernMenu_Stats_LevelDescription, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'WBP_ModernMenu_Stats_LevelDescription_C_ExecuteUbergraph_WBP_ModernMenu_Stats_LevelDescription::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function WBP_ModernMenu_Stats_LevelDescription.WBP_ModernMenu_Stats_LevelDescription_C.InitCommonTexts
// 0x0060 (0x0060 - 0x0000)
struct WBP_ModernMenu_Stats_LevelDescription_C_InitCommonTexts final
{
public:
	struct FModern_StatMenuLevelTableRow          CallFunc_GetDataTableRowFromName_OutRow;           // 0x0000(0x0040)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0048(0x0018)()
};
static_assert(alignof(WBP_ModernMenu_Stats_LevelDescription_C_InitCommonTexts) == 0x000008, "Wrong alignment on WBP_ModernMenu_Stats_LevelDescription_C_InitCommonTexts");
static_assert(sizeof(WBP_ModernMenu_Stats_LevelDescription_C_InitCommonTexts) == 0x000060, "Wrong size on WBP_ModernMenu_Stats_LevelDescription_C_InitCommonTexts");
static_assert(offsetof(WBP_ModernMenu_Stats_LevelDescription_C_InitCommonTexts, CallFunc_GetDataTableRowFromName_OutRow) == 0x000000, "Member 'WBP_ModernMenu_Stats_LevelDescription_C_InitCommonTexts::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Stats_LevelDescription_C_InitCommonTexts, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000040, "Member 'WBP_ModernMenu_Stats_LevelDescription_C_InitCommonTexts::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Stats_LevelDescription_C_InitCommonTexts, CallFunc_Conv_IntToText_ReturnValue) == 0x000048, "Member 'WBP_ModernMenu_Stats_LevelDescription_C_InitCommonTexts::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

// Function WBP_ModernMenu_Stats_LevelDescription.WBP_ModernMenu_Stats_LevelDescription_C.InitData
// 0x0068 (0x0068 - 0x0000)
struct WBP_ModernMenu_Stats_LevelDescription_C_InitData final
{
public:
	class FName                                   RowKey;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FModern_StatMenuLevelTableRow          CallFunc_GetDataTableRowFromName_OutRow;           // 0x0008(0x0040)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0050(0x0018)()
};
static_assert(alignof(WBP_ModernMenu_Stats_LevelDescription_C_InitData) == 0x000008, "Wrong alignment on WBP_ModernMenu_Stats_LevelDescription_C_InitData");
static_assert(sizeof(WBP_ModernMenu_Stats_LevelDescription_C_InitData) == 0x000068, "Wrong size on WBP_ModernMenu_Stats_LevelDescription_C_InitData");
static_assert(offsetof(WBP_ModernMenu_Stats_LevelDescription_C_InitData, RowKey) == 0x000000, "Member 'WBP_ModernMenu_Stats_LevelDescription_C_InitData::RowKey' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Stats_LevelDescription_C_InitData, CallFunc_GetDataTableRowFromName_OutRow) == 0x000008, "Member 'WBP_ModernMenu_Stats_LevelDescription_C_InitData::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Stats_LevelDescription_C_InitData, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000048, "Member 'WBP_ModernMenu_Stats_LevelDescription_C_InitData::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Stats_LevelDescription_C_InitData, CallFunc_Conv_IntToText_ReturnValue) == 0x000050, "Member 'WBP_ModernMenu_Stats_LevelDescription_C_InitData::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

// Function WBP_ModernMenu_Stats_LevelDescription.WBP_ModernMenu_Stats_LevelDescription_C.OnInputMethodChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_ModernMenu_Stats_LevelDescription_C_OnInputMethodChanged final
{
public:
	ECommonInputType                              bNewInputType;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_Stats_LevelDescription_C_OnInputMethodChanged) == 0x000001, "Wrong alignment on WBP_ModernMenu_Stats_LevelDescription_C_OnInputMethodChanged");
static_assert(sizeof(WBP_ModernMenu_Stats_LevelDescription_C_OnInputMethodChanged) == 0x000001, "Wrong size on WBP_ModernMenu_Stats_LevelDescription_C_OnInputMethodChanged");
static_assert(offsetof(WBP_ModernMenu_Stats_LevelDescription_C_OnInputMethodChanged, bNewInputType) == 0x000000, "Member 'WBP_ModernMenu_Stats_LevelDescription_C_OnInputMethodChanged::bNewInputType' has a wrong offset!");

// Function WBP_ModernMenu_Stats_LevelDescription.WBP_ModernMenu_Stats_LevelDescription_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_ModernMenu_Stats_LevelDescription_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_Stats_LevelDescription_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_ModernMenu_Stats_LevelDescription_C_PreConstruct");
static_assert(sizeof(WBP_ModernMenu_Stats_LevelDescription_C_PreConstruct) == 0x000001, "Wrong size on WBP_ModernMenu_Stats_LevelDescription_C_PreConstruct");
static_assert(offsetof(WBP_ModernMenu_Stats_LevelDescription_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_ModernMenu_Stats_LevelDescription_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_ModernMenu_Stats_LevelDescription.WBP_ModernMenu_Stats_LevelDescription_C.SetupLine
// 0x0002 (0x0002 - 0x0000)
struct WBP_ModernMenu_Stats_LevelDescription_C_SetupLine final
{
public:
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_Stats_LevelDescription_C_SetupLine) == 0x000001, "Wrong alignment on WBP_ModernMenu_Stats_LevelDescription_C_SetupLine");
static_assert(sizeof(WBP_ModernMenu_Stats_LevelDescription_C_SetupLine) == 0x000002, "Wrong size on WBP_ModernMenu_Stats_LevelDescription_C_SetupLine");
static_assert(offsetof(WBP_ModernMenu_Stats_LevelDescription_C_SetupLine, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000000, "Member 'WBP_ModernMenu_Stats_LevelDescription_C_SetupLine::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Stats_LevelDescription_C_SetupLine, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000001, "Member 'WBP_ModernMenu_Stats_LevelDescription_C_SetupLine::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");

// Function WBP_ModernMenu_Stats_LevelDescription.WBP_ModernMenu_Stats_LevelDescription_C.UpdateState
// 0x0020 (0x0020 - 0x0000)
struct WBP_ModernMenu_Stats_LevelDescription_C_UpdateState final
{
public:
	int32                                         CurrentLevel;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Local_IsActive;                                    // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B[0x1];                                       // 0x001B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast;  // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_Stats_LevelDescription_C_UpdateState) == 0x000008, "Wrong alignment on WBP_ModernMenu_Stats_LevelDescription_C_UpdateState");
static_assert(sizeof(WBP_ModernMenu_Stats_LevelDescription_C_UpdateState) == 0x000020, "Wrong size on WBP_ModernMenu_Stats_LevelDescription_C_UpdateState");
static_assert(offsetof(WBP_ModernMenu_Stats_LevelDescription_C_UpdateState, CurrentLevel) == 0x000000, "Member 'WBP_ModernMenu_Stats_LevelDescription_C_UpdateState::CurrentLevel' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Stats_LevelDescription_C_UpdateState, Local_IsActive) == 0x000004, "Member 'WBP_ModernMenu_Stats_LevelDescription_C_UpdateState::Local_IsActive' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Stats_LevelDescription_C_UpdateState, Temp_bool_Variable) == 0x000005, "Member 'WBP_ModernMenu_Stats_LevelDescription_C_UpdateState::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Stats_LevelDescription_C_UpdateState, Temp_byte_Variable) == 0x000006, "Member 'WBP_ModernMenu_Stats_LevelDescription_C_UpdateState::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Stats_LevelDescription_C_UpdateState, Temp_byte_Variable_1) == 0x000007, "Member 'WBP_ModernMenu_Stats_LevelDescription_C_UpdateState::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Stats_LevelDescription_C_UpdateState, Temp_bool_Variable_1) == 0x000008, "Member 'WBP_ModernMenu_Stats_LevelDescription_C_UpdateState::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Stats_LevelDescription_C_UpdateState, Temp_byte_Variable_2) == 0x000009, "Member 'WBP_ModernMenu_Stats_LevelDescription_C_UpdateState::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Stats_LevelDescription_C_UpdateState, Temp_byte_Variable_3) == 0x00000A, "Member 'WBP_ModernMenu_Stats_LevelDescription_C_UpdateState::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Stats_LevelDescription_C_UpdateState, CallFunc_SelectFloat_ReturnValue) == 0x000010, "Member 'WBP_ModernMenu_Stats_LevelDescription_C_UpdateState::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Stats_LevelDescription_C_UpdateState, K2Node_Select_Default) == 0x000018, "Member 'WBP_ModernMenu_Stats_LevelDescription_C_UpdateState::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Stats_LevelDescription_C_UpdateState, K2Node_Select_Default_1) == 0x000019, "Member 'WBP_ModernMenu_Stats_LevelDescription_C_UpdateState::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Stats_LevelDescription_C_UpdateState, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00001A, "Member 'WBP_ModernMenu_Stats_LevelDescription_C_UpdateState::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_Stats_LevelDescription_C_UpdateState, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast) == 0x00001C, "Member 'WBP_ModernMenu_Stats_LevelDescription_C_UpdateState::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast' has a wrong offset!");

}

