#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_QuickCommandsMenu_View

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_QuickCommandsMenu_View.WBP_QuickCommandsMenu_View_C.ExecuteUbergraph_WBP_QuickCommandsMenu_View
// 0x0018 (0x0018 - 0x0000)
struct WBP_QuickCommandsMenu_View_C_ExecuteUbergraph_WBP_QuickCommandsMenu_View final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_QuickCommandsMenu_View_C_ExecuteUbergraph_WBP_QuickCommandsMenu_View) == 0x000008, "Wrong alignment on WBP_QuickCommandsMenu_View_C_ExecuteUbergraph_WBP_QuickCommandsMenu_View");
static_assert(sizeof(WBP_QuickCommandsMenu_View_C_ExecuteUbergraph_WBP_QuickCommandsMenu_View) == 0x000018, "Wrong size on WBP_QuickCommandsMenu_View_C_ExecuteUbergraph_WBP_QuickCommandsMenu_View");
static_assert(offsetof(WBP_QuickCommandsMenu_View_C_ExecuteUbergraph_WBP_QuickCommandsMenu_View, EntryPoint) == 0x000000, "Member 'WBP_QuickCommandsMenu_View_C_ExecuteUbergraph_WBP_QuickCommandsMenu_View::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_View_C_ExecuteUbergraph_WBP_QuickCommandsMenu_View, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'WBP_QuickCommandsMenu_View_C_ExecuteUbergraph_WBP_QuickCommandsMenu_View::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuickCommandsMenu_View_C_ExecuteUbergraph_WBP_QuickCommandsMenu_View, CallFunc_GetPlayerController_ReturnValue_1) == 0x000010, "Member 'WBP_QuickCommandsMenu_View_C_ExecuteUbergraph_WBP_QuickCommandsMenu_View::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");

}

