#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Modern_HorizontalSlider

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Modern_HorizontalSlider.WBP_Modern_HorizontalSlider_C.ExecuteUbergraph_WBP_Modern_HorizontalSlider
// 0x0018 (0x0018 - 0x0000)
struct WBP_Modern_HorizontalSlider_C_ExecuteUbergraph_WBP_Modern_HorizontalSlider final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_HorizontalSlider_C_ExecuteUbergraph_WBP_Modern_HorizontalSlider) == 0x000008, "Wrong alignment on WBP_Modern_HorizontalSlider_C_ExecuteUbergraph_WBP_Modern_HorizontalSlider");
static_assert(sizeof(WBP_Modern_HorizontalSlider_C_ExecuteUbergraph_WBP_Modern_HorizontalSlider) == 0x000018, "Wrong size on WBP_Modern_HorizontalSlider_C_ExecuteUbergraph_WBP_Modern_HorizontalSlider");
static_assert(offsetof(WBP_Modern_HorizontalSlider_C_ExecuteUbergraph_WBP_Modern_HorizontalSlider, EntryPoint) == 0x000000, "Member 'WBP_Modern_HorizontalSlider_C_ExecuteUbergraph_WBP_Modern_HorizontalSlider::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Modern_HorizontalSlider_C_ExecuteUbergraph_WBP_Modern_HorizontalSlider, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_Modern_HorizontalSlider_C_ExecuteUbergraph_WBP_Modern_HorizontalSlider::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_HorizontalSlider_C_ExecuteUbergraph_WBP_Modern_HorizontalSlider, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'WBP_Modern_HorizontalSlider_C_ExecuteUbergraph_WBP_Modern_HorizontalSlider::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

// Function WBP_Modern_HorizontalSlider.WBP_Modern_HorizontalSlider_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct WBP_Modern_HorizontalSlider_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_HorizontalSlider_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_Modern_HorizontalSlider_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_Modern_HorizontalSlider_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong size on WBP_Modern_HorizontalSlider_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_Modern_HorizontalSlider_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_Modern_HorizontalSlider_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");

}

