#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Modern_QuestEntry

#include "Basic.hpp"

#include "Altar_structs.hpp"
#include "Altar_classes.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Modern_QuestEntry.WBP_Modern_QuestEntry_C
// 0x01B0 (0x0480 - 0x02D0)
class UWBP_Modern_QuestEntry_C final : public UNavigationListviewEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_OriginalImageTile_C*               ActiveQuest_Decorator;                             // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               ActiveQuest_Icon;                                  // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               DecoratorOverlay;                                  // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               EntryDecorator;                                    // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               EntryImage;                                        // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               FocusMarker;                                       // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               Line;                                              // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               MainQuest_Icon;                                    // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay;                                           // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AltarTextBlock_C*                  QuestName;                                         // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_0;                                  // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLegacyMapMenuQuestProperties          Properties;                                        // 0x0330(0x0098)(Edit, BlueprintVisible)
	bool                                          FocusEnabled;                                      // 0x03C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C9[0x7];                                      // 0x03C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLegacyMapMenuQuestProperties          QuestProperties;                                   // 0x03D0(0x0098)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         MainQuestPriorityValue;                            // 0x0468(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDecorator;                                       // 0x046C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          LastSelectedState;                                 // 0x046D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46E[0x2];                                      // 0x046E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           MainQuestLoc;                                      // 0x0470(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void ExecuteUbergraph_WBP_Modern_QuestEntry(int32 EntryPoint);
	void IsMainQuest(const class FText& NewName, bool* IsMainQuest_0);
	void OnListItemObjectSet(class UObject* ListItemObject);
	void SelectStateIcon();
	void SetIcon(class UTexture2D* Texture);
	void SetProperties(const struct FLegacyMapMenuQuestProperties& NewProperties);
	void UpdateEntry();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Modern_QuestEntry_C">();
	}
	static class UWBP_Modern_QuestEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Modern_QuestEntry_C>();
	}
};
static_assert(alignof(UWBP_Modern_QuestEntry_C) == 0x000008, "Wrong alignment on UWBP_Modern_QuestEntry_C");
static_assert(sizeof(UWBP_Modern_QuestEntry_C) == 0x000480, "Wrong size on UWBP_Modern_QuestEntry_C");
static_assert(offsetof(UWBP_Modern_QuestEntry_C, UberGraphFrame) == 0x0002D0, "Member 'UWBP_Modern_QuestEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_QuestEntry_C, ActiveQuest_Decorator) == 0x0002D8, "Member 'UWBP_Modern_QuestEntry_C::ActiveQuest_Decorator' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_QuestEntry_C, ActiveQuest_Icon) == 0x0002E0, "Member 'UWBP_Modern_QuestEntry_C::ActiveQuest_Icon' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_QuestEntry_C, DecoratorOverlay) == 0x0002E8, "Member 'UWBP_Modern_QuestEntry_C::DecoratorOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_QuestEntry_C, EntryDecorator) == 0x0002F0, "Member 'UWBP_Modern_QuestEntry_C::EntryDecorator' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_QuestEntry_C, EntryImage) == 0x0002F8, "Member 'UWBP_Modern_QuestEntry_C::EntryImage' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_QuestEntry_C, FocusMarker) == 0x000300, "Member 'UWBP_Modern_QuestEntry_C::FocusMarker' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_QuestEntry_C, Line) == 0x000308, "Member 'UWBP_Modern_QuestEntry_C::Line' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_QuestEntry_C, MainQuest_Icon) == 0x000310, "Member 'UWBP_Modern_QuestEntry_C::MainQuest_Icon' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_QuestEntry_C, Overlay) == 0x000318, "Member 'UWBP_Modern_QuestEntry_C::Overlay' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_QuestEntry_C, QuestName) == 0x000320, "Member 'UWBP_Modern_QuestEntry_C::QuestName' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_QuestEntry_C, WidgetSwitcher_0) == 0x000328, "Member 'UWBP_Modern_QuestEntry_C::WidgetSwitcher_0' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_QuestEntry_C, Properties) == 0x000330, "Member 'UWBP_Modern_QuestEntry_C::Properties' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_QuestEntry_C, FocusEnabled) == 0x0003C8, "Member 'UWBP_Modern_QuestEntry_C::FocusEnabled' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_QuestEntry_C, QuestProperties) == 0x0003D0, "Member 'UWBP_Modern_QuestEntry_C::QuestProperties' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_QuestEntry_C, MainQuestPriorityValue) == 0x000468, "Member 'UWBP_Modern_QuestEntry_C::MainQuestPriorityValue' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_QuestEntry_C, IsDecorator) == 0x00046C, "Member 'UWBP_Modern_QuestEntry_C::IsDecorator' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_QuestEntry_C, LastSelectedState) == 0x00046D, "Member 'UWBP_Modern_QuestEntry_C::LastSelectedState' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_QuestEntry_C, MainQuestLoc) == 0x000470, "Member 'UWBP_Modern_QuestEntry_C::MainQuestLoc' has a wrong offset!");

}

