#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Modern_Settings_SaveLoadButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "WBP_ModernPrefab_NavigableButton_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Modern_Settings_SaveLoadButton.WBP_Modern_Settings_SaveLoadButton_C
// 0x0040 (0x1700 - 0x16C0)
class UWBP_Modern_Settings_SaveLoadButton_C final : public UWBP_ModernPrefab_NavigableButton_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_Modern_Settings_SaveLoadButton_C; // 0x16C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_ModernPrefab_ControllerInputHint_C* ControllerInput;                                  // 0x16C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               FocusBackground;                                   // 0x16D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AltarTextBlock_C*                  Text;                                              // 0x16D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           FontColor;                                         // 0x16E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnButtonFocussed;                                  // 0x16F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_WBP_Modern_Settings_SaveLoadButton(int32 EntryPoint);
	void OnFocus();
	void OnInitButtonWidgets();
	void OnUnfocus();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Modern_Settings_SaveLoadButton_C">();
	}
	static class UWBP_Modern_Settings_SaveLoadButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Modern_Settings_SaveLoadButton_C>();
	}
};
static_assert(alignof(UWBP_Modern_Settings_SaveLoadButton_C) == 0x000010, "Wrong alignment on UWBP_Modern_Settings_SaveLoadButton_C");
static_assert(sizeof(UWBP_Modern_Settings_SaveLoadButton_C) == 0x001700, "Wrong size on UWBP_Modern_Settings_SaveLoadButton_C");
static_assert(offsetof(UWBP_Modern_Settings_SaveLoadButton_C, UberGraphFrame_WBP_Modern_Settings_SaveLoadButton_C) == 0x0016C0, "Member 'UWBP_Modern_Settings_SaveLoadButton_C::UberGraphFrame_WBP_Modern_Settings_SaveLoadButton_C' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_SaveLoadButton_C, ControllerInput) == 0x0016C8, "Member 'UWBP_Modern_Settings_SaveLoadButton_C::ControllerInput' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_SaveLoadButton_C, FocusBackground) == 0x0016D0, "Member 'UWBP_Modern_Settings_SaveLoadButton_C::FocusBackground' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_SaveLoadButton_C, Text) == 0x0016D8, "Member 'UWBP_Modern_Settings_SaveLoadButton_C::Text' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_SaveLoadButton_C, FontColor) == 0x0016E0, "Member 'UWBP_Modern_Settings_SaveLoadButton_C::FontColor' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_SaveLoadButton_C, OnButtonFocussed) == 0x0016F0, "Member 'UWBP_Modern_Settings_SaveLoadButton_C::OnButtonFocussed' has a wrong offset!");

}

