#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_AltarHud_Fade

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_AltarHud_Fade.WBP_AltarHud_Fade_C.ExecuteUbergraph_WBP_AltarHud_Fade
// 0x0038 (0x0038 - 0x0000)
struct WBP_AltarHud_Fade_C_ExecuteUbergraph_WBP_AltarHud_Fade final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Modern_LoadingImage_C*             K2Node_DynamicCast_AsWBP_Modern_Loading_Image;     // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULoadingScreenManager*                  CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool InNewVisibility)>         K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_InNewVisibility;                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AltarHud_Fade_C_ExecuteUbergraph_WBP_AltarHud_Fade) == 0x000008, "Wrong alignment on WBP_AltarHud_Fade_C_ExecuteUbergraph_WBP_AltarHud_Fade");
static_assert(sizeof(WBP_AltarHud_Fade_C_ExecuteUbergraph_WBP_AltarHud_Fade) == 0x000038, "Wrong size on WBP_AltarHud_Fade_C_ExecuteUbergraph_WBP_AltarHud_Fade");
static_assert(offsetof(WBP_AltarHud_Fade_C_ExecuteUbergraph_WBP_AltarHud_Fade, EntryPoint) == 0x000000, "Member 'WBP_AltarHud_Fade_C_ExecuteUbergraph_WBP_AltarHud_Fade::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_AltarHud_Fade_C_ExecuteUbergraph_WBP_AltarHud_Fade, Temp_bool_Variable) == 0x000004, "Member 'WBP_AltarHud_Fade_C_ExecuteUbergraph_WBP_AltarHud_Fade::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_AltarHud_Fade_C_ExecuteUbergraph_WBP_AltarHud_Fade, Temp_byte_Variable) == 0x000005, "Member 'WBP_AltarHud_Fade_C_ExecuteUbergraph_WBP_AltarHud_Fade::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_AltarHud_Fade_C_ExecuteUbergraph_WBP_AltarHud_Fade, Temp_byte_Variable_1) == 0x000006, "Member 'WBP_AltarHud_Fade_C_ExecuteUbergraph_WBP_AltarHud_Fade::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_AltarHud_Fade_C_ExecuteUbergraph_WBP_AltarHud_Fade, K2Node_DynamicCast_AsWBP_Modern_Loading_Image) == 0x000008, "Member 'WBP_AltarHud_Fade_C_ExecuteUbergraph_WBP_AltarHud_Fade::K2Node_DynamicCast_AsWBP_Modern_Loading_Image' has a wrong offset!");
static_assert(offsetof(WBP_AltarHud_Fade_C_ExecuteUbergraph_WBP_AltarHud_Fade, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'WBP_AltarHud_Fade_C_ExecuteUbergraph_WBP_AltarHud_Fade::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_AltarHud_Fade_C_ExecuteUbergraph_WBP_AltarHud_Fade, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000018, "Member 'WBP_AltarHud_Fade_C_ExecuteUbergraph_WBP_AltarHud_Fade::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AltarHud_Fade_C_ExecuteUbergraph_WBP_AltarHud_Fade, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'WBP_AltarHud_Fade_C_ExecuteUbergraph_WBP_AltarHud_Fade::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_AltarHud_Fade_C_ExecuteUbergraph_WBP_AltarHud_Fade, K2Node_CustomEvent_InNewVisibility) == 0x000030, "Member 'WBP_AltarHud_Fade_C_ExecuteUbergraph_WBP_AltarHud_Fade::K2Node_CustomEvent_InNewVisibility' has a wrong offset!");
static_assert(offsetof(WBP_AltarHud_Fade_C_ExecuteUbergraph_WBP_AltarHud_Fade, K2Node_Select_Default) == 0x000031, "Member 'WBP_AltarHud_Fade_C_ExecuteUbergraph_WBP_AltarHud_Fade::K2Node_Select_Default' has a wrong offset!");

// Function WBP_AltarHud_Fade.WBP_AltarHud_Fade_C.OnLoadingScreenVisibilityChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_AltarHud_Fade_C_OnLoadingScreenVisibilityChanged final
{
public:
	bool                                          InNewVisibility;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AltarHud_Fade_C_OnLoadingScreenVisibilityChanged) == 0x000001, "Wrong alignment on WBP_AltarHud_Fade_C_OnLoadingScreenVisibilityChanged");
static_assert(sizeof(WBP_AltarHud_Fade_C_OnLoadingScreenVisibilityChanged) == 0x000001, "Wrong size on WBP_AltarHud_Fade_C_OnLoadingScreenVisibilityChanged");
static_assert(offsetof(WBP_AltarHud_Fade_C_OnLoadingScreenVisibilityChanged, InNewVisibility) == 0x000000, "Member 'WBP_AltarHud_Fade_C_OnLoadingScreenVisibilityChanged::InNewVisibility' has a wrong offset!");

// Function WBP_AltarHud_Fade.WBP_AltarHud_Fade_C.IsNavigable
// 0x0001 (0x0001 - 0x0000)
struct WBP_AltarHud_Fade_C_IsNavigable final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AltarHud_Fade_C_IsNavigable) == 0x000001, "Wrong alignment on WBP_AltarHud_Fade_C_IsNavigable");
static_assert(sizeof(WBP_AltarHud_Fade_C_IsNavigable) == 0x000001, "Wrong size on WBP_AltarHud_Fade_C_IsNavigable");
static_assert(offsetof(WBP_AltarHud_Fade_C_IsNavigable, ReturnValue) == 0x000000, "Member 'WBP_AltarHud_Fade_C_IsNavigable::ReturnValue' has a wrong offset!");

}

