#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Graphics_TogglerButtons5

#include "Basic.hpp"

#include "Altar_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_Graphics_TogglerButtons5.WBP_Graphics_TogglerButtons5_C.ButtonSwitch
// 0x000A (0x000A - 0x0000)
struct WBP_Graphics_TogglerButtons5_C_ButtonSwitch final
{
public:
	bool                                          Btn1On;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Btn2On;                                            // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Btn3On;                                            // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Btn4On;                                            // 0x0003(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Btn5On;                                            // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Graphics_TogglerButtons5_C_ButtonSwitch) == 0x000001, "Wrong alignment on WBP_Graphics_TogglerButtons5_C_ButtonSwitch");
static_assert(sizeof(WBP_Graphics_TogglerButtons5_C_ButtonSwitch) == 0x00000A, "Wrong size on WBP_Graphics_TogglerButtons5_C_ButtonSwitch");
static_assert(offsetof(WBP_Graphics_TogglerButtons5_C_ButtonSwitch, Btn1On) == 0x000000, "Member 'WBP_Graphics_TogglerButtons5_C_ButtonSwitch::Btn1On' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons5_C_ButtonSwitch, Btn2On) == 0x000001, "Member 'WBP_Graphics_TogglerButtons5_C_ButtonSwitch::Btn2On' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons5_C_ButtonSwitch, Btn3On) == 0x000002, "Member 'WBP_Graphics_TogglerButtons5_C_ButtonSwitch::Btn3On' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons5_C_ButtonSwitch, Btn4On) == 0x000003, "Member 'WBP_Graphics_TogglerButtons5_C_ButtonSwitch::Btn4On' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons5_C_ButtonSwitch, Btn5On) == 0x000004, "Member 'WBP_Graphics_TogglerButtons5_C_ButtonSwitch::Btn5On' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons5_C_ButtonSwitch, CallFunc_Not_PreBool_ReturnValue) == 0x000005, "Member 'WBP_Graphics_TogglerButtons5_C_ButtonSwitch::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons5_C_ButtonSwitch, CallFunc_Not_PreBool_ReturnValue_1) == 0x000006, "Member 'WBP_Graphics_TogglerButtons5_C_ButtonSwitch::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons5_C_ButtonSwitch, CallFunc_Not_PreBool_ReturnValue_2) == 0x000007, "Member 'WBP_Graphics_TogglerButtons5_C_ButtonSwitch::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons5_C_ButtonSwitch, CallFunc_Not_PreBool_ReturnValue_3) == 0x000008, "Member 'WBP_Graphics_TogglerButtons5_C_ButtonSwitch::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons5_C_ButtonSwitch, CallFunc_Not_PreBool_ReturnValue_4) == 0x000009, "Member 'WBP_Graphics_TogglerButtons5_C_ButtonSwitch::CallFunc_Not_PreBool_ReturnValue_4' has a wrong offset!");

// Function WBP_Graphics_TogglerButtons5.WBP_Graphics_TogglerButtons5_C.ExecuteUbergraph_WBP_Graphics_TogglerButtons5
// 0x0180 (0x0180 - 0x0000)
struct WBP_Graphics_TogglerButtons5_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons5 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0018(0x0018)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0040(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Array_Get_Item;                           // 0x0050(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0068(0x0018)()
	class FText                                   CallFunc_Array_Get_Item_1;                         // 0x0080(0x0018)()
	class FText                                   CallFunc_Array_Get_Item_2;                         // 0x0098(0x0018)()
	class FText                                   CallFunc_Array_Get_Item_3;                         // 0x00B0(0x0018)()
	class FText                                   CallFunc_Array_Get_Item_4;                         // 0x00C8(0x0018)()
	class FText                                   CallFunc_GetLabel_ReturnValue;                     // 0x00E0(0x0018)(ConstParm)
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue;          // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_GraphicsPanel_C*                   K2Node_DynamicCast_AsWBP_Graphics_Panel;           // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_GraphicsPanel_C*                   K2Node_DynamicCast_AsWBP_Graphics_Panel_1;         // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_GraphicsPanel_C*                   K2Node_DynamicCast_AsWBP_Graphics_Panel_2;         // 0x0120(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_GraphicsPanel_C*                   K2Node_DynamicCast_AsWBP_Graphics_Panel_3;         // 0x0130(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_GraphicsPanel_C*                   K2Node_DynamicCast_AsWBP_Graphics_Panel_4;         // 0x0140(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_GraphicsPanel_C*                   K2Node_DynamicCast_AsWBP_Graphics_Panel_5;         // 0x0150(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetLabel_ReturnValue_1;                   // 0x0160(0x0018)(ConstParm)
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue_1;        // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Graphics_TogglerButtons5_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons5) == 0x000008, "Wrong alignment on WBP_Graphics_TogglerButtons5_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons5");
static_assert(sizeof(WBP_Graphics_TogglerButtons5_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons5) == 0x000180, "Wrong size on WBP_Graphics_TogglerButtons5_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons5");
static_assert(offsetof(WBP_Graphics_TogglerButtons5_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons5, EntryPoint) == 0x000000, "Member 'WBP_Graphics_TogglerButtons5_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons5::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons5_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons5, K2Node_MakeArray_Array) == 0x000008, "Member 'WBP_Graphics_TogglerButtons5_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons5::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons5_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons5, CallFunc_Format_ReturnValue) == 0x000018, "Member 'WBP_Graphics_TogglerButtons5_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons5::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons5_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons5, K2Node_CreateDelegate_OutputDelegate) == 0x000030, "Member 'WBP_Graphics_TogglerButtons5_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons5::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons5_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons5, K2Node_MakeArray_Array_1) == 0x000040, "Member 'WBP_Graphics_TogglerButtons5_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons5::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons5_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons5, CallFunc_Array_Get_Item) == 0x000050, "Member 'WBP_Graphics_TogglerButtons5_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons5::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons5_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons5, CallFunc_Format_ReturnValue_1) == 0x000068, "Member 'WBP_Graphics_TogglerButtons5_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons5::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons5_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons5, CallFunc_Array_Get_Item_1) == 0x000080, "Member 'WBP_Graphics_TogglerButtons5_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons5::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons5_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons5, CallFunc_Array_Get_Item_2) == 0x000098, "Member 'WBP_Graphics_TogglerButtons5_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons5::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons5_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons5, CallFunc_Array_Get_Item_3) == 0x0000B0, "Member 'WBP_Graphics_TogglerButtons5_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons5::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons5_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons5, CallFunc_Array_Get_Item_4) == 0x0000C8, "Member 'WBP_Graphics_TogglerButtons5_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons5::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons5_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons5, CallFunc_GetLabel_ReturnValue) == 0x0000E0, "Member 'WBP_Graphics_TogglerButtons5_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons5::CallFunc_GetLabel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons5_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons5, CallFunc_EqualEqual_TextText_ReturnValue) == 0x0000F8, "Member 'WBP_Graphics_TogglerButtons5_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons5::CallFunc_EqualEqual_TextText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons5_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons5, K2Node_DynamicCast_AsWBP_Graphics_Panel) == 0x000100, "Member 'WBP_Graphics_TogglerButtons5_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons5::K2Node_DynamicCast_AsWBP_Graphics_Panel' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons5_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons5, K2Node_DynamicCast_bSuccess) == 0x000108, "Member 'WBP_Graphics_TogglerButtons5_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons5::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons5_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons5, K2Node_DynamicCast_AsWBP_Graphics_Panel_1) == 0x000110, "Member 'WBP_Graphics_TogglerButtons5_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons5::K2Node_DynamicCast_AsWBP_Graphics_Panel_1' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons5_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons5, K2Node_DynamicCast_bSuccess_1) == 0x000118, "Member 'WBP_Graphics_TogglerButtons5_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons5::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons5_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons5, K2Node_DynamicCast_AsWBP_Graphics_Panel_2) == 0x000120, "Member 'WBP_Graphics_TogglerButtons5_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons5::K2Node_DynamicCast_AsWBP_Graphics_Panel_2' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons5_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons5, K2Node_DynamicCast_bSuccess_2) == 0x000128, "Member 'WBP_Graphics_TogglerButtons5_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons5::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons5_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons5, K2Node_DynamicCast_AsWBP_Graphics_Panel_3) == 0x000130, "Member 'WBP_Graphics_TogglerButtons5_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons5::K2Node_DynamicCast_AsWBP_Graphics_Panel_3' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons5_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons5, K2Node_DynamicCast_bSuccess_3) == 0x000138, "Member 'WBP_Graphics_TogglerButtons5_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons5::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons5_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons5, K2Node_DynamicCast_AsWBP_Graphics_Panel_4) == 0x000140, "Member 'WBP_Graphics_TogglerButtons5_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons5::K2Node_DynamicCast_AsWBP_Graphics_Panel_4' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons5_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons5, K2Node_DynamicCast_bSuccess_4) == 0x000148, "Member 'WBP_Graphics_TogglerButtons5_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons5::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons5_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons5, K2Node_DynamicCast_AsWBP_Graphics_Panel_5) == 0x000150, "Member 'WBP_Graphics_TogglerButtons5_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons5::K2Node_DynamicCast_AsWBP_Graphics_Panel_5' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons5_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons5, K2Node_DynamicCast_bSuccess_5) == 0x000158, "Member 'WBP_Graphics_TogglerButtons5_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons5::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons5_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons5, CallFunc_GetLabel_ReturnValue_1) == 0x000160, "Member 'WBP_Graphics_TogglerButtons5_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons5::CallFunc_GetLabel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons5_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons5, CallFunc_EqualEqual_TextText_ReturnValue_1) == 0x000178, "Member 'WBP_Graphics_TogglerButtons5_C_ExecuteUbergraph_WBP_Graphics_TogglerButtons5::CallFunc_EqualEqual_TextText_ReturnValue_1' has a wrong offset!");

// Function WBP_Graphics_TogglerButtons5.WBP_Graphics_TogglerButtons5_C.GetSingleQualityLevel
// 0x0054 (0x0054 - 0x0000)
struct WBP_Graphics_TogglerButtons5_C_GetSingleQualityLevel final
{
public:
	int32                                         Out;                                               // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Result;                                            // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetConsoleVariableIntValue_ReturnValue;   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetConsoleVariableIntValue_ReturnValue_1; // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetConsoleVariableIntValue_ReturnValue_2; // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetConsoleVariableIntValue_ReturnValue_3; // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetConsoleVariableIntValue_ReturnValue_4; // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_4;          // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetConsoleVariableIntValue_ReturnValue_5; // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_5;          // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetConsoleVariableIntValue_ReturnValue_6; // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_6;          // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetConsoleVariableIntValue_ReturnValue_7; // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_7;          // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetConsoleVariableIntValue_ReturnValue_8; // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_8;          // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetConsoleVariableIntValue_ReturnValue_9; // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Graphics_TogglerButtons5_C_GetSingleQualityLevel) == 0x000004, "Wrong alignment on WBP_Graphics_TogglerButtons5_C_GetSingleQualityLevel");
static_assert(sizeof(WBP_Graphics_TogglerButtons5_C_GetSingleQualityLevel) == 0x000054, "Wrong size on WBP_Graphics_TogglerButtons5_C_GetSingleQualityLevel");
static_assert(offsetof(WBP_Graphics_TogglerButtons5_C_GetSingleQualityLevel, Out) == 0x000000, "Member 'WBP_Graphics_TogglerButtons5_C_GetSingleQualityLevel::Out' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons5_C_GetSingleQualityLevel, Result) == 0x000004, "Member 'WBP_Graphics_TogglerButtons5_C_GetSingleQualityLevel::Result' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons5_C_GetSingleQualityLevel, CallFunc_GetConsoleVariableIntValue_ReturnValue) == 0x000008, "Member 'WBP_Graphics_TogglerButtons5_C_GetSingleQualityLevel::CallFunc_GetConsoleVariableIntValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons5_C_GetSingleQualityLevel, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_Graphics_TogglerButtons5_C_GetSingleQualityLevel::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons5_C_GetSingleQualityLevel, CallFunc_GetConsoleVariableIntValue_ReturnValue_1) == 0x000010, "Member 'WBP_Graphics_TogglerButtons5_C_GetSingleQualityLevel::CallFunc_GetConsoleVariableIntValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons5_C_GetSingleQualityLevel, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000014, "Member 'WBP_Graphics_TogglerButtons5_C_GetSingleQualityLevel::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons5_C_GetSingleQualityLevel, CallFunc_GetConsoleVariableIntValue_ReturnValue_2) == 0x000018, "Member 'WBP_Graphics_TogglerButtons5_C_GetSingleQualityLevel::CallFunc_GetConsoleVariableIntValue_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons5_C_GetSingleQualityLevel, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x00001C, "Member 'WBP_Graphics_TogglerButtons5_C_GetSingleQualityLevel::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons5_C_GetSingleQualityLevel, CallFunc_GetConsoleVariableIntValue_ReturnValue_3) == 0x000020, "Member 'WBP_Graphics_TogglerButtons5_C_GetSingleQualityLevel::CallFunc_GetConsoleVariableIntValue_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons5_C_GetSingleQualityLevel, CallFunc_EqualEqual_IntInt_ReturnValue_3) == 0x000024, "Member 'WBP_Graphics_TogglerButtons5_C_GetSingleQualityLevel::CallFunc_EqualEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons5_C_GetSingleQualityLevel, CallFunc_GetConsoleVariableIntValue_ReturnValue_4) == 0x000028, "Member 'WBP_Graphics_TogglerButtons5_C_GetSingleQualityLevel::CallFunc_GetConsoleVariableIntValue_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons5_C_GetSingleQualityLevel, CallFunc_EqualEqual_IntInt_ReturnValue_4) == 0x00002C, "Member 'WBP_Graphics_TogglerButtons5_C_GetSingleQualityLevel::CallFunc_EqualEqual_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons5_C_GetSingleQualityLevel, CallFunc_GetConsoleVariableIntValue_ReturnValue_5) == 0x000030, "Member 'WBP_Graphics_TogglerButtons5_C_GetSingleQualityLevel::CallFunc_GetConsoleVariableIntValue_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons5_C_GetSingleQualityLevel, CallFunc_EqualEqual_IntInt_ReturnValue_5) == 0x000034, "Member 'WBP_Graphics_TogglerButtons5_C_GetSingleQualityLevel::CallFunc_EqualEqual_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons5_C_GetSingleQualityLevel, CallFunc_GetConsoleVariableIntValue_ReturnValue_6) == 0x000038, "Member 'WBP_Graphics_TogglerButtons5_C_GetSingleQualityLevel::CallFunc_GetConsoleVariableIntValue_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons5_C_GetSingleQualityLevel, CallFunc_EqualEqual_IntInt_ReturnValue_6) == 0x00003C, "Member 'WBP_Graphics_TogglerButtons5_C_GetSingleQualityLevel::CallFunc_EqualEqual_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons5_C_GetSingleQualityLevel, CallFunc_GetConsoleVariableIntValue_ReturnValue_7) == 0x000040, "Member 'WBP_Graphics_TogglerButtons5_C_GetSingleQualityLevel::CallFunc_GetConsoleVariableIntValue_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons5_C_GetSingleQualityLevel, CallFunc_EqualEqual_IntInt_ReturnValue_7) == 0x000044, "Member 'WBP_Graphics_TogglerButtons5_C_GetSingleQualityLevel::CallFunc_EqualEqual_IntInt_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons5_C_GetSingleQualityLevel, CallFunc_GetConsoleVariableIntValue_ReturnValue_8) == 0x000048, "Member 'WBP_Graphics_TogglerButtons5_C_GetSingleQualityLevel::CallFunc_GetConsoleVariableIntValue_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons5_C_GetSingleQualityLevel, CallFunc_EqualEqual_IntInt_ReturnValue_8) == 0x00004C, "Member 'WBP_Graphics_TogglerButtons5_C_GetSingleQualityLevel::CallFunc_EqualEqual_IntInt_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons5_C_GetSingleQualityLevel, CallFunc_GetConsoleVariableIntValue_ReturnValue_9) == 0x000050, "Member 'WBP_Graphics_TogglerButtons5_C_GetSingleQualityLevel::CallFunc_GetConsoleVariableIntValue_ReturnValue_9' has a wrong offset!");

// Function WBP_Graphics_TogglerButtons5.WBP_Graphics_TogglerButtons5_C.Refresh
// 0x0088 (0x0088 - 0x0000)
struct WBP_Graphics_TogglerButtons5_C_Refresh final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Array_Get_Item;                           // 0x0010(0x0018)()
	TArray<struct FOriginalVideoOption>           CallFunc_GetOptions_ReturnValue;                   // 0x0028(0x0010)(ConstParm, ReferenceParm)
	class FText                                   CallFunc_GetLabel_ReturnValue;                     // 0x0038(0x0018)(ConstParm)
	struct FOriginalVideoOption                   CallFunc_Array_Get_Item_1;                         // 0x0050(0x0028)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Graphics_TogglerButtons5_C_Refresh) == 0x000008, "Wrong alignment on WBP_Graphics_TogglerButtons5_C_Refresh");
static_assert(sizeof(WBP_Graphics_TogglerButtons5_C_Refresh) == 0x000088, "Wrong size on WBP_Graphics_TogglerButtons5_C_Refresh");
static_assert(offsetof(WBP_Graphics_TogglerButtons5_C_Refresh, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_Graphics_TogglerButtons5_C_Refresh::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons5_C_Refresh, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_Graphics_TogglerButtons5_C_Refresh::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons5_C_Refresh, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_Graphics_TogglerButtons5_C_Refresh::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons5_C_Refresh, CallFunc_Array_Get_Item) == 0x000010, "Member 'WBP_Graphics_TogglerButtons5_C_Refresh::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons5_C_Refresh, CallFunc_GetOptions_ReturnValue) == 0x000028, "Member 'WBP_Graphics_TogglerButtons5_C_Refresh::CallFunc_GetOptions_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons5_C_Refresh, CallFunc_GetLabel_ReturnValue) == 0x000038, "Member 'WBP_Graphics_TogglerButtons5_C_Refresh::CallFunc_GetLabel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons5_C_Refresh, CallFunc_Array_Get_Item_1) == 0x000050, "Member 'WBP_Graphics_TogglerButtons5_C_Refresh::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons5_C_Refresh, CallFunc_Array_Length_ReturnValue) == 0x000078, "Member 'WBP_Graphics_TogglerButtons5_C_Refresh::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons5_C_Refresh, CallFunc_Array_Add_ReturnValue) == 0x00007C, "Member 'WBP_Graphics_TogglerButtons5_C_Refresh::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons5_C_Refresh, CallFunc_Less_IntInt_ReturnValue) == 0x000080, "Member 'WBP_Graphics_TogglerButtons5_C_Refresh::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_Graphics_TogglerButtons5.WBP_Graphics_TogglerButtons5_C.RefreshQualityPresetsOptions
// 0x0040 (0x0040 - 0x0000)
struct WBP_Graphics_TogglerButtons5_C_RefreshQualityPresetsOptions final
{
public:
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSingleQualityLevel_out;                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Array_Get_Item;                           // 0x0008(0x0018)()
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Array_Get_Item_1;                         // 0x0028(0x0018)()
};
static_assert(alignof(WBP_Graphics_TogglerButtons5_C_RefreshQualityPresetsOptions) == 0x000008, "Wrong alignment on WBP_Graphics_TogglerButtons5_C_RefreshQualityPresetsOptions");
static_assert(sizeof(WBP_Graphics_TogglerButtons5_C_RefreshQualityPresetsOptions) == 0x000040, "Wrong size on WBP_Graphics_TogglerButtons5_C_RefreshQualityPresetsOptions");
static_assert(offsetof(WBP_Graphics_TogglerButtons5_C_RefreshQualityPresetsOptions, CallFunc_Array_LastIndex_ReturnValue) == 0x000000, "Member 'WBP_Graphics_TogglerButtons5_C_RefreshQualityPresetsOptions::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons5_C_RefreshQualityPresetsOptions, CallFunc_GetSingleQualityLevel_out) == 0x000004, "Member 'WBP_Graphics_TogglerButtons5_C_RefreshQualityPresetsOptions::CallFunc_GetSingleQualityLevel_out' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons5_C_RefreshQualityPresetsOptions, CallFunc_Array_Get_Item) == 0x000008, "Member 'WBP_Graphics_TogglerButtons5_C_RefreshQualityPresetsOptions::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons5_C_RefreshQualityPresetsOptions, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000020, "Member 'WBP_Graphics_TogglerButtons5_C_RefreshQualityPresetsOptions::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons5_C_RefreshQualityPresetsOptions, K2Node_SwitchInteger_CmpSuccess) == 0x000021, "Member 'WBP_Graphics_TogglerButtons5_C_RefreshQualityPresetsOptions::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons5_C_RefreshQualityPresetsOptions, CallFunc_Array_Get_Item_1) == 0x000028, "Member 'WBP_Graphics_TogglerButtons5_C_RefreshQualityPresetsOptions::CallFunc_Array_Get_Item_1' has a wrong offset!");

// Function WBP_Graphics_TogglerButtons5.WBP_Graphics_TogglerButtons5_C.UpdateValue
// 0x0078 (0x0078 - 0x0000)
struct WBP_Graphics_TogglerButtons5_C_UpdateValue final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FOriginalVideoOption>           CallFunc_GetOptions_ReturnValue;                   // 0x0018(0x0010)(ConstParm, ReferenceParm)
	struct FOriginalVideoOption                   CallFunc_Array_Get_Item;                           // 0x0028(0x0028)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item_1;                         // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue;          // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E[0x2];                                       // 0x006E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Graphics_TogglerButtons5_C_UpdateValue) == 0x000008, "Wrong alignment on WBP_Graphics_TogglerButtons5_C_UpdateValue");
static_assert(sizeof(WBP_Graphics_TogglerButtons5_C_UpdateValue) == 0x000078, "Wrong size on WBP_Graphics_TogglerButtons5_C_UpdateValue");
static_assert(offsetof(WBP_Graphics_TogglerButtons5_C_UpdateValue, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'WBP_Graphics_TogglerButtons5_C_UpdateValue::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Graphics_TogglerButtons5_C_UpdateValue, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'WBP_Graphics_TogglerButtons5_C_UpdateValue::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
