#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModernMenu_MagicDetails

#include "Basic.hpp"

#include "Altar_structs.hpp"
#include "Altar_classes.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ModernMenu_MagicDetails.WBP_ModernMenu_MagicDetails_C
// 0x02C8 (0x0790 - 0x04C8)
class UWBP_ModernMenu_MagicDetails_C final : public UVAltarWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       SchoolIconFadeInOut;                               // 0x04D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       MagicInfoFadeInOut;                                // 0x04D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidgetSwitcher*       Active_Castable_Infos_Switcher;                    // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAnimatableRetainerBox*                 BackgroundPaper;                                   // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           Category_Box;                                      // 0x04F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           Cost_Box;                                          // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               Cost_Separator_Line;                               // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               Infos_BG_and_School_Illustration;                  // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModernMenu_Added_Effects_List_C*   Magic_Active_Added_Effects_List;                   // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               Magic_Active_Icon;                                 // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AltarTextBlock_C*                  Magic_Active_Magnitude_Value;                      // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AltarTextBlock_C*                  Magic_Active_Name;                                 // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AltarTextBlock_C*                  Magic_Active_School;                               // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModernMenu_Added_Effects_List_C*   Magic_Castable_Added_Effects_List;                 // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AltarRichTextBlock_C*              Magic_Castable_CastingFequency_Text;               // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AltarTextBlock_C*                  Magic_Castable_Category_Text;                      // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               Magic_Castable_Catgeory_Icon;                      // 0x0550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AltarTextBlock_C*                  Magic_Castable_Cost_Value;                         // 0x0558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               Magic_Castable_Icon;                               // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AltarTextBlock_C*                  Magic_Castable_ImmuneToSilence;                    // 0x0568(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AltarTextBlock_C*                  Magic_Castable_Name;                               // 0x0570(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AltarTextBlock_C*                  Magic_Castable_Range_Value;                        // 0x0578(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               Magic_Castable_School_Immune_Separator;            // 0x0580(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AltarTextBlock_C*                  Magic_Castable_School_Name;                        // 0x0588(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AltarTextBlock_C*                  Magic_Castable_UniqueWeight_Value;                 // 0x0590(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AltarTextBlock_C*                  Magic_Castable_Weight_Value;                       // 0x0598(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           Range_Box;                                         // 0x05A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               Range_Separator_Line;                              // 0x05A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           Weight_Box;                                        // 0x05B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalImageTile_C*               Weight_Separator_Line;                             // 0x05B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMap<EModernMagicMenuItemSchool, class UTexture2D*> School_Illusatration;                        // 0x05C0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   CanCastOnceText;                                   // 0x0610(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   CanCastOnceADayText;                               // 0x0628(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<ELegacyMagicMenuItemCategory, class UTexture2D*> CatgeoryIllusatration;                     // 0x0640(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<ELegacyMagicMenuItemCategory, class FText> CategoryText;                                    // 0x0690(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<ELegacyMagicMenuItemType, class FText>   TypeText;                                          // 0x06E0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<EModernMagicMenuItemSchool, class FText> SchoolText;                                        // 0x0730(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UMaterialInstanceDynamic*               DMI_IllustrationSchool;                            // 0x0780(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsOnMagicMenu;                                    // 0x0788(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_ModernMenu_MagicDetails(int32 EntryPoint);
	void HideSchoolIllustration(bool bInstant);
	void MakeBrush(class UTexture2D* InTexture, struct FSlateBrush* Brush);
	void PlayFadeAnimation(bool DoFadeIn);
	void UpdateActiveEffectInfos(const struct FLegacyMagicMenuItemProperties& ItemProperties);
	void UpdateCastableInfos(const struct FLegacyMagicMenuItemProperties& ItemProperties);
	void UpdateCastFrequencyText(const struct FLegacyMagicMenuItemProperties& ItemProperties);
	void UpdateInfos(const struct FLegacyMagicMenuItemProperties& ItemProperties);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ModernMenu_MagicDetails_C">();
	}
	static class UWBP_ModernMenu_MagicDetails_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ModernMenu_MagicDetails_C>();
	}
};
static_assert(alignof(UWBP_ModernMenu_MagicDetails_C) == 0x000008, "Wrong alignment on UWBP_ModernMenu_MagicDetails_C");
static_assert(sizeof(UWBP_ModernMenu_MagicDetails_C) == 0x000790, "Wrong size on UWBP_ModernMenu_MagicDetails_C");
static_assert(offsetof(UWBP_ModernMenu_MagicDetails_C, UberGraphFrame) == 0x0004C8, "Member 'UWBP_ModernMenu_MagicDetails_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_MagicDetails_C, SchoolIconFadeInOut) == 0x0004D0, "Member 'UWBP_ModernMenu_MagicDetails_C::SchoolIconFadeInOut' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_MagicDetails_C, MagicInfoFadeInOut) == 0x0004D8, "Member 'UWBP_ModernMenu_MagicDetails_C::MagicInfoFadeInOut' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_MagicDetails_C, Active_Castable_Infos_Switcher) == 0x0004E0, "Member 'UWBP_ModernMenu_MagicDetails_C::Active_Castable_Infos_Switcher' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_MagicDetails_C, BackgroundPaper) == 0x0004E8, "Member 'UWBP_ModernMenu_MagicDetails_C::BackgroundPaper' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_MagicDetails_C, Category_Box) == 0x0004F0, "Member 'UWBP_ModernMenu_MagicDetails_C::Category_Box' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_MagicDetails_C, Cost_Box) == 0x0004F8, "Member 'UWBP_ModernMenu_MagicDetails_C::Cost_Box' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_MagicDetails_C, Cost_Separator_Line) == 0x000500, "Member 'UWBP_ModernMenu_MagicDetails_C::Cost_Separator_Line' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_MagicDetails_C, Infos_BG_and_School_Illustration) == 0x000508, "Member 'UWBP_ModernMenu_MagicDetails_C::Infos_BG_and_School_Illustration' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_MagicDetails_C, Magic_Active_Added_Effects_List) == 0x000510, "Member 'UWBP_ModernMenu_MagicDetails_C::Magic_Active_Added_Effects_List' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_MagicDetails_C, Magic_Active_Icon) == 0x000518, "Member 'UWBP_ModernMenu_MagicDetails_C::Magic_Active_Icon' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_MagicDetails_C, Magic_Active_Magnitude_Value) == 0x000520, "Member 'UWBP_ModernMenu_MagicDetails_C::Magic_Active_Magnitude_Value' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_MagicDetails_C, Magic_Active_Name) == 0x000528, "Member 'UWBP_ModernMenu_MagicDetails_C::Magic_Active_Name' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_MagicDetails_C, Magic_Active_School) == 0x000530, "Member 'UWBP_ModernMenu_MagicDetails_C::Magic_Active_School' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_MagicDetails_C, Magic_Castable_Added_Effects_List) == 0x000538, "Member 'UWBP_ModernMenu_MagicDetails_C::Magic_Castable_Added_Effects_List' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_MagicDetails_C, Magic_Castable_CastingFequency_Text) == 0x000540, "Member 'UWBP_ModernMenu_MagicDetails_C::Magic_Castable_CastingFequency_Text' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_MagicDetails_C, Magic_Castable_Category_Text) == 0x000548, "Member 'UWBP_ModernMenu_MagicDetails_C::Magic_Castable_Category_Text' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_MagicDetails_C, Magic_Castable_Catgeory_Icon) == 0x000550, "Member 'UWBP_ModernMenu_MagicDetails_C::Magic_Castable_Catgeory_Icon' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_MagicDetails_C, Magic_Castable_Cost_Value) == 0x000558, "Member 'UWBP_ModernMenu_MagicDetails_C::Magic_Castable_Cost_Value' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_MagicDetails_C, Magic_Castable_Icon) == 0x000560, "Member 'UWBP_ModernMenu_MagicDetails_C::Magic_Castable_Icon' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_MagicDetails_C, Magic_Castable_ImmuneToSilence) == 0x000568, "Member 'UWBP_ModernMenu_MagicDetails_C::Magic_Castable_ImmuneToSilence' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_MagicDetails_C, Magic_Castable_Name) == 0x000570, "Member 'UWBP_ModernMenu_MagicDetails_C::Magic_Castable_Name' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_MagicDetails_C, Magic_Castable_Range_Value) == 0x000578, "Member 'UWBP_ModernMenu_MagicDetails_C::Magic_Castable_Range_Value' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_MagicDetails_C, Magic_Castable_School_Immune_Separator) == 0x000580, "Member 'UWBP_ModernMenu_MagicDetails_C::Magic_Castable_School_Immune_Separator' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_MagicDetails_C, Magic_Castable_School_Name) == 0x000588, "Member 'UWBP_ModernMenu_MagicDetails_C::Magic_Castable_School_Name' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_MagicDetails_C, Magic_Castable_UniqueWeight_Value) == 0x000590, "Member 'UWBP_ModernMenu_MagicDetails_C::Magic_Castable_UniqueWeight_Value' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_MagicDetails_C, Magic_Castable_Weight_Value) == 0x000598, "Member 'UWBP_ModernMenu_MagicDetails_C::Magic_Castable_Weight_Value' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_MagicDetails_C, Range_Box) == 0x0005A0, "Member 'UWBP_ModernMenu_MagicDetails_C::Range_Box' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_MagicDetails_C, Range_Separator_Line) == 0x0005A8, "Member 'UWBP_ModernMenu_MagicDetails_C::Range_Separator_Line' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_MagicDetails_C, Weight_Box) == 0x0005B0, "Member 'UWBP_ModernMenu_MagicDetails_C::Weight_Box' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_MagicDetails_C, Weight_Separator_Line) == 0x0005B8, "Member 'UWBP_ModernMenu_MagicDetails_C::Weight_Separator_Line' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_MagicDetails_C, School_Illusatration) == 0x0005C0, "Member 'UWBP_ModernMenu_MagicDetails_C::School_Illusatration' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_MagicDetails_C, CanCastOnceText) == 0x000610, "Member 'UWBP_ModernMenu_MagicDetails_C::CanCastOnceText' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_MagicDetails_C, CanCastOnceADayText) == 0x000628, "Member 'UWBP_ModernMenu_MagicDetails_C::CanCastOnceADayText' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_MagicDetails_C, CatgeoryIllusatration) == 0x000640, "Member 'UWBP_ModernMenu_MagicDetails_C::CatgeoryIllusatration' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_MagicDetails_C, CategoryText) == 0x000690, "Member 'UWBP_ModernMenu_MagicDetails_C::CategoryText' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_MagicDetails_C, TypeText) == 0x0006E0, "Member 'UWBP_ModernMenu_MagicDetails_C::TypeText' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_MagicDetails_C, SchoolText) == 0x000730, "Member 'UWBP_ModernMenu_MagicDetails_C::SchoolText' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_MagicDetails_C, DMI_IllustrationSchool) == 0x000780, "Member 'UWBP_ModernMenu_MagicDetails_C::DMI_IllustrationSchool' has a wrong offset!");
static_assert(offsetof(UWBP_ModernMenu_MagicDetails_C, bIsOnMagicMenu) == 0x000788, "Member 'UWBP_ModernMenu_MagicDetails_C::bIsOnMagicMenu' has a wrong offset!");

}

