#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Cursor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Altar_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Cursor.WBP_Cursor_C
// 0x0018 (0x02D8 - 0x02C0)
class UWBP_Cursor_C final : public UVAltarCursor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_OriginalImageTile_C*               WBP_OriginalImageTile;                             // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Visible;                                           // 0x02D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Cursor(int32 EntryPoint);
	void OnUpdateCursorSize(float Delta);
	void OnUpdateCursorVisibility(bool bVisible);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Cursor_C">();
	}
	static class UWBP_Cursor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Cursor_C>();
	}
};
static_assert(alignof(UWBP_Cursor_C) == 0x000008, "Wrong alignment on UWBP_Cursor_C");
static_assert(sizeof(UWBP_Cursor_C) == 0x0002D8, "Wrong size on UWBP_Cursor_C");
static_assert(offsetof(UWBP_Cursor_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_Cursor_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Cursor_C, WBP_OriginalImageTile) == 0x0002C8, "Member 'UWBP_Cursor_C::WBP_OriginalImageTile' has a wrong offset!");
static_assert(offsetof(UWBP_Cursor_C, Visible) == 0x0002D0, "Member 'UWBP_Cursor_C::Visible' has a wrong offset!");

}

