#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Modern_Settings_PresetsWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Altar_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Modern_Settings_PresetsWidget.WBP_Modern_Settings_PresetsWidget_C
// 0x0068 (0x06A8 - 0x0640)
class UWBP_Modern_Settings_PresetsWidget_C final : public UVModernSettingWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0640(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_OriginalImageTile_C*               FocusBackground;                                   // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModernPrefab_ControllerInputHint_C* HintKey;                                          // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               LeftArrowBox;                                      // 0x0658(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                LeftArrowButton;                                   // 0x0660(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Modern_Settings_PresetsBox_C*      PresetsBox;                                        // 0x0668(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               RightArrowBox;                                     // 0x0670(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                RightArrowButton;                                  // 0x0678(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AltarTextBlock_C*                  SettingsLabel;                                     // 0x0680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           FocusColor;                                        // 0x0688(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           UnfocusColor;                                      // 0x0698(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void PreConstruct(bool IsDesignTime);
	void OnUnfocus();
	void OnStepChanged(int32 StepIndex, const class FString& Value);
	void OnSettingNavigateRight();
	void OnSettingNavigateLeft();
	void OnSettingChanged(const struct FModernSettingTableRow& NewSettingRow);
	void OnSettingAccept();
	void OnRefreshWidgetRequested(float Value);
	void OnFocus();
	void OnConsoleVariableChanged();
	void InitializeWidget();
	void ExecuteUbergraph_WBP_Modern_Settings_PresetsWidget(int32 EntryPoint);
	void Construct();
	void BndEvt__WBP_Modern_Settings_PresetsWidget_RightArrowButton_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_Modern_Settings_PresetsWidget_LeftArrowButton_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Modern_Settings_PresetsWidget_C">();
	}
	static class UWBP_Modern_Settings_PresetsWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Modern_Settings_PresetsWidget_C>();
	}
};
static_assert(alignof(UWBP_Modern_Settings_PresetsWidget_C) == 0x000008, "Wrong alignment on UWBP_Modern_Settings_PresetsWidget_C");
static_assert(sizeof(UWBP_Modern_Settings_PresetsWidget_C) == 0x0006A8, "Wrong size on UWBP_Modern_Settings_PresetsWidget_C");
static_assert(offsetof(UWBP_Modern_Settings_PresetsWidget_C, UberGraphFrame) == 0x000640, "Member 'UWBP_Modern_Settings_PresetsWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_PresetsWidget_C, FocusBackground) == 0x000648, "Member 'UWBP_Modern_Settings_PresetsWidget_C::FocusBackground' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_PresetsWidget_C, HintKey) == 0x000650, "Member 'UWBP_Modern_Settings_PresetsWidget_C::HintKey' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_PresetsWidget_C, LeftArrowBox) == 0x000658, "Member 'UWBP_Modern_Settings_PresetsWidget_C::LeftArrowBox' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_PresetsWidget_C, LeftArrowButton) == 0x000660, "Member 'UWBP_Modern_Settings_PresetsWidget_C::LeftArrowButton' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_PresetsWidget_C, PresetsBox) == 0x000668, "Member 'UWBP_Modern_Settings_PresetsWidget_C::PresetsBox' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_PresetsWidget_C, RightArrowBox) == 0x000670, "Member 'UWBP_Modern_Settings_PresetsWidget_C::RightArrowBox' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_PresetsWidget_C, RightArrowButton) == 0x000678, "Member 'UWBP_Modern_Settings_PresetsWidget_C::RightArrowButton' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_PresetsWidget_C, SettingsLabel) == 0x000680, "Member 'UWBP_Modern_Settings_PresetsWidget_C::SettingsLabel' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_PresetsWidget_C, FocusColor) == 0x000688, "Member 'UWBP_Modern_Settings_PresetsWidget_C::FocusColor' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_PresetsWidget_C, UnfocusColor) == 0x000698, "Member 'UWBP_Modern_Settings_PresetsWidget_C::UnfocusColor' has a wrong offset!");

}

