#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModernMenu_MagicTabs

#include "Basic.hpp"

#include "Altar_structs.hpp"


namespace SDK::Params
{

// Function WBP_ModernMenu_MagicTabs.WBP_ModernMenu_MagicTabs_C.BndEvt__WBP_ModernMenu_MagicTabs_magic_tabs_ActiveEffects_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ModernMenu_MagicTabs_C_BndEvt__WBP_ModernMenu_MagicTabs_magic_tabs_ActiveEffects_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_MagicTabs_C_BndEvt__WBP_ModernMenu_MagicTabs_magic_tabs_ActiveEffects_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ModernMenu_MagicTabs_C_BndEvt__WBP_ModernMenu_MagicTabs_magic_tabs_ActiveEffects_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_ModernMenu_MagicTabs_C_BndEvt__WBP_ModernMenu_MagicTabs_magic_tabs_ActiveEffects_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_ModernMenu_MagicTabs_C_BndEvt__WBP_ModernMenu_MagicTabs_magic_tabs_ActiveEffects_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_ModernMenu_MagicTabs_C_BndEvt__WBP_ModernMenu_MagicTabs_magic_tabs_ActiveEffects_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_ModernMenu_MagicTabs_C_BndEvt__WBP_ModernMenu_MagicTabs_magic_tabs_ActiveEffects_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_ModernMenu_MagicTabs.WBP_ModernMenu_MagicTabs_C.BndEvt__WBP_ModernMenu_MagicTabs_magic_tabs_All_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ModernMenu_MagicTabs_C_BndEvt__WBP_ModernMenu_MagicTabs_magic_tabs_All_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_MagicTabs_C_BndEvt__WBP_ModernMenu_MagicTabs_magic_tabs_All_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ModernMenu_MagicTabs_C_BndEvt__WBP_ModernMenu_MagicTabs_magic_tabs_All_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_ModernMenu_MagicTabs_C_BndEvt__WBP_ModernMenu_MagicTabs_magic_tabs_All_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_ModernMenu_MagicTabs_C_BndEvt__WBP_ModernMenu_MagicTabs_magic_tabs_All_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_ModernMenu_MagicTabs_C_BndEvt__WBP_ModernMenu_MagicTabs_magic_tabs_All_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_ModernMenu_MagicTabs_C_BndEvt__WBP_ModernMenu_MagicTabs_magic_tabs_All_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_ModernMenu_MagicTabs.WBP_ModernMenu_MagicTabs_C.BndEvt__WBP_ModernMenu_MagicTabs_magic_tabs_Self_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ModernMenu_MagicTabs_C_BndEvt__WBP_ModernMenu_MagicTabs_magic_tabs_Self_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_MagicTabs_C_BndEvt__WBP_ModernMenu_MagicTabs_magic_tabs_Self_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ModernMenu_MagicTabs_C_BndEvt__WBP_ModernMenu_MagicTabs_magic_tabs_Self_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_ModernMenu_MagicTabs_C_BndEvt__WBP_ModernMenu_MagicTabs_magic_tabs_Self_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_ModernMenu_MagicTabs_C_BndEvt__WBP_ModernMenu_MagicTabs_magic_tabs_Self_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_ModernMenu_MagicTabs_C_BndEvt__WBP_ModernMenu_MagicTabs_magic_tabs_Self_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_ModernMenu_MagicTabs_C_BndEvt__WBP_ModernMenu_MagicTabs_magic_tabs_Self_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_ModernMenu_MagicTabs.WBP_ModernMenu_MagicTabs_C.BndEvt__WBP_ModernMenu_MagicTabs_magic_tabs_Target_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ModernMenu_MagicTabs_C_BndEvt__WBP_ModernMenu_MagicTabs_magic_tabs_Target_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_MagicTabs_C_BndEvt__WBP_ModernMenu_MagicTabs_magic_tabs_Target_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ModernMenu_MagicTabs_C_BndEvt__WBP_ModernMenu_MagicTabs_magic_tabs_Target_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_ModernMenu_MagicTabs_C_BndEvt__WBP_ModernMenu_MagicTabs_magic_tabs_Target_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_ModernMenu_MagicTabs_C_BndEvt__WBP_ModernMenu_MagicTabs_magic_tabs_Target_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_ModernMenu_MagicTabs_C_BndEvt__WBP_ModernMenu_MagicTabs_magic_tabs_Target_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_ModernMenu_MagicTabs_C_BndEvt__WBP_ModernMenu_MagicTabs_magic_tabs_Target_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_ModernMenu_MagicTabs.WBP_ModernMenu_MagicTabs_C.BndEvt__WBP_ModernMenu_MagicTabs_magic_tabs_Touch_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ModernMenu_MagicTabs_C_BndEvt__WBP_ModernMenu_MagicTabs_magic_tabs_Touch_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_MagicTabs_C_BndEvt__WBP_ModernMenu_MagicTabs_magic_tabs_Touch_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ModernMenu_MagicTabs_C_BndEvt__WBP_ModernMenu_MagicTabs_magic_tabs_Touch_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_ModernMenu_MagicTabs_C_BndEvt__WBP_ModernMenu_MagicTabs_magic_tabs_Touch_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_ModernMenu_MagicTabs_C_BndEvt__WBP_ModernMenu_MagicTabs_magic_tabs_Touch_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_ModernMenu_MagicTabs_C_BndEvt__WBP_ModernMenu_MagicTabs_magic_tabs_Touch_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_ModernMenu_MagicTabs_C_BndEvt__WBP_ModernMenu_MagicTabs_magic_tabs_Touch_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_ModernMenu_MagicTabs.WBP_ModernMenu_MagicTabs_C.ExecuteUbergraph_WBP_ModernMenu_MagicTabs
// 0x0030 (0x0030 - 0x0000)
struct WBP_ModernMenu_MagicTabs_C_ExecuteUbergraph_WBP_ModernMenu_MagicTabs final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_4;               // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_3;               // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_2;               // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_MagicTabs_C_ExecuteUbergraph_WBP_ModernMenu_MagicTabs) == 0x000008, "Wrong alignment on WBP_ModernMenu_MagicTabs_C_ExecuteUbergraph_WBP_ModernMenu_MagicTabs");
static_assert(sizeof(WBP_ModernMenu_MagicTabs_C_ExecuteUbergraph_WBP_ModernMenu_MagicTabs) == 0x000030, "Wrong size on WBP_ModernMenu_MagicTabs_C_ExecuteUbergraph_WBP_ModernMenu_MagicTabs");
static_assert(offsetof(WBP_ModernMenu_MagicTabs_C_ExecuteUbergraph_WBP_ModernMenu_MagicTabs, EntryPoint) == 0x000000, "Member 'WBP_ModernMenu_MagicTabs_C_ExecuteUbergraph_WBP_ModernMenu_MagicTabs::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_MagicTabs_C_ExecuteUbergraph_WBP_ModernMenu_MagicTabs, K2Node_ComponentBoundEvent_Button) == 0x000008, "Member 'WBP_ModernMenu_MagicTabs_C_ExecuteUbergraph_WBP_ModernMenu_MagicTabs::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_MagicTabs_C_ExecuteUbergraph_WBP_ModernMenu_MagicTabs, K2Node_ComponentBoundEvent_Button_4) == 0x000010, "Member 'WBP_ModernMenu_MagicTabs_C_ExecuteUbergraph_WBP_ModernMenu_MagicTabs::K2Node_ComponentBoundEvent_Button_4' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_MagicTabs_C_ExecuteUbergraph_WBP_ModernMenu_MagicTabs, K2Node_ComponentBoundEvent_Button_3) == 0x000018, "Member 'WBP_ModernMenu_MagicTabs_C_ExecuteUbergraph_WBP_ModernMenu_MagicTabs::K2Node_ComponentBoundEvent_Button_3' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_MagicTabs_C_ExecuteUbergraph_WBP_ModernMenu_MagicTabs, K2Node_ComponentBoundEvent_Button_2) == 0x000020, "Member 'WBP_ModernMenu_MagicTabs_C_ExecuteUbergraph_WBP_ModernMenu_MagicTabs::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_MagicTabs_C_ExecuteUbergraph_WBP_ModernMenu_MagicTabs, K2Node_ComponentBoundEvent_Button_1) == 0x000028, "Member 'WBP_ModernMenu_MagicTabs_C_ExecuteUbergraph_WBP_ModernMenu_MagicTabs::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");

// Function WBP_ModernMenu_MagicTabs.WBP_ModernMenu_MagicTabs_C.Set Active Tab
// 0x0008 (0x0008 - 0x0000)
struct WBP_ModernMenu_MagicTabs_C_Set_Active_Tab final
{
public:
	ELegacyMagicMenuPage                          Page;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernMenu_MagicTabs_C_Set_Active_Tab) == 0x000004, "Wrong alignment on WBP_ModernMenu_MagicTabs_C_Set_Active_Tab");
static_assert(sizeof(WBP_ModernMenu_MagicTabs_C_Set_Active_Tab) == 0x000008, "Wrong size on WBP_ModernMenu_MagicTabs_C_Set_Active_Tab");
static_assert(offsetof(WBP_ModernMenu_MagicTabs_C_Set_Active_Tab, Page) == 0x000000, "Member 'WBP_ModernMenu_MagicTabs_C_Set_Active_Tab::Page' has a wrong offset!");
static_assert(offsetof(WBP_ModernMenu_MagicTabs_C_Set_Active_Tab, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000004, "Member 'WBP_ModernMenu_MagicTabs_C_Set_Active_Tab::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");

}

