#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Modern_Settings_ButtonWidget

#include "Basic.hpp"

#include "Altar_structs.hpp"


namespace SDK::Params
{

// Function WBP_Modern_Settings_ButtonWidget.WBP_Modern_Settings_ButtonWidget_C.ExecuteUbergraph_WBP_Modern_Settings_ButtonWidget
// 0x03C0 (0x03C0 - 0x0000)
struct WBP_Modern_Settings_ButtonWidget_C_ExecuteUbergraph_WBP_Modern_Settings_ButtonWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FModernSettingTableRow                 CallFunc_GetSettingRow_ReturnValue;                // 0x0008(0x0138)(ConstParm)
	struct FModernSettingTableRow                 CallFunc_GetSettingRow_ReturnValue_1;              // 0x0140(0x0138)(ConstParm)
	class UVSettingsMenuViewModel*                K2Node_Event_ViewModel;                            // 0x0278(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FModernSettingTableRow                 K2Node_Event_NewSettingRow;                        // 0x0280(0x0138)(ConstParm)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Settings_ButtonWidget_C_ExecuteUbergraph_WBP_Modern_Settings_ButtonWidget) == 0x000008, "Wrong alignment on WBP_Modern_Settings_ButtonWidget_C_ExecuteUbergraph_WBP_Modern_Settings_ButtonWidget");
static_assert(sizeof(WBP_Modern_Settings_ButtonWidget_C_ExecuteUbergraph_WBP_Modern_Settings_ButtonWidget) == 0x0003C0, "Wrong size on WBP_Modern_Settings_ButtonWidget_C_ExecuteUbergraph_WBP_Modern_Settings_ButtonWidget");
static_assert(offsetof(WBP_Modern_Settings_ButtonWidget_C_ExecuteUbergraph_WBP_Modern_Settings_ButtonWidget, EntryPoint) == 0x000000, "Member 'WBP_Modern_Settings_ButtonWidget_C_ExecuteUbergraph_WBP_Modern_Settings_ButtonWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ButtonWidget_C_ExecuteUbergraph_WBP_Modern_Settings_ButtonWidget, CallFunc_GetSettingRow_ReturnValue) == 0x000008, "Member 'WBP_Modern_Settings_ButtonWidget_C_ExecuteUbergraph_WBP_Modern_Settings_ButtonWidget::CallFunc_GetSettingRow_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ButtonWidget_C_ExecuteUbergraph_WBP_Modern_Settings_ButtonWidget, CallFunc_GetSettingRow_ReturnValue_1) == 0x000140, "Member 'WBP_Modern_Settings_ButtonWidget_C_ExecuteUbergraph_WBP_Modern_Settings_ButtonWidget::CallFunc_GetSettingRow_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ButtonWidget_C_ExecuteUbergraph_WBP_Modern_Settings_ButtonWidget, K2Node_Event_ViewModel) == 0x000278, "Member 'WBP_Modern_Settings_ButtonWidget_C_ExecuteUbergraph_WBP_Modern_Settings_ButtonWidget::K2Node_Event_ViewModel' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ButtonWidget_C_ExecuteUbergraph_WBP_Modern_Settings_ButtonWidget, K2Node_Event_NewSettingRow) == 0x000280, "Member 'WBP_Modern_Settings_ButtonWidget_C_ExecuteUbergraph_WBP_Modern_Settings_ButtonWidget::K2Node_Event_NewSettingRow' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ButtonWidget_C_ExecuteUbergraph_WBP_Modern_Settings_ButtonWidget, K2Node_Event_IsDesignTime) == 0x0003B8, "Member 'WBP_Modern_Settings_ButtonWidget_C_ExecuteUbergraph_WBP_Modern_Settings_ButtonWidget::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WBP_Modern_Settings_ButtonWidget.WBP_Modern_Settings_ButtonWidget_C.OnSettingChanged
// 0x0138 (0x0138 - 0x0000)
struct WBP_Modern_Settings_ButtonWidget_C_OnSettingChanged final
{
public:
	struct FModernSettingTableRow                 NewSettingRow;                                     // 0x0000(0x0138)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_Modern_Settings_ButtonWidget_C_OnSettingChanged) == 0x000008, "Wrong alignment on WBP_Modern_Settings_ButtonWidget_C_OnSettingChanged");
static_assert(sizeof(WBP_Modern_Settings_ButtonWidget_C_OnSettingChanged) == 0x000138, "Wrong size on WBP_Modern_Settings_ButtonWidget_C_OnSettingChanged");
static_assert(offsetof(WBP_Modern_Settings_ButtonWidget_C_OnSettingChanged, NewSettingRow) == 0x000000, "Member 'WBP_Modern_Settings_ButtonWidget_C_OnSettingChanged::NewSettingRow' has a wrong offset!");

// Function WBP_Modern_Settings_ButtonWidget.WBP_Modern_Settings_ButtonWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Modern_Settings_ButtonWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Settings_ButtonWidget_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_Modern_Settings_ButtonWidget_C_PreConstruct");
static_assert(sizeof(WBP_Modern_Settings_ButtonWidget_C_PreConstruct) == 0x000001, "Wrong size on WBP_Modern_Settings_ButtonWidget_C_PreConstruct");
static_assert(offsetof(WBP_Modern_Settings_ButtonWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_Modern_Settings_ButtonWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_Modern_Settings_ButtonWidget.WBP_Modern_Settings_ButtonWidget_C.SetViewModel_Internal
// 0x0008 (0x0008 - 0x0000)
struct WBP_Modern_Settings_ButtonWidget_C_SetViewModel_Internal final
{
public:
	class UVSettingsMenuViewModel*                ViewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Settings_ButtonWidget_C_SetViewModel_Internal) == 0x000008, "Wrong alignment on WBP_Modern_Settings_ButtonWidget_C_SetViewModel_Internal");
static_assert(sizeof(WBP_Modern_Settings_ButtonWidget_C_SetViewModel_Internal) == 0x000008, "Wrong size on WBP_Modern_Settings_ButtonWidget_C_SetViewModel_Internal");
static_assert(offsetof(WBP_Modern_Settings_ButtonWidget_C_SetViewModel_Internal, ViewModel) == 0x000000, "Member 'WBP_Modern_Settings_ButtonWidget_C_SetViewModel_Internal::ViewModel' has a wrong offset!");

// Function WBP_Modern_Settings_ButtonWidget.WBP_Modern_Settings_ButtonWidget_C.SetVSettingsMenuViewModel
// 0x0028 (0x0028 - 0x0000)
struct WBP_Modern_Settings_ButtonWidget_C_SetVSettingsMenuViewModel final
{
public:
	class UVSettingsMenuViewModel*                ViewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_GetExtension_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput;      // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SetViewModel_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Settings_ButtonWidget_C_SetVSettingsMenuViewModel) == 0x000008, "Wrong alignment on WBP_Modern_Settings_ButtonWidget_C_SetVSettingsMenuViewModel");
static_assert(sizeof(WBP_Modern_Settings_ButtonWidget_C_SetVSettingsMenuViewModel) == 0x000028, "Wrong size on WBP_Modern_Settings_ButtonWidget_C_SetVSettingsMenuViewModel");
static_assert(offsetof(WBP_Modern_Settings_ButtonWidget_C_SetVSettingsMenuViewModel, ViewModel) == 0x000000, "Member 'WBP_Modern_Settings_ButtonWidget_C_SetVSettingsMenuViewModel::ViewModel' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ButtonWidget_C_SetVSettingsMenuViewModel, CallFunc_GetExtension_ReturnValue) == 0x000008, "Member 'WBP_Modern_Settings_ButtonWidget_C_SetVSettingsMenuViewModel::CallFunc_GetExtension_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ButtonWidget_C_SetVSettingsMenuViewModel, CallFunc_SetViewModel_ViewModel_CastInput) == 0x000010, "Member 'WBP_Modern_Settings_ButtonWidget_C_SetVSettingsMenuViewModel::CallFunc_SetViewModel_ViewModel_CastInput' has a wrong offset!");
static_assert(offsetof(WBP_Modern_Settings_ButtonWidget_C_SetVSettingsMenuViewModel, CallFunc_SetViewModel_ReturnValue) == 0x000020, "Member 'WBP_Modern_Settings_ButtonWidget_C_SetVSettingsMenuViewModel::CallFunc_SetViewModel_ReturnValue' has a wrong offset!");

// Function WBP_Modern_Settings_ButtonWidget.WBP_Modern_Settings_ButtonWidget_C.ThisIsForPluginCompliance
// 0x0001 (0x0001 - 0x0000)
struct WBP_Modern_Settings_ButtonWidget_C_ThisIsForPluginCompliance final
{
public:
	bool                                          ThisIsForPluginCompliance_0;                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Modern_Settings_ButtonWidget_C_ThisIsForPluginCompliance) == 0x000001, "Wrong alignment on WBP_Modern_Settings_ButtonWidget_C_ThisIsForPluginCompliance");
static_assert(sizeof(WBP_Modern_Settings_ButtonWidget_C_ThisIsForPluginCompliance) == 0x000001, "Wrong size on WBP_Modern_Settings_ButtonWidget_C_ThisIsForPluginCompliance");
static_assert(offsetof(WBP_Modern_Settings_ButtonWidget_C_ThisIsForPluginCompliance, ThisIsForPluginCompliance_0) == 0x000000, "Member 'WBP_Modern_Settings_ButtonWidget_C_ThisIsForPluginCompliance::ThisIsForPluginCompliance_0' has a wrong offset!");

}

