#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModernHud_Magicka

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_ModernHud_Magicka.WBP_ModernHud_Magicka_C.ExecuteUbergraph_WBP_ModernHud_Magicka
// 0x0004 (0x0004 - 0x0000)
struct WBP_ModernHud_Magicka_C_ExecuteUbergraph_WBP_ModernHud_Magicka final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_Magicka_C_ExecuteUbergraph_WBP_ModernHud_Magicka) == 0x000004, "Wrong alignment on WBP_ModernHud_Magicka_C_ExecuteUbergraph_WBP_ModernHud_Magicka");
static_assert(sizeof(WBP_ModernHud_Magicka_C_ExecuteUbergraph_WBP_ModernHud_Magicka) == 0x000004, "Wrong size on WBP_ModernHud_Magicka_C_ExecuteUbergraph_WBP_ModernHud_Magicka");
static_assert(offsetof(WBP_ModernHud_Magicka_C_ExecuteUbergraph_WBP_ModernHud_Magicka, EntryPoint) == 0x000000, "Member 'WBP_ModernHud_Magicka_C_ExecuteUbergraph_WBP_ModernHud_Magicka::EntryPoint' has a wrong offset!");

// Function WBP_ModernHud_Magicka.WBP_ModernHud_Magicka_C.UpdateMagicka
// 0x0010 (0x0010 - 0x0000)
struct WBP_ModernHud_Magicka_C_UpdateMagicka final
{
public:
	double                                        NewProgress;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Is_Preview;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModernHud_Magicka_C_UpdateMagicka) == 0x000008, "Wrong alignment on WBP_ModernHud_Magicka_C_UpdateMagicka");
static_assert(sizeof(WBP_ModernHud_Magicka_C_UpdateMagicka) == 0x000010, "Wrong size on WBP_ModernHud_Magicka_C_UpdateMagicka");
static_assert(offsetof(WBP_ModernHud_Magicka_C_UpdateMagicka, NewProgress) == 0x000000, "Member 'WBP_ModernHud_Magicka_C_UpdateMagicka::NewProgress' has a wrong offset!");
static_assert(offsetof(WBP_ModernHud_Magicka_C_UpdateMagicka, Is_Preview) == 0x000008, "Member 'WBP_ModernHud_Magicka_C_UpdateMagicka::Is_Preview' has a wrong offset!");

}

