#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_OriginalMenu_InventoryDetails_Tooltip

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "CommonInput_structs.hpp"
#include "Altar_structs.hpp"
#include "Altar_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_OriginalMenu_InventoryDetails_Tooltip.WBP_OriginalMenu_InventoryDetails_Tooltip_C
// 0x0058 (0x0520 - 0x04C8)
class UWBP_OriginalMenu_InventoryDetails_Tooltip_C final : public UVAltarWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVContainerMenuViewModel*               VContainerMenuViewModel;                           // 0x04D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UVInventoryMenuViewModel*               VInventoryMenuViewModel;                           // 0x04D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UVItemDetailsViewModel*                 VItemDetailsViewModel;                             // 0x04E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_AltarTextBlock_C*                  inv_details_tooltip_effects_text;                  // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalMenu_InventoryDetails_Tooltip_EnchantmentEffects_C* inv_details_tooltip_enchantment_effects; // 0x04F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OriginalMenu_InventoryDetails_Tooltip_IngredientEffects_C* inv_details_tooltip_ingredient_effects; // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           inv_details_tooltip_noeffects_verticalbox;         // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               inv_details_tooltip_overlay;                       // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsMouseKeyboard;                                   // 0x0510(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsTooltipVisible;                                  // 0x0511(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsListViewHovered;                                 // 0x0512(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_513[0x1];                                      // 0x0513(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         IngredientEffectsNb;                               // 0x0514(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         EnchantmentEffectsNb;                              // 0x0518(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_OriginalMenu_InventoryDetails_Tooltip_inv_details_tooltip_enchantment_effects_K2Node_ComponentBoundEvent_1_OnEffectsUpdated__DelegateSignature(int32 EffectsNb);
	void BndEvt__WBP_OriginalMenu_InventoryDetails_Tooltip_inv_details_tooltip_ingredient_effects_K2Node_ComponentBoundEvent_0_OnEffectsUpdated__DelegateSignature(int32 EffectsNb);
	void Construct();
	void ExecuteUbergraph_WBP_OriginalMenu_InventoryDetails_Tooltip(int32 EntryPoint);
	void Hide();
	void OnInputMethodChanged(ECommonInputType bNewInputType);
	void OnMouseHoverListViewChanged(bool IsHovered_0);
	void UpdateHoveredItem(class UTESForm* ItemForm);
	void UpdateLayout(EFormID FormType);
	void UpdateSpecificLayout(class UCommonUserWidget* ToolTipWidget_0, int32 EffectsNb);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_OriginalMenu_InventoryDetails_Tooltip_C">();
	}
	static class UWBP_OriginalMenu_InventoryDetails_Tooltip_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_OriginalMenu_InventoryDetails_Tooltip_C>();
	}
};
static_assert(alignof(UWBP_OriginalMenu_InventoryDetails_Tooltip_C) == 0x000008, "Wrong alignment on UWBP_OriginalMenu_InventoryDetails_Tooltip_C");
static_assert(sizeof(UWBP_OriginalMenu_InventoryDetails_Tooltip_C) == 0x000520, "Wrong size on UWBP_OriginalMenu_InventoryDetails_Tooltip_C");
static_assert(offsetof(UWBP_OriginalMenu_InventoryDetails_Tooltip_C, UberGraphFrame) == 0x0004C8, "Member 'UWBP_OriginalMenu_InventoryDetails_Tooltip_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryDetails_Tooltip_C, VContainerMenuViewModel) == 0x0004D0, "Member 'UWBP_OriginalMenu_InventoryDetails_Tooltip_C::VContainerMenuViewModel' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryDetails_Tooltip_C, VInventoryMenuViewModel) == 0x0004D8, "Member 'UWBP_OriginalMenu_InventoryDetails_Tooltip_C::VInventoryMenuViewModel' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryDetails_Tooltip_C, VItemDetailsViewModel) == 0x0004E0, "Member 'UWBP_OriginalMenu_InventoryDetails_Tooltip_C::VItemDetailsViewModel' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryDetails_Tooltip_C, inv_details_tooltip_effects_text) == 0x0004E8, "Member 'UWBP_OriginalMenu_InventoryDetails_Tooltip_C::inv_details_tooltip_effects_text' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryDetails_Tooltip_C, inv_details_tooltip_enchantment_effects) == 0x0004F0, "Member 'UWBP_OriginalMenu_InventoryDetails_Tooltip_C::inv_details_tooltip_enchantment_effects' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryDetails_Tooltip_C, inv_details_tooltip_ingredient_effects) == 0x0004F8, "Member 'UWBP_OriginalMenu_InventoryDetails_Tooltip_C::inv_details_tooltip_ingredient_effects' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryDetails_Tooltip_C, inv_details_tooltip_noeffects_verticalbox) == 0x000500, "Member 'UWBP_OriginalMenu_InventoryDetails_Tooltip_C::inv_details_tooltip_noeffects_verticalbox' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryDetails_Tooltip_C, inv_details_tooltip_overlay) == 0x000508, "Member 'UWBP_OriginalMenu_InventoryDetails_Tooltip_C::inv_details_tooltip_overlay' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryDetails_Tooltip_C, IsMouseKeyboard) == 0x000510, "Member 'UWBP_OriginalMenu_InventoryDetails_Tooltip_C::IsMouseKeyboard' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryDetails_Tooltip_C, IsTooltipVisible) == 0x000511, "Member 'UWBP_OriginalMenu_InventoryDetails_Tooltip_C::IsTooltipVisible' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryDetails_Tooltip_C, IsListViewHovered) == 0x000512, "Member 'UWBP_OriginalMenu_InventoryDetails_Tooltip_C::IsListViewHovered' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryDetails_Tooltip_C, IngredientEffectsNb) == 0x000514, "Member 'UWBP_OriginalMenu_InventoryDetails_Tooltip_C::IngredientEffectsNb' has a wrong offset!");
static_assert(offsetof(UWBP_OriginalMenu_InventoryDetails_Tooltip_C, EnchantmentEffectsNb) == 0x000518, "Member 'UWBP_OriginalMenu_InventoryDetails_Tooltip_C::EnchantmentEffectsNb' has a wrong offset!");

}

