#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModernHud_Breath

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ModernHud_Breath.WBP_ModernHud_Breath_C
// 0x0030 (0x0318 - 0x02E8)
class UWBP_ModernHud_Breath_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVHUDMainViewModel*                     VHUDMainViewModel;                                 // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UVHUDBreathViewModel*                   VHUDBreathViewModel;                               // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BreathBarBlinkAnim;                                // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Breath_Bar_Root;                                   // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        BlinkingSpeed;                                     // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void EventOnIsMenuModeUpdated(bool NewValue);
	void ExecuteUbergraph_WBP_ModernHud_Breath(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void UpdateBreathPercentage(double Percentage);
	void UpdateIsBreathBarBlinking(bool NewValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ModernHud_Breath_C">();
	}
	static class UWBP_ModernHud_Breath_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ModernHud_Breath_C>();
	}
};
static_assert(alignof(UWBP_ModernHud_Breath_C) == 0x000008, "Wrong alignment on UWBP_ModernHud_Breath_C");
static_assert(sizeof(UWBP_ModernHud_Breath_C) == 0x000318, "Wrong size on UWBP_ModernHud_Breath_C");
static_assert(offsetof(UWBP_ModernHud_Breath_C, UberGraphFrame) == 0x0002E8, "Member 'UWBP_ModernHud_Breath_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_Breath_C, VHUDMainViewModel) == 0x0002F0, "Member 'UWBP_ModernHud_Breath_C::VHUDMainViewModel' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_Breath_C, VHUDBreathViewModel) == 0x0002F8, "Member 'UWBP_ModernHud_Breath_C::VHUDBreathViewModel' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_Breath_C, BreathBarBlinkAnim) == 0x000300, "Member 'UWBP_ModernHud_Breath_C::BreathBarBlinkAnim' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_Breath_C, Breath_Bar_Root) == 0x000308, "Member 'UWBP_ModernHud_Breath_C::Breath_Bar_Root' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_Breath_C, BlinkingSpeed) == 0x000310, "Member 'UWBP_ModernHud_Breath_C::BlinkingSpeed' has a wrong offset!");

}

