#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModernHud_SneakEye

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ModernHud_SneakEye.WBP_ModernHud_SneakEye_C
// 0x00A0 (0x0388 - 0x02E8)
class UWBP_ModernHud_SneakEye_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVHUDReticleViewModel*                  VHUDReticleViewModel;                              // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OutCombat;                                         // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       InCombat;                                          // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hide;                                              // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Show;                                              // 0x0310(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Scaling;                                      // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               Sizing;                                            // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bIsShown;                                          // 0x0330(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInCombat;                                         // 0x0331(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_332[0x6];                                      // 0x0332(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        FinalSneakLevel;                                   // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AlphaSneak;                                        // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CurrentSneakLevel;                                 // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           TimerSneak;                                        // 0x0350(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnInCombatState;                                   // 0x0358(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnOutCombatState;                                  // 0x0368(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	double                                        ActualEyeTransition;                               // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        In_Sneak_Level;                                    // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_ModernHud_SneakEye(int32 EntryPoint);
	void InCombatState();
	void OnInitialized();
	void OutCombatState();
	void SneakAlpha();
	void Update_Sneak_Level(double InSneakLevel);
	void UpdateSneakingVisibility(bool InSneaking);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ModernHud_SneakEye_C">();
	}
	static class UWBP_ModernHud_SneakEye_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ModernHud_SneakEye_C>();
	}
};
static_assert(alignof(UWBP_ModernHud_SneakEye_C) == 0x000008, "Wrong alignment on UWBP_ModernHud_SneakEye_C");
static_assert(sizeof(UWBP_ModernHud_SneakEye_C) == 0x000388, "Wrong size on UWBP_ModernHud_SneakEye_C");
static_assert(offsetof(UWBP_ModernHud_SneakEye_C, UberGraphFrame) == 0x0002E8, "Member 'UWBP_ModernHud_SneakEye_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_SneakEye_C, VHUDReticleViewModel) == 0x0002F0, "Member 'UWBP_ModernHud_SneakEye_C::VHUDReticleViewModel' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_SneakEye_C, OutCombat) == 0x0002F8, "Member 'UWBP_ModernHud_SneakEye_C::OutCombat' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_SneakEye_C, InCombat) == 0x000300, "Member 'UWBP_ModernHud_SneakEye_C::InCombat' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_SneakEye_C, Hide) == 0x000308, "Member 'UWBP_ModernHud_SneakEye_C::Hide' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_SneakEye_C, Show) == 0x000310, "Member 'UWBP_ModernHud_SneakEye_C::Show' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_SneakEye_C, Icon) == 0x000318, "Member 'UWBP_ModernHud_SneakEye_C::Icon' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_SneakEye_C, Icon_Scaling) == 0x000320, "Member 'UWBP_ModernHud_SneakEye_C::Icon_Scaling' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_SneakEye_C, Sizing) == 0x000328, "Member 'UWBP_ModernHud_SneakEye_C::Sizing' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_SneakEye_C, bIsShown) == 0x000330, "Member 'UWBP_ModernHud_SneakEye_C::bIsShown' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_SneakEye_C, bInCombat) == 0x000331, "Member 'UWBP_ModernHud_SneakEye_C::bInCombat' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_SneakEye_C, FinalSneakLevel) == 0x000338, "Member 'UWBP_ModernHud_SneakEye_C::FinalSneakLevel' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_SneakEye_C, AlphaSneak) == 0x000340, "Member 'UWBP_ModernHud_SneakEye_C::AlphaSneak' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_SneakEye_C, CurrentSneakLevel) == 0x000348, "Member 'UWBP_ModernHud_SneakEye_C::CurrentSneakLevel' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_SneakEye_C, TimerSneak) == 0x000350, "Member 'UWBP_ModernHud_SneakEye_C::TimerSneak' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_SneakEye_C, OnInCombatState) == 0x000358, "Member 'UWBP_ModernHud_SneakEye_C::OnInCombatState' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_SneakEye_C, OnOutCombatState) == 0x000368, "Member 'UWBP_ModernHud_SneakEye_C::OnOutCombatState' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_SneakEye_C, ActualEyeTransition) == 0x000378, "Member 'UWBP_ModernHud_SneakEye_C::ActualEyeTransition' has a wrong offset!");
static_assert(offsetof(UWBP_ModernHud_SneakEye_C, In_Sneak_Level) == 0x000380, "Member 'UWBP_ModernHud_SneakEye_C::In_Sneak_Level' has a wrong offset!");

}

