#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LegacyHud_InfoIcon

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_LegacyHud_InfoIcon.WBP_LegacyHud_InfoIcon_C.ExecuteUbergraph_WBP_LegacyHud_InfoIcon
// 0x0028 (0x0028 - 0x0000)
struct WBP_LegacyHud_InfoIcon_C_ExecuteUbergraph_WBP_LegacyHud_InfoIcon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_ByteToDouble_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LegacyHud_InfoIcon_C_ExecuteUbergraph_WBP_LegacyHud_InfoIcon) == 0x000008, "Wrong alignment on WBP_LegacyHud_InfoIcon_C_ExecuteUbergraph_WBP_LegacyHud_InfoIcon");
static_assert(sizeof(WBP_LegacyHud_InfoIcon_C_ExecuteUbergraph_WBP_LegacyHud_InfoIcon) == 0x000028, "Wrong size on WBP_LegacyHud_InfoIcon_C_ExecuteUbergraph_WBP_LegacyHud_InfoIcon");
static_assert(offsetof(WBP_LegacyHud_InfoIcon_C_ExecuteUbergraph_WBP_LegacyHud_InfoIcon, EntryPoint) == 0x000000, "Member 'WBP_LegacyHud_InfoIcon_C_ExecuteUbergraph_WBP_LegacyHud_InfoIcon::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_LegacyHud_InfoIcon_C_ExecuteUbergraph_WBP_LegacyHud_InfoIcon, CallFunc_Conv_ByteToDouble_ReturnValue) == 0x000008, "Member 'WBP_LegacyHud_InfoIcon_C_ExecuteUbergraph_WBP_LegacyHud_InfoIcon::CallFunc_Conv_ByteToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LegacyHud_InfoIcon_C_ExecuteUbergraph_WBP_LegacyHud_InfoIcon, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000010, "Member 'WBP_LegacyHud_InfoIcon_C_ExecuteUbergraph_WBP_LegacyHud_InfoIcon::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LegacyHud_InfoIcon_C_ExecuteUbergraph_WBP_LegacyHud_InfoIcon, CallFunc_MakeVector2D_ReturnValue) == 0x000018, "Member 'WBP_LegacyHud_InfoIcon_C_ExecuteUbergraph_WBP_LegacyHud_InfoIcon::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");

// Function WBP_LegacyHud_InfoIcon.WBP_LegacyHud_InfoIcon_C.SetTextColour
// 0x0024 (0x0024 - 0x0000)
struct WBP_LegacyHud_InfoIcon_C_SetTextColour final
{
public:
	struct FLinearColor                           Colour;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0010(0x0014)()
};
static_assert(alignof(WBP_LegacyHud_InfoIcon_C_SetTextColour) == 0x000004, "Wrong alignment on WBP_LegacyHud_InfoIcon_C_SetTextColour");
static_assert(sizeof(WBP_LegacyHud_InfoIcon_C_SetTextColour) == 0x000024, "Wrong size on WBP_LegacyHud_InfoIcon_C_SetTextColour");
static_assert(offsetof(WBP_LegacyHud_InfoIcon_C_SetTextColour, Colour) == 0x000000, "Member 'WBP_LegacyHud_InfoIcon_C_SetTextColour::Colour' has a wrong offset!");
static_assert(offsetof(WBP_LegacyHud_InfoIcon_C_SetTextColour, K2Node_MakeStruct_SlateColor) == 0x000010, "Member 'WBP_LegacyHud_InfoIcon_C_SetTextColour::K2Node_MakeStruct_SlateColor' has a wrong offset!");

// Function WBP_LegacyHud_InfoIcon.WBP_LegacyHud_InfoIcon_C.SetValue
// 0x0018 (0x0018 - 0x0000)
struct WBP_LegacyHud_InfoIcon_C_SetValue final
{
public:
	class FText                                   Value;                                             // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_LegacyHud_InfoIcon_C_SetValue) == 0x000008, "Wrong alignment on WBP_LegacyHud_InfoIcon_C_SetValue");
static_assert(sizeof(WBP_LegacyHud_InfoIcon_C_SetValue) == 0x000018, "Wrong size on WBP_LegacyHud_InfoIcon_C_SetValue");
static_assert(offsetof(WBP_LegacyHud_InfoIcon_C_SetValue, Value) == 0x000000, "Member 'WBP_LegacyHud_InfoIcon_C_SetValue::Value' has a wrong offset!");

}

