#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Modern_Settings_SystemButtonWrapper

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Altar_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Modern_Settings_SystemButtonWrapper.WBP_Modern_Settings_SystemButtonWrapper_C
// 0x0048 (0x0510 - 0x04C8)
class UWBP_Modern_Settings_SystemButtonWrapper_C final : public UVAltarWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_Modern_Settings_SaveLoadButton_C*  SaveLoadButton;                                    // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Label;                                             // 0x04D8(0x0018)(Edit, BlueprintVisible)
	TMulticastInlineDelegate<void()>              OnButtonClicked;                                   // 0x04F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnButtonFocussed;                                  // 0x0500(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__WBP_Modern_Settings_SaveLoadButtonWrapper_WBP_Modern_Settings_SaveLoadButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_Modern_Settings_SystemButtonWrapper_SaveLoadButton_K2Node_ComponentBoundEvent_0_OnButtonFocussed__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_WBP_Modern_Settings_SystemButtonWrapper(int32 EntryPoint);
	void OnFocus();
	void PreConstruct(bool IsDesignTime);
	void SetButtonText(const class FText& NewText);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Modern_Settings_SystemButtonWrapper_C">();
	}
	static class UWBP_Modern_Settings_SystemButtonWrapper_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Modern_Settings_SystemButtonWrapper_C>();
	}
};
static_assert(alignof(UWBP_Modern_Settings_SystemButtonWrapper_C) == 0x000008, "Wrong alignment on UWBP_Modern_Settings_SystemButtonWrapper_C");
static_assert(sizeof(UWBP_Modern_Settings_SystemButtonWrapper_C) == 0x000510, "Wrong size on UWBP_Modern_Settings_SystemButtonWrapper_C");
static_assert(offsetof(UWBP_Modern_Settings_SystemButtonWrapper_C, UberGraphFrame) == 0x0004C8, "Member 'UWBP_Modern_Settings_SystemButtonWrapper_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_SystemButtonWrapper_C, SaveLoadButton) == 0x0004D0, "Member 'UWBP_Modern_Settings_SystemButtonWrapper_C::SaveLoadButton' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_SystemButtonWrapper_C, Label) == 0x0004D8, "Member 'UWBP_Modern_Settings_SystemButtonWrapper_C::Label' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_SystemButtonWrapper_C, OnButtonClicked) == 0x0004F0, "Member 'UWBP_Modern_Settings_SystemButtonWrapper_C::OnButtonClicked' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_Settings_SystemButtonWrapper_C, OnButtonFocussed) == 0x000500, "Member 'UWBP_Modern_Settings_SystemButtonWrapper_C::OnButtonFocussed' has a wrong offset!");

}

