#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_OriginalMenu_InventoryListView

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CommonInput_structs.hpp"
#include "Altar_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_OriginalMenu_InventoryListView.WBP_OriginalMenu_InventoryListView_C.CreateNewEntry
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_OriginalMenu_InventoryListView_C_CreateNewEntry final
{
public:
	struct FOriginalInventoryMenuItemProperties   Properties;                                        // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FOriginalInventoryMenuItemProperties   Local_Properties;                                  // 0x0050(0x0050)(Edit, BlueprintVisible)
	class UVOriginalInventoryMenuItem*            Local_NewEntry;                                    // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVOriginalInventoryMenuItem*            CallFunc_SpawnObject_ReturnValue;                  // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OriginalMenu_InventoryListView_C_CreateNewEntry) == 0x000008, "Wrong alignment on WBP_OriginalMenu_InventoryListView_C_CreateNewEntry");
static_assert(sizeof(WBP_OriginalMenu_InventoryListView_C_CreateNewEntry) == 0x0000B0, "Wrong size on WBP_OriginalMenu_InventoryListView_C_CreateNewEntry");
static_assert(offsetof(WBP_OriginalMenu_InventoryListView_C_CreateNewEntry, Properties) == 0x000000, "Member 'WBP_OriginalMenu_InventoryListView_C_CreateNewEntry::Properties' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryListView_C_CreateNewEntry, Local_Properties) == 0x000050, "Member 'WBP_OriginalMenu_InventoryListView_C_CreateNewEntry::Local_Properties' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryListView_C_CreateNewEntry, Local_NewEntry) == 0x0000A0, "Member 'WBP_OriginalMenu_InventoryListView_C_CreateNewEntry::Local_NewEntry' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryListView_C_CreateNewEntry, CallFunc_SpawnObject_ReturnValue) == 0x0000A8, "Member 'WBP_OriginalMenu_InventoryListView_C_CreateNewEntry::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");

// Function WBP_OriginalMenu_InventoryListView.WBP_OriginalMenu_InventoryListView_C.ExecuteUbergraph_WBP_OriginalMenu_InventoryListView
// 0x0190 (0x0190 - 0x0000)
struct WBP_OriginalMenu_InventoryListView_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryListView final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable;                                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_2;                              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_3;                              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELegacyInventoryMenuPage                      K2Node_CustomEvent_NewPage;                        // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonListView*                        CallFunc_GetListView_ReturnValue;                  // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate;            // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              K2Node_CustomEvent_bNewInputType;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonListView*                        CallFunc_GetListView_ReturnValue_1;                // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0068(0x0078)(ConstParm)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x00E0(0x0038)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x0118(0x0078)(ConstParm)
};
static_assert(alignof(WBP_OriginalMenu_InventoryListView_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryListView) == 0x000008, "Wrong alignment on WBP_OriginalMenu_InventoryListView_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryListView");
static_assert(sizeof(WBP_OriginalMenu_InventoryListView_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryListView) == 0x000190, "Wrong size on WBP_OriginalMenu_InventoryListView_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryListView");
static_assert(offsetof(WBP_OriginalMenu_InventoryListView_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryListView, EntryPoint) == 0x000000, "Member 'WBP_OriginalMenu_InventoryListView_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryListView::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryListView_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryListView, Temp_byte_Variable) == 0x000004, "Member 'WBP_OriginalMenu_InventoryListView_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryListView::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryListView_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryListView, Temp_real_Variable) == 0x000008, "Member 'WBP_OriginalMenu_InventoryListView_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryListView::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryListView_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryListView, Temp_real_Variable_1) == 0x00000C, "Member 'WBP_OriginalMenu_InventoryListView_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryListView::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryListView_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryListView, Temp_real_Variable_2) == 0x000010, "Member 'WBP_OriginalMenu_InventoryListView_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryListView::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryListView_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryListView, Temp_real_Variable_3) == 0x000014, "Member 'WBP_OriginalMenu_InventoryListView_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryListView::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryListView_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryListView, K2Node_CustomEvent_NewPage) == 0x000018, "Member 'WBP_OriginalMenu_InventoryListView_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryListView::K2Node_CustomEvent_NewPage' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryListView_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryListView, K2Node_Event_IsDesignTime) == 0x000019, "Member 'WBP_OriginalMenu_InventoryListView_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryListView::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryListView_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryListView, CallFunc_GetListView_ReturnValue) == 0x000020, "Member 'WBP_OriginalMenu_InventoryListView_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryListView::CallFunc_GetListView_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryListView_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryListView, CallFunc_GetPlayerController_ReturnValue) == 0x000028, "Member 'WBP_OriginalMenu_InventoryListView_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryListView::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryListView_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryListView, K2Node_CreateDelegate_OutputDelegate) == 0x000030, "Member 'WBP_OriginalMenu_InventoryListView_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryListView::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryListView_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryListView, CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue) == 0x000040, "Member 'WBP_OriginalMenu_InventoryListView_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryListView::CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryListView_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryListView, K2Node_CustomEvent_bNewInputType) == 0x000048, "Member 'WBP_OriginalMenu_InventoryListView_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryListView::K2Node_CustomEvent_bNewInputType' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryListView_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryListView, CallFunc_GetListView_ReturnValue_1) == 0x000050, "Member 'WBP_OriginalMenu_InventoryListView_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryListView::CallFunc_GetListView_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryListView_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryListView, K2Node_Select_Default) == 0x000058, "Member 'WBP_OriginalMenu_InventoryListView_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryListView::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryListView_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryListView, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000060, "Member 'WBP_OriginalMenu_InventoryListView_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryListView::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryListView_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryListView, K2Node_Event_MouseEvent_1) == 0x000068, "Member 'WBP_OriginalMenu_InventoryListView_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryListView::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryListView_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryListView, K2Node_Event_MyGeometry) == 0x0000E0, "Member 'WBP_OriginalMenu_InventoryListView_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryListView::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryListView_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryListView, K2Node_Event_MouseEvent) == 0x000118, "Member 'WBP_OriginalMenu_InventoryListView_C_ExecuteUbergraph_WBP_OriginalMenu_InventoryListView::K2Node_Event_MouseEvent' has a wrong offset!");

// Function WBP_OriginalMenu_InventoryListView.WBP_OriginalMenu_InventoryListView_C.OnInputMethodChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_OriginalMenu_InventoryListView_C_OnInputMethodChanged final
{
public:
	ECommonInputType                              bNewInputType;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OriginalMenu_InventoryListView_C_OnInputMethodChanged) == 0x000001, "Wrong alignment on WBP_OriginalMenu_InventoryListView_C_OnInputMethodChanged");
static_assert(sizeof(WBP_OriginalMenu_InventoryListView_C_OnInputMethodChanged) == 0x000001, "Wrong size on WBP_OriginalMenu_InventoryListView_C_OnInputMethodChanged");
static_assert(offsetof(WBP_OriginalMenu_InventoryListView_C_OnInputMethodChanged, bNewInputType) == 0x000000, "Member 'WBP_OriginalMenu_InventoryListView_C_OnInputMethodChanged::bNewInputType' has a wrong offset!");

// Function WBP_OriginalMenu_InventoryListView.WBP_OriginalMenu_InventoryListView_C.OnMouseEnter
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_OriginalMenu_InventoryListView_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_OriginalMenu_InventoryListView_C_OnMouseEnter) == 0x000008, "Wrong alignment on WBP_OriginalMenu_InventoryListView_C_OnMouseEnter");
static_assert(sizeof(WBP_OriginalMenu_InventoryListView_C_OnMouseEnter) == 0x0000B0, "Wrong size on WBP_OriginalMenu_InventoryListView_C_OnMouseEnter");
static_assert(offsetof(WBP_OriginalMenu_InventoryListView_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'WBP_OriginalMenu_InventoryListView_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryListView_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'WBP_OriginalMenu_InventoryListView_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function WBP_OriginalMenu_InventoryListView.WBP_OriginalMenu_InventoryListView_C.OnMouseLeave
// 0x0078 (0x0078 - 0x0000)
struct WBP_OriginalMenu_InventoryListView_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_OriginalMenu_InventoryListView_C_OnMouseLeave) == 0x000008, "Wrong alignment on WBP_OriginalMenu_InventoryListView_C_OnMouseLeave");
static_assert(sizeof(WBP_OriginalMenu_InventoryListView_C_OnMouseLeave) == 0x000078, "Wrong size on WBP_OriginalMenu_InventoryListView_C_OnMouseLeave");
static_assert(offsetof(WBP_OriginalMenu_InventoryListView_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'WBP_OriginalMenu_InventoryListView_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function WBP_OriginalMenu_InventoryListView.WBP_OriginalMenu_InventoryListView_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_OriginalMenu_InventoryListView_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OriginalMenu_InventoryListView_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_OriginalMenu_InventoryListView_C_PreConstruct");
static_assert(sizeof(WBP_OriginalMenu_InventoryListView_C_PreConstruct) == 0x000001, "Wrong size on WBP_OriginalMenu_InventoryListView_C_PreConstruct");
static_assert(offsetof(WBP_OriginalMenu_InventoryListView_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_OriginalMenu_InventoryListView_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_OriginalMenu_InventoryListView.WBP_OriginalMenu_InventoryListView_C.RemoveItemSurplus
// 0x0038 (0x0038 - 0x0000)
struct WBP_OriginalMenu_InventoryListView_C_RemoveItemSurplus final
{
public:
	int32                                         LastIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSize_ReturnValue;                      // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonListView*                        CallFunc_GetListView_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSize_ReturnValue_1;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetItemAt_ReturnValue;                    // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonListView*                        CallFunc_GetListView_ReturnValue_1;                // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OriginalMenu_InventoryListView_C_RemoveItemSurplus) == 0x000008, "Wrong alignment on WBP_OriginalMenu_InventoryListView_C_RemoveItemSurplus");
static_assert(sizeof(WBP_OriginalMenu_InventoryListView_C_RemoveItemSurplus) == 0x000038, "Wrong size on WBP_OriginalMenu_InventoryListView_C_RemoveItemSurplus");
static_assert(offsetof(WBP_OriginalMenu_InventoryListView_C_RemoveItemSurplus, LastIndex) == 0x000000, "Member 'WBP_OriginalMenu_InventoryListView_C_RemoveItemSurplus::LastIndex' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryListView_C_RemoveItemSurplus, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'WBP_OriginalMenu_InventoryListView_C_RemoveItemSurplus::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryListView_C_RemoveItemSurplus, CallFunc_GetSize_ReturnValue) == 0x000008, "Member 'WBP_OriginalMenu_InventoryListView_C_RemoveItemSurplus::CallFunc_GetSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryListView_C_RemoveItemSurplus, CallFunc_GetListView_ReturnValue) == 0x000010, "Member 'WBP_OriginalMenu_InventoryListView_C_RemoveItemSurplus::CallFunc_GetListView_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryListView_C_RemoveItemSurplus, CallFunc_Subtract_IntInt_ReturnValue) == 0x000018, "Member 'WBP_OriginalMenu_InventoryListView_C_RemoveItemSurplus::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryListView_C_RemoveItemSurplus, CallFunc_GetSize_ReturnValue_1) == 0x00001C, "Member 'WBP_OriginalMenu_InventoryListView_C_RemoveItemSurplus::CallFunc_GetSize_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryListView_C_RemoveItemSurplus, CallFunc_GetItemAt_ReturnValue) == 0x000020, "Member 'WBP_OriginalMenu_InventoryListView_C_RemoveItemSurplus::CallFunc_GetItemAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryListView_C_RemoveItemSurplus, CallFunc_Less_IntInt_ReturnValue) == 0x000028, "Member 'WBP_OriginalMenu_InventoryListView_C_RemoveItemSurplus::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryListView_C_RemoveItemSurplus, CallFunc_GetListView_ReturnValue_1) == 0x000030, "Member 'WBP_OriginalMenu_InventoryListView_C_RemoveItemSurplus::CallFunc_GetListView_ReturnValue_1' has a wrong offset!");

// Function WBP_OriginalMenu_InventoryListView.WBP_OriginalMenu_InventoryListView_C.SetScrollbarInputHint
// 0x0100 (0x0100 - 0x0000)
struct WBP_OriginalMenu_InventoryListView_C_SetScrollbarInputHint final
{
public:
	class UVAltarUISubsystem*                     CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonListView*                        CallFunc_GetListView_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            CallFunc_TryGetBrushFromKey_OutBrush;              // 0x0010(0x00D0)()
	class UTexture*                               K2Node_DynamicCast_AsTexture;                      // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OriginalMenu_InventoryListView_C_SetScrollbarInputHint) == 0x000010, "Wrong alignment on WBP_OriginalMenu_InventoryListView_C_SetScrollbarInputHint");
static_assert(sizeof(WBP_OriginalMenu_InventoryListView_C_SetScrollbarInputHint) == 0x000100, "Wrong size on WBP_OriginalMenu_InventoryListView_C_SetScrollbarInputHint");
static_assert(offsetof(WBP_OriginalMenu_InventoryListView_C_SetScrollbarInputHint, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000000, "Member 'WBP_OriginalMenu_InventoryListView_C_SetScrollbarInputHint::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryListView_C_SetScrollbarInputHint, CallFunc_GetListView_ReturnValue) == 0x000008, "Member 'WBP_OriginalMenu_InventoryListView_C_SetScrollbarInputHint::CallFunc_GetListView_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryListView_C_SetScrollbarInputHint, CallFunc_TryGetBrushFromKey_OutBrush) == 0x000010, "Member 'WBP_OriginalMenu_InventoryListView_C_SetScrollbarInputHint::CallFunc_TryGetBrushFromKey_OutBrush' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryListView_C_SetScrollbarInputHint, K2Node_DynamicCast_AsTexture) == 0x0000E0, "Member 'WBP_OriginalMenu_InventoryListView_C_SetScrollbarInputHint::K2Node_DynamicCast_AsTexture' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryListView_C_SetScrollbarInputHint, K2Node_DynamicCast_bSuccess) == 0x0000E8, "Member 'WBP_OriginalMenu_InventoryListView_C_SetScrollbarInputHint::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryListView_C_SetScrollbarInputHint, CallFunc_GetDynamicMaterial_ReturnValue) == 0x0000F0, "Member 'WBP_OriginalMenu_InventoryListView_C_SetScrollbarInputHint::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function WBP_OriginalMenu_InventoryListView.WBP_OriginalMenu_InventoryListView_C.UpdateCurrentPage
// 0x0001 (0x0001 - 0x0000)
struct WBP_OriginalMenu_InventoryListView_C_UpdateCurrentPage final
{
public:
	ELegacyInventoryMenuPage                      NewPage;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OriginalMenu_InventoryListView_C_UpdateCurrentPage) == 0x000001, "Wrong alignment on WBP_OriginalMenu_InventoryListView_C_UpdateCurrentPage");
static_assert(sizeof(WBP_OriginalMenu_InventoryListView_C_UpdateCurrentPage) == 0x000001, "Wrong size on WBP_OriginalMenu_InventoryListView_C_UpdateCurrentPage");
static_assert(offsetof(WBP_OriginalMenu_InventoryListView_C_UpdateCurrentPage, NewPage) == 0x000000, "Member 'WBP_OriginalMenu_InventoryListView_C_UpdateCurrentPage::NewPage' has a wrong offset!");

// Function WBP_OriginalMenu_InventoryListView.WBP_OriginalMenu_InventoryListView_C.UpdateItemFocus
// 0x0028 (0x0028 - 0x0000)
struct WBP_OriginalMenu_InventoryListView_C_UpdateItemFocus final
{
public:
	int32                                         PreviousSize;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCurrentElementIndex_ReturnValue;       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSize_ReturnValue;                      // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSize_ReturnValue_1;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSize_ReturnValue_2;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCurrentElementIndex_ReturnValue_1;     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OriginalMenu_InventoryListView_C_UpdateItemFocus) == 0x000004, "Wrong alignment on WBP_OriginalMenu_InventoryListView_C_UpdateItemFocus");
static_assert(sizeof(WBP_OriginalMenu_InventoryListView_C_UpdateItemFocus) == 0x000028, "Wrong size on WBP_OriginalMenu_InventoryListView_C_UpdateItemFocus");
static_assert(offsetof(WBP_OriginalMenu_InventoryListView_C_UpdateItemFocus, PreviousSize) == 0x000000, "Member 'WBP_OriginalMenu_InventoryListView_C_UpdateItemFocus::PreviousSize' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryListView_C_UpdateItemFocus, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000004, "Member 'WBP_OriginalMenu_InventoryListView_C_UpdateItemFocus::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryListView_C_UpdateItemFocus, CallFunc_GetCurrentElementIndex_ReturnValue) == 0x000008, "Member 'WBP_OriginalMenu_InventoryListView_C_UpdateItemFocus::CallFunc_GetCurrentElementIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryListView_C_UpdateItemFocus, CallFunc_GetSize_ReturnValue) == 0x00000C, "Member 'WBP_OriginalMenu_InventoryListView_C_UpdateItemFocus::CallFunc_GetSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryListView_C_UpdateItemFocus, CallFunc_GetSize_ReturnValue_1) == 0x000010, "Member 'WBP_OriginalMenu_InventoryListView_C_UpdateItemFocus::CallFunc_GetSize_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryListView_C_UpdateItemFocus, CallFunc_Subtract_IntInt_ReturnValue) == 0x000014, "Member 'WBP_OriginalMenu_InventoryListView_C_UpdateItemFocus::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryListView_C_UpdateItemFocus, CallFunc_Greater_IntInt_ReturnValue) == 0x000018, "Member 'WBP_OriginalMenu_InventoryListView_C_UpdateItemFocus::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryListView_C_UpdateItemFocus, CallFunc_GetSize_ReturnValue_2) == 0x00001C, "Member 'WBP_OriginalMenu_InventoryListView_C_UpdateItemFocus::CallFunc_GetSize_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryListView_C_UpdateItemFocus, CallFunc_GetCurrentElementIndex_ReturnValue_1) == 0x000020, "Member 'WBP_OriginalMenu_InventoryListView_C_UpdateItemFocus::CallFunc_GetCurrentElementIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryListView_C_UpdateItemFocus, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000024, "Member 'WBP_OriginalMenu_InventoryListView_C_UpdateItemFocus::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_OriginalMenu_InventoryListView.WBP_OriginalMenu_InventoryListView_C.UpdateListView
// 0x0120 (0x0120 - 0x0000)
struct WBP_OriginalMenu_InventoryListView_C_UpdateListView final
{
public:
	TArray<struct FOriginalInventoryMenuItemProperties> Items;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          DoFocusUpdate;                                     // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Local_PreviousSize;                                // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Local_Index;                                       // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOriginalInventoryMenuItemProperties   Local_CurrentItem;                                 // 0x0020(0x0050)(Edit, BlueprintVisible)
	class UVOriginalInventoryMenuItem*            Local_NewEntry;                                    // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Local_SelectedItemIndex;                           // 0x0078(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8B[0x5];                                       // 0x008B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonListView*                        CallFunc_GetListView_ReturnValue;                  // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSize_ReturnValue;                      // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A3[0x1];                                       // 0x00A3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSize_ReturnValue_1;                    // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetItemAt_ReturnValue;                    // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSize_ReturnValue_2;                    // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVOriginalInventoryMenuItem*            K2Node_DynamicCast_AsVOriginal_Inventory_Menu_Item; // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C2[0x2];                                       // 0x00C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FOriginalInventoryMenuItemProperties   CallFunc_Array_Get_Item;                           // 0x00C8(0x0050)()
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OriginalMenu_InventoryListView_C_UpdateListView) == 0x000008, "Wrong alignment on WBP_OriginalMenu_InventoryListView_C_UpdateListView");
static_assert(sizeof(WBP_OriginalMenu_InventoryListView_C_UpdateListView) == 0x000120, "Wrong size on WBP_OriginalMenu_InventoryListView_C_UpdateListView");
static_assert(offsetof(WBP_OriginalMenu_InventoryListView_C_UpdateListView, Items) == 0x000000, "Member 'WBP_OriginalMenu_InventoryListView_C_UpdateListView::Items' has a wrong offset!");
static_assert(offsetof(WBP_OriginalMenu_InventoryListView_C_UpdateListView, DoFocusUpdate) == 0x000010, "Member 'WBP_OriginalMenu_InventoryListView_C_UpdateListView::DoFocusUpdate' has a wrong offset!");
