#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Modern_QuestPage

#include "Basic.hpp"

#include "Altar_structs.hpp"
#include "Altar_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Modern_QuestPage.WBP_Modern_QuestPage_C
// 0x0088 (0x0550 - 0x04C8)
class UWBP_Modern_QuestPage_C final : public UVLegacyMapMenuQuestsPage
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVFooterViewModel*                      VFooterViewModel;                                  // 0x04D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UVMapMenuViewModel*                     VMapMenuViewModel;                                 // 0x04D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       QuestListFadeInOut;                                // 0x04E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_Modern_QuestDetailPanel_C*         QuestDetailPanel;                                  // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Modern_QuestHistoryPanel_C*        QuestHistoryPanel;                                 // 0x04F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           QuestListingBox;                                   // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Modern_QuestListPanel_C*           QuestListPanel;                                    // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        QuestPageSwitcher;                                 // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsViewingCompletedQuestDetails;                    // 0x0510(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_511[0x7];                                      // 0x0511(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          GlbMessageSound;                                   // 0x0518(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          OkSound;                                           // 0x0520(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          CancelSound;                                       // 0x0528(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<struct FLegacyMapMenuQuestProperties>  CurrentQuestsList;                                 // 0x0530(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UWBP_Modern_Menu_Player_Footer_C*       Footer;                                            // 0x0540(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         LastQuetsNumber;                                   // 0x0548(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LastEnabledQuest;                                  // 0x054C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_Modern_QuestPage_QuestDetailPanel_K2Node_ComponentBoundEvent_1_OnInspectPressedDispatcher__DelegateSignature();
	void BndEvt__WBP_Modern_QuestPage_QuestHistoricPanel_K2Node_ComponentBoundEvent_4_OnRequestGoToMap__DelegateSignature();
	void BndEvt__WBP_Modern_QuestPage_QuestHistoryPanel_K2Node_ComponentBoundEvent_5_OnHistoryBackAction__DelegateSignature();
	void BndEvt__WBP_Modern_QuestPage_QuestListPanel_K2Node_ComponentBoundEvent_0_OnClickedQuest__DelegateSignature(const struct FLegacyMapMenuQuestProperties& ClickedQuestProperties);
	void BndEvt__WBP_Modern_QuestPage_QuestListPanel_K2Node_ComponentBoundEvent_2_OnHoverQuestPropertiesChanged__DelegateSignature(const struct FLegacyMapMenuQuestProperties& NewProperties);
	void BndEvt__WBP_Modern_QuestPage_QuestListPanel_K2Node_ComponentBoundEvent_6_OnRequestChangePage__DelegateSignature(ELegacyMapMenuPage RequestedPage);
	void ExecuteUbergraph_WBP_Modern_QuestPage(int32 EntryPoint);
	int32 GetSubPageFromPageEnum(uint8 InByte);
	void HandleBackButtonClicked();
	void HandleToMapButtonClicked();
	void HoverQuestPropertyAction(const struct FLegacyMapMenuQuestProperties& NewProperty);
	void InitFooter(class UWBP_Modern_Menu_Player_Footer_C* Footer_0);
	void InpActEvt_IA_UI_Specific_QuestMenu_GoToQuestDetail_K2Node_EnhancedInputActionEvent_0(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_Specific_QuestMenu_ScrollFlavorText_K2Node_EnhancedInputActionEvent_1(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void IsOnQuestListPage(bool* IsOnQuestListPage_0);
	void On_Set_Active_Quest_Pressed(const struct FLegacyMapMenuQuestProperties& QuestProperties);
	void OnBackFromHistoric();
	void OnFocus();
	void OnRequestPageChange(ELegacyMapMenuPage NewPage);
	void OnRequestQuestDetail();
	void OnUnfocus();
	void OnUpdateCurrentPage(ELegacyMapMenuPage NewPage);
	void OnUpdateQuests(TArray<struct FLegacyMapMenuQuestProperties>& NewQuestsList);
	void SetStateOnHistoryQuit();
	void UpdateCurrentPage(ELegacyMapMenuPage NewPage);
	void UpdateQuests(const TArray<struct FLegacyMapMenuQuestProperties>& NewQuestsInfo);
	void UpdateTitleProperties(const struct FLegacyMapMenuTitleProperties& NewTitleProperties);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Modern_QuestPage_C">();
	}
	static class UWBP_Modern_QuestPage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Modern_QuestPage_C>();
	}
};
static_assert(alignof(UWBP_Modern_QuestPage_C) == 0x000008, "Wrong alignment on UWBP_Modern_QuestPage_C");
static_assert(sizeof(UWBP_Modern_QuestPage_C) == 0x000550, "Wrong size on UWBP_Modern_QuestPage_C");
static_assert(offsetof(UWBP_Modern_QuestPage_C, UberGraphFrame) == 0x0004C8, "Member 'UWBP_Modern_QuestPage_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_QuestPage_C, VFooterViewModel) == 0x0004D0, "Member 'UWBP_Modern_QuestPage_C::VFooterViewModel' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_QuestPage_C, VMapMenuViewModel) == 0x0004D8, "Member 'UWBP_Modern_QuestPage_C::VMapMenuViewModel' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_QuestPage_C, QuestListFadeInOut) == 0x0004E0, "Member 'UWBP_Modern_QuestPage_C::QuestListFadeInOut' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_QuestPage_C, QuestDetailPanel) == 0x0004E8, "Member 'UWBP_Modern_QuestPage_C::QuestDetailPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_QuestPage_C, QuestHistoryPanel) == 0x0004F0, "Member 'UWBP_Modern_QuestPage_C::QuestHistoryPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_QuestPage_C, QuestListingBox) == 0x0004F8, "Member 'UWBP_Modern_QuestPage_C::QuestListingBox' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_QuestPage_C, QuestListPanel) == 0x000500, "Member 'UWBP_Modern_QuestPage_C::QuestListPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_QuestPage_C, QuestPageSwitcher) == 0x000508, "Member 'UWBP_Modern_QuestPage_C::QuestPageSwitcher' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_QuestPage_C, IsViewingCompletedQuestDetails) == 0x000510, "Member 'UWBP_Modern_QuestPage_C::IsViewingCompletedQuestDetails' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_QuestPage_C, GlbMessageSound) == 0x000518, "Member 'UWBP_Modern_QuestPage_C::GlbMessageSound' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_QuestPage_C, OkSound) == 0x000520, "Member 'UWBP_Modern_QuestPage_C::OkSound' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_QuestPage_C, CancelSound) == 0x000528, "Member 'UWBP_Modern_QuestPage_C::CancelSound' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_QuestPage_C, CurrentQuestsList) == 0x000530, "Member 'UWBP_Modern_QuestPage_C::CurrentQuestsList' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_QuestPage_C, Footer) == 0x000540, "Member 'UWBP_Modern_QuestPage_C::Footer' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_QuestPage_C, LastQuetsNumber) == 0x000548, "Member 'UWBP_Modern_QuestPage_C::LastQuetsNumber' has a wrong offset!");
static_assert(offsetof(UWBP_Modern_QuestPage_C, LastEnabledQuest) == 0x00054C, "Member 'UWBP_Modern_QuestPage_C::LastEnabledQuest' has a wrong offset!");

}

