#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WPB_VideoMenu_HorizontalSlider

#include "Basic.hpp"

#include "Altar_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WPB_VideoMenu_HorizontalSlider.WPB_VideoMenu_HorizontalSlider_C.BndEvt__WPB_VideoMenu_HorizontalSlider_ScrollBar_K2Node_ComponentBoundEvent_0_OnValueChangedDelegate__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WPB_VideoMenu_HorizontalSlider_C_BndEvt__WPB_VideoMenu_HorizontalSlider_ScrollBar_K2Node_ComponentBoundEvent_0_OnValueChangedDelegate__DelegateSignature final
{
public:
	float                                         CommitedValue;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WPB_VideoMenu_HorizontalSlider_C_BndEvt__WPB_VideoMenu_HorizontalSlider_ScrollBar_K2Node_ComponentBoundEvent_0_OnValueChangedDelegate__DelegateSignature) == 0x000004, "Wrong alignment on WPB_VideoMenu_HorizontalSlider_C_BndEvt__WPB_VideoMenu_HorizontalSlider_ScrollBar_K2Node_ComponentBoundEvent_0_OnValueChangedDelegate__DelegateSignature");
static_assert(sizeof(WPB_VideoMenu_HorizontalSlider_C_BndEvt__WPB_VideoMenu_HorizontalSlider_ScrollBar_K2Node_ComponentBoundEvent_0_OnValueChangedDelegate__DelegateSignature) == 0x000004, "Wrong size on WPB_VideoMenu_HorizontalSlider_C_BndEvt__WPB_VideoMenu_HorizontalSlider_ScrollBar_K2Node_ComponentBoundEvent_0_OnValueChangedDelegate__DelegateSignature");
static_assert(offsetof(WPB_VideoMenu_HorizontalSlider_C_BndEvt__WPB_VideoMenu_HorizontalSlider_ScrollBar_K2Node_ComponentBoundEvent_0_OnValueChangedDelegate__DelegateSignature, CommitedValue) == 0x000000, "Member 'WPB_VideoMenu_HorizontalSlider_C_BndEvt__WPB_VideoMenu_HorizontalSlider_ScrollBar_K2Node_ComponentBoundEvent_0_OnValueChangedDelegate__DelegateSignature::CommitedValue' has a wrong offset!");

// Function WPB_VideoMenu_HorizontalSlider.WPB_VideoMenu_HorizontalSlider_C.ConstructVideoCommand
// 0x00A0 (0x00A0 - 0x0000)
struct WPB_VideoMenu_HorizontalSlider_C_ConstructVideoCommand final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	TArray<struct FOriginalVideoOption>           CallFunc_GetOptions_ReturnValue;                   // 0x0018(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOriginalVideoOption                   CallFunc_Array_Get_Item;                           // 0x0030(0x0028)()
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item_1;                         // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        CallFunc_Round_A_ImplicitCast;                     // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WPB_VideoMenu_HorizontalSlider_C_ConstructVideoCommand) == 0x000008, "Wrong alignment on WPB_VideoMenu_HorizontalSlider_C_ConstructVideoCommand");
static_assert(sizeof(WPB_VideoMenu_HorizontalSlider_C_ConstructVideoCommand) == 0x0000A0, "Wrong size on WPB_VideoMenu_HorizontalSlider_C_ConstructVideoCommand");
static_assert(offsetof(WPB_VideoMenu_HorizontalSlider_C_ConstructVideoCommand, Value) == 0x000000, "Member 'WPB_VideoMenu_HorizontalSlider_C_ConstructVideoCommand::Value' has a wrong offset!");
static_assert(offsetof(WPB_VideoMenu_HorizontalSlider_C_ConstructVideoCommand, ReturnValue) == 0x000008, "Member 'WPB_VideoMenu_HorizontalSlider_C_ConstructVideoCommand::ReturnValue' has a wrong offset!");
static_assert(offsetof(WPB_VideoMenu_HorizontalSlider_C_ConstructVideoCommand, CallFunc_GetOptions_ReturnValue) == 0x000018, "Member 'WPB_VideoMenu_HorizontalSlider_C_ConstructVideoCommand::CallFunc_GetOptions_ReturnValue' has a wrong offset!");
static_assert(offsetof(WPB_VideoMenu_HorizontalSlider_C_ConstructVideoCommand, CallFunc_Round_ReturnValue) == 0x000028, "Member 'WPB_VideoMenu_HorizontalSlider_C_ConstructVideoCommand::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(WPB_VideoMenu_HorizontalSlider_C_ConstructVideoCommand, CallFunc_Array_Get_Item) == 0x000030, "Member 'WPB_VideoMenu_HorizontalSlider_C_ConstructVideoCommand::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WPB_VideoMenu_HorizontalSlider_C_ConstructVideoCommand, CallFunc_Conv_IntToString_ReturnValue) == 0x000058, "Member 'WPB_VideoMenu_HorizontalSlider_C_ConstructVideoCommand::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WPB_VideoMenu_HorizontalSlider_C_ConstructVideoCommand, CallFunc_Array_Get_Item_1) == 0x000068, "Member 'WPB_VideoMenu_HorizontalSlider_C_ConstructVideoCommand::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WPB_VideoMenu_HorizontalSlider_C_ConstructVideoCommand, CallFunc_Concat_StrStr_ReturnValue) == 0x000078, "Member 'WPB_VideoMenu_HorizontalSlider_C_ConstructVideoCommand::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WPB_VideoMenu_HorizontalSlider_C_ConstructVideoCommand, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000088, "Member 'WPB_VideoMenu_HorizontalSlider_C_ConstructVideoCommand::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WPB_VideoMenu_HorizontalSlider_C_ConstructVideoCommand, CallFunc_Round_A_ImplicitCast) == 0x000098, "Member 'WPB_VideoMenu_HorizontalSlider_C_ConstructVideoCommand::CallFunc_Round_A_ImplicitCast' has a wrong offset!");

// Function WPB_VideoMenu_HorizontalSlider.WPB_VideoMenu_HorizontalSlider_C.ExecuteUbergraph_WPB_VideoMenu_HorizontalSlider
// 0x0030 (0x0030 - 0x0000)
struct WPB_VideoMenu_HorizontalSlider_C_ExecuteUbergraph_WPB_VideoMenu_HorizontalSlider final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_CommitedValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_ConstructVideoCommand_ReturnValue;        // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UVUINavigationGlobalSubsystem*          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IVEnhancedInputNavigable> CallFunc_NavigateToWidget_Widget_CastInput;     // 0x0020(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(WPB_VideoMenu_HorizontalSlider_C_ExecuteUbergraph_WPB_VideoMenu_HorizontalSlider) == 0x000008, "Wrong alignment on WPB_VideoMenu_HorizontalSlider_C_ExecuteUbergraph_WPB_VideoMenu_HorizontalSlider");
static_assert(sizeof(WPB_VideoMenu_HorizontalSlider_C_ExecuteUbergraph_WPB_VideoMenu_HorizontalSlider) == 0x000030, "Wrong size on WPB_VideoMenu_HorizontalSlider_C_ExecuteUbergraph_WPB_VideoMenu_HorizontalSlider");
static_assert(offsetof(WPB_VideoMenu_HorizontalSlider_C_ExecuteUbergraph_WPB_VideoMenu_HorizontalSlider, EntryPoint) == 0x000000, "Member 'WPB_VideoMenu_HorizontalSlider_C_ExecuteUbergraph_WPB_VideoMenu_HorizontalSlider::EntryPoint' has a wrong offset!");
static_assert(offsetof(WPB_VideoMenu_HorizontalSlider_C_ExecuteUbergraph_WPB_VideoMenu_HorizontalSlider, K2Node_ComponentBoundEvent_CommitedValue) == 0x000004, "Member 'WPB_VideoMenu_HorizontalSlider_C_ExecuteUbergraph_WPB_VideoMenu_HorizontalSlider::K2Node_ComponentBoundEvent_CommitedValue' has a wrong offset!");
static_assert(offsetof(WPB_VideoMenu_HorizontalSlider_C_ExecuteUbergraph_WPB_VideoMenu_HorizontalSlider, CallFunc_ConstructVideoCommand_ReturnValue) == 0x000008, "Member 'WPB_VideoMenu_HorizontalSlider_C_ExecuteUbergraph_WPB_VideoMenu_HorizontalSlider::CallFunc_ConstructVideoCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(WPB_VideoMenu_HorizontalSlider_C_ExecuteUbergraph_WPB_VideoMenu_HorizontalSlider, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000018, "Member 'WPB_VideoMenu_HorizontalSlider_C_ExecuteUbergraph_WPB_VideoMenu_HorizontalSlider::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WPB_VideoMenu_HorizontalSlider_C_ExecuteUbergraph_WPB_VideoMenu_HorizontalSlider, CallFunc_NavigateToWidget_Widget_CastInput) == 0x000020, "Member 'WPB_VideoMenu_HorizontalSlider_C_ExecuteUbergraph_WPB_VideoMenu_HorizontalSlider::CallFunc_NavigateToWidget_Widget_CastInput' has a wrong offset!");

// Function WPB_VideoMenu_HorizontalSlider.WPB_VideoMenu_HorizontalSlider_C.UpdateLabel
// 0x0018 (0x0018 - 0x0000)
struct WPB_VideoMenu_HorizontalSlider_C_UpdateLabel final
{
public:
	class FText                                   CallFunc_GetLabel_ReturnValue;                     // 0x0000(0x0018)(ConstParm)
};
static_assert(alignof(WPB_VideoMenu_HorizontalSlider_C_UpdateLabel) == 0x000008, "Wrong alignment on WPB_VideoMenu_HorizontalSlider_C_UpdateLabel");
static_assert(sizeof(WPB_VideoMenu_HorizontalSlider_C_UpdateLabel) == 0x000018, "Wrong size on WPB_VideoMenu_HorizontalSlider_C_UpdateLabel");
static_assert(offsetof(WPB_VideoMenu_HorizontalSlider_C_UpdateLabel, CallFunc_GetLabel_ReturnValue) == 0x000000, "Member 'WPB_VideoMenu_HorizontalSlider_C_UpdateLabel::CallFunc_GetLabel_ReturnValue' has a wrong offset!");

// Function WPB_VideoMenu_HorizontalSlider.WPB_VideoMenu_HorizontalSlider_C.UpdateSliderValues
// 0x0008 (0x0008 - 0x0000)
struct WPB_VideoMenu_HorizontalSlider_C_UpdateSliderValues final
{
public:
	struct FFloatInterval                         CallFunc_GetExtremalValue_ReturnValue;             // 0x0000(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WPB_VideoMenu_HorizontalSlider_C_UpdateSliderValues) == 0x000004, "Wrong alignment on WPB_VideoMenu_HorizontalSlider_C_UpdateSliderValues");
static_assert(sizeof(WPB_VideoMenu_HorizontalSlider_C_UpdateSliderValues) == 0x000008, "Wrong size on WPB_VideoMenu_HorizontalSlider_C_UpdateSliderValues");
static_assert(offsetof(WPB_VideoMenu_HorizontalSlider_C_UpdateSliderValues, CallFunc_GetExtremalValue_ReturnValue) == 0x000000, "Member 'WPB_VideoMenu_HorizontalSlider_C_UpdateSliderValues::CallFunc_GetExtremalValue_ReturnValue' has a wrong offset!");

// Function WPB_VideoMenu_HorizontalSlider.WPB_VideoMenu_HorizontalSlider_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct WPB_VideoMenu_HorizontalSlider_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WPB_VideoMenu_HorizontalSlider_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WPB_VideoMenu_HorizontalSlider_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WPB_VideoMenu_HorizontalSlider_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong size on WPB_VideoMenu_HorizontalSlider_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WPB_VideoMenu_HorizontalSlider_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WPB_VideoMenu_HorizontalSlider_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");

}

